{"format": "raw", "annotations": [], "confidence": 0.9351940104373792, "data": [{"start_time": 0, "text": "Good afternoon, everybody. Can everybody hear me? Good afternoon, everybody. Thank you for being here this afternoon. It is 2:05 p.m. On July 30th 2019. My name is Michael Brian. I'm sure the sustainability and transportation committee stop by Kelly today expect to have at least one of their colleagues joining us at some point this afternoon. We have a pact agenda and a ton of folks here. Today is great to have you all in the audience we have well, first of all for those that are planning for time, I expect this meeting will probably Run 3 hours instead of 2 hours. So depending on where your items are on the agenda. Let's just plan for that. We have close to 50 people signed up to after public comment and sew in an effort to get through as much of the public comment as possible and the items that are on the agenda today. I'm going to start with public comment at 1 minute each. So for folks that are planning to come forward and do that if you're in a group of You were more and maybe want to consolidate your message. I can give you two minutes collectively that would help us get through more people if folks are just going to say the same thing over and over again to be great to hear from you all at once but everyone has that right and then we'll check in again after 30 minutes to see where we are on public comment and it's going to extend that a little longer than we normally just do it for 20 minutes. I'll start with 30 minutes could have so many folks really quickly on the agenda today Morgan have a discussion about the green New Deal. We're going to take up a couple items around Seattle Children's Hospital. We have rsji annual report from Seattle Department of Transportation. We're going to get an annual streetcar operations report from s. We're going to also consider an ordinance related to commute reproduction and finally a resolution about Naval sonar testing in the Puget Sound in coastal Waters cell lots of talk about so when we shift to public comment, I'm going to call off three or four. Name suffix in queue up at either microphone again. I'd ask you to watch the clocks up here that show you how much time you have left. I will cut you off at about 1 minute or give you a couple seconds to wrap up but it really appreciate folks honored a chance forever as many people as possible to talk to try to keep their comments to that one minute. Doug Holton is first followed by an McCulloch. And then I think then honey court and then mr. Leigh and Nora Chan bristles one of the most Transit dependent neighborhoods in Seattle with a higher-than-average elderly and low-income population Purcells also designated as a regional growth Center and our transportation option need to work in conjunction with our land use and employment. Is Seattle's downtown neighborhoods including foristell continue to gain jobs and residents? We need to ensure that their high capacity Transit options. Let's finish what we started and a complete the streets are downtown. Thank you, Doug Mann. Hi, I'm the executive director of the first Home Improvement Association. My name is Ian McCulloch First Hill is one of the city's largest employment centers over 35,000 people go to work in First Hill everyday Additionally the population of our neighborhood will increase by 72% over the next five years and we have the lowest rate of car ownership of any neighborhood in Seattle completing the streetcar network with options to connect to light rail Sounder and fairies will support one of Seattle's densest neighborhoods. Thank you and enjoy my counselor Pacheco set though. Thank you. Zeto here I'm Nora, can I pick about 30 or 40 people here today? And so I don't want to take up so much of your time. So if you don't mind we just all come out. Is that okay? That would be great. And I thank you for doing that. Swinging with Nora wants to come up or stand up where you are. Whoever want to come up and you can come up. Okay, this is the first time they come. Thank you for bringing folks. Yellow, ohia I started with he's a little kid. Read residence business are supporting the Center City Connector. We Chinatown have all sorts of response Museum and culture to share. So anybody want to share with us, please come. Okay, and then I saw her as it is. Please keep your hummus reason. This has been waiting since the 20th Trail construction off the first Hill streetcar. So you tell them in Chinese. I want them to participate. I hope you know that straight North. Approximately 20000 people will ride the Neal Center City Connector per day. That is more than any Metro Bus 9 can do it stays right. So I'll let her breathing in Chinese. chin chin And I will give you a little extra time since you're translating. So keep going. This is great. Thank you. Energy efficient way to move more people and kicking people out of their car and reducing with blocks. Okay, someone from Washington, Utah. Strict I will connect residence to the new job without increasing congestion and save money. Remember easy and fast transportation will bring successful. You are here. So thank you very much, and I have more people coming. Thank you so much for organizing and helping translate and to all the folks who came down for the first time to testify at City Hall. We really appreciate hearing your voice is here to thank you for being here. Randy Gustafson is next. Randy is going to be followed by Ryan Packer then Andrew today and then Alice Lockhart. Hello, I'm Randy Gustafson. I am a retired just retired as Seattle streetcar operator. I was in original operator from a 2017 or 2007. Anyway, I have some concerns about I understand that you're going to be considering whether to amend the contract for the vehicles or to get cancel it and get a new contract. I would suggest for supper reasons going back to the 66ft vehicles that are actually available at Brookville Equipment Corporation. I don't know them personally, but I do know that they are being used in five different cities down in Oklahoma Tempe Dallas on Milwaukee and one other one. Anyway, there are good reasons to go to stay at 66 foot The Operators have fall back brakes and so they will be going from Maybe three or four five different vehicles in one shift and if you have to understand your clearances, so I to go from a 66ft to a 75 foot and have to know which car you're in and doing your clearances. It's very important. Thank you Mandy. Can I leave this retirement and thanks for sharing. Hi there. I'm here because back in March. We were all here for a vision zero presentation where we were told that Seattle it continues to be on the right track. I have some numbers from the first six months of this year number of total Collision that resulted in serious injury and loss of life 98 average amount of time between those collisions 44 hours number of pedestrians. Seriously killed or injured in those that six months 39, which means we're on track by the end of the year if the past decade of friends has continued to see 90 by the end of the year when in fact we've been averaging around 50 for the past 10 years average number of collisions reported by the traffic Twitter account on Rainier Avenue through yesterday this year on dirt and 34 percentage of people referenced above who deserve to have their safety prioritized over people moving vehicle traffic 100% And the number of times the current mayor of Seattle is recommitted the city division 00 Thank you, Brian. Andrew Dallas Thank you, Randy. Hey Allison, Andrew from 3:50. Seattle will give you two minutes. The green New Deal of knowledge is a truce. We live in an era of climate emergency in this era the city must ensure that we reduce climate pollution to make progress towards cities in the city's environmental inequity Kohl's Seattle Department of transportation's focuses the sign and use of our streets achieving climate pollution reduction on our streets is a simple design issue but a complex social process the design is simple because all that stuff needs is a plan to convert annually, some of our street from lanes for cars Tulane to Green Transportation specifically lines for bosses bike trails in sidewalks each year. The city should calculate the amount of carbon reduction in mission to choose based on the estimated reduction of EMTs. Vehicle miles traveled the social process is more complex and City leadership have barely begun to plan for how to convert a CD of car drivers to a city of Walkers bikers and Transit users your suggestions. First we need to raise awareness in our communities of the many benefits of this conversion from active Transportation, including biking and walking important and the community City can promote and needs to promote all these benefits in neighborhood meetings. But also more strongly by committing to developing a social infrastructure that includes walking by coordinators at schools players for the canoe trip Reduction Program Outreach to business districts and residential on Green Transportation. I'm sure City departments have additional ideas and we should mind those to create a culture within the city government and in the city at Large. Zero carbon Transportation. Thank you next and was going to be followed by Katie Wilson then Jordan van voast and then Chen Chen / 1300 Center City ratepayers to support the streetcar project. We are pleased that the project is moving forward and we support Council approved in the nest. Seattle continues to grow and the downtown is now home to 300,000 workers in more than 80,000 residents. We need to prioritize a diverse Transportation at work to give people more options to keep our economic or thriving finally. We also know the majority of residents support this project. It's time to move it forward. Thank you for your time. I look forward to working with the council and I can't lie Katie. Good afternoon. Handsome number is my name is Katie Wilson, and I'm here representing the transit Riders Union first. I just want to express our strong support for the city developing a green New Deal for Seattle with Community also want to speak to the commuter production program, which I believe we're going to be discussing later. This afternoon has come from the city's going to meet our climate goals. We need to give people better options and driving alone employers have a big role to play in this by providing Transit passes for their employees and taking other measures that encourage employees to take transit bike or walk to work. We appreciate that the city has a commuter production program. And we also think the city can do more to ensure that more workers are getting Transit benefits and also to make sure these benefits are Equitable about the plan that you're going to be discussing today the recommendation to actually rank requirements by Effectiveness and do more to require that CTR employer's take high impact. We also think that there's a lot of improvements that could be made and I'm out of time. So to be continued. Thank you for offering the opportunity to comment on this legislation. I also is to acknowledge that we stand on unseeded to Amish territory, which is very relevant to the green New Deal legislation. I spent my life learning to live in tune with nature gardening cycling Wilderness Travel low-impact living but the indigenous people Seattle. We're the experts in this regard and we need to listen to them and the youth whose future we are foreclosing on with the fossil fuel-based economy. Mother Earth is hurting now and there's no more time for business as usual. We've got to stop building giant parking garage is like the one that just went up at Expedia. We have to rethink our way of life based on an understanding of interdependence and prioritizing compassion over profit. And I'd also be in support of the item number 7 the resolution concerning the sonar Witches are harming the whales and other cetaceans. Thank you. Thank you. Jordan. Chen is next not sure if testified already with you Nora. He's more important than I am James James averaging Erickson. So hang on one second for Jim Erickson. Then James Wang gym 24, whoever cited number 17 site in their name in Chinese characters, so I can't pronounce that but if someone signed a number 17 who hasn't testified already come forward and then following that would be dug Trump. Go ahead gym. Jim Erickson speaking as a resident First Hill is my opinion that the Center City Connector project should be completed as planned according to the KPMG streetcar cost review the benefit to Seattle. It will be an increase in potential annual ridership from the current forecast of 2 million to a new hire forecast of 6 million. This will become the busiest metro line in Seattle First Hill is an urban center Village that combines groin employment in groin residential housing. We are a destination in the morning for those heading to work and in the afternoon for those returning home. We recently advocated Shifting the new underground Light Rail station on the east side of I-5 on First Hill. The idea was rejected our original neighborhood plan center gone underground Light Rail station at Madison and minor First Hill underground station was Cancel our Senior residence and Healthcare visitors appreciate the role on and roll off accessibility offered by streetcar platforms. If the decision is made to cancel the Center City Connector project, it will be another large disappointment on First Hill. Thank you, Jim. James Monger next and then I did it for someone who signed in with Chinese characters. I'll be at the Jenks. Okay. Thank you. Good afternoon. Council members. My name is James Wong. I'm the CEO of vibrant cities a locally-owned and locally-based development company based in Chinatown International District focus on mixed residential and Retail development projects in Seattle speak in favor of the city center streetcar project because one a city needs to continue to invest in reliable affordable Transit. I'm an immigrant from humble beginnings growing up my family use public transportation because there is a fordable it was a primary means of getting from home to work into China Town II. Our city is becoming denser everyday and we need Transportation options that would help more residents without adding to the congestion a city population increased by about 135000 people from 2010 to 2017. Get the city wants to reduce congestion. It needs to support Transportation options like City Center Center City streetcar, which will connect residents to jobs in downtown and South Lake Union without increasing congestion in about 3 in the city truly values Chinatown District as a historic cultural neighborhood than the city needs to invest in Connect City street car that will make CID more accessible to Residents and visit visitors alike. Your time is up if you want to turn that in some time for herself already, so there's a lot of folks that are here to speak today. So and then couver those chinatown's are dead, and we don't want that to happen to Seattle Chinatown. We need to connect it. Thank you. I got your point gym. Okay, where to go to Doug next? I guess. It's in this or someone else is going to be I think it's a pain who are Lou and then page Malott. I'm Doug speak on behalf of the urbanist We join both the mass Coalition of moving all Seattle sustainably and the ocean because we believe in projects like the streetcar and we want to see them done as quickly as possible. It's high-quality emission-free Transit and we need to be doing that as quickly as we can to deal with our climate crisis and twenty thousand daily Riders from pretty-much day one. Is that serious writer shipping? Where else would all these people go? If you're in the bus at rush hour in Seattle downtown most of the bus is already pretty crammed full. It would be nice to have a little bit of a safety valve for those folks and supposed to say we could just do this with a bus each one of these vehicles. Thanks for being 75 feet long. It can carry about 166 people across low. That's about twice. The one most Metro buses can handle so he should have more capacity and partially why you seen sitting there so much ridership. So I I really hope that this project can stay alive in 10. Okay, maybe they already testified page Milat. I'm paid you're going to be followed by we're going on the number 21 Lisa Howard then Mike McQuade and Marie about AOL. My name is Paige Millard in I am a resident along the first Hill streetcar alignment. I'm here today in support of the streetcar and look forward to the Center City Connector being completed quickly to help absorb grows in the downtown core. What's the Center City Connector is complete the Five Mile street car route is expected to have more Riders per day than King County Metro is busiest bus route the rapidride E which covers 14 miles increase current streetcar ridership by four times as a joins, the two existing lines to create one complete streetcar System since 2010 the area along the street car Route 7 more than 43,000 an increase of 66% and a 27% increase in employment along the Route the traffic congestion downtown impact buses along 1st Avenue signal the need for higher capacity Transit. We also know that 65% of carbon emissions from a region come from transportation. We cannot afford to wait any longer I'm making Investments and high-capacity electric transportation. Let's be proactive so we can build it quickly and maintain the high quality project that we were promised. But that streetcar rolling. Hi, I'm Lisa Howard MD with the executive director of The Alliance for Pioneer Square station work in Pioneer Square or committed to find solutions to minimize the construction impacts all this while completing this important project. Please consider the benefits chart transportation system and our city and I'm have to answer any other questions or encounter Square later so you can get more people. Thank you. I'm sure we will have more Mike employee. I'm also the South Lake Union Community Council Transportation chair and a member of the steering committee and streetcar coalition. In South Lake Union at 50,000 people living and working in my neighborhood. The ones are 15 years ago. Most aren't from Seattle many not from the United States are newest residents. Think about Mobility very differently than 55 year old SUV driving guys like me, although I did log 200 miles on my bike last week of our 7 districts competitiveness is a city is critical to our way of life district-by-district our neighborhood and easy-to-navigate downtown benefits every voter in each of our District's districts wrapping up transportations. The fabric that knits our community together options when the day in this economy wheel our Legacy As Leaders to take us back to the 1970s when we turn down money for subway system to be our Legacy. Let's go street car. Thank you. Mike. Maria's next Marie. You're going to be followed by Tom Chang then Dave mentz and then Rachel ludwik, Pacheco. My name is Maria abbate alone. Usually I come here as Beacon Hill Council chair and is environmental justice coordinator for El Centro. But today I come to you as somebody who's been working on environmental and economic Justice since 1993. I want to bring the thinking and the soul of the Community Coalition environmental justice that really wanted to share with our environmental friends that environmental isn't just natural habitat the built Environment as well as people of color those who are in danger. So it is with such a wonderful kudos to the communities in yourself. Let's put this together to say that it's the right time when emergency with climate change. We are in a place where in the federal government is not taking any leadership. You must take care of ourselves as a city to say who we are and do what we wish and we have race and social justice within the city policies and with that. I cannot wait to see how this will actually be conquered ties this we say in the old business and without a carbon impact analysis. We will not have as an effective a program. Please consider the including that carbon impact analysis same as any physical or social impact analysis. Thank you. I appreciate that. I'm Tom. I don't see Tom Chang getting up Dave men's. Thank you for your work on the green New Deal. There's so many important aspects. I think we should include radical new green building codes. My friend Chris Rogers like construction of Patsy bullets bullets. Enter here on Madison and 14th World greenest building. We should be proud of that. But he told me that during design and construction. He had to beg the city to create exceptions to the building code to allow the greenest features to be built such as grey water recycling passive solar walls solar electricity storage use of non toxic materials composting toilets and more every home and building in the city could have these features every one of these features to create new business structures and jobs in our city. We have these Visionaries to follow. It's already been done here in Madison follow them, even if the cost seems excessive and high now, but just wait so in conclusion we should Change the Paradigm. We should resist powerful calls for business as usual. When are City leads with amazing things like this the nation often follows. Thanks. So make sure we're not missing you at I'm trying to sign up. All right, we'll go to Rachel electric Rachel. You'll be followed by Emily Hazelton. Then Megan Murphy and then Megan Cruz. Thanks for being here and Rachel and I am really excited to be an idiot Green New Deal like everyone else and I really want to draw attention to how important and how difficult it will be to get Transportation Justice. Right as Ryan was really actually run the we are attracted to have twice as I think it's twice as many deaths in serious injuries as 2010 which is the year after I moved to Seattle jail, because the reason why that's happening is because our streets are still overwhelming design for cars and we don't really reprioritize cars in 2016 there to pass an ordinance to lower speed limits everywhere. But in reality, we haven't really lowered them everywhere everywhere. It's a very short section in Columbia City and income housing. You're not following through the people don't actually switch to light rail into the street card all these things if we don't have to provide them a safe place to walk. Thank you. Thank you Rachel. I rent in Belltown and I'm a volunteer with 350 Seattle as our climate changes Seattle will be a destination for climate driven migration in the coming decades. We are not ready for the rent is already too damn high for people who live here. We are struggling with homelessness and a placement displacement for current residents to be a truly welcome in my city. We need places where people can afford to live. I'm proud to live in a sanctuary City and I hope that we can can you continue to be a sanctuary city as climate change gets worse. In order to meet this. Hope Seattle's Green New Deal should invest in affordable housing along public transit routes greater density will accomplish many things at once. I will lower our cities emissions help communities thrive in place prepare us to accept climate migrants into our city and create lots of jobs. Thank you for your endorsement of the green New Deal and I advocate for centering housing density and affordability as you commence planning. Thank you. Say Paul's office last spring and there was a whole group of us trying to have her endorse it and then she finally endorsed it and people the movement is still building and you know, it's all these new health apps where they can check your blood pressure and your blood sugar and I'm your resting heart rate and there's algorithms that connected on an apple. What if they had one for the Earth? It's like I'm with all this carbon going up in the air. It's like telling someone with lung cancer to keep smoking because we need to quit the habit of carbon. So, it's City Planning. I'm home Green New Deal is like way on The Cutting Edge of where the future is and I only hope a city planners. We all go further cuz we all our stakeholders and we develop cities that are completely carbon-free and more shared spaces and shared living quarters for climate refugees. Thank you next Meghan. We followed by Alex Hudson bend on Blakeney and then surely Sabbath first planning document for either land use for transportation and the city to acknowledge. The impacts of Transportation Network companies Uber has the less. I do propose one Amendment to the Send the measuring and that it equates one sov single occupancy vehicle ride with one TC on RT NC rides and equivalent of dried for every person driving alone in their car that puts one mile on the road. Someone taking an Uber or Lyft puts 2.8 vehicle miles traveled on the road. So this is really something that we've got an address and then furthermore. This is part of the grand scheme that's dictated by our comprehensive plan in Seattle. We need to put this designation TNC and delivery trucks as mode shares that we're tracking that the fastest growing elements on our streets and big disruptors. Thanks. Hello, good afternoon. I'm Alex Hudson, executive director of transportation choices Coalition or a Statewide. Advocacy organization working to bring people more and better transportation options from here to speak on behalf of the Center City Connector streetcar on Center City streetcar for a very long time. Somebody is cared a lot about Forest Hill and great Transportation options. You've heard many excellent reasons why we need to keep this project moving forward to zero emissions Transportation project that's going to connect people to amazing destinations throughout our city and create opportunities to fur tens of thousands of people to get out of their cars everyday leaving is towards a car light downtown. Also just going to speak on behalf of somebody who is inactive and Avid user of the first two line to just bring into the room. The many many many people who are already using the system and who benefit I see people across all levels of society use A Streetcar think you for your leadership and looking forward to getting a moving forward to being so quick and concise if it's okay with your counselor Jacob extend table, for another 10 minutes or so, and I think we're going to get to everybody the one minute pace. Thanks. Hun. Great. Thanks like me. I work for the downtown Seattle Association and I'm here today to speak on behalf of the Center City Connector streetcar 619 to see so many familiar faces in the crowd here folks that are supported with this project in touch every corner of downtown and many of the communities that in the car center city of Everett Place to be one voice that's not here today. And it's it's sad we bought the champion of this project Mentor Tom Gibbs who used to stand here next to me and tell me just about everything. I know about three cars isn't here with us. He passed away earlier this month than he thought his entire career to fix our environment make Lake Washington healthy and if I fight for transportation and most recently Fighting with us to get this project back up and running again. And so we're super excited that we take some momentum and appreciate the council's work on that. So, thank you and we look forward to working with you Shirley. Hi, my name is Shirley Savelle and I brought this poster for you. It says Vision zero equals Vision caca. Let me tell you why so my family we live very close to bring your Avenue and so it's not funny in the collisions, but we can hear them. We hear them everyday yesterday yesterday. We were in the house and we heard a collision. So I walk down I expected to see one of these two car collisions, but now instead what I found was a young girl who was on her bike. She was crossing a crosswalk a driver decided to not look for her in the crosswalk hit her paramedics were there her head when she had blood pouring down her head from her head. So I really don't think that the mayor has done any investment in Vision zero. I don't think it's funny to call a vision Kaka, but it to us because every day we here And we see the traffic violence. We don't want to be the next person to my kids. This was a young kid younger than my daughter. Just going somewhere not a not a white guy in spandex a kid, so this is for you. I thank you for taking the time to listen to you for bringing that and I'm sorry about what happened Dianna m is next and Diana you're going to be followed by gentleman element and then Johnny free crew. Hi, my name is Diana and I'm part of the Seattle women's commission and I'm here to talk about the program. We appreciate the help reduce. Obviously the transportation cost for some workers, but I'm here to talk about the fact that I'm according to the Puget Sound Regional Council travel survey low-wage workers are much less likely to cut an employer pay transit pass in high-income workers and low-income workers. Are those who need the most and I'm here on my capacity as part of the women's commission to talk about the fact that obviously woman and children are more Transit and more Transit opportunities that are more flexible and they are often traveling with children with other people. And so for this population, obviously + 4 + 4 Low wage income income workers in general thinking about it. That the commuter Protection Program expands is a big necessity. Thank you. Executive director of God greenware an environmental justice organization in South Seattle. We're here to speak in support of the green new deal as an environmental justice organization. We really encourage the city to take seriously the kind of climate crisis. Our communities are bombarded by climate pollution have a lower life expectancy rates. And I redeem the sacrifice zones on by the screen economy. We really want to see Aurora bus policy. Insurance investments in an environmental justice communities can use a color working-class communities so that we can also have long I'm healthy lives. We don't want to see any more people die or from from health issues or from climate-related issues or from even economic violence. I really appreciate hearing from everyone about the importance of investments in these communities what it would look like if we had access to living wage paying job. Healthcare transit for everyone and how affordable housing for everyone. Thank you. Gives You Hell Johnny members, my name is Johnny thicker when I'm an organizer of a Doctrine and part of the Seattle for green New Deal campaign. And this past summer. We've been having lemonade stands. We've been canvassing folks and we've been talking about the green New Deal and what are the priorities that keeps coming up is transit for all and then we say transit for all mean free public transit. You know, I think it's really cool in this city that we have middle schoolers and high schoolers. I get Orca cards, but a green New Deal of calling for so much more where everyone has the ability to hop on the bus and travel safely and freely where they need to be, you know public transit should serve the public and not only those who benefit based off financial means and I think in a green New Deal, we should also think about a just transition for fare enforcement instead of finding people who may or may not be able to afford Transit because I have them be Transit support guides and help people get to where they need to be and so think about these really cool creative ideas and building a better world. Thank you. Nexus Barry Blanton that tank and Barry here we go by Jamie Lee and then Monisha Singh and then James McIntosh. Hi, I'm very Blanton. My company is Blanton Turner, and we're down in Pioneer Square. I currently serve as the coach are the alliance for Pioneer Square. I also serve as the chair of the Chinatown International District district business Improvement area here to strongly support the center city streetcar initiative. In fact, I look at the street cars that we have and while their grade this link will add the Valium yet necessary to the other two wings, and it makes it a reasonable system, and that's what we really need to ask. So we appreciate your support and hope that you support that. Thank you. Thanks. Jamie hi, I'm Jamie lady with the Seattle Chinatown International District preservation development Authority. I'm here today to express our support for the Center City. Connector project is no secret that our neighborhood injured years of construction for the first Hill streetcar with the promise that our segment was a bunch of the new part of a larger system connecting to CID to downtown and bring thousands of writers and turn neighborhood right now. The streetcar system is on finish. It is not fulfilling its promise our neighborhood has one of the highest Transit ridership sin the city it's important to have a full functioning system will be unfortunate have suffered through years of construction for nothing. Thank you very much. Thank you, Timmy. executive director for the Chinatown International District business Improvement Area International District Chinatown ID business owners property owners and residents best tourism traffic to Chinatown to support that you cannot Vitality of the neighborhood and other residents of Seattle neighborhoods at the Chinatown ideas. Thank you. I'm going after James McIntosh going to have Katherine Leggett thin Alec Anand and Sarah. Tekla. Okay. Hi, my name is James McIntosh and I'm with Transit Riders Union and chairperson of that Transit operations and planning committee. The transit Riders Union has endorsed the completion of the connector Sweet Caroline. So please go ahead with completion of the Seattle connector streetcar line. I am a person who is visually impaired. So Transit is my lifeline the connector streetcar line will provide Swift and convenient service between sounds like Union Westlake the Pike Place Market Pioneer Square, the International Space Station train stations, and they're not so District the first Hill and Capitol Hill serving locals and visitors alike. And particularly. The line will be a great benefit to the disabled people in wheelchairs and people like me or getting a little older and having trouble walking. Getting a little older. They are the system will run on renewable energy. So what better way to work toward a green New World, especially for future Generations or Valentine's Jim go ahead with connection of the shuttle Central City streetcar line as a vital Link in our Thanks James 2 coming out. Hi, my name is Katherine and I'm a volunteer with 350 Seattle and I believe we have a great opportunity ahead with us with the Seattle Green New Deal. I came to the issue of climate Justice most recently in reading the New York Times article about the ipcc report back in October 2018. It's alarming words really shook me out of my previous complacency. It's well known that the target year for the radical changes, that must be made is is the year 2030 and my oldest daughter will graduate from high school in 2030. So that's the motivation. I have to do this work every day. Not only for my family, but for all of the families, I tried to look to see how many graduates Seattle will have in 20-30. I'm just going to estimate ten thousand. So thank you for all your support so far and I look forward to working with you. Alec Alec hear me followed by Sarah and then Neil Anderson Lipa and then Lisa nitze is the last one. Don't my name is Alexandra organizer with seats at the Seattle and also working on the Seattle for a green New Deal campaign. When I start by thanking customer a brine for all your leadership with relation to the Seattle for green New Deal champion. Thank you. Can't remember Pacheco for your supports and the signing on to her campaign a couple of weeks ago. I'm just reiterate why we need 2,000 said that shadow has become a new leader and for climate action in the United States end 20 years later and we found out the most recent years. We have. Tell Seattle's emissions are rising they're going up to the time he needs to fallens. So we need so much more dramatic action in the currently seeing and just to see one thing that I hope the green New Deal will included we can't walk this way and we'll see we really need to have every single City Department making all of their decisions through a claimant lanes and 395 metal Justice lines so we can see is part of this instructions. To every city Department that they need to come up with plans that will averages her a mission and reduce our pollution in line with what signs and Justice demand that should be part of this. Thank you Sarah. From Seattle to do not live here. I'm actually a sustainability student in Arizona. And I think I just want to speak to the importance of Seattle's leadership because if the green new deal because if if you guys don't pass it is not going to pass somewhere else like we're waiting for you guys were also in Phoenix working on localized green new deal, but it's things like this. It's a lot harder moving forward in a red State and I think that that is really what Seattle has the opportunity to do here is lead the nation and I think it's going to be really important especially given Washington's already regressive tax structure finding a way, you know, if we're talking about climate Justice those were the most money or paying the most into this. Thank you. Anil Hi, my name is new Anderson and I'm here today to express my support for Seattle's green new deal. But ironically I drove my car into Seattle to come here and tell you that would have been better to take a bus. But I'm coming from outside Seattle and making multiple stops and managing all of that with bus transfers would have been a lot more difficult. So I just took the easy way and drove instead. What if we were to embrace the green New Deal I imagine that there would have been a congestion price to discourage me from driving to the city and I'll gladly pay that and not just to relieve some of my guilt from driving but also because I would know that the money was helping to fund infrastructure that would make it less necessary to drive in the first place. And once I ride downtown, it would look very different than it does. Now with many fewer cars. It would be possible to have a greatly expanded bike network with dedicated Lanes City biker safe. That would make it easier for people like me who aren't as comfortable riding in traffic stopped on a bike to get around. These are simple changes for the green New Deal invites us to completely re-imagined. What are City could look like when we leave the building today. It'll be to the familiar sight of frustrated drivers on crowded streets competing for scarce parking spaces and of the familiar smell of gas fumes from the constant stream of traffic, but I think it's possible to eat too much more welcoming environment around the needs of people not cars and to me the power of the green New Deal is that it gives us a chance to meet the goals of emission reduction in a way that creates a more livable and inviting City for all of us. Thank you. Hello, my name is Jeff and I'm a volunteer was 350 Seattle and an incoming new bathtub student and I'm here to testify on the Seattle Green New Deal. We've all heard of the UN report that states that we've have just about 10 years to cut our Global emissions by half but a lesser known fact from that report is that our missions must be got 20/20 and for Sharp sharply in the years after that means in just the next few months. We met we must create a strategic plan on how will / carbon in the next decade that plan is what we called the green New Deal. It must include a band not only on new fossil-fuel projects, which we currently have in King County, but we must also swiftly replace existing fossil fuel infrastructure with renewable energy. Furthermore. We must have an urban growth boundary to limit logging in the name of development and reduce our emissions from commuting at the same time. Thank you counsel members for supporting the green New Deal and I look forward to the Swift transformation in her City in the coming year Lisa. And then there's one more Lisa crislu will be the last one. Hi, I'm leasing it's over isn't it to stay in a real estate developer and manager owner and manager of the Starbucks center with a long history in Pioneer Square and I'm here to express strong support for the Center City Connector streetcar project in August and it's a stick and breaks ground on 80 units of Workforce housing at South Washington between second and third. It's the first opportunity Zone project in the city and in 15 months will have between 80 and 160 10s coming and going from their homes. They are most of whom are expected to primarily if not sole take public transportation. So the streetcar connector will have a significant impact on their experience living in Pioneer Square along with that of all the other spending time in this historic part of our city. Thank you for your support. Chris crislu here All right, not seeing Chris. We're going to go ahead and close public comment. Thank you all for adjusting your time frame to one minute. You did an amazing job. So Applause. Do I have an audience for getting through that so and it really appreciate so many folks coming out today. We have a pact agenda. It's one of Franklin mini packed agendas. We're going to have in this assembly and transportation committee is my waning days on the council wind up. I'm trying to get as much stuff done as possible. So thanks for all being here today will jump into agenda item. Number one. I'll have Kelly read that in and I'll invite presenters or to the table was he reside in we are having a breathing on the green, New Deal. Two books. Come on Ford Wherever you may be like today. Does congestion in the in the Halls as people are working their way forward that? Maybe they're protected walking Lane in the back of Chambers get people through like it. In a second. Introductions, I just want to let folks know we spent almost an hour and public comment today. So the meeting which is already planning to run about an hour long will likely run a little past 5 goal at this point is to get you all the agenda items help ever take only recognize that you may have other commitments. And so just let me know if there are things that you have special concerns about if you want me to hold those but for now, let's get going. So why do we start with a quick round of introductions if you want to just say it in I'm loving him and his den ice staff council member O'Brien on sustainability and Brittany Bush will lay on the chair of the Sierra Club Seattle group and Nancy, please our climate Justice organizer. I got green snot remaley and I'm the co-founder of Melissa Scott talks. Thank you. All so much for being here is great to hear from so many folks in the audience today talking about support for the green new deal. It's a concept that I've heard a lot about in the past year and yet figured out what does that mean for a city like Seattle if we want to follow in that framework an important question that you and the organisers who showed up at City Hall a little over a month ago and I forgot the city council to sign on everyone to sign onto a letter supporting the green New Deal. We want to work towards that loan if you want to maybe start with just a couple comments about what we've been working on the office and then I'll turn it over to our presenters. Sure, I'm things cuz my brain yeah, yeah. Basically our office has had the pleasure and a privilege of convening various Community stakeholders around discussing. What a green New Deal looks like and we've been meeting with them since the green New Deal endorsement letter was delivered to council and counsel endorsed it and we just like to thank the three Community stakeholders here for being here today and to open up the floor for them to share what the priorities are for including an a green New Deal for Seattle. So I will turn it over to you all to decide who wants to speak first. We have a staff with that form or formal introduction, Talk to you if you want a western approach you without the low or what you don't want to tell you how much your pillow will sloth. I'm not a high-yellow at a YMCA Charles friendly. You know why I agreed on a Harrison well, good afternoon. My English name is not really my lock code. The name is Joaquina Wanna Tonight. I'm from Standing Rock, but the resident of Beacon Hill and my parents are Charles trembly and Donna Harrison, and I would like to thank councilmember O'Brien and his staff for the incredible work and support and bring them forward this incredible opportunity to make Seattle leader with a passage of a green New Deal. We will get there and thank you for signing on to the letters support a few weeks back. Inner Lakota language, we have a saying mcdoc away or Yasin. And with that roughly translates to is we are all related or on My Relations and we say this and with an understanding that we are related not to just are our own family members or own tribe other human, but literally related to all of creation human and non-human relatives as well as when she macaw our grandmother Earth and when we say this, we understand that we are all interrelated an interdependent upon one another and when we begin to negatively impact one aspect of or one of our relatives and eventually impacts us all and that's absolutely what we've been seeing over the course of the past several decades. Are native communities have already ate and went when one point I'd like to make is and Artemis have already experienced a change climate and experiencing a changing climate do to the practices of mining the siding of hazardous and toxic waste facilities and nuclear waste facilities have more on or near tribal reservations and which has negatively impacted our health in terms of cancer rates and terms of life expectancies for my own people on Lakota. People are life expectancy for males is only 45 years old or life expectancy for Lakota females is 49 years old and I'm 42. What brought me here to Seattle was actually someone shouted out earlier the Community Coalition for environmental justice. However, I was hired as a community organizer where we specifically addressed the impacts of the sighting of hazardous and toxic waste facilities located primarily in South and Southeast Seattle Beacon Hill South Park in Georgetown and also really like to acknowledge. Green for taking up that I am continuing and expanding on all the work environmental justice here and Seattle because Seattle just like some of our tribal communities residents are already experiencing the impacts of toxic waste facilities. We know what report shows that there higher rates of asthma and places like Beacon Hill. To an absolute urgency to the passage of a green New Deal. We see it stalling on the federal level and that's somewhat to be expected. But we have the opportunity here in Seattle to be a leader in the passage of a localized a green new deal because communities in folks have failed to connect heed the warnings of traditional communities. We find ourselves in the conditions that we are all facing now and I just want to say a few other reports just the other day the Earth overshot Day Report came out which is a annual day that looks at resource consumption and the Earth's ability to regenerate the resources that have been consumed and July 29th. Was this year's Earth overshoot Day July 29th, and this was the earliest date to be recorded for since it began in the 1970s, which means that we're using nature at 1.7 times faster than an ecosystem can regenerate itself. And of course the United States has the largest consumer of those resources. We all know that June was recorded as the hottest month on record. I the intergovernmental science policy platform on biodiversity and ecosystem Services released a report a few months back which among many things. It states that over 1 million animal and plant species are threatened with Extinction due to the impacts of climate change the World Health Organization. I released a report where they cite that since 1988 over a hundred and fifty deaths per year can be attributed to climate change with the majority of those deaths taken place in the global South and they anticipate that number to rise to over 250,000 by the year 2030 through 2050 with malnutrition heat stress and malaria be in the the main source of death more locally Zillow the the home home. You can go on and look for housing and apartments. They actually released a report a number of months back where they stay right here in Seattle that they anticipate over 1,500 homes being underwater. But within just 80 years so not talking about a a radical environmental organizations is a real estate agency. And which of those songs I'd be an estimated loss of 2 billion dollars and a bulk of those homes are projected to be underwater are centered in the west Seattle Rainier Beach and Southeast Seattle communities from a mortgage financial and literally underwater. Yes, thank you for that clarification are some Seattle we have the opportunity to take a lead and set a strong precedent bypassing a green New Deal that not only sets at site on Seattle being carbon neutral but carbon excuse me climate pollution free by 2030 free of all pollutant gases that contribute to climate change. We knowed over the past even in my time working with this Council that you've taken incredible the steps and standings from 15 now to do Janice people. Stay your support for our fight against the Dakota access Pipeline and as was shared earlier in testimony often times when Seattle takes a stand the rest of the country and in some cases the rest of the world is watching and so you have it Opportunity to set precedent for other communities to follow the other piece. I'm excited about with this green New Deal is the inclusion of free prior and informed consent, which is a concept that actually also came out of a standing Rock in 1974 when the indigenous peoples from around the world gathered in Standing Rock to convene a strategy session on how to support one another from out the globe. One of these ideas was free prior informed consent and I which became a part of the United Nations declaration rights of indigenous peoples with that it would allow for is an exciting new opportunity for Seattle to collaborate with our local tribes and looking at unique ways we can revive Habitat, as was also stated in testimony, you know, our local tribes are the experts on this land and were able to live in coexistence with it for tens of thousands of years with little to no harm to it which brings back to one other point to that inter-governmental science report. What they found was in communities, where are excuse me lands that were held by indigenous communities or managed by digitas communities, they found little to no impact on those lands so that this green New Deal could provide a space for a unique collaborative effort and thank u l I hope I hit my five minute mark. Thank you. That was great. I really appreciate that. So I want to talk about the importance of the green New Deal being led by Frontline communities. So as Matt had mentioned we see black folks indigenous + communities of color and poor folks being District partially impacted by pollution across the country is so it's not just here and that's why it's really important that we are part of the solution and this isn't just a simple Rebrand of the work that were currently doing in Seattle what this really means is institutionalizing this process where you know, I've been I lived here my whole life. I have worked with God rain for the last three years and every single meeting that I come into I hear City staffers saying, oh, we really want to know Kenny priorities and we really want them to be in alignment with the work that we do. This is a way to do that if we're performing a task force or governing board, whatever the word the term is that we end up using It will be an accountability space where the community can really drive the work that we are wanting to push, you know, as communities go through these problems. They know the solutions, but they're not often resorted to be able to make these Solutions happen in their communities. And this is also an opportunity to move towards a just transition. And when I say I just transition that means moving away from an extractive economy and making sure that people who directly and indirectly work in the fossil fuel industry are left behind either and we're looking into how to make sure that folks that drive trucks for fossil fuel industry or people that are actually like in the front lines who have health issues because of this are also unable to access free healthcare and be able to get compensated for the new work that they have to transition to as Johnny mentioned earlier in his testimony. And we also want to make sure that you know Frontline commuting to be part of this work because we have already been facing gentrification. We don't want this new brand of ego gentrification to happen. And so when I hear people talk about all we can do green buildings. Well, we should consider green buildings that don't displace people when we're implementing policies like that. I'm going to give you some examples of just transition. We have some local ones like in Bellingham. They have a farm worker Co-op where folks are able to they think they own part of the the the corporate Corporation. You know what I mean? They own part of the work that they're doing and they have ownership over that and they work together to be able to build what works for them. And then in other areas where we have where we work as an alliance during the national organizations Folks at ribbons Health in Richmond. They have been able to I work together as Community when the city couldn't build Gardens on the greenway Trail the communication together and they started building Gardens and this initiative started in the early 2000s. And now they feed family is locally and it's all access to healthy food. This is a way that we can move towards more Community Land Trust and had some money on land Camion solar were committees are able to figure out for themselves and go through the motions themselves and do what works best for them without having to go through many barriers that they have gone through right now. So having this process week from lead is really important for us and to also bring home the point. We are really interested in looking at the green zone concept on this happened. I just passed Statewide in California where they prioritize areas that have been impacted most by pollution and the communities are able to drive or Solutions. So when we go through a green New Deal, we need to be able to identify which areas would need the most work right now as I mentioned that happens a lot and communities that are primarily primarily income-based of black and itches and camisa color and the poor folks and so she will be able to identify those areas through weather. Census tracking or looking at Health disparities for Respiratory issues diabetes things like that that will be a concrete way for us to be able to say these are the communities that we need to make priority first and then figure out with them how to build a solutions for them. Thank you that you appreciate all that. So I would like to talk about the places in Taylor that are emissions are coming from and some of the work that we would like to see there in Seattle come from two places transportation and buildings and to really achieve our stated goal of being carbon-neutral by 2030. We need to aggressively reimagine the way that we construct and use these parts of our city transportation is the biggest source of greenhouse gas. Emissions is responsible for about two-thirds of our missions in Seattle 85% of which come from car. So we really have to reimagine or city is a place built for buses for bikes and pedestrians and not as a car Centric place and way of life. We need a comprehensive bus and bike system that can safely and reliably get people in all parts of town not only to play but to work no matter where they work the middle. Hours, they work not just for people who have normal can use but we need bus and Transit service for people who work on Sundays now only Tech workers. What are domestic workers in our service Works reliably be able to use Transit is well. Otherwise, it's not Equitable Equitable access that includes bus stop design that's friendly to people with disabilities. We need affordable and multi-family housing near Transit and we need to explore making transit fare free when cars are you say should be electric when possible and we need an Allegro bike Network that makes easy and obvious choice everywhere in the city including the South End bike Network that doesn't have people coming in and talking about the trauma from the accident that they witness everyday in their neighborhood and then let's families feel safe. The other major motion source is buildings, which account for about a third of the greenhouse gas emissions one thing that we can do theirs continue to welcome multi-family housing into our city is multi-family housing is generally inherently more low Mission more energy efficient. But one thing that we really are going to have to do is examine our fuel usage 2016. OST benchmarking report says that Seattle carbon-neutral electric utility City Light has a minor contribution to greenhouse gas emission, but natural gas and steam have larger impact missions overall decline. The largest greenhouse gas emission Source natural gas is remain nearly constant it almost three-quarters of Seattle building energy emissions another report from 2017. No zipper Seattle to meet the goal of being carbon-neutral by Our previous day's going by 2050 not only muscle electricity you remain carbon-neutral. We must convert 75% a residential gas and oil used for HVAC in domestic hot water to electricity as well as the majority of our commercial usage. So it's not only crucial that the city ensure that the building types like multi-family housing that usually are electric electric. We need to make sure that train doesn't change what we need to really need to look at how we make electricity the largest possible portion of our Heating and Air Appliance usage and forcing you to do this in a way that is compatible to adjust transition principal. So we need to look at job and packs job transition job creation the financial impacts for the people who are have already been burying the ex. text star of the fossil fuels and look at the two lead on that regard. Thank you all for thank you all for the ongoing work. You've all done individually and collectively around climate Justice and for being here today to frankly speak speak truth to us about what we need to do some of the things that I heard more that we need to have a bee climate pollution free by the year 2030 how we do it is critically important and centering the voices of Frontline communities who historically have been most impacted and will almost certainly be most impacted by the effects of climate change is critically important not simply rebranding the existing work. We've been doing frankly rethinking how we approach this. I heard that the principles around Prior informed consent are important to Centre at this. That their opportunities for Partnerships and working with Community special indigenous communities who frankly have a centuries-long history of doing the exact type of work that we need to Discover right now Concepts like green zones are a tool we can use used elsewhere starting to be used elsewhere focus on if we're actually going to meet these goals and we're going to have to do significant things to address the climate pollution in our transportation sector and it how we heat and operate our buildings. Are there other things that you all want to highlight that we should be centering when we talked about, you know, adopting a the green New Deal for Seattle. This is our little document from god reigns. I'll tell are a priority areas. So fair green jobs for all housing for all healthy food for all public transit for all Healthcare and childcare clean air and water energy democracy and no more fossil fuels I can give you this little sheet super into the details, but we can continue that conversation. Thank you adjust transition was another concept that talks about that is critically important and also heard about access to free transit for everyone on both and public comment here today. So those are good principles to Other comments and customer Pacheco if you have any comments or questions. Please Japan. Sorry I was running down some notes. And I will thank you all for being here speaking to the committee today and just because John down some notes for myself in terms of what I think I need to be thinking about just moving forward today and and two for the remainder of the Year special as you can see that conversation around the green, New Deal. Let me know just need about land using and specifically like how how do we develop more walkable neighborhoods and you no more dancing in your Transit centers in so, you know, I'm going to keep Brian and I are trying to work on some things and I think we'll be able to keep moving the ball for improving those Transit options for communities. I think that's just so vital, you know, I speak so often about how you know, I don't have a car and it just the part of it is because I happen to to be in such a Transit Rich district and I wish that wouldn't was more true for more people in so so that we can get more people out of cars and support for just renewable sources of energy and safe routes that created that make it easier for people to to buy Kandinsky around our neighborhoods and communities would be helpful and acknowledges that this portion impacts of climate change and we know that this is historically the decisions we've made that have led to this point. I have most of the support of impacted communities of color low-income communities and what we do next needs to be proactive in Dublin to undress helping to address and mitigate those concerns so that were were intentional about her Solutions. So I'll be mindful of that in terms of my thought process moving forward. So, thank you. Thank you. Can snort Aiko. I really appreciate the ability to chat with all of you since some work together that goes on for a number of years, but also just in the last month, since you came to City Hall task for us to support a green New Deal and based on the conversation today councilmember. What I'm interested in doing is finalizing work on a resolution to bring back to committee a week from now where the city could the committee could consider adopting the principles of a green new deal as outlined by some of the conversations and some of the firework you share with us. I'd love to be able to share a draft with that before the end of this week with with you all in the public and council members to see that but there is a sense of urgency around this and a resolution would be a great staff who would be sitting here laying out some principles and some commitments course a resolution alone is not going to achieve this. We need to do and so I would love to move swiftly through passing a resolution and move on to some of the work we need to do and something. Since we need to make him communities to get this work done. So that's my plan at the moment. I want to I want to just highlight the challenges before I said, I think everyone in the audience knows but I am going to say this out loud just to remind myself when I start on Council 2010 if it was in 2011 actually passed a resolution committing the city to being carbon-neutral by the year 2050 at the time. It was less than 10 years ago that may have been the boldest commitment in the United States and certainly one of the boldest commitments Nation around the world. In the 10 9 years since we've done some good work, but we'll be seeing is in the past few years are overall carbon emissions continue to go up. So not only are not on the trajectory to meet our carbon neutrality by 2050. We're actually still heading in the wrong direction and what we're talking about here is back then we had almost 40 years to meet at and we're saying we need to make a new commitment and we have 10 years now to do something that for the past nine years. We haven't been able to do on a trajectory of 40 years. I think we're capable of that. I mean frankly we have to be but it means that frankly I think passing the resolution even with a bold commitment to 2030 the principles laid out here. I think that will be a relatively easy thing to do because I think the people on this Council or supportive of your communities in the concepts laid out here, but the actual work to completely make our transportation system pollution free in the next 10 years to make sure that all of our buildings are running exclusively on 100% renewable energy in the next 10 years. These are going to require significant bold actions at the city level and you know without your all your all support. We're not going to have a prayer doing that but I believe that the green New Deal is annulment an opportunity of movement that Can change the political Dynamic that we've been stuck in for a long time? And I have I have some hope and optimism that that will allow us to achieve this and that's what I'm going to try to do my remaining months on the council and that's what I plan to be working on for the next decade myself to once I no longer in Council. Your committee members any closing comments. If you have any else you'd like to add before we move on to the next agenda item and invite you to be part of the discussion in one way or another week from now. One last thing we talked about transit-oriented development a lot and how that could be a solution for getting people to take buses and whatnot. However, I just want to make sure that when we're doing things like that, we're mindful of how our brain communities back who have been displayed through different developments that have happened through that process as we've seen that happening already and that makes it harder for able to meet their carbon goals. So bringing the back into the City and training space for that again, I appreciate that Nancy. Thank you all for the work and look forward to will be along with you all the all the rest of the way and in 20-30 making sure that Seattle holds to its commitments. Yeah, I want to say thank you for your work and your leadership on this. I think this it's I think there's a movement is momentum and now is a time for us to be really really bold on this to really use our imaginations and take big step forwards as a community, and I think we can do it. Thank you. Thank you all so much for your leadership. It's been an honor to work with you and I'm looking forward to the next few months. Thanks a bunch. the Rita and a Gen X number two and three and invite prisoners forward for the next item next to items 564 and Ordnance relating to the Department of Parks and Recreation accepting an easement from an entering into a maintenance agreement with Seattle Children's Hospital a Washington nonprofit corporation as a condition of the public benefit requirement for the street vacation of the portions of 41st Avenue Northeast and a portion of Northeast 46th Street petition approval contained in clerk file 30969 0 And Council Bill 119-5662 and ordinance vacating a portion of 41st Avenue Northeast and a portion of Northeast 46th Street on the petition of Seattle Children's Hospital clerk file. 309-6290 Welcome everyone. Let's start with introductions Seattle Department of Transportation in real estate Michael Jenkins Seattle design commission. I will get on the council for 10 years. I feel like I started my work at this project in parts and it seems fitting that it's right here to say goodbye to me and kick me out the door. So I don't jump in and assume you want to start and give us an overview and I'm just two pieces of legislation. So maybe just help us understand the distinction between those two but you can talk about them collectively if you'd like and have finished this work. So there are two pieces of legislation in front of you and what we propose is to a perhaps go over the vacation presentation first the vacation ordinance is The second step in the vacation approval process. So when the city council approves a vacation petition, it's always subject to numerous conditions. There are conditions that relate to design and mitigation and public benefits. So we see the vacation ordinance coming right at the time a project is opening or later if there are easements and other things that take us awhile to figure out so when the council approves a vacation, there's a public Hearing in conditions and then we all go out and spend some times a long time figuring out and developing things and implementing them so that two pieces of legislation are the very very last step which is the vacation ordinance and one of the vacation conditions, which is the park easement legislation. So normally we would look at voting on all of the condition related. Translation first so that when you vote on the vacation ordinance, everything is done, even if it's just a few moments apart and we did think I'm so I Richard has a very brief presentation on the parks connection, but we thought it does make sense to introduce the subject more broadly since there was a major institution master plan and phased work and a lot of issues related to that. So what we're proposing is that we look at the vacation presentation, which Todd's going to go over for us and answer any questions and I would note that we have a pretty extensive PowerPoint presentation just because it was such a complicated process. We wanted to make sure we had everything here. I know you're familiar with it. I know counselor which Echo at living in the area may be very familiar with the project as well so we can go as quickly or in as much detail as you wish. So we propose to go over that and then turn to Richard and look at the vote on the Eastman ordinance and then finally the vote on the vacation ordinance. Excellent. So what I would suggest is in the spirit of time to move the abbreviated version by Pacheco and I will interrupt if we have any questions. It's obviously a big complex project and I know it's in customer take his district 2 so we'll get the reverse order of the presentation. So So good afternoon. Thank you for the time. You're very familiar with Seattle Children's Hospital. We've been around for a hundred and eleven years and since 1953 in Laurelhurst. And as you know, we provide Health Care to children and our city and our region regardless of their families ability to pay this afternoon. We're going to talk about the street vacation will give you some context in history and share with you the public benefits that we put in place in response to I'm the council conditions. So as you all know, I wore in Northeast Seattle behind the University of Washington in the Laurelhurst neighborhood back in 2010 as part of our major institution master plan work. We had over 7 different proposals. For I need an expansion on the Laurelhurst campus we together with the council and our neighbors agreed on what we called option 7A which involved the purchase of the Laurel on Terrace Apartments of what's 136 units of housing to the Westin of the campus and that is hatched there. A part of the Laurel on Terrace was two streets Northeast 45th Street and 41st Avenue Northeast that were part of the original development back in the 1940s and wound their way through the development. We proposed the demolition of the 17 buildings on the site and the vacation of the two streets in order to complete our master plan what you see on the screen the masterplan ads 1.25 million square feet to the campus and you can see the the proposed buildings are Level 1 2 3 4 and so on as soon as the master plan was approved. We began a major, excuse me up permit application for building number one, which opened in 2013. It's a building that has primarily on patient care 196. Patient bedrooms in emergency department and kitchen we're currently involved with phase two if you've driven by which I'm sure you have or written by it's a big hole right now, but that will contain a new Cancer Care Clinic laboratory Pharmacy and other needed services. We developed a list of six different public benefits that we presented in this room and were accepted to hear back in 2013-14. I believe and they consist of a burke Gilman Trail connection additional Street amenities on Sandpoint way Transit Center contributions of 2 million dollars or more to the a bike and pedestrian fund some Street amenities on 40th Avenue Northeast and finally the creation of a pocket park and in the appendix, I have a whole lot of information for you lots of texts and lots of photos, but I chose three photos to share with you to represent the work that is now complete and these photos were taken a few years ago. So it looks actually even better. On the upper left is a view northward on Sandpoint way. It's notable. It shows the transit improvements. It shows a plaza. It shows what I believe is the first bike path in Seattle. It doesn't go very far but it's meaningful to us because it goes from our new Burke Gilman connection to the front entrance of Seattle. Children's Hospital can be used by neighbors families visiting the hospital and certainly are on staff. The center photo is a pocket park on the corner of 45th and 40th that we created in landscape buffer area there at the corner of the campus. And then finally on the upper right are several significant sequoia trees and the burke-gilman connection that we created from the internet. Directions to 40th and Sandpoint way up to the burke-gilman trail. So we showed this chart back when we were here the last time and you can see that we've completed everything that we said we would and we also made a cash payment back in 2013 as required. So we believe we've completed all our obligations then and we are ready for approval this final slide that I have for you shows about. Oh, I think it's nearly 4 million dollars in any improvements that are spread over the four phases of the master plan improvements the bulk of them coming in Phase 1 and and are already complete. She's just thank you for the bike path and it's nice. Thank you. Yeah, I don't know Michael. They design commission was really engaged in that and then and we can look at the more detail on the trail connection, which was one of the public benefit obligations of time. I guess I just like to summarize quickly that I think this is a fine example of what the commission likes to see you got public facing public benefits that do not require use of the building do not require you to go interior to the site. They provide a clear benefit to the nearby community in particular 40th, but it also enhances on larger City Investments the trail Connection in particular at burke-gilman a lot of those connections that we seek and sometimes be awkward you were entering right in the path of automobile travel. There's a significant time for people to enter or leave gather yourself before you hit a city street and then you've got that other significant Investments long the ride. Again, I just think it's a fine example of what the commission likes to see that and then ultimately recommend to the council in terms of a healthy public benefit package public benefit package before its time or just in time maybe the trail connection project that was a multi departmental and agency effort. First of all, I don't want to thank everybody who was involved in it and all the good hard work. They put into it to go forward got an overhead picture of the trail and you can see Park property or the burke-gilman trail, which is shaded in green. You can also clearly see the connector Trail which goes across Park property to Children's Hospital property and then onward to Sand Point Way, it offers a pedestrian access. And it's also maintained a maintenance agreement Children's Hospital will maintain the Landscaping they put in hardscaping and lighting and this is in perpetuity of the portion of the trail that's on par property the portion of the trail that continues across children's has been granted to the city through an easement and that again is in perpetuity. I maintenance and repair of the troll connections again will fall on a children's hospital in the resigns. So even if the property is sold, it continues to be maintained by the future owner and the trailer basement provides terms and conditions of Trail usage further protect the city through Define indemnification liability and access requirements to tell us also accessible 24 hours a day 7 days a week 365 days a year except winners required maintenance in which case at that point, you know people may have to be But that's the only time it's it's going to be impacted. questions I don't have anything specific on the project. I have seen most of these Investments come online so I can visually account to the fact that they've met the requirement to Beverly. Do you want to just confirm that what we anticipated years ago when we first started on this has been completed the required vacation fee and so everything is ready. And we do recommend that we vote first on the parks easement and then that will take off the very last. So yeah, so this some it took a while for us to get here but children's is very responsive. So it was really our pleasure to work with him on finishing this I think the council I'm went into great detail on the master plan in the vacation and I think everything has been implemented very carefully. I also wanted. This is really part of the vacation process. But you're but it is part of the the major institution master plan your ongoing commitment to transportation for people who reach the the hospital has been an inspiration from me since I've been on the council really think fit as a as an institution a private institution you do amazing work to a really thoughtfully figure it out in a role model sir, you know agencies and Institutions and other private businesses around the city and I'm not sure how much could have to do we have butt in the in the coming months There's an opportunity to get an update on what you're all doing on your couch reproduction is always inspiring to hear that and looked it up because of everyone we're doing which opens were doing when it comes to Transportation special for their workers. I think that are carbon emissions. So we just talked about it last issue with would be a lot lower. Password protected you have any questions on this or you're ready to actually vote? All right. So I'll go ahead and move my guess. You know, I should just mention that I believe I once again skipped over approving the agenda but not hearing any objection. Go back to the item being approved agenda. But now go ahead and move 11956 for all those in favor signify by saying hi. So that'll be wonderful counselor recommendation to Parks easement. So now we can move on to the actual vacation. Now that increasing Theory when it gets the full Council if we do in the right order will met all the requirements. So I'll move Council Bill 11956 to the actual vacation ornaments. Thank you for all your work on that and this will be the full Council on Monday. Tell Alexa to Jenna and number 4 and I'll invite the presenters forward that he read that in Contracting equity. well, I'm here. That's exactly what I I want to take your shoes off. If you're free. I just get used to me start by just going down the line and everyone can just introduce themselves briefly and then we'll get into good afternoon Michelle Domingo the new manager for the office of equity and economic inclusion. Menards on Marlin C&R SGI advisor on one of the coaches for The S-Type change seen Sammy look like you wanted to maybe I was going to open it up and then some let these really capable folks leave the show. So I'm just excited to be here with with this team. The team does a lot of really great work across the agency and is really leading our are charged forward throughout the agency on all of these issues together. So I would that I will let them share all the good news and all the work they were doing and be here to help answer questions. Again, my name is Michelle Domingo and you go to the next slide and I'm 3 months in the new position. And the office of equity and economic inclusion sits in the director's office and works collaboratively with a change team. We have the Kobe's here and also the transportation Equity program the OED I that's our acronym we promote Equity throughout the entire organization of s. Through a raise in Social Equity lens and our office in with the wind visor on the RSA advisor and in collaboration with a change team and transportation at Cody, we leave the Strategic vision and leadership in the planning and promotion and advancement of equity and leaves us. To a measurable Improvement of through an intersectional equity analysis. I started in May so I'm 3 months in and I have a great team here to report out some details in the past year. So I think when all I want to see is next good afternoon. Again, my name is Manalo Marlon C. And I'm going to provide a few artist J updates as we all know here at the mission of the city's rsji and social justice initiative is to end institutionalized racism in city government and at Seattle Department of Transportation. We've analyzed our scope of work Authority and impact in identifying what are Will and accountability isn't getting the city they are and we've established Division II end institutionalized racism by sees in an equity in our transportation system Workforce and intersections with institutional erases systems. What that means is that were intentional about not only centering into an Institutional analysis, but also a structural analysis in our pursuit of Equitable outcomes. We currently have one full-time RCI staff member. And in this role as RCI advisor, I advise as. Directors managers and staff on Equity strategies as well as the system change across are very signs of business. I also serve as an adviser and resource far change team chairs and numerous idt's across the city to build both a department-wide and a Citywide RCI framework that will Center RCI as a practice and all of our city work. In 2018 as we can see on the slide we set seven Department Artistry articles ranging from establishing and you change team function all the way down as you can see it to training all staff for implicit bias in RPI. And we've had quite a bit of transition over 2018 in both our leadership and organizational structure. So it did slow down our progress on some of these goals. However, we are meeting all of them except for establishing our employee Resource Group for PLC advancement called polka and fully drafting RCI goals for divisional work plans in regards to Poca. It's up and running. However, we're at a place where we're currently working to establish funding for the employee Resource Group. regarding the divisional work plans I'm actually in the process of scheduling meetings with the new division directors to discuss their vision of embedding artist GI in their divisional work plans. I should also know that our goal to train all our all of our staff in implicit bias an RPO why it wasn't an expectation that we would achieve that and when you're in 2018. But our goal was to make significant progress towards that and we have trained 311 of our staff members and implicit bias rrpl license setting the school in 2018 and lastly using racial Equity toolkits to guide our racial Equity analysis on our various projects in lines of work has become a Norm at us. And if you would like to see a few examples of that we've submitted the four listed here on the slide to Seattle office of civil rights, so, please feel free to look at a bit your discussion. Thank you for your time. And thanks for highlighting your tool kits that you've done and those are really helpful when we said policies. So I appreciate your leadership on that everyone. Okay, some of the changes has happened with the change team from last year when we met one of the first things is to restructure the change team leadership as you can see we have four different subgroups and I change team and we wanted to make sure that we are having people who we see a subject matter experts within each subgroup. And so we made it we decided to have them as at lead within that and also we was going to promote your leadership development as well. And so we put together a one pager that did that and I shared it was the senior management team which was especially helpful. I think in terms of basically every year one third of the change team is in their first year of their three-year term, and so there's a pretty steep learning curve and there's been some changes at 3. Bubble to so just having a resource that everybody can put two has been really helpful when I was talking about. We wanted to make sure that our plan is that everyone who has the ability to have some type of ability to hire. We want to make sure that they're taking implicit bias to have that analysis when they are taking making decisions is where the hiring and with HR. We want to make sure we created a three-tier system and with HR that have more of the data is to see where are where are employees at and what were they need to do as far as like The Institute me in the foundational knowledge. They need to take each tier going up. And then lastly we created a new communication subgroup and that was based out of the realization that you know. Really needed to know that there was a change team and that we were there to support them because we need when we think that you know, the only time we did Outreach like internal Outreach was really Adrian recruiting new members. And so we thought I was really important and then the second part was there was a lot of good work going on by restaurant staff. So we wanted to highlight their Equity analysis of these and and then the decision based on those analyses to mitigate impact some communities of color and and so those are kind of the four things that we've done in the past year that we wanted to highlight today. So if you recognize that whenever we restructure anything that could be somewhat sensitive so I don't need to tread too deeply here. But I'm just curious if the restructuring was driven about kind of matching the news trucks on the organization or creating new opportunities for folks or just out of recognition that it needed some new energy over the years to visit the changed him a few times and there's a lot of Engagement least that means I went to but I'm curious what was driving the restructuring and you know, you don't need to go too deeply if there's sensitive stuff they had to how to flatten the change team organization. And so initially they were in the previous years has been to co-chairs kind of bleeding the change team. I guess you can say us to but then a lead for every subgroup and so, you know changing changing work is really about kind of building momentum and a move. Show me really wanted to kind of have that special reflect that helpful. Thank you. Drawing error has occurred, but we can still I think you said I can go get my graphs a little different than yours those in the audience, but it'll be available online later, but please speak to it. As you can see here, we compare the representation in our Workforce to that of the greater Seattle King County area for more accurate in meaningful reflection of the diversity in our department. We also break the data down by both race and job classification for more clear understanding of who's most impacted in our Workforce and where the disparities lie the state of intern in forms. Both department-wide Workforce Equity initiatives as well as our contributions to our Citywide Workforce Equity initiative. Our HR department works in partnership with office of equity and economic inclusion in establishing our first employee research group that I mentioned earlier name polka Apprentice in mentorship programs and implementing Workforce Equity initiatives supported by the city's a we pack Group which stands for the workforce Equity planning and advisory committee and our department has representation on that committee through the office of equity and economic inclusion. Quick question here. And again, sorry audience. I'm looking at the The percentages in the the I don't add up to 100% across on the columns is that people look like for instance 3% of Greater Seattle area that African-Americans to 66.8% Asian American 18.2 Hispanic Latin American 9.7 white 68% Native American 1% The one I add those up that comes to More than 100% And then when the assembly representative in the apartment, it comes to less than 100% So. Is that is that like is there an explanation for that? That's okay. I can get some information on later. Zenaida from the HR department here at this moment. This is a reflection of the records that they have and what was submitted to the office of Equity Funds presentation. I'll follow I'll forward your question and then I'll get back to you. Just confirm check out the work for the workforce Equity metrics one kudos to the women and making more money than the men but there's a 8 to 10% disparity between people of color and their white counterparts. Is that without getting more specific into the into the date. I like it. I can speak to how are using that data. So we're really intentional about having our representation on we pack be from the office of equity is RCI advisor and serving on we pack so I interned compare that strategy with rsj and use RCI as a practice in our departmental HR Workforce Equity initiatives. At The Witcher highlighting right now is the need to Center race and all of our analyses and a reason is is the reason for us breaking down the date of the way that we did now why that's the reality is why we have the reason social justice initiative, right? So, what will what we will do moving forward around that is to be disclosed and what will be done in Partnership again with the office of equity HR & R Citywide we pack committee. Just more curious to see if it had more to do with the advancement opportunities or where the positions were relative to everyone else and so forth. And so again getting more specific highlights at more about just the pay disparity. Oh, no, it doesn't have any of my slice up there either. Wonderful. My name is Viviana Garza and I'm the I can move a little bit and I oversee the implementation of our Department's efforts for inclusion for women and minority-owned businesses. So for 2018, this is our annual update. I would appreciate it. Thank you so much for trying to get the photos of are the picture. So it does. We look to leverage our purchasing power to be inclusive of and a building capacity of women and minority-owned business enterprises in the work that we do we track your spending in purchasing Consulting and construction before construction. We collaborate with our partners at the finest administrative services department for advancing our goals. So the information we're showing today or perform. Indicators for a purchasing a Consulting goals, which is what we set fire department on an annual basis. So our actual performance for the past six years is shown a steady increase in the departmental goals in the last four years. We reset how we look at Wendy targets from being solely endpoints are kind of a Finish Line to developing and implementing structural changes that can change the process is internally and see that results externally. So that means structural changes within our procurement processes to change an advance our utilization. So some of the initiatives that we've implemented include looking at availability proactively engaging regularly with Department leadership for accountability as well as asking for planning for procurements ahead of time so that we can take a look at that and plan accordingly and providing an advance look up opportunities both in the Consulting world and construction through providing what I've in my experience has been most valuable for firms at least from the feedback. I've gotten Is our anticipated project sheets. So those sheets let Wendy friends know what we might be working on looking as far forward as 2023 and we share that in advance so that they have time to prepare to meet our needs and start screaming. Now I love how is that is it pretty well received my my my sense is that when we look at how a mess. Does he work compared to other organizations including wash. Historically it seems like you've been a real leader in this. I'm just curious if that if the feedback you get from Community that's bidding on these that still. As one where when I'm talking to folks and community that is a big piece of feedback that comes back is looking at having the opportunity and the time to prepare for our needs our business needs with advance notice so that they know about what's coming up all the way. I mean we have in the construction world. I have an anticipated project sheets that go out to 2023. So looking ahead and being able to know about those opportunities folks can get involved with P main preparing themselves getting together to do joint ventures. That way they can be ready for the procurement when they go out to First full sedation. So that that is something that we have had a conversation or many conversations with folks and other agencies and their following suit or doing similar things. Straight that looks like that's the first one. That's okay. I'm going to move on to the next. Thank you so much about it. Thank you. Okay, but I won't criticize laptop keep going buddy. So about 19.4 million of our 2018 dollars went to Wendy firms in 2018, which is actually an increase from 4.2 of 4.2 million dollars from 2017 on the purchasing side. That meant about 4.4 million dollars went to Wendy firms which came out to about 19% of our purchasing spend which surpassed our goal to 15% and Consulting that meant about 15 million dollars would be firms, which is 40% of our Consulting spend again far surpassing our 23% goal, and I also want to be clear with you this data. You'll see the bars are they might have similar numbers like the 23% on the Consulting side for a 2017 being slightly higher than the 23% on the 2018. It's because we're looking at the totals for the year to 23% in 2018 was smaller than 20% of the 17 just cuz the body of Consulting where we head out Boston Consulting. Here, so What I wanted also take a look at and what is important for us a test. Is breaking this down further so that we can see patterns breaking us down into women a minority owned business enterprises were able to see the out of the 19.4 million dollars a substance of amount does go to white women owned firms and the remainder goes to minority-owned businesses. So that break down is helpful because it allows us to Taylor Outreach strategies. I think it will be mentioned last year as well and that helped us develop our annual Outreach plan going on to the next year. One thing that came out of this as we focus on work shops in the community in Spanish starting with the Seattle public libraries and finance administrative services in the past. We did how to do business with s. Spanish language sections, but in 2018, we expanded that we decided that this is this is important to do for the entire for more of the city as a whole and so we connected with our Capital Department partners and collaborated with the wind advisories from spu and SC. And the mayor's office policy advisor and Contracting activity and you can own conclusion as in Zwolle to put on how to do business with the city of Seattle still in Spanish and still leading folks through the online business directory and how to get a connection with the city of Seattle opportunities neighborhood Outreach to the east African communities as well as other communities inclusive of Women Business communities focusing on the inclusion of women of color. And so we're trying to figure out other avenues into to include and to give this information and tools traditional communities. So this is key for our data in terms of developing are a targeted Outreach an important part of the numbers that aren't accounted for are the sub Consulting dollars. So I wanted to talk a little bit about that. We had in 2018 about 3.6 million dollars on tracked inclusion plan contract that went to win. Chauffeur for our Consulting contracts that exceed $314,000. There will be an inclusion plan attached to that procurement, which means that we ask Prime's to show us what kind of substantive sap consultant commitment they can deliver those subcontracted those sub dollars aren't part of our actual percentages. That is something that is important for the big picture because we can see the impact of inclusions to windy Farms even within our larger projects. We've also taken a strong look at our prompt payment performance. So we've been asked to include from the from within our annual Outreach plan and starting in 2018 prompt payment percentage. We've been asked to the application for all departments who have an angle at which plan is to have a 95% commitment address. We have a one hundred percent commitment to pay invoices within 30 days and we achieved in 2018 90% we continue to hold her go. At 100% going forward because you recognize that even though in 2018. There were some bumps in the road due to changing Financial systems issues which impacted our percentage we think it's particularly important to maintain that goal because prompt payment really impacts women and minority-owned businesses in the way that they can continue to do business. We also track our diversity commitments and payments in step with the finance administrative Services Department through b2g now, which is our cities online diversity compliance system and that allows us to track payments on the sub consultant level to make sure that we monitor the progress but also to make sure that the sub Consultants can share with us whether or not they're being paid promptly and step in if that's not the case beyond the numbers we want. We move to I can't move. We look we looked Outreach efforts to move the needle so last year we continued our working with us. Events which are as. Hosted Outreach events that we hold downstairs and their Bertha Knight Landes room. We had our working with us. Move Seattle event in 2018, which showcased the kind of work. We expect in the most data Levi updated on the current project of the 11 mm of Seattle's projects. And we had us. Project managers and Leadership accessible the firm's to connect with Emma Prime contractors. We also had a working with us. Ready to Prime event which through panel of es. PN Contracting specialist and staff from the finance and administrative Services Department focused on providing tools resources and tips and strategies to be successful as a prime. Especially for firms were moving looking to make the transition from being a sap consultant to being a prime and we chose that particular Focus because we had gotten Community feedback and interest. We also continue to have when he Advocate trainings and that is to help desk. Staff understand where expectations for the Department are coming from we partner with the office for civil rights to make sure that we are to offer those courses within the race and social justice initiative. So we make sure that we are Lined with them. We have two courses the first talking about Contracting equity and what it means and exploring the effects of racism and how that impacts Contracting and the second is how that translates into expectations for the city and what tools are available to help. So we still we connect again with essence of Allah as well as Finance administrative Services Department to walk us through they online business directory, which is a very important tool for the city to Advanced Contracting Equity at the close of 2018 at 81 be Advocates, and I'm hoping to move that number a little bit more than it was this year, but still a TI te Casas for a grape and another piece that I wanted to make sure that's really important that I know I'd talked about it a little bit last year. Is our goals generally and how were challenging ourselves to next to in 2018 or 2019? We are increasing our goals to 30% and it's insulting and 19% in purchasing and another important piece of our goals is the levy to move Seattle's 23% When do utilization call for that we collaborate with our partners in the finest administrative services department and our office to move Seattle to gather all the information we need because that spans Consulting purchasing and construction and the dollars include the spend to construction subcontractors and leveraged funds but does not include the sub Consulting dollars currently in line with cities the city policy does not include labor cost or anything that's identified as direct exceptions. So from the start of Levi through 2018, we attained a 23.3% windy utilization which is exciting about 48 million dollars that went to the went into the pockets of These were just fantastic, but we still continue to do our targeted Outreach. So about two months ago. We had our latest move Seattle working with us. Move Seattle event to continue that targeted Outreach me at about 131 attendees, which is really great. We also implemented a new award recognizing SR20 Pathfinders. So I stopped folks who go above and beyond help connecting Wendy's for the right sources this year are Pathfinders. Where are three. Ends Scott hartmarx liger and Greg his own room really proud of them. But one of the things I wanted to mention is that while we're happy that we're meeting our utilization currently. We're still remain diligent. We're continuing to keep our our finger on the pulse of that because we realize that this is where we're barely halfway through the Levee. We just want to make sure that we're conscious of maintaining our our percentage as we go forward. So to finish off for power and excited to have attained the highest web utilization and S. Two days, and we plan to continue challenging ourselves, and we are committed to continuing with our internal Contracting process improvements monitoring subcontractor goals posting working with us. Events providing advance notice of opportunities with our anticipated project sheets. Implementing will be out to get trained and having targeted Outreach such as the intro to the city Spanish language workshops. So with the with the office of equity and inclusion increasing and capacity with the addition of r o e I managed service were so excited about we hope to continue building the capacity of our Equity team and continue pushing for inclusion and further solidify that s. Really truly value of equity don't thank you. Thank you. That was a lot of information and I think there's a lot of lot of success stories is the share and I really appreciate that. This isn't just about here or numbers we hit it but I appreciate that you're looking at the distinction between a women-owned business versus the one that color on business and you know, when we leave our overall go how we doing with other splits. In other areas, we could do better and it every year we keep improving approval be so the screen And then our last lied, I'm so Viviana talk to about condition is moving forward, but I'm for work for us Equity. Again, the establishment of the people of color advancement employee Resource Group is a big deal. And they're looking at on creating a budget and working with human resources in ODI to send her work 4th or 1st Equity as Enzo Primus take hold and then for the change team, they're working on their division of work plans developing internal ret workshops in inside us. So people can learn more about how to actually do the rats in a Refreshers and then work changed even working on sustainability of new members and creating a budget moving into the next year. Is there anything else change team wanted to add or Mrs. Jie advisor? We're busy. That is very clear. I really I'm really intrigued by the the polka and I'm interested in think I'll just flag for us as we get into budget. I'd love to see how that's fine. And you know, I want to make sure that it's actually funny that I've seen. I know that in the city or other organizations too often folks find, you know, start with like a we need to have a Workforce it more represents our city. They can bring those perspectives in then retention can be really hard or promoting people to the Rings can be really hard. And so I'm I really appreciate it. I'm intrigued to learn more about this and maybe take it to other places where I'm involved to figure out how we can use it to like this is how that works. So but I know that having a commitment without the funding and resources text you do it just music app. So I hope to see that boyfriend in the budget when it comes to us and want to make sure we fight that so we can pull it out and learn a little more about it. Council when I get there cuz I know there's also a lot of competition in the budget and I really appreciate change team I know that I really appreciate your comments earlier about how we you know, what I heard was you know, this is like a Grassroots organizing effort within the department and we won't expect it is like an advocacy group. Maybe you can't say that in front of the boss here, but that's what I heard and I think that's outstanding because I think that's how you know my pin my 10 years on the council. I've learned so much because of city employees who are doing the organizing including your organizing around me and it's been really powerful and probably the most valuable thing. I've learned since I've been at the city. So that's great to hear and anything we can do on the council to support the change team, you know, please keep us posted and all the folks welcome to the new position in the new structuring. It's exciting to see I think certainly, you know, when you look on or charge him like a titles that's a piece of showing a commitment dedication to the work. But obviously you can put titles in order to RCN and still not doing either work and so it's great to hear from you. I'll personally about what you doing and I sense of real passion and commitment for this working for somebody that worked with before. I know that this is awesome on the record so she can't give you any trouble. Thanks Tim Kelly. Let's redo the next agenda item the annual streetcar operations report and next steps. Excellent will get the whole team up here and not going to do this by yourself. pictures look good I'll just acknowledge that we had a lot of turn out in public, today for the streetcar. I think they're just people randomly saw this on the agenda and showed up or maybe some organizing going on out there, but it's great to have so many people in the community and a mix of folks from across a community speak into it remains a major transportation both in terms of impact on how we get around the city but also financial resources and so excited to have both here about how the operations at our existing speak our lines working where the center city streetcar fits in so when we start with introductions with Council Central staff, Chris a Lemon Street Car Insurance headquarters manager s. Sam Zimbabwe director of project manager. And did you want to make any comments to just to just here to keep an eye on us must jump in with the presentation and as we get two questions, please feel free to ask questions to on our behalf. So I appreciate it. So I'm going to give a little Framing and then I'll turn it over to Chris to talk about 2018 performance and Eric will take the lead on that where we go with the Center City Connector Next Step. So, we're very excited to be here to talk about streetcar with see this project as being Court our mission or vision and and core values. We worked over the past year or so to refresh and renew as well. So we're here to talk about two things. The current status of the streetcar program is best of 2018 operations report and then talk about The Center City Connector and where we go to 2018 was a very positive year overall for streetcar operations. It also included a lot of work by the department to that which was at the direction of Mayor durkan to I do understand the where's the C3 project had seen issues and some of those might have been just below the surface too many, but we worked hard to surface. So we continue that work into 2019 and we're here to discuss both where we may be able to make improvements in 2018. And then how we are ready and prepared to move forward with the C3 project respond in a responsible way. So with that we serve talk a little bit about each of these components and I'll turn it over to Chris to talk about the operations report and then again Eric will take the lead on this III next steps. Thank you. So we're here to talk about the operations report as you may be familiar. This is a requirement that was pursuing to in order to counsel from some time ago. We were last here in December 2018 to talk about the most current numbers at that time. We're here now to talk a little bit about your ad 2018 some of the trends we saw and looking at the year in 2018. We're pretty encouraged by some of the results. We've seen kick it on the ridership front system-wide ridership was up over 2017 and in year 2018 about 18% Most of that increase came on the first Hill line. So 31% jump in ridership on First Hill in 2018, which is pretty significant ridership on the South Lake Union lines stayed pretty consistent over the past three years. So we see that the starting to stabilize a bit down slightly about 4% of those those two lines combined where she Showing a double-digit increase in the 80% range that Trend continues through the early part of 2019. So through the first quarter 2019 even looking up into two May. We're still seeing increases on First Hill and even some increase on South Lake Union as well. So happy that that that's continuing we expect at that wall play out for the rest of the year. Can I just clarify one thing I said most of the ridership increase came on for so bad all of it to the right a little bit of noise there. But so I felt like Union has been flat for three years has he mentioned in early? Nineteen Racine a little pickup. Is it still within the margin of error kind of thing or is it is it a trend? We're seeing I think the first still aligned continues to grow the South Lake Union line remains pretty flat. Now that the increases we see month by month to month. I read somewhat seasonal until they're high points and low points throughout the year and sometime we see some changes in the latter part of the summer early part of the Fall. So September tends to be a little bit of a October 10th to pick up a bit. So I think by the time we get to the end of the year will be able to kind of know more about the trend but so far the numbers are encouraging through the early part of 2019 is probably I'm just Sports remembering that I think the South King Street Car ridership peeked around 2013. Excuse me in about 750,000 are there is currently there's a lot of reasons why that that has changed part of it might be because we really stand a Transit service in South Lake Union. So there's a lot of other options. We have overall a lot of great Transit network, but the actual Slice of ridership on South Lake Union decrease at that time. It does seem to have stabilized for the last three years, but it's it's not where we originally thought it would be and so just to be clear on the transit what we may have seen before his people to Natuzzi tried and we extended service into there where there was a sea lion and guess would be the big one in the 46re able to do A1C ride and they just whatever it was a 15 or 20% reduction and overall ridership. But first Hill streetcar overseeing is is a different friend. And even though it's been you know, it's not a new line at this point has been operational for a few years we can take to see increases in that attributable to growth or more people just kind of getting socialized to it and trying it or I think that's a big part now for the the first cell line as people might think learn about it as an option and come to experience it. I think we're seeing growth in that sector. We're seeing a lot of transfers quickly and as for the 5th and Jackson quarter where we touch Sounder and we touch Link light rail, we touch a number bus routes. So we see a lot of transfer activity on Orcutt apps ons in that V and Jackson stop taking up towards the the first Hill Capitol Hill neighborhoods where people are getting off around Swedish hospital and some other Hospital. Seattle University and so forth they both both touch on Transit hubs Westlake and International District, although I think International District is a larger hub for sure. And so that would make sense to little bit longer line. I also curious your sense on you know, it's a newer line and so my sense is when we designed and built it we learned from some of the operation challenges on South Lake Union specifically dedicated right away, and I'm curious if you never think that makes it is it a faster more reliable connection because of that or they they still similar in that terms. We tend to operate a little quicker on the first Hill line in terms of travel times, but I think some of that stew you to some of the challenges that we see in South Lake Union that we don't see him first, LOL. So I'm South Lake Union line across Mercer twice as we complete that circuit well, which is you know as in pretty heavy. Volume send the PMP on my bike. I can do this and leave between the traffic in the box, but it doesn't really have that opportunity pretty frequent blockages strictly from blocking the Box sometimes from Cars blocking what are marked streetcar only Lanes on the first Hill line you more Center running quickly on the Jackson Street alignment. So I think that helps we we don't have to do the The zig and zag of the curb Lane and parked cars and so forth. But South Lake Union near where we're trying to take some steps to improve on that to reduce some of those blockages to bring some spotting improvements to bear that will help improve speed reliability and actually xlights pieces out of it. In fact the photo you see here is is very recent. This is some of the most recent payment markings we've done this is from last weekend. I believe where we were out clarifying on Terry Avenue some of those streetcar only markings. I would put some signage out to that effect late last year. The weather is more conducive to to do in that pavement markings. You'll see the red paint treatment which hopefully will help keep some of those cars out of the the transatlantic quickly at that Terry and Mercer Crossing. There's some others that were at were considering related to speed reliability as well. And then a number that we're looking at related to try and improve some of the safety can Concerns around bicycles interacting with streetcar tracks trying to clarify some pads for bicycles and so forth and you'll see that reflected in a forthcoming bicycle-related report is this painting is makes it pretty clear. So I appreciate that we going to carry this painting across Mercer so that even when people are blocking the box at least not blocks that part of the box if it's an option or at this point, we haven't looked at extending it into the intersection per se to look at it spent part of trying to do that further north. We are looking at like Fairview and Valley is an intersection where we have some blockages which actually is part of the Roosevelt rapidride project is played at the house of improvements that will benefit streetcar as well. And then looking at the Westlake in Valley intersection, and I think that's been considered as part of some of the C&D line and So I would like trying to capitalize on on improvements that will benefit not just streetcar, but but other lines as well drink. Looking at operating costs and revenues. This is just kind of a snapshot of the South Lake Union line to the next slide to give you a snapshot of First Hill. Generally we run about twice as much service from the revenue hours perspective on the first Hill line as we do on South Lake Union and you see that reflected in the operating cost for those two lines a little bit over a little bit under half as much to run the South Lake Union line is just around the first Hill line Fair revenue for both of those routes welfare. Revenue overall is is up. It's it's up against merch ridership on the first Hill line down a little bit on the South Lake Union line will be trying to do some more data collection and Analysis to try to get to what may be behind some of those numbers are a box recovery again, you'll see reflected as sort of a snapshot of that Revenue 20% is is our farebox recovery on South Lake Union. 10% on First Hill little colorblind is 1.5 million. Is that can County or Amazon? So the Lion's Share of revenues on the income from 1.5 million dollar contribution that King County to that line Sorry looks like that little lighter blue wedges the amount that we received from Amazon as a sponsor of one of the South Lake Union streetcar Line Streetcar vehicles, and that was part of the street vacation. And is that a 10-year commitment sore? Yeah, I think it goes out through like 24, maybe twenty-four wanted to just mentioned again. That's one of the things driving farebox recovery is the use for cutting the number of transfers that are happening and I think that might be one of the issues that is behind where the the variations in Fair Revenue. Obviously one you have individual take multiple transfers. Farragut split across all the YouTube the platform to that person uses. So that has an impact on the fair recovery and then just to reinforce that about two-thirds of our trips are transfer related on the streetcar which is very good news in a sense of its integrated into the regional transit Network and there been people are taking multiple modes. It means that if of fare paid on the streetcar is not a full fare if you weren't transferring so that's why it's one of the reasons why you may not track exactly with ridership. Turn in public, today in Raeford in numerous times over the years and broader issue around Transit is how we make friends and more accessible and I think there's a growing movement to figure out what we just met Transit free to everyone. It's complicated obviously in the system is run by multiple different agencies. It's complicated because we do get sniffing around you from farebox recovery. And so that we have to find a blackout but I know that historically farebox recovery is a metric that Transit operators look at a lot and I appreciate you guys and I expect you to keep bringing it back and I also want to see where that there are other policy decisions will be making to you know, if none of the schools, you know, so that they would still show up. I assume in Fair because I've been guessing how orcas track we give the cards away free and reimburse on the other end, but I'm going to want to I don't want to be to focus on farebox recovery is being the ultimate metric because I don't really care about is ridership and if we can figure out a way from policies to allow people to have Cheaper free access to Transit and the ridership goes through the roof and we're saving climate pollution and congestion goes down in our farebox recovery is a completely different metric that is spot-on with me, but it's not quite there yet, but I just want to act like that. Moving forward to the next life gives you kind of a snapshot of his we look at total operating cost and total operating revenues, which could be on just the fair box. There is still a city investment that is brought to bear to make the numbers pencil out the most transit systems. This is not something that pays for itself. And so there is any investment to go see along the bottom there. This is the combined system First Hill and South Lake Union as we get into 2024, you'll notice that the number goes up a little bit actually quite a bit as we lose the Sound Transit contribution to the first Hill line. That's a 5 million-dollar annual source of revenue for that line. I appreciate that. Just all transit get subsidized but all transportation both get subsidized in various ways and so much more happy to be subsidizing Transportation Transit. Then I am free ways. So but it's good to track that and I know that that sound transit issue is initiative. Will San San Fran Sol be dealing with and I'm sure as we work through Sound Transit 3 this week are those conversations for future councils and Sound Transit boards to work through Yeah in into on on that front or the latest that front we do have some developments on the for the governance structure front. We've been working on a new interlocal agreement with the King County Metro. As you were called to the city owns the system County operates it for us that's governed through an agreement we have with Metro that expires at the end of this year until will be bringing forth to counsel a new agreement later this summer for your consideration to renew that relationship into the future and is a term of the new one of your dealer at this point. We expect it'll be a five-year term and preserves a lot of the provisions of the the previous agreement with some changes that will will discuss with you later this Summer Camp Creek. Set this point. I'll hand it over to Eric to talk more about Center City Connector and some of the next steps we have proposed, but we really see the Center City Connector us as being a critical Link in the system and making it a system and connecting a lot of the destinations that we see around all the regional transit network from from commuter rail to ferries to link to Metro Bus Racine housing and jobs growing in the area served by Center City Connector. And we think that this is a vital part of the transit Network going forward that where we are. Ready to move forward in that responsible way. So it's a critical think we heard from public testimony today and we think they don't have that we've done is still contagious to show it as being a strong additional demand in and around downtown. Tennis start with a status update on our vehicle contract. We have a contract to deliver 10 vehicles for the Center City Connector project wish you to stop work order on that last year coinciding with the independent review that has been extended now through September of this year and we really have a couple of options going forward with that contract to keep the project moving forward one would be to amend the contract and really extend the the schedule out a couple of years to meet our our revised rap scheduled for delivery of A Streetcar project. The second option would be to terminate the contract and then begin a new procurement process that would coincide with our objectives schedule for see if there's some opportunities potentially with new procurement and terms of the vehicles, but they're also limitations if we're not going to be able to dress all the things that we've we've I die. Time in terms of the larger longer and heavier Vehicles there really just what's out there today is really not there's not a lot of matches or any matches it locally for vehicles at perfectly matched. Sounds like you didn't pursue tell Eric we heard in the comment today from a recently-retired operator that they do exist and he named manufacturing company that I wasn't familiar with her but I don't recognize the names and some other cities. I don't know if you can speak to that or if it's if not, it'd be great. If someone kind of follow-up we have to get the name just to make sure we're not missing something. I suspect you've done your homework are thoroughly that'll be great to understand that if you have any information on that is one of the producers of some of the more recent projects in the US the cars are lighter, I think but they're still heavy we still would have the weight issue Maybe. Not as short as First Hill right now, but they're definitely shorter than the cat Vehicles. The ones that are have been built recently buy them. That is one of the things we would be doing next year is really doing more research and what's available water options are okay and along those lines the other thing that the gentleman mention which was really appreciate. It was just the driver training necessary and the differences of running different fleets something that is a Transit user. I don't really think about but obviously I'm being her operability, you know Main in space in lines and tracks but also interoperability among drivers. Is that something that it is a real consideration also as we moving forward in making this critical decision is a noun that is from people I can but also working with King County the streetcar operators there that are working with us on both delivery and even design When's Beyond? Okay, so just in terms of moving forward then I'll with design first one point out your we do have we completed 100% plans for the core. I'll call it of the Center City Connector streetcar project on 1st Avenue and Stewart. Those plans are really done. We will be reviewing them looking at risks and opportunities going forward. We don't really expect to see major changes on those or changes on the design and configuration there. There is new scope that we identified last year coming out of the independent review and then further analysis by and starred in our Consulting team looking at how the new vehicles with interface with the existing system on Forest Hill and South Lake Union and identified changes to some of my forms and tell tracks changes to the design of the maintenance facility in South Lake Union identified some Bridge strengthening that needs to happen on Jackson Street. In addition to that looking looking ahead will also be visiting the area way analysis that was completed really looking at that and with the analysis a test. I completed this past year. So to do that we anticipate that you will be acting on are looking at legislation from us. I think next week. This is an appropriation for 2019 and 2029 million dollars to proceed with designed primarily of that new new scope. This would be an intercom loan that is repaid by the transportation portion of the property proceeds for the Mercer mega block that were anticipating coming through in 2020. Just pointing out that the 2019 adopted budget right now for the streetcar was 500,000 that was really intended as a placeholder given the length of time the project was still under the independent review and we weren't sure what the status would be moving forward. But the $9 will allow us to complete the design to 30% Also delete some of the analysis of the area ways and updates to the environmental analysis will also be working with the Seattle landmarks board on options for the bricklayers building at the South Lake Union maintenance facility as we redesigned that both for the additional cars and the longer cars. But with that work will be ready to update our cost estimate and schedule towards the end of next year and ready to really initiate the small starts over beside process with the FDA. So Eric talk late late it out laid out what we're going to be doing just in terms of when we're doing it. And it's the mechanics over the course of the rest of 2019. Assuming that the appropriation goes forward. We would be doing Reaper chairman of Design Services for those additional tasks that are cleaned out. Most of that work will be happening in 20 20 in 20/20 will be a big year in terms of advancing that design advancing our delivery mechanism and how we would how we would end up constructing the project Adventure testing through those different options that we have during 20/20 being able to bring back a full funding package and and fully full project ready to initiate the FDA oversight process. And just this again where we're still at the beginning of that process, but there's a lot of work that we are ready and prepared to do. Reminding you that the last cost estimate that came to you back in February still showed a funding Gap about 65 million dollars for us. In about another twenty or so million dollars for utilities. So this additional work would presumably update the cost estimates and schedules and provide a new Baseline for the project, but there is not a funny proposal for the full project at this time. to the overview we receive legislation from the the mayor that would create the Endorphin loan and give authority to spend that money. I move will get that on the introduction referral calendar for next week. So we can get we have legislation before the committee the next steps. And where we are in this is is I guess it's not terribly different than a construction project in big numbers. And so the decisions were making here are really important ones. I think one of the things that would be really helpful for us next week. I'm not sure, we probably have some of this information that we may need some ass. Help is just understand, you know, what kind of ranges of overall costs I believe the analysis that was completed in the last year and my time incorrect gave some ranges of what we thought it would be to complete but I know that those until we answer some more questions about what you know, what needs to be done on the Bayou. Vitamin needs to be done safely. We can fill all those out that we're at this tricky position. I'm not just the council but then they are to wear Sam. I can't remember the terms you used about proceeding be used through language carefully. Maybe you can repeat that again so I can remember to learn responsible. So moving forward responsibly and I interpret that to mean we intend to move forward but they're still pieces of information. We don't fully know and so to say a decision that absolutely we're going to 1% build this yet. There's still a question mark and I don't know how how great that gray area is but there's I imagine if there is a high likelihood that this project wasn't going to move forward you wouldn't be asking for 9 million dollars. If we knew exactly what was be happening, you would probably be saying we are going to move forward with this and that the next step is not knowing until we're somewhere in between those ranges and so understanding, you know, how much Suncoast we have into this. I know some of that has to do with the the procurement of the vehicles which is him? What what canceling a contract my cost us but some ranges and what the cost to complete the project might be this 9 million dollars again is is adding to the sun costs, you know, if we decide not to move it we're not going to maybe there's some ancillary benefit on the viaduct to something but pretty limited there myself and I imagine my colleagues are going to want to understand. You know, what that looks like is Calvin mentioned that you know, there's some money set aside to complete the project but almost certainly not enough to complete the project is Envision today. So what we be looking for course, if we were to cancel the project some of that money I probably need to be returned. Funding sources of December will be available for other things. So understanding those different colors of money. They didn't committed to would also be kind of good to understand you're so we may not have policy agreement a bouncing on Council Members as we make this decision, but it would be great to have Clarity on the numbers in the data were using to make that decision. So hopefully we can get that dialed in and Calvin I Look to You to Help think you have a compressor sent that cuz it's fairly complex. That's right adjusted for everybody as we go through committee and then potentially Council that I will say that one of the challenging parts of that is a time is also money in this case and and work that we plan to do next year. Can we quit will give us a better sense of time in which also ends up impacting the cost and Enzo Ferrari us being able to proceed with some of that work doesn't mean that $9 goes out the door as soon as it's Appropriated it it that enables the project to get to these points and there we can have we can continue to inform the committee as we make progress along the way there for planning purposes and in this is my request and everything's probably a lot of question marks, but why don't we assume that the council would would take action before recess in mid-august? I don't know that that's a huge dollar difference. But but let's just move forward on that. So it will be if you approve this. This is the range of things were looking at recognizing that that we know makes my colleagues may have different ways and how we proceed in different questions there. It would be imagine the questions were going to learn will inform what happens but I'm clear on like if if the technical folks in the political folks the mayor feel like, you know, assuming we get these types of answers. We're prepared to move forward on this and we think there's a decent chance. Fall within the range and if you get an answer that says, it's see. No, it's actually going to be a hundred million more then, you know, I don't know that you're prepared to Define what responsible looks like you're not but having some sense of that. I think next week would also be helpful for us to understand where we're going at least where the mayor and tends to go if we can get that. Covered potato O'Brien. I think it would be helpful. But I hear Barry consistently with throughout the district and specially this afternoon it's just need for the the investments in transit. Right? And so what would be helpful for me and send it cuz I kind of go back to re-engage with community members and district is the degree of certainty that information on the casserole Brian so that you know if I have that information and so forth so that we instill confidence back into the project cuz I think that that just how things have salmon know you got in here recently and so have I and so I want to make sure that we can still have the confidence back into the project and make sure that the investment is there's a trust you to move forward on a number of Transit investment fronts. We are working with the FTA on Madison brt that will greatly inform our ability to eventually receive the the FDA grant for streetcar as well. And so, you know if we can build success and funding partnership there. There's two there's a there's a lot of interrelated Transit Investments that are coming to the downtown that that we cc3 as being a really critical part of so super thinks you're working this appreciate both the the existing report an existing systems and also the potential my steps and look forward to conversation next week. We will my goal would be to have a vote on this next week obviously call you can decide if we're not quite ready, but that's the intent. Thank you. All right as promised we are going way long. Tell me what you read the next agenda item in with you to talk about addiction. Council Bluffs 581 to Seattle commute trip production or CTR program adopting an updated strategic plan adopting a local designation of Seattle Center City as a growth and transportation Efficiency Center as defined by RCW 1794 528 and amending sections 2500 2.30 25.02 / 35250. 240-2502. 5020. 255-2202. 7020 202802 Seattle municipal code. Welcome want to be there quick introductions Transit Mobility division. Some of the people were here. Oh, yes, he still here who testified production they stuck with us for almost 3 hours now. So tell us what we're talking about when it comes to production today. Get off and Sarah will give you more depth overview of The Proposal today. I leave the program. We also call it our transportation options program. These programs are strategies and efforts to help reduce Reliance on single occupancy vehicles that single drivers or single Riders and increase use of Transit carpooling sampling Rideshare active Transportation such as walking and biking is for people to get around and commute to work our commute reproduction program or we called our city our program. We love acronyms which is led by Sarah is are foundational program on that's Guided by the state CTR law that was first adopted in 1991 since 1991. Seattle's local program has grown and evolved. We're proud of the collaborative Partnerships. We've developed with Seattle's largest employers. Those employers have made significant investments in their program. Including transit pass program subsidized and otherwise great bike programs for the bike rims showers and dryers and many other things that make a great destination for biking to work incentives and other efforts at have support the public Investments that the city made it has made in transit service improvements and walking and biking improvements in the city. We also have had great relationships and develop delivering this program with King County Metro who manages and King County business focus programs like the Orca passport program in business products to provide Transit subsidies to GM products to their employees the vanpool in the vanpool program is examples of partnership that we've developed over the years of the saddle organization there a downtown service organization who works with downtown employers and property managers and they also work with our largest employers see charm player City Y, As a result of this is efforts and he's great Partnerships. Our program is Nash recognized nationally as a best in practice program and I'm going to turn it over to Sarah who will walk you through the proposal today, which is an adoption of a new strategic plan for the next four years to guide our programming and amendments to the existing chapter in the Seattle Municipal Code that implements guidelines and rules for this program. Thank you, man. So a background on building on some of the details that and just gave you Seattle CTR program is mandated by state law. We have our own local planning local code and compliance with that state law on it's also largely funded by the state and the goal of this program is to reduce single-vehicle travel and pollution. Hence the focus on that the commute trip. This is the core of our TDM work. It has provided key data programming and relationships with the business Community during the Seattle squeeze. Our last plan on ordinance was updated in 2008. It was followed by several years of pilot programs. And so part of the reason that we have put together this plan today is to illustrate all the great work that was done during those pilot years and to incorporate them into our regular programming and state law requires adoption by ordinance. So that's why we're here. I'm just going to come in the photo you chose to put their I still love that photo was on a tour in Copenhagen and came back from it and what the folks did that of the transportation and it's it just says so much and a picture. That's great call tweeted this photo two weeks ago off room. I don't know what it's like to organize this. It's a fairly simple photo and I imagine but weekly we had to close the street and where you found 177 cars and then 177 bikes and hit them from the next photo. I imagine it took a few hours to organize, but it's great that says a lot. So if I Cry Currently work with 270 of our largest employers. Those are employers with a hundred or more employees commuting during peak hour and dust covers around 195000 employees Citywide the core pieces of the CTR program are the biennial commute survey which provides a vital Data Tracking our commute mode split data that contributes towards the center city mode split survey, which is core to tracking the data and performance of our demand management efforts. It also includes Daniel program reports which tracks what employers are investing in and how they are complying with the code. Core piece of our program is the partnership with commute Seattle which provides the Key Programs and support to our employers and housebuilders relationships on providing. This program has a real business-to-business amenity. I'm helping employees and commuters to navigate all the changing Transportation elements in our city today. That little graphic on the right is just to show the the the progress that's been made over the years and the reason why we're leader in the state and also Nationwide in terms of the efforts. This is just to show you our our planning process. We started back in March 2017, which allowed us to fully incorporate the the latest data into our analysis and also time to do considerable Outreach to our stakeholders and to the public. We received some great public comment on the plan over the past several months. So parties in Opportunities, so what's on the plan and why plan now our priorities included alignment with our policy objectives on the Move Seattle plan the 2035 comprehensive plan and the one Center City Planning area. This new plan will allow us to align our targets going out to 2035 with those plan documents. It will also align the geographic areas of study on particularly in the center city. So that those study areas are aligned and also codify the center city as what's known as a Gtech, which is the state's term for a focus area for demand management efforts. In addition to the the priority of a plan that I'd like to highlight is the vision to continue to drive performance with primarily carrots not sticks the business-to-business relationship that I mentioned earlier has been Key to Our Success and and those are are there there are enforcement means included in our code. We find that the partnership with employers generally this the more important piece of driving performance and also to continue our our Partnerships with commute Seattle and with also with King County Metro who is a key collaborator on efforts surrounding work a promotion and the additional abusive Transit. Opportunities essentially this plan includes a lot of strategies you'll notice and part of that is again illustrating The Innovation that would like to continue based on our pilot programs over the past few years. So continuing that good work and also responding to many of the changes in the city since 2008 including additional time transportation options and finally to ensure that the data that's collected through this program that the ability to collect it analyze it and ensure its quality is continued. And so is the ordinance today like dessert existing ordinance not allow for the new technology or is it just kind of clunky or impolite tncs like uber and Lyft and it also there's a slide on this a little bit later a few other aspects that needed to be updated include diff knowledgement of contract workers, which is something that wasn't quite clear in the relationship between our code in the state code. So there's a few tweaks out that that offer Clarity in the language. So the key metric that we track is part of this plan that as part of this program is the drive alarm rate. That's our key metric. This chart shows the past performance in blue. And then how we have modeled in simplified terms the targets moving out to 2035 which is where we want our performance to align with the move Seattle and comprehensive plan goals of 25% Drive alone mode share in our case for the commute. And so is part of this plan. We set new performance goals Citywide that will help us achieve those targets moving into the future. Just the downtown Peak. Commuter is a Citywide P. Or is it Citywide all commute sir. And is the latest data point it looks like on here. It's from 2015 ish or something or 16? I can't quite tell. I'm wondering when can I get the next data point I know if you haven't. Call for that biennium was 32% and the actual was 31% So we didn't meet that that Target for our latest biennium in the next serving round. Is this fall? So to add a bit more detail to our performance targets we set our performance targets for employers based on network group called neighborhood group are what we call networks. This is a way of breaking down the geography of the city into areas based on common land use and transportation context moved to us a different way of setting those targets. The previous targets for employers were based on a combination of that land use and transportation Contacts Plus the average performance by Employers in that geographic area. We're now moving towards a Target that is modeled based on the future performance. We'd like to see so again a way of improving performance until we achieve the 2035 goals. So these are modeled rather than the previous sort of the average achievable goals that we had set for employers. So they they More aggressive moving forward in order to achieve those future goals the secondary metric that we've added through. This plan is a vehicle miles traveled. This is a way of gaining additional insight into what the commuting patterns are out there. Are we seeing, you know, if you were driving trips, but additional length, that's something we'd like to keep a track on an important trend. I'm so this gets to a specifically the center city. Again. We're adopting that as a Gtech that's like growth in transportation Efficiency Center every two years. We with commute Seattle complete the center city mode split survey, which is a full market report that tracks both of the large Employers in the center city, which are the seats are affected ones plus adding and data on the smaller employers. So this is a full Market understanding of what's happening in the center city. It's it's widely used in terms of tracking trends for how people are accessing downtown. So this chart illustrates how we've tracked in the past how the the full Market meaning including the smaller employers has been catching up in terms of performance and drive alone rate to the larger employers and we see that Trend continuing into the future until they converge to achieve. The same Target in 2035, which will then be contributing for a Citywide performance specialist to say that we track the full market downtown and help the downtown to set its own a full market performance school, which is related to how we achieved performance Citywide since there are so many large employers downtown. Question on data most of these reports at least as I recall in my history filling them out in a previous life are self-reported data surveys for folks and buildings and I'm curious from a data Integrity respective. Do we do we do any other kind of checks or recollection on these is you know, it doesn't know we have whatever 252 days a year and people do a mix of things and how you report that and I think in the city most people see themselves as doing the right thing until today over report Transit used in under report driving alone. And do we do we verify that buy an intercept surveys or any other metrics to see if it's right. We do typically at least compared anecdotally to things like the American Community survey and and see if the trends are are echoing each other. The survey while it's true any survey does have certain amount of air I know margin of error and Etc a human error or bias as far as what have you the number of surveys we collect through. This is so large, you know so are our ancestors robust robust picture of what's happening around the city when you when you get down to some of the very specific Geographic areas or areas of the city where we have fewer people reporting the margin of error does grow, but from what we've seen we have no reason to suspect that there are huge. And is this the CTR sites 180 employers employees under employees are more. Who are scheduled to report to work during Peak? Can you. And so do we think that the full Market will Tren down just because of other Investments were making do we anticipate doing more Outreach to them? I know we passed that CT our dance last year that kind of address to reach out to the broader Market Beyond Justice CTR effective sites Investments were making this this program is very much a compliment to the Investments are making in transit and other modes, but it's also the trend we've been seeing in terms of how smaller employers are catching up to larger Employers in terms of the commute programs. They offer meaning that more and more small small employers are offering Orca products, including subsidized and even fully subsidized Orca products and that is investment in those Continuous that's part of why we we see our our our Drive alone, right trending down for those smaller employers as well. We have had some grant money when we've gotten some limited duration grant money. We have done programs Focus programs. Try to reach him players that aren't participating the CTR program. We did one of her in 2018 in the University District called University District. Let's go did a lot of Outreach with a small businesses there also did a real effort with her Transportation Equity program to try to get Orca lift product into eligible Transit Riders hands. We also did one for a while focus in South Lake Union in the on the smaller employers just because that was such a high-growth area and we're trying to make Maximum Impact there. So the next few slides are provided as mostly a reference in a summary of these are the the strategies included in the plan. And again that that we've included many strategies that reflect the existing work that we do as well as the opportunity for program expansion each one of these strategies typically includes the what we would we would do under current funding as well as what we could do given additional resources weather staff or other resources. I'm so there's a flexibility built into the Strategic plan where we assume the current flat level of Base funding but provide guidance for how we would use any additional resources. That again. This is the second slide. There are a lot of strategies. So in summary of highlights that are of of the changes that are included in this plan document. There's that new approach to setting targets. They are more aggressive. They are aligned now with other planning documents Seattle comprehensive plan. We have updated the network so that geographically we are aligned with the Center City Planning efforts the funding scenario Sofer for each of the strategies that I just mentioned. We assume the the flat State funding State funding for this program has remained flat for at least 10 years, but we offer Us in areas for how we would use additional resources the additional metrics and benchmarks. We have added DMT as a metric as I mentioned additional commuting patterns and insight into on the impacts of how people aren't using our transportation system. And we've also added a framework of benchmarks. I didn't include a slide on this but essentially it it offers a wave. How to track our own performance and progress internally such as how many people are we reaching through our programming how many employers are offering Orca products etcetera. So it's a more detailed tracking progress. Terms of feedback. We we heard a mix of a feedback from our stakeholders. We got a few comments on, you know, wondering how to how to remain compliant how to meet the new aggressive targets. We also heard some feedback that targets were not aggressive enough. So I think we've landed somewhere and in the middle and we believe that the data also Bears out that these are indeed aggressive but achievable targets So finally that the ordinance that will adopt this plan. The plan document itself will guide our program and a defines the the growth and transportation Efficiency Center center. That is the center city the clarification and updates to the existing code offers a cleaner structure and also offers a clarified guidance to employers as to how they can remain in compliance some of us addresses some of the changes that I had asked about regarding adding in new options like Transportation Network companies are tncs updating surveying and data collection and promoting the most effective protection strategies for employers. So there's a there's a series of clarifications and in the code that will make it easier to understand and further promote Clarity and how employers remain compliant and how we run the And so while there's no codified level of effort change for employer compliance. It doesn't. Those more aggressive goes by so I request is to pass this ordinance to. The plan and the updated code. I am happy to do that. Thanks for all your work on this one thing. I just want to mention. I'm not sure if you guys were his side through all three hours of meeting that we talked a lot about the green New Deal the beginning of this and you know, one of the request from communities that we adopt frankly radically more aggressive Targets on reducing greenhouse gas emissions specifically to be climate pollution free by the year 2030 were not on target to do that by 2050 on the plant rejected. We've been working on for almost 10 years now and so that is a radical shift in what books were asking and to be clear. They're not asking it just cuz I can't be fun to be radical. They're asking because you know, I really do just fine on the planet depends on cities like Seattle leading and I'm others following almost immediately and obviously transportation is our biggest source. And I feel like this only to say that if in fact we adopt a resolution, which I'm pretty sure we will and if in fact we create the political will to actually meet those targets, which I think is a big? I hope we have the capacity to do that. We will almost certainly be looking at all the tools in the toolbox including commute reproduction and ends be saying what what seems I've ever came of the word you just use but we're kind of in the middle on a sweet spot Aveeno aggressive but achievable that we will likely be in a place where we have to throw that out and say we have to look what scientifically necessary to do this and then figure out how to achieve that that will not change my action on supporting this today, but I just think for the folks that are working on that in the folks that attract ants in the community. Starting to think about if we wanted to eliminate all carbon pollution for my transportation system in the next 10 years. Some of that will be conversion to Electric but someone's going to have to really be based on those ships and what a different framework would look like. It'll probably be beyond the term of me being here trying this committee for you come back to you. But I hope that the folks at a star and a partner organizations Seattle. I'm an advocacy organizations Transit Riders Union TCC environment organizations start thinking about what's possible for what's necessary and then how to make that possible and so look forward to some interesting conversations that are going to be hard but I believe that Seattle build on the national leadership we've shown on this front and and really grow that immediately in the coming years to sew heads up So if that I get the distinct pleasure of moving Council Bill one 19581 and second thing it is that going to do when I'm the only voting member of the committee here, and I'll vote on that. So it will move forward to full counsel next week with a recommendation to pass it and thanks again for all your work on this and I really appreciate your thoughts on how we move forward to. Thank you so much. One final agenda item. Let's talk about orcas. Play would you eat an agenda item number 7 and I'll invite presenter Ford. We have resolution 31892 a resolution expressing concern with the Northwest testing and training proposal of the United States Department of Navy for Puget Sound Waters from Northern California through Washington State and for Alaska sure I Michelle Caulfield with the office of sustainability and environment you for being here at 5:17 on a Tuesday or special committee meeting. That is extremely long might have one picture to put up just to remind everyone that when I'm talking about an orca today, it's not a transit pass but a marine mammal So I'm really pleased to be here helping reduces resolution and I guess I'll just start with a little bit about the resolution and how we drafted and sort of what it what's in the resolution stares at a high level three main elements to this resolution. The first is really strong support about Seattle a strong concern with the US Navy's ongoing and proposed testing and training activities. The second piece is really the urge the Navy to use the latest science and to reduce impacts on marine mammals, including endangered Southern resident orcas. The last bit is really to affirm our support kind of collective efforts of the scientific Community environmental organizations agency partners and the work of Puget Sound tribes to reduce critical threats to the southern resident orcas. So the background here is that the Navy is currently engaged in ongoing training and testing activities in Puget Sound and in surrounding Coastal Waters and Elsewhere on the planet and they do that under currently under a 2015 authorization from NOAA Fisheries. In March the Navy released a very lengthy 1800 page report call the draft Northwest training and testing supplemental environmental impact statement, which I'll just refer to as he is and that outlines proposed activities and impacts as part of its application for the authorization for activities to begin in 2020. So is a five-year authorization. This is the next batch of activities and another authorization. Activities when we talked about the activities that they're proposing I'll just get a little more clear. They include are compact air combat Maneuvers submarine tracking and detection exercises electronic warfare practice mine training and herpes testing and I'm embarrassed to say my son will be like super excited about all these activities probably in reviewing the Navy's proposed plan and drafting this resolution. We worked really closely with key Partners who are leading Orca in Puget Sound recovery efforts and those include Puget Sound partnership Seattle Aquarium, Washington in mermentau Council or Justice Washington Department of Fish and Wildlife Seattle Public Utilities who has some marine biologist on staff and some other City departments. And as you know manager can also filed an official public comment and June to formally document concern as part of that formerly is process. I just want to thank you for your vocal support and that come public. I might as well as council member her bolts who offered her voice to. So transitioning if there's widespread concern about the impact that these activities have on Southern resident orcas, you know, we are fortunate to have a family of 76 or cuz I'm living in the Sailor C and 3 pods known as j-pod kpod and I'll pod they're endangered and they're in Decline and we have some really exciting news of a new baby calf. I was born and that's actually the second calf this year, which is very very exciting but is important to note that Orca calves Face apparel as first year with a 50% survival rate, but it's still exciting. I want to I want to stay optimistic about that. But I also want to say, you know, we probably all remember last summer. I know I was completely heartbroken by the images of j35 is the mother of a dead Orca calf who mourned her Offspring and carried it for more than ten thousand miles for 17 days. I'm almost going to cry thinking about that. It was very I know my sister in Chicago was like tracking a daily. but all around the country and World War and so the primary threats to the southern resident orcas are three prime diminish salmon, toxic contaminants and disturbance from vessel traffic and also noise. So really related to noise, that's a big key of this these proposed training activities. I learned a lot about orcas last month's rent or, and sort is used by your bio sonar and vocalization, which is sound for really critical survival behaviors, like mating and feeding and resting and navigating navels sonar has been shown to cause whales to stop vocalizing and feeding to abandon their habitats to panic and under some circumstances two strand or even die in strand is essentially get stuck on land because they serve lose their bearings by not being able to communicate and use sonar In short they need Quiet Waters to communicate to navigate and to thrive there are documented cases in this region of u.s. And Canadian Naval activities that have caused harm displacement or death to Orcas. And with this very small and declining population. Even the loss of one or I can have a major impact on Decades of recovery that many have been working on so in closing just to keep this short on the resolution before you urges the Navy to prioritize and expand protections for southern resident orcas as part of these activities to use the most recent science and its analysis and to reduce harm And also to cease training and testing activities in southern resident orcas and other important marine mammals are present and lastly it also underscores Seattle's Collective commitment to reduce threats to these Irreplaceable members of our region to ensure protections and to keep our Puget Sound water safe for the entire community. Happy to answer any questions. Michelle thank you so much for your work on this and my thanks to the marriage working to for her leadership on this and I'm excited to pass the resolution today. I'm curious if you've had a chance to have any conversations with anyone at the Navy. I feel like we have the the National Oceanic and Atmospheric Administration. It seems to understand the science really well and you have the Navy who's trying to meet their objective, but just great cost and it seems like you know, what are what are the odds that we get through to the Navy that they need to do something different? I have not had conversations with anyone from the Navy but I have talked to folks from Puget Sound partnership and whose staff that are on the governor's task force. And I know that the Navy sits on that test for so they're engaged in conversations around recovery, which is a great thing. I do know there have been situations in the past like in 2013. There was a court case that actually sort of address these tests and training activities in California to Hawaii area where the Navy was forced to change some of their activities and I also know I know I want another question you had was just sort of the regional kind of working together with other jurisdictions. I've talked to folks here in Savannah, relations, and we're really looking at those partnership agencies that we work with under protect our rivers and Recovery to look at should they look at resolutions like this and what are the opportunities for additional public comment on the situation because next year the finally asked will come out in the summer and also no official. Will have a public comment process when it considers authorizing his activities moving forward. So we're going to be tracking this and looking at what role we can play to support other partners in this conversation as well. Well the mail the request in your copy already planning to do this, but assuming this passes at the full Council next week, which I assume it will make sure that we deliver this with a letter to our federal Congressional Delegation. I hope the Navy will listen to our comments, but the people that prove their funding every year we see we'll have some direct impact on them and hopefully can help Steris. If in fact the state wants to do everything in our power to protect the resident Orca population. I also want to just acknowledge that the work of tribal leaders on this who I've done so much work over the years ago over it now houses of yours frankly, but who you know specifically see that work is as members of our family and this is the M2 this critical to the to them and all of us has is a family member threatened. And so we have an obligation moral and otherwise to do this work, so And I'm grateful for amazing tribal leaders who have spoken on behalf of this and I fought for this and it's disappointing. They were at the point. We are today we're we're down to 70 + resident to work as but let's do everything we can try me on for it on. So I'll go ahead and move in second resolution. 318927 vote Yes on it. That is what we need to do to get a committee and I'll go to the full Council on Monday. And please let me know if there is a sign on letter that we should do in conjunction with this obviously our names will be on the resolution. So that made him fly at that if there's other things that we think we should do when it comes through next year and then maybe there's some work with our legislative it to see if they can do some something like this in while at the state level. I'm great. That is the end. We're going to wrap up. It's not even 5:30 and 1/2 hours are like Heroes. You should get a badge or a button or something for 3 and 1/2 hours of sustainability Transportation Kelly. Thank you for sticking around. I don't believe you even had a bathroom break. So okay. I didn't even know this work, but thanks everyone.", "end_time": 12227.0}]}