{"format": "raw", "annotations": [], "confidence": 0.9474859617758489, "data": [{"start_time": 0, "text": "Good morning, everyone. Good morning. Thank you for joining us today. This is a select committee on homelessness and housing affordability. It is March 22nd, 2019 9:30 a.m. And we just want to welcome you here on this sunny Friday, really appreciate the fact that you are here and thank you to my buddy. Mr. Johnson for joining us appreciate that we have two items on today's agenda first. We're going to have public comment, of course, but then we're going to hear from Jason Johnson and Mark Jones test Colby and Alan Lee on the progress of the homelessness Regional government work. I've asked them to be prepared to talk to us about a recommended schedule a next steps and second. We're going to begin the committee's work today on the human services department director confirmation will have the mayor's nominee Jason Johnson and Deputy Mayor Mosley at the table. So I welcome you here and thank you councilman Gonzalez. Welcome back from San Diego. And we will have just for the record. We're going to have another special select committee on homelessness and housing affordability in 2 weeks on April 12th. So, let's dive into public comment. I'm going to ask that we do lineup at the two different microphones, since we only have about 14 people signed up today. I'm going to ask for a 2 minute clock to be placed on each person. So Jen Klein and my friend, mr. Abdullah, and you'll be next and then Janet Pope and Gordon McHenry in that order. So, thank you Jen for being here. opportunity Do you see the little green. Nego? Can you just have to speak and that raises so you can stand up straight if you want. Thank you. Councilmembers, thank you for the opportunity to provide public comment in support of Americans nomination of Jason Johnson to be agency's director for over four years and worked closely with Jason that entire time I'm his executive assistant. So I know him and his work very well first having Jason service agencies director provide stability for HSV staff Our Community Partners and the region of Human Services sector as a whole many staff and partners want a steady stable leadership and a company in organizational improvements that Jason has and can continue to provide II given the important work this year to create a new Consolidated entity to unify. The Region's homeless response. Jason is the right person to lead hsd during this crucial. Where he has deep understanding of the city and hsg staff work. Third. Jason is an open and inclusive leader as his scheduler. I can attest to how Jason shift his calendar to accommodate impromptu meetings with staff how he takes meetings early in the morning or late in the evening to accommodate their schedules and any privacy needs they may have he truly has an open-door policy. Lastly. There are many many other agencies and employees and community members who support the nomination of Jason, but providing public comment and meetings at the Press have described as circus life just isn't their preferred style. You've received several email messages from colleagues in support of Jason over the last couple months, and I hope you'll tell you those sincerely. Thank you. Thank you Jane welcome. Thank you cousin remembers, my name is MD Abdul and I am representing hear the community that I said which is mainly refugees and also I support equity and social justice in all King County and mainly in West Seattle and also assault Seattle area. I would like to take a moment to reflect your own mayor Jenny durkan his decision to appoint master Jason Johnson as a director of the city of Seattle Human Services Department many of my community members as well as friends have discussed the importance of the appointment. We believe master Jason Johnson is a strong leader who can bring progress Innovation and have a leadership skills to uplift the moral and the work of the city of Seattle, especially in the area of homelessness. I walked with most of Jason at all home bored and had a discussion with him in different meetings, including one table. And also including the task force. I was also part of a group that traveled to Washington DC with master Jason to advocate for more support for homeless families and individuals. I found most of Jason Johnson as someone who is able to connect people across different sectors and how to listen to bring meaningful discussions and solution is in our growing community in Seattle. Our Community Values his appointment because of the because of his passion in caring about human dignity and also caring about equity and social justice and prosperity for thank you I'm going to ask you to wrap it up. I personally believe that Jason is qualified to lead. my commute I need change. Thank you very much for coming. We have Janet Pope and Gordon McHenry and after that Denise Scott Schubert and Bruce. Thank you. Good morning. My name is Janet Pope CEO of compass housing Alliance and weave between the second and third largest holder of service contact contract for the human services department with the city in addition. We have prayed over 800 units of affordable housing within the county. So we understand the system. I started my position nearly six years ago just as the former amazingly talented feeder of Katherine Lester was fluctuating from permanent to interim and back to permanent as the leader of the human services department political process. It was extremely frustrating for providers as the department was paralyzed just as so many critical processes and improvements since then. Jason St. Catharines deputy director for homelessness. The department has done some amazing wonderful work including developing a strategic plan with In my opinion have finally moved the system forward. Jason has been instrumental and hugely supportive for Compass including helping helping Compass expand our 24/7 enhance shelter and housing navigation case management system that is really having significant impact in the system. We have improved our data-driven decisions and we can't wait to share some of the data and things with the system and the evidence that we have collected. So as we move forward with future labs and some of the other recommendations from the multiple Consultants that we've had it really is Time for Action and fast action. It is not time to pause and do a search process and have a huge learning curve for a new leader when we already have someone with the right skills and the right experience but most importantly the historical knowledge already in place. Thank you very much and key Janet McHenry then Denise then Scott Schubert. Morning, sweetie are members of the council. I'm Gordon McHenry Junior. I'm president and CEO Solid Ground. I'm here because I support the council moving forward with a sense of urgency to complete the process of appointing the director of the human services department process is important and it's needed and uncertainty and delay is harmful to the effectiveness of the department and can we can effectively dealership and leaders a my opinion and extended process. Unfortunately Echoes a pattern for most of this decade of behavior by the city tour those who seek to lead hsd they could easily be perceived to be dismissive and even disrespectful as soon as special disturbing pattern since the leaders have been from communities have historically been marginalized by our society. I support major mayor Durkins nomination of Jason to be confirmed as director of the human services department. Charlie Brown is a partner of the city of Seattle providing life-affirming services in the areas of homelessness and housing food in hunger transportation and advocacy. Eliminate barriers that contribute to Poverty racism and oppression in this world. We work on a daily basis with the staff and Leadership of the human services department. I work for years with Jason as deputy director. And after Catherine Lester's departures interim director, Jason and I are both members of the Seattle King County Continuum of Care Coordinating Board. Jason is an exemplary leader committed to the efficient culturally-relevant compassionate delivery of Human Services to those in our city who need these services. He is a strong partner in the hard work to redesign our home system so that we have a regional system and structure that will strengthen our work to make homelessness rare brief and one-time Jason Just Dance and is committed to race and social justice values and principles that are key to Seattle being a city that is fair just and Equitable. He is leading and he's leading well, so I strongly encourage the council to affirm and invest in Jason's leadership and service by approving his appointment to be director of the city of Seattle Human Services Department. Thank you for the work you're doing on Solid Ground that we have Denise Scott and then Bruce the morning cancel. My name is Denise Crown Bell on co-chair of Seattle silence Breakers and a 19-year City Light employee. I'm here to testify against the nomination process for Jason Johnson is HST director. This nomination didn't follow the process that ate just the employees were promised by the mayor's office nor what SSB Seattle silence Breakers was told by the mayor's office would happen and open inclusive and transparent search process. Many HST employees have testified to the fact that the process did not include a race and social justice lens many stoke the stakeholders and community members of also testified to that fact the recent hsd employee survey showed deep concerns with leadership including the span of time that Mr. Johnson was the interim director. When so many people have spoken out against the nomination. How can Council move forward with this nomination if confirmed how does hsd move forward? This process was run counter to the mayor's own City values as the process did not include his race in social justice lens nor was it an inclusive process words and actions matter? And then finally putting aside my other hats like my Smiles Burger hat and my union hat and speaking is Denise City employee my nearly 19 years of the city. I've never seen so many employees come out and testify and this about their own boss. They do that at Great risk to their Futures at the city of Seattle and yet they still testified because they cared And as a citizen of Seattle pulling the nomination from Council Members savants committee, I feel as an Ender end run around at council's Duty as a legislative body. And I know things get political but it feels really political and it also feels undemocratic and disrespectful not only to the employees but the community as a whole words and actions matter. Please return this nomination to cancel and redo the search process or to the mayor and redo this. Bring you head of a chesty. Thank you. Next we have Scott Scott Bruce and then Peggy hotz good morning, My name is Scott Schubert. And I'm the program director for the homeless housing for accelerator YMCA. I'm here to read a letter of support from Mark Putnam executive director. He says I'm writing again to express my support for mayor jorkins nomination of Jason Johnson as hsd director Jason Johnson is compassionate intuitive and hard-working leader. He pursues innovative ideas and creates collaborative teams to execute on them. Jason's own lived experience provides a perspective that supports entering hsd program participants in all solutions. I work with Jason from more than 10 years from his days in the City of Kent and I've always respected Jason's professionalism and learn leadership. He has earned respect from his colleagues in government non-profit philanthropy and business in each of his Including at his his stint as the interim director of hsd the study of leadership. Jason has provided over the years has led to significant results for some of the most vulnerable citizens of the city of Seattle stability of leadership during the planning and transition phase of creating a joint oversight structure to guide the homelessness response is essential nonprofit Partners such as the YMCA significantly rely on hsd funding and operational competency confirming Jason as the Director provide certainty certainty during this time of important transition. Thank you for your leadership Scott Bruce Peggy and it I think it's Gina. Hello, my name is Bruce goggle last night Nickelsville. Estella Village residents unanimously voted not to allow Jason Johnson bully Lehigh to oppress and Destroy what Nickelodeon's have created when Interbay voted unanimously to change operations Jason Johnson and Lehigh fully supported that Democratic decision. So Jason Johnson, the people you serve has spoken leave us alone and put a leash on your dog Lehigh hold yourself accountable and for your for your mismanagement and don't be a hypocrite. This is self management vs. Mismanagement as head of security. I am 1/3 of a leadership that leads by example obligations accountability and Community are the ideal to be a pole self-management takes practice patience humility and forgiveness humble yourself Jason Johnson and lead by example only then will you be forgiven The Village? Peggy my name is Peggy hotz sure we'll in Nickelsville or democratically organized and self-governed that kind of structure and Powers the homeless people live there and teaches them valuable skills that will benefit them for the rest of their lives. Self-management isn't for everyone. But most people agree. It's a valuable type of organizing that should be part of a broad range of shelter options. Jason Johnson doesn't agree he's done his level best to try and eliminate them under Johnson's leadership a huge powerful. Nonprofit has been encouraged just wallow Nickelsville ignoring the encampment ordinance of the cities and the years of work homeless people themselves put in to build Nicholsville. In 2018, Tent City 5 voted to switch its operations to the low income housing Institute. And Jason Johnson said that was just fine, even though it was against the order last night in Nickelsville. Othello Village. There was a unanimous vote to reject Lehigh and stick with Nickelsville. Here's a test of mr. Johnson's Integrity. Will Jason Johnson support a democratic vote to stay with Nickelsville as a fellow Village voted unanimously or Willy reject democracy when it doesn't suit his purpose. Gina Regina s Petri Sean and then Benjamin Cox Good morning. My name is Gina Petrie. I'm a co-chair of Seattle silence Breakers and organizer for radical women. I'm here also to urge you not to move forward with this nomination of hsd director by want to thank those council members who have voted to send this nomination back. I think it's important to recognize that you are standing Hornet transparent of inclusive process, but I just want to ask for those that haven't how can you ignore the countless testimonies asking you not to if you move this process forward without that that is a message that you are sending some of you have stated the desire to change the process later, but my question is why not now? That's moment is before you so I would like to ask you to take a stand and show support of those hsd employees who are speaking up. Please service providers and recipients have who have also made their position clear and been organizing. So I would like to ask you to show that their voices and they're organizing matters in the city. Thank you. Thank you Sean and then Benjamin Cox Hi, my name is Joan Bickley work for the Arc of King County where an organization that get your people developmental disabilities. And we have a grant from the county best arts for kids disability is the the single largest disproportionality in the homelessness crisis where 6.4% of population and 53% of the homeless population there a lot of reasons for that. I wanted to focus on Two And I have some some materials for you as well. Extremely low income is calculated 30% of Ami. Well, if your on Social Security, you're making $9,200 a year, you're well below 30% Ami and that's never going to change and so there's a large proportion of people who are not going to be kind of Access housing for spring the low income because they don't make enough money. The other thing I wanted to highlight was that the that the vi-spdat at the city and county uses does not wait disability way of language access either so people can be extremely vulnerable in real life, but not rate as needing intervention and I have some examples of people that the ark has work with I can think of an individual whose death autistic medically fragile and transgender and did not score as vulnerable enough to receive intervention. So I I'll leave you with these and I hope that that you will look at the reasons why just disabled people are being served there a lot of organizations that have been trying to way into the city and county about this. Thank you Benjamin Cox And then we have one more Matthew Lang Benjamin here. No, okay, Matthew. A good morning cancel. I'm here to read a letter from the transit Riders Union to the council today dear low income housing Institute board of directors mayor. Durkan and Seattle City council members. The transit Riders Union has had a long and productive association with Nickelsville. We've worked together on issues ranging from transit access to very low income and homeless writers to funding for housing and homeless Services over the years. We have seen Nickelsville succeed in providing needed shelter safety and Community for countless people of diverse background situations and needs we have seen the dedication and resilience of Nickelsville residents leaders and staff. Is there a persistent through difficulties change lives and build lasting relationships with neighbors and the broader Community. We are there for extremely dismayed to learn that Lehigh has told Nickelsville to withdraw from operation of the otello Georgetown in Northlake villages in a matter of days. We are concerned that the city of Seattle Human Services Department is encouraging this move. We understand that there are disagreements over mandatory case management, which is not Acquired by city ordinance sanctioning the camps and the self-management model that is Central to Nickelsville. We're not experts in these matters, but we believe that there must be a solution to these disagreements that doesn't end in this damaging way and the preserves and respects Nickelsville in Nickelsville Integrity there for the transit Riders Union calls on the Lehigh board mayor and the city council to direct the human services department to not mandate required case management and to encourage the self-management. Nickelsville has succeeded with us at Nickelsville be allowed to operate their camps in place for a cooling down. Of a month followed by negotiations led by a skilled respected and agreed professional mediator. We also would like to know that without many years of dedicated work and especially the organizing Advocate advocacy and activism of nickels going at sibling organization Sharon wheel is unlikely that Seattle would now be a national leader in pioneering tiny house Villages and sanction encampments. Thank you for your commitment to resolving this conflict fairly. Sincerely the transit Riders General membership meeting. Thank you for coming it really in the letter. Do we have anybody else? Nobody else has signed up. Alright, well, thank you all for coming. Thank you for your testimony this morning. I'm going to move to our next section which is with Mark Jones and I think has Colby is here and asked you to come up to the table and anybody else that you're bringing with you. I believe Jason Johnson, you're going to be part of this conversation as well Alan Lee from Council Central staff Jeff Tracy. Are you part of this? Very good. Thank you. Well, if you will as you're settling in Allen is Gil start with introductions is ready to go. Good morning manager and Alan Lee with Templeton. I'm Tesco be with the mayor's office with a national vision service morning. Jason Johnson with the human services department. I'm happy to please do so. I'm thank you cast members. So today we are hearing from them as you noted Madam chair from Mark Jones of and is as well as members of the executive on the ongoing process for implementing some of the recommendations that Mark Jones and Anaya has previously known previously under a future Laboratories the recommendations that they made for the process out. Find an agreed to by the mayor and King County Executive last May to explore different models of combining the governance of our homelessness Investments and policy strategy into one combined County City Authority. So the last time that's excuse me to meetings ago, but I'm for the select committee Mark and tests both were here to you presents on the recommendations themselves. And so today we're going to hear about a potential timeline as well as a general work plan. I'm in other characteristics as we move forward with his process. Very good. Are we driving into marker test you have some intro? Before we handed over entirely to Mark. The only other thing I would know it is that the mayor's office has convened a council client group and that client group has met now twice and we'll be meeting monthly thereafter. And so that client group actually has had a preview of this presentation. The the presentation will go into a little bit more detail and is responsive to the feedback that we got from the client who had a client group. I think in this case means council members a plus mayoral staff, which is the similar makeup. I understand that the County Council is using to make sure that the electors actually get feedback from our folks. We're working on a new modeling and envisioning that so I don't want those two things that there is a actual client group that maybe people haven't yet heard of I saw do you think it needs a new name? Cuz it's really an internal Focus conversation. I'm just want to make sure that's super clear. Who's on the client group? Who are they? So council members Bagshaw Moscato and O'Brien. And if I could just a matter other people, I just thought I heard that right. I just heard there were several people including employees or Stafford Council Members Plus staff from the mayor's office and then Central staff is also in the room as well as Council staff and Mark representing in his role as project manager has also been participating six people. What does it look like and what is their goal? Sew a shirt so that again there's three council members that are participating on behalf of the council mayor staff hsd staff and the number of people in the room varies depending upon which staff show up. So it's been anywhere from what are their names and what is the purpose of the client group and so on I was I'm not clear. I got the three council members. I got that part. So president was established by statement of legislative intent during the last budget session and the the statement of legislative intent called for the creation of a joint executive and Council lead quote unquote client group that would explore how the how the recommendations at that. Forthcoming recommendations would be implemented to completion during this year calendar 2019 and currently that client group comprises The comprises the aforementioned the three council members. I'm also present at this client group and has been interim director of Jason Johnson Mark Jones has recently joined test Colby and Central staff. Oh and expensively Sleepwalker from the office of housing as well as the office of intergovernmental relations. They have also been there. What's the purpose of this group is to inform our recommendations will be sitting there so you so you mentioned Steve Walker from oir and the three council members. We've mentioned Jason Johnson was there Tesco beef in the mayor's office location a lot of things in a very impressed. During the budget. And so while we try to put placeholders in there and give it some thought. I don't think we did a deep dive. I I didn't do a deep-diving thinking about the regional structure and who should help develop it. I guess part of my concern is whether it's little top-heavy and whether we should have more of a comprehensive client group, which could consist of other folks as we deploy. I think the last thing we want to do is come out with a structure. That's just top-heavy without the input of stakeholders people experiencing homelessness employees just a little more of a comprehensive group cuz it sounded a little just top-heavy when you said client group. That doesn't seem like a bit of feel like a client group. So again, That's just one of my concerns appreciate that concern and I will confess I'm relatively new to the city. And so when I heard the term client group, I was also confused. And so I had to go back and look at the slide to to truly understand what the purpose was part of the presentation today that Mark is going to give specifically addresses that issue and we'll get do a presentation about what the various comedian group committee structure and groups are to ensure that there is Broad representation of stakeholders, including customers including providers, including labor representation, so that including staff and so that that will ensure that we've got the voices that are necessary to take this work forward, but also that there is referee respective accountability to those groups. So that any decision then comes that comes forward to the mayor and to the council and its legislative capacity will be informed. That process of the frustration and concern I've had as well. I'm one of the things that I asked for was a list of all the individuals serving on various committees and various groups as we know that there's kind of concentric circles of stakeholder groups. I shouldn't say stakeholders is internal groups plus some external groups. It's very confusing even for me after being at two of those meetings. So I think what the council presidents asking for is similar to what I know the chair and I have asked for which is why we need the names of folks are going to be serving on these various groups. And as you continue to fill out which organizations are going to be participating ensuring that the voice of those who experience homelessness, which is the key component of the recommendations. Thank you Mark that we have a better understanding that so this President I just want to underscore your concern are my concerns as well. I'll share with you the initials. What I got in response to that very question. So I understand some of those groups are changing. So we are all asking for the same information move on with just to put a footnote on this. I think what we're hearing is that the initial group coming together was a leadership group that identified what the next steps are going to be Mark you have spent a year-and-a-half. I believe now or more creating. What is what we're going to hear about and your recommendations and what I'm excited about is how will the community be engaged. I know you already have done much of that. So if you could just as you're going through explain who's been involved how they've been involved and what the next steps are going to be. Of course. Thank you and I will also know just by way of general not even copy up a framing at the outset that much of this work of community engagement, right? Dunwell is always on going right there's not a point where it's over and so part of I think the desire has been to acknowledge openly right? Like when we just haven't talked to someone yet. And that is not an unwillingness to talk to somebody or anybody. It's just like haven't talked to those folks yet. So I hope that likes as as we have this conversation that it's clear that there is no one willingness to engage with anyone and were very very very flexible in that regard. So briefly, I today's goals are to familiarize folks with the current roles and work streams of the consultant teams to discuss how implementation of the recommendations will be managed and to identify the decisions that are legally reserves to council so briefly just by way of introduction in the past. I was with a team called future Laboratories. I'm now is a team called Innovation Services actually not a difference. They're my team has been out of our parent company. We are still deeply related to those folks organizationally and we are their friends. Just wanted to be clear about the name change in the want to be clear about the role that we have o a t moved I want to be clear about the role that we have now in the fall. We were very concerned with policy development Community engagement volume the assets. We are really doing a lot of work or will now is really to assist in managing the implementation of that work and so are our job is shifted to some degree around identifying priorities managing timelines and helping to resolve issues part of that does include right like working with count both counsel both Executives to identify like what are the concerns and so I know that I've said this to some of you but I I want to be very clear that our contract remains jointly funded. The city and the county so I am here not as in anyone's particular agent, but simply attempting as best as we can to help Shepherd a process appropriately the Rosenberg streams of the consultant groups. I want to make sure that folks have Clarity around who's doing what and who is responsible for what so our team is responsible for building a runway for a new Regional Authority by focusing on the following actions from the fall report that is one assistant by Theory of change to consolidating into original thority 3 becoming accountable to customers at all levels and 8 creating a Define public-private partnership through funders collaborative model. The inputs for that work are still first and foremost customers and folks with lived experience agency staff city and county councils Marin executive providers private-sector partners. And of course the work that we did in Phase 1 organizational structure. That is really our highest task here is to make sure that idea we don't already is a strap and I'm to the point that one of the our colleagues at the county often makes that it works bikes we built the thing cuz we said we were going to build a thing but it doesn't actually change right the way that we function or how we move to engage folks. The next group CSH or Corporation for Supportive Housing is on board to develop something that is being referred to as the regional action plan or wrap a lot of acronyms and government. So if I stay rap, I mean Regional action plan in this context and just Deport change management around that I will know that CSH was also here in the fall. I'm working very closely with my team optically around COC governance and integrating the HUD dollars into a regional Authority framework. Our team's work very well together closely and they're led by a woman named Dan Oliva who was the former deputy assistant secretary at Hodge who oversaw all of the homeless Investments for the nation. She's very very Brian the info for the wrap work will be our report from the fall Focus strategies date. I will talk with you in a moment customers. Council's Marin executive providers private-sector Partners the output I really a plan for regional programs and policies and program level metric strategies and goals. I wanted to let me hear because I I think that and would want me to send that that desire is not to direct people in like go do this, right. The desire is to hear again. Really listen about what do people want to do and then to use our technical expertise as best we can tell identify what potential pathways are that will get you to those goals. I think it's really important. Actually that that be like stated and restated. We are very clear internally on sort of the Consulting team that are our job is not to dictate the path forward. It is to be like here where folks want to go and help craft an executable strategy quick reminder. We've been through your study multiple times at this table and if somebody wants to see it online for today, Find it. It is in a lot of notes and it has a blink that's letters but but it is HRS. Casey. Future.com that is where the report lives if I'm remembering correctly and someone will not at me. That's what will make sure that it's someplace very visible and circulated again to my colleagues so that they have an update accounts with mosquito. I also think that if we could put the link to the interactive presentation that the team has created that would be great. But we also for those of us who want to flip a page have a pdf version of this. Thank you for creating that I think would be good for us to link that as well. I'm on our webpage so that people can find it and readily and we're happy to have a good and I think that's important. But also I want people to know how much work has gone into this that this is not the first impression that you've been working on this for many many months with lots of Input from community. So just continue. Thank you last team strategies has a goal of analyzing Investments of the city of Seattle King County Suburban cities in Santa Fe and analyzing the system performance as it is currently, excuse me. I want to be really really clear about the delineation and streams in the sense that our team at and I guess we are policy folks qualitative researchers. This was really a quantitative job rights or this was about and almost forensic leffel has given how many funding streams were at Play Enter the inputs for that. We're really budgets and Investments. I was part of some of that process where they generated a number templates into them out all over to the Suburban cities to philanthropy to really find out like a who how much money is flowing into this in what programmatic buckets homeless management information system data to reach my a state. African for acronyms housing inventory count data or hick data Kian from interviews and then system admin staff. The outputs are clean data analysis for CSH to incorporate into the regional action plan. I know that a number of you and I think it's an early folks and Leadership positions in this region have dropped inside like but can we get the actual data on the stingray and focus strategies because of their of quantitative expertise was really rot in lean on to produce that and to be able to say okay. This is actually how much money it is. And this is what is being spent on and end. These are the best we can do in terms of a sequence performance. Any questions from Council on that before I move into a rollup of that work in which we would Implement these various sets of strategies talk to me about how the work of focus strategies might change some of the ways that we think about it either funding of a new Regional Authority or how might actually change the process by which all of our various governments and private philanthropist, give funding to individuals that are doing work to end homelessness or organizations. That's a good question. So I would say that One of the benefits to the amount of collaboration that's been happening between these teams is that we were other there's been some desegregation of our timeline showing a moment. Our work has been reinforcing. So none of the work that has been produced by Focus strategies that I've been privy to this far as indicated that any of the work that was produced in the fall was was actually like not informed by the right things or or headed in the wrong direction. I would also say that this I give specific capacity around I wouldn't say the ability to or the need a shift Investments and you will make the decision but it gives you an idea of who's spending what we're so that you could begin to think about like, okay. So like is, you know given that we can see with Clarity that philanthropy is putting all this. The best thing do we want to continue to to find at the level that were found it right? So I don't I wouldn't say that it is a body of work that is intended to be used in that way. I think it really is supposed to be more informative and deliberative for you. All is that correct until around those types of Investments that you just highlighted and making recommendations about, you know, either additional governance reform or additional revenue or additional other recommendations that may come out of that fiscal analysis. I think some of that is on test question. So what are expectation is that the data set and the general analysis the super the so the analysis that Focus strategies is doing currently is really looking at The the progress was made and the accountability that the city and the county of had to respond to the 2016 report and producing a data set that actually brings City-County philanthropic Investments together to feed into the regional action plan and Mark actually has a couple of slides coming up here that will show that flow and it really is the regional action plan that is been going to provide recommendations and rationales behind exactly what you're talkin about sort of the direction that funding should go and the funding goes towards particular interventions or in particular in particular combination what the anticipated outcome will be but more importantly what the performance outcomes will be and the accountability for achieving those performance performance outcomes. So if you if we can think about the focus strategies as a sort of a foundation For the work really that that that more productive work that you're describing which will come out of the regional action plan and I think it goes without saying that there is a lot of scaffolding that you guys are using right now and you know, I'm the land-use guy. So I have to use kind of building an allergies right now the recommendations but I think and that's important and we need to understand about that scaffolding and we understand need to understand about the process in order to be well-informed about teacher recommendations. But I think what I'm really interested in learning more of his how are different governments and philanthropies have worked together. Well where we might be funding things at cross-purposes from each other or we might be overly redundant and we can have efficiencies of scale and the kinds of recommendations both structurally and financially that need to Made in order to make sure that maximum resources are going out to Providers to support individuals and getting them off the streets and into permanent Supportive Housing. I think this is why I'm not frustrated by this presentation by any stretch of the imagination, but I think there's just a lot of anxiety and maybe this is just cuz I'm a short-timer a lot of anxiety to try to get two outcomes here so that we can really start to see better results. And so excited to learn a little bit more about what some of those recommendations are really hope that the client group is going to be working on those specific elements because I think that from reading through many of these reports to date there seems to be opportunities here for improvement, but we haven't seen those yet. I think everybody's just anxious to see what they look like and I couldn't agree with you more and it won't be surprising that the mayor's office shares your interest and concern and desire. Where to see exactly those level of outcomes the client group will absolutely be part of the review of the regional action plan, which again is really the document that is going to get at the at the concerns and questions and issues that you're raising. So it's an interactive process with the executives office the client group as well as the consultative process that Mark is going to go through. Okay. Thank you madam chair for the first question that comes number Johnson as I think it's a really good question and I'm not quite sure. He got a direct answer. I think the answer is no that's the client group is not directly responsible for answering those questions. I still think that and I think what you were saying is that the regional action plan through this this group of people that you plan to convene in the future will actually look at the metrics and the the strategies that he was asking about and the funding I think it's still Bears the question, which is one then I posed earlier which Help us Define what the client group is doing? Because I think our colleagues are going to have a lot of questions about what this table is doing vs. What the other concentric circles of stakeholders will be doing so to answer the good council members question directly. I don't think we still have a definition of what that client group is charted with doing though. I think it became a little bit clearer and that last meeting and I know in some ways your building the plan as you fly it and appreciate you continuing to try to get us information in writing with their definitions and names of the council president has requested so that we can also be very clear in our responses. But I think the direct answer the first question was no the client group is not responsible for that level of detail. So I am wanting us to move forward here. And I know that on slide 12, you're going to start talking about implementation management. Thank you, So I just briefly I I like timelines they help me think. So this represents a timeline of the overlapping work and the particular products right that are R&R flowing right? So there is the system audit that our team did in the fall or no helping with some stand-up there's fiscal analysis in the regional action plan is off of time. But I think is more helpful is like the products right? It's like this is us going to Attica how the products work and how they flow into each other. So you'll know right that the 10 transformation strategy then flow both into the regional action plan and the system stand up and that that we don't action plan then informs the actions of a regional Authority. So that is that is how all of this information is is currently being move forward and if write the council would like to take a dive on a particular thing. I hope that this is helpful with regard to Where that. Might be so to prevent implementation management also contains a number of questions of the council has asked so the purpose of Information Management, right again is to establish accountability between the city the county community stakeholders throughout the implementation process and to engage key stakeholders to inform the decision-making process, you know, as we have tried to again and body as in perfectly as being have but try to in the fall, we really want this to be a community different process. Like the desire is not to do something, you know behind closed doors in a top-heavy way and I think part of this point what has happened is we are building the playhouse near questions that you are asking the questions that we are asking but I think we're all terribly trying to do to the point about names is is actually not over a certain who should sit around table, but did genuinely got a nasty. Members like how do you want to be involved and we've just begun that process. So what we have thus far is a staffing structure that has not been turned on. I want to be very clear right like so we have settled on this as a as a plan for a path forward, but we have not begun to fully turn this engine on so to speak and get it how many I think it's the work of the next week. We can have a steering committee which will be largely responsible for sort of Process Management and strategy. I'm will be composed of sort of the implementation lead that's representation from both Executive offices and both relevant agencies. So are all about an agency. That's all home d t h o s h St. Our team and our project management role HSI specifically said office of housing Public Health Department all home. Collisions on City cessation us energy come from homelessness philanthropy business partners labor unions providers Advocates and counsel Central staff from both consoles. That is the the current formation of sort of a steering body for all of the different work that has to get done. There will be for working groups that actually do a lot of the deep. That we have been talking about needing to get done. Those working groups are organizational stand-up Community engagement policy and planning external Affairs Surfer example of customer. Send that some of the questions that you were just raising around like you know, how and where will we understand where policies are at cross-purposes? For example, that will take place in the policy and planning working group where staff again from all of the relevant agencies will begin to actually run an audit of like, how are we funding? What are we funding for excetera so that we can begin to answer that question. What you'll know is that you know, for example using that we're trying to make sure that everybody who's involved in finding stuff is there so the reason for example of a rate Foundation is there is that they will represent philanthropy and all of the Investments that they are putting in to be able to discuss what policies guide those Investments similar right? Like we're inviting the Suburban cities. Policy managers because they also have investment and we need to understand what policies are guiding those we have tried for these to be as inclusive as possible with regard to who is there and we have made sure that equity and homeless Advocates will be invited to all of those tables Again part of the reason why you don't see names is that on the staff side? We're currently working with our partners at all home HST dchs to identify who are the appropriate staff. Right? And then with the community members we have to go ask again not wanting to assert like you have been chosen from Community to represent but to say look, we need to reach out to the lived experience Coalition and have a conversation about how they want to engage. I want to specifically know that because we had a meeting with the undoing institutional racism collaborative earlier this week and one of the specific conversations there was actually about like does it Is it is it actually reasonable to expect people to attend a meeting as like how they're how their input is is taken up right and that win with those of us who are paid as like full-time staff to go to meetings and like do that work put that in position on people who are not being paid to perform that labor in the same way that actually is deeply inequitable. And so we need to actually have a conversation with those community members about how they how their involvement will be a felicitous and not a burden will not actually treat for their attention, and we're just now starting those conversations. I'm happy to talk about that, but I don't know how to answer our last meeting mark that I appreciate it is that you and your team have been going and will continue to go into the community to find the leaders of the natural leaders and to ask for their involvement. It's not people have to come to City Hall at 2 in the afternoon on Friday. Thank you. I'm so just visual schematic. This is the decision-making structure as it is currently held legally which is that there will be working groups as I just mentioned right that are responsible for certain process implementation generating all of the things. Can you discuss the acronyms because not everybody knows what u s i c h of course Council on homelessness Federal agency and they helped guide a lot of the federal strategies that in turn in form hide in a chest and a number of other departments around their investment. Idhs is the Department of Community Human Services. That's the county department. That is the ortholog to hsd which is the human services department for the city HSI of homeless Services investment strategy. That is the city Department specifically responsible for homeless since work. Am I missing any? iJustine Okay, thank you. Okay. Oh, I'm sorry. I see ISO sound cities Association. That is the the membership body that represents the the Suburban cities to remember different policy making bodies. So they're working groups will be responsible for work. Just a lot of it to do excited to get started on that is really there to help you Process Management coordination the strategy again that's made up of a lot of this sort of senior staff who are then going to be responsible for making sure that the council's and executive leadership are like getting the information that they need in the ways of the need to make it to uphold their legal and constitutional Authority. So that's that implementation structure that has been outlined again that we are in the process of turning that on right now. So look forward to having actual things to say that are not just process thing at meetings moving forward. Your previous slide on page 5 for you have August September October November. That was obviously last year 2018 and you're now at the system stand up Point. What juncture do you think you'll be able to come back and talk to us about who's involved with the next plans on whether or not we'll succeed in having something in 2019 on the first question is involved in a week or so. Really, I mean like we are we are in the process of again, like on the on the agency side folks are identifying the right staff on the communities. We have already started that Outreach to be like a fool and how and what so should be able to provide specifics about that in the near-term on the second question about will we do something in 2019? I can't tell you you can tell you that. Tell if I mean I tie the our team has always shared your sense of urgency and has advocated wherever possible for short time lines that drive for adoption and are not process heavy. It is our hope that that continues to be the attitude on both the city and county sides and and I believe the currently that is the case. I'm any other questions before I move forward into the specific legal decisions that will come before console. Don't let me continue. Okay, so for Council decisions, we have identified. I believe it's the seven decisions and some of this will require from a boat. Some of it may need a formal vote. Some of it is just like y'all will have to sign off on it so that we know that we're proceeding inline. They are approving the legal structure for a new entity. Like is it a PTA is it you know that those are our decisions that you will have to provide input for there is adopting a resolution are forming Regional governance approving a scope for Charter for a new entity. Again that made formal vote adopting an interlocal agreement approving external Partners Regional action plan, which again will have a lot of the the detail around program level metrics and and strategies approving you into the board members and adopting a budget request what you'll note is For each decision there are parties consulted or involved. You know, the client group is always there. We're on almost everything. There is also a live experience Coalition and we are again this is not like a close list. Like either than these are the only people we will talk to you. It seems like this is who we know we need to be talking to and if someone else raises their hand and says, I would like to be part of this or someone tells us like a you should also check in with you know, someone so that that's Community engagement, right? It is in season right now. I think that we had previously index test against on select committee meetings, I think on it by Simpson. We have gone with a more General like if we can get this done in the time frame And then the relevant workstream. So these are the things that are really going to come to council for sure. There will be many other facts spit like these are the things that we know are like hey, these are the big decisions along the way we will have to make many many many many decisions together and I believe that again when we talk about what is the purpose of the client group? I think it is probably at least how I am hoping that it will be used is to troubleshoot around those kinds of like more day-to-day. Like, how do we get through that Sushi? We talking to who do we call about those kinds of questions? This is my last line. So thank you for your time are their existing entities that we are basing possible structures off of or stealing good ideas from other entities and cowboy and put them together into some kind of Frankenstein structure here. I mean, can you point me to some examples about where we might be trying to draw from in order to help not recreate the wheel but are on their number models that we are borrowing from liberally the the two most on I guess the one that will have the most in common with the final structure, but it will still be difference or LA and Portland. So la City in LA county. I have a joint Authority that they deserve a bulk of their funding through call Blossom, but then they also have Investments that just fell to the counting the city and strategies that are actually they have County strategies Regional strategies and then LA City strategies to a lot of the the work in our report in the fall around like stop Regional governance and and the ways in which we recommended dealing with the size of the county or the 13th largest county in America. I say that all the time we took a lot of that work and redeployed it in terms of thinking through how you could do. So original governance in a way that would make sense. Portland has a joint entity with Multnomah County the county assistance. I'd Mark Jewell and who is their director? Is a person that I talked to quite frequently about sort of how his board structure works. Actually their government structure is is very effective and how it works in terms of who sits on it and how they select you sits on it is something that I definitely tried it with Mark about quite a bit. We have also looked at a number of other models that are close but not quite there. So one actually is Columbus which has one entity that oversees all of investment but it's a 501 c 3 actually that is the sort of the single funder for everything is that merged with the county in the same way but some of the span of control they have over services with certainly what we were back during towards when we begin to look at like what the what the structural difficulties you were facing where I can do this list for quite some time and I'm happy to provide it to your office or answer any specific question. You might have that's super helpful. Thank you very much. And I might have missed some of this or maybe it was in writing, but I just had a few very basic questions. This new entity if you will or I think I understand the decision-making structure answer to how decisions are Serta flow in the collaborative process. I get that but this new structure to will winners our goal to have that in place where we shooting for the goal that I would love again. I can't make this decision for you the goal that I would I would love if everyone would agree to is the fall like to have something by September what I think be pretty great given the number of other things in terms of budget process that you are obligated to take off and I'm not going to hold you to that. I'm just trying to get a feel for likes. I might have missed some of this another conversations and Again this structure if you will, I know how many council members we have. There's nine here and there's nine there and their different city council's within the county got a lot of moving Parts here. Ideally, what is that final energy look like is that a nine-member organization or five member or a 25-member or what or what sort of the goal their the range of goals in that new structure found one of the questions with we're grappling with we've begun to talk with the city attorney's office. The county also will begin to talk with their Prosecutors office around exactly these questions. So the actual question of what the legal form will look like against Mark Mark just described several other several examples of types of legal formation. So we are still looking at illegal formation, and we're actively in conversation with the client group. That's that is essentially the first step in this is to really decide legally what it will look like when we bring the accounting in the city together and leave room for the possibility of sounds some of the sun cities to actually invest in be a part of that. That's that will be the first step to making a decision about the number of Commissioners or board members depending on where we fall and what the allocation of those will be between the death of the different governments. The one thing we know for sure is that we are looking to create an entity that can be nimble that can be Innovative and also deeply responsive to the outcomes and the goals that both of the Lodge at least the county and the city having doubt it with so sorry. It's a little bit still out of building plane while flying but we will have again more robust conversation with the client leading to even more robust. Station visit with the council or is it between 5 and 20 or can you just give me something September is right outside of what you going to miss you? I will show this job is I just start with what I'm trying to do. And then I said to work backwards sometimes and I could change that a little bit but I'm just trying to get a feel and particular to be transparent and what we're doing. This is huge and should should should drink some great I've gotten so and if we don't have a test I get that we had to do the process I get that but I'd like to be able to just sort of know what we're shooting for. So you don't have anything that I don't want to force a dancer and some was going to hold you to it, but I just want to be able to because I had a few more of just basic questions like that that I want to ask but Is I will say is just our take which is that a governing body should be small and technically expert meaning that if you have a board 25 people is really difficult to actually then get something done and technically expert I am I mean actually deeply fluent in the things that you need in order to solve the problem because whoever takes the song is Edie is going to have a real job on their hands and they need to go to a board and they can actually get advice from that isn't just folks who are like I'm here cuz I have this XYZ power. So I'm hearing a little smarter not 25 or something smaller than that and they will be staffed. they'll be staffed separated or do we envision our employees and like the County Employees considered having it as part of their assignment are they employed by this new entity or are they remain do we know any of these questions and haven't actually decided what the the legal formation of the entity is, we don't yet have all the question the answer so that I will say that the conversation is that gchs staff and age and HSI staff the homeless services in the Siri is that those those entities that those those staff positions will move into the new entity the way they will do that and the Types of positions that will be available in the new entity is part of the work that we've engaged Mark and their team to help us with but we're also talking with HR. We're also talking with the unions were also going to be looking at the possibility of actually subcontracting with a separate HR entity that has expertise in emerging and in creating job classification salary bands those sorts of things so that the general answer is right now the view is and I can't keep doing this with my hand because I'm trying to say that we're actually blowing folks into this new entity. But quite frankly, we have the same questions about not just the status of existing staff moving into it, but then how do new staff move into they'll be openings. And what do we do in terms of hiring new staff of that entity and that's really a conversation between the the council and our City attorney. An HR the smaller cities like Renton within the county and there are they at all engagement these preliminary conversations are they more representatives to the county leadership needs discussion folks have been the most engaged because of the positions. They have within 10 cities are near Backus merch Almanac and councilmember print the current president Prince iPod it but I was just trying to figure if they if it were just dealing with their interests through the county or were they actually in and I just want to make a comment on As we consider this and we're still sort of at a very high level it creates. I think a lot of angst and anxiousness and a lot of people with respect to those experiencing homelessness or vendors and contractors or employees and during this process of high-level discussion. I just think we need to try to get on with it little more clear because we could lower anxiety music could be great opportunities and hopefully better outcomes better results, but until then, you know trust level may not be high. And so I think we just have to serve to get stuff out there. So I wouldn't have been out of line. If you said, you know this new entity hour looking out the tween 8:15 that serve ideal and ideally maybe 25 or 30 employees maybe 200. I have no idea but we can start putting some meat on the bones a little bit. It's okay cuz we can change it down the road as we start. You got to start somewhere. So I just enjoy the presentation right? I'm trying to just get a little more care than what this September October rollout me look like that. I appreciate that you want to do that feedback? I will say that that was received from County Council yesterday. So that is helpful because it will say that bike from our perspective you requesting that means that like we're in a good place until we can then go forward to next body of work. And so that is what we will not do question to test. I have been really grateful that you have been brought on by the mayor's office and I didn't realize your background until we had an opportunity to talk a couple of weeks ago and maybe if you could just talk about what you think your responsibilities are going forward as the males Mayors representatives and the work that you've done around systems that to me is a real winner and something that we need. Thank you. So my body of work for the mayor's office is twofold. It is definitely being the mayor's representative and conduit as is doing the project management certainly being the conduit with the council around Regional governance, which can take many different forms from attending an entire slew of meetings around to this issue to again engaging with Central staff in more thorny questions about legal entity and engaging with internally with our partners in oir and city council. Excuse me. I'm City attorney's office and also making sure that internally I'm working with my colleagues in the mayor's office to make sure that for example labor issues are handled appropriately. I'm so to a certain degree as Mark is playing the project manager role if you will for the overall. Imitation of this I think of myself as a sort of the Mayors project manager on this and again attempting to balance the the perspective of both the mayor as well as the council in partnership with Central staff and Council staff. Thank you for that other questions Council colleagues. So so I can also say when I have the chance to talk about how some of the folks who I really trust in that and the homelessness and housing world have worked with you in the past and have had a lot of great working relationships with you and I think you can highly recommended so that gives me a lot of Hope. I've had the chance to sit down with Mark as well. Thank you for your commitment to sitting down and including the voices of folks who have been experiencing homelessness either for a day or for a decade and making sure that their voices Center one of the things that I really want to elevate from the report that you included was the need to make sure that our front line staff. Rhoc contracted organizations receive a living wage is something that the council's been taking on for a very long time. We were able to make a small deposit in the bucket last year in our budget on thanks to my Council colleagues for supporting the cost of living increase for all contractors. So I think that those elements are really important one piece that I just want to make sure that we don't lose sight of is that your report had 10 recommendations and the concept of having a joint government structure is one of those 10 and so as I said before and I'll say publicly I just want to make sure that we're not reshuffling the deck chairs on the Titanic if we're not addressing those other fundamental root cause changes that need to be put into place everything from as you heard from the disability rights Advocate making sure that our intake system is equitably including folks and looking at their lived experiences and making sure that they get access to services to making sure hsd providers are getting a living wage to Making sure that we're tracking measurable outcomes and that includes internally as well for our own Department. Not just applying performance standards to are contracted organizations, but figuring out how we're going to hold ourselves accountable to ultimately creating a new shared governance structure. I think what you're hearing interview questions and I get I want to call and tell them we're Johnson in these questions. I think the reason that you're hearing so many questions is because of War ultimate Lee going to be responsible, right? We are going to be held accountable as we should be as the electives to make sure that the system's truly do change and we haven't just shifted responsibility and without knowing more about the ways in which the council will continue to have a role in directing funding ensuring accountability for our internal workings for changing the metrics in which we hold our Community Partners accountable versus ourselves accountable. We are all going to ultimately be the ones who are Be responsible for any changes that do or don't materialize. So the big question for me continues to remain what role does council have in helping to establish and also Monitor and leverage leverage points. Do we have to change course if we don't see it changing so I know those are the big questions you've heard from me before and one area that I think would be helpful in. I can't remember exactly which of our colleagues said it but let's not reinvent the wheel and one of the things that you offered is to show how this model that you're proposing might be different from Los Angeles. And then what is the others that you mention Portland OR Portland Columbus and Portland from those cities to come and presentable. What's what were the pitfalls? How did they include voice the voices of those on the front lines in terms of providers? And how did they include those who are living? Unsheltered in terms of those experiencing homelessness into their models and then really what was the outcome. How did he see the change and I know many of our cities are Across the Nation have been able to celebrate ending chronic homelessness, which to me would just be a huge marker of us actually succeeding and changing our pattern some cities have experienced decrease overall numbers in terms of people living outside like Los Angeles and New York. As, you know an indicator that I would love to see as well. But what are some of the other cities doing and how are they including that voice and then ultimately has decision-makers as the policymakers who got elected to to bear that responsibility. What was the responsibility that they had in these new structures? That's my pills are my big questions. So I didn't just did a quick sidebar with Council council president Harold for you went out the door. Technically. We only have six meetings of this committee between On September and all of us are wanting to support what you're doing, which is the speed this up. We all have been working on this morning for the 10 years. I've been on this Council we have been working on these issues over and over again what you have brought to us, I think is our best Way Forward know you built on Barb poppy study you build on the good work that was done by Focus strategies. You've had them look at it this again to what I'd love to be thinking about. We've got our client group. You're going to have the Steering group how we can move this. What you need from this Council in order to be able to get the support whatever you need for us to be able to say. Yes in September is our goal. Let's put that stake in the ground figure out what you need work backwards. So if we need special meetings of this Committee in order to help you make your decisions that mean you've asked for us to approve a legal structure to adopt a A solution that will affirm Regional governance. We want to prove the scope of a charger and then adopt an interlocal agreement that means I was working with King County Council. We know that we can work with our external Partners philanthropy to be able to bring together the government funding. Let's figure that out. But I guess you're hearing from all of us were very interested in the detail. We know that you need our support. So let us know how we can be useful. Thank you. Are any of the questions for this panel now anything else that any of you want to add? Thank you for your time on this for a long time and it is actually really wonderful to be in a community that has this much thought and Care found your energy refreshing and I also like it that you'll tell us yeah, we're on the right track or know we aren't even great to have that can endure. Thank you. Ok anything else then we will just move forward. Mr. Johnson will give you a minute. So the next time we have on our agenda is the first discussion that we will have for an appointment with Jason Johnson. And I think he's just taking a quick moment. So Mr. Mosley wanted to come up and join us. Jeff Sims from Council Central staff. Thank you for being here. And rather than just having a dead silence here for a moment. Why don't you just if you want to introduce this than David you can I I know that Jason will be right behind sure as council members know on Monday V inspection referral calendar was amended so that the confirmation of Jason Johnson to be the director of hsd was moved to this committee on Wednesday. Some questions were provided to hsd to receive a written response and we have received about two-thirds of those back already. So we appreciate the work that hsd put into getting us back on what was a rather short timeline understand that more of the the remainder of the written answers will be arriving shortly and certainly an advance of our next committee meeting on this topic which would be April 12th. And also I understand that. Mr. Johnson is prepared to respond to any of those questions as well as others that you might have today and then moving forward. This committee will have another another hearing on this nomination on April 12th as a special meeting of the select committee. Members of the council pleased to be here today to support the miers nomination of Jason Johnson as a director of the human services department. Jason has been in leadership roles in HST for almost six years now and has served as the interim director for the last 10 months of Jason oversaw the largest expansion of shelter space in the in the city's history which included expansion of services to lgbtq house house holes. He has helped to make our homelessness response more effective to serve those communities more disproportionately impacted by this crisis. He has been instrumental in our in our in completing our Central work toward a regional Governor structure, which you heard that about just recently he is also being a was a key participant in the city's response to our unsheltered citizens during the recent snow storm which brought more than 500 people into safe warm places and literally save lives. Of course homelessness is not the only portion of the critical services that hsd provides Jason is also ensuring that we're serving our seniors. I use victims of gender-based violence and our most vulnerable populations. Finally, he has been effectively Dove hsd during this period of transition and uncertainty as pointed out by the council in the previous presentation. This is a period of transition and uncertainty and Jason has done a remarkable job of keeping that agency and the important work if it does functioning at a high level, so I'm pleased to be here to have this this morning with Jason as the council begins your confirmation process. Thank you and welcome to the table. Thank you. Appreciate it. I think you may have a few preliminary comments that you'd like to make a welcome mat. And then we have asked too many questions. Thank you for your many pages of response. I know there's been additional questions that are coming your way and that those will be coming back to us prior to the next meeting scheduled for April 12th. So if you would Like to make any preliminary questions, please do and then I'm going to go through many of the questions and answers that you provided or at least ask the questions again and allow you in your own voice now in front of the cameras and folks were watching just to discuss your answers. So please go ahead I am really honored to have this opportunity to be with you today. Also honored to be nominated for the director position at hsd before I start I want to acknowledge that while this hearing is about me I am privileged to do this work with a team of nearly 400 of the most dedicated people I could imagine Hsd staff truly are on the front lines of addressing some of the greatest inequities in our community and I am very aware that I do not sit up here alone. They are in every statement that I make. The first I'd like to share a little bit about me and why I'm in this work, then I'd like to review just a few of the Department's many accomplishments from 2018. Finally. I'd like to share some thoughts about 2019 and my vision for HST going forward. So let me begin with a little story that has helped shape who I am today. I am the eldest son of a loving resilient mother who became a a parent as a teenager. She raised my brother and I on her own in public housing and who relied she relied in my family relied on many of the support services hsd is responsible for providing today. Social workers and coaches were my heroes. They were the ones I wanted to emulate I share this out the gate not because it's Unique thousands of people overcome adversity and successfully improve their economic status right here in King County, but to share that this lived experience and my relationships with Human Service workers is my starting place. It is the lens through which I see the Department's work. It is also formative as I continue my journey and understanding racism and equity. The system of supports worked exactly as designed for my family, but it was different for my neighbors are color many of whom are still living in that housing project today my friend Jose and his family hard-working Mexican American immigrants are raising a new generation in the same economic conditions that they were raised in. It is through this lived experience that I understand my privilege my family's privilege and the impacts of structural racism. After becoming a licensed social worker myself. I began a career in Seattle at the Fremont Public Association now known as Solid Ground. I managed in home care programs for older adults and adults with permanent disabilities. I worked under the leadership team of Frank chopp Cheryl Cobb Umberto Alvarez and Cecile an alt East Progressive leaders help shape my perspective of the Human Services sector and gave me a framework for understanding how to combat the negative impacts of racism and poverty. I credit these leaders today for grounding me in our shared values of equity Justice responsibilities and most importantly to me optimism, they showed me how to be more empathetic equity-based in client centered. They lived the power of servant leadership. This is when I first began a partnership with hsd and saw the expertise care and the values of Staff here that were lined with my own. When I worked at the Lifelong AIDS Alliance, I manage housing programs in a caseload of high need medical vulnerable single adults. It was also my first experience seeing experience serving a chronically homeless population. I learned what powerful medicine a safe stable home can be and again hsd staff wherever present in that world as a funder but more importantly as advocates for social justice and equity. I saw the need for advocacy Justice and collaboration first hand in my work at the City of Kent people living in poverty involved in the court and jail system survivors of domestic violence people experiencing homelessness. We're in need of services in an area undergoing huge growth and demographic transitions. And with factions advocating for different goals. It was only in relationship with community-based organizations across government sectors, and with people using services that are work succeeded. Once again HST was a partner as we worked on a multi-year regional on shelter task force to end homelessness in King County. It was clear that the best and brightest worked at the human services department, and I wanted to join them. I had the opportunity to juice to do so and 2013. I'm proud of our work at here at hsd to be part of a team that is grounded the work of the department inequity Community results and accountability. We have been on a multi-year journey to tie our work to measurable changes for the people we serve. I am especially proud of the work. We accomplished together in 2018 a time of great transition with the new mayor the departure of Katherine Lester. After three years is our department director my new role as interim director and an mou with King County around governance over our homeless response, even in those conditions. We put out 136 and 1/2 million dollars of our budget in contracts to community organizations are case managers supported over 11,000 adults throughout King County our staff provided 360 young people with internship opportunities through our funding of community-based organizations. They were nearly 1.3 million emergency meals provided. Are investments in addressing homelessness served over 25000 unduplicated households last year. And increase the number of exits to permanent housing by 30% and 4900 Support Services were provided to sexual assault and domestic violence survivors. Over half of our staff attended race and social justice training and or undoing institutional racism training. Additionally we executed three times as many contracts on time as we had the year before. In 2018, we had zero audit findings. We Consolidated the navigation team under HST and continue to address the crisis of homelessness with our regional Community Partners. But we have much to do in the air in the year ahead. You heard in great detail the city's plan to stand up a new Ridge Regional entity to address the crisis of homelessness. I would like to say publicly here that I'm not seeking any formal role with that new entity. I am however committed to ensuring that the foundation of this new entity of sound and developed with customer voice. If I should be can confirm to do so HST is where I'm in interested in continuing my work work in partnership with employees our provider Partners mayor. Durkan her cabinet all in Partnership that will make him portent changes in people's lives here in Seattle. I believe in the work of HST in the people working here and I'm happy to be part of that team. As I look ahead for hsd I see several areas, which we can focus on should I receive your support of my nomination my vision includes 1 results HSC Investments positively impact Seattle's population. Meaning that are performance measures show impact to stewardship hsd spins the Public's money responsibly mean in the agency operates with our budget and without audit findings. 3 employee experience HST is a great place to work for our employees meeting at staff report their satisfaction through a variety of channels including the employee survey connections with the supervisor is direct feedback to the director's office and our Human Service Human Resources team. We can and must improve in this area. For innovation hsd has a modern infrastructure. Meaning its stakeholders can access the data they need And 5 Equity work to ensure racial social gender and Geographic equity in our funding Services Staffing and convenience. However, as my journey here today has shown I have never done this alone. Should I be confirmed? I look forward to partnering with you the community other departments and the employees of the human services department to continue our work to address Equity support and Community for all of Seattle. Thanks again for the opportunity to be with you and I'm prepared to answer any questions while my colleagues to weigh in here as well. Otherwise, I'll just keep going asking you questions. One of the responses that you made it to our questions was in question number 6 about how will you support the implementation of the city's race and social justice initiative. You mentioned that in your opening remarks. I'd love to have you. I have a little bit deeper into that. Sure. So, you know I mentioned in my opening remarks that it was with great intention that it came to the human services department. One of the reasons that I wanted to be here is that this city and that department embodies a very clear race and social justice initiative and strategies with in it that had not always been the case in other places. I had worked it was that framework that initiative the Deep commitment to addressing the impacts of racism and social injustice that made it very desirable for me to work with this city and with specifically with the Human Services Department. I felt that there was great alignment in values between the race and social justice initiative and the values that I hold both as a person and as a trained social worker. I have a 25-year career in this work. I have always worked in the human service sector. It is my passion to ensure that I am part of a movement that helps people and brings Equity into people's lives. And so I see very close alignment between my personal values my professional values and the values of the race in social justice initiative. Likewise it's you know, I think important first and foremost for a leader to allow space for discussions dialogue and debate about racism to occur inside of an organization. I do that. There are ample opportunities for people to enter into dialogue and to call to task when they believe that racism or the impacts of a social injustice are present in any of our policies or practices. I also have ensured that our staff are are trained and have language and and and the ability to both speak to and understand the impacts of institutional racism shared in my opening remarks that we had over 200 people go through race and social justice initiative training as and or undoing institutional racism training. We I have a deep commitment and have made a commitment to participate in our rsji change team. I meet with the change team co-leads on a monthly basis that meeting is takes place so that we can both share information but also work in Partnership about how we're going to promote rsji inside of the department. But there is a lot of work to do there is work for me to do personally. I understand that while I have certain you have studied and and training understanding. I also understand as a queer man what oppression can feel like as a white man. It is my ongoing responsibility to make sure that I am engaged with and add tables and inviting others to participate and tables that I have the opportunity to be at the show that different perspectives ideas and perspectives can be offered and always part of my decision-making and so that's how I implemented. I try to be an inclusive leader. I try to ensure that I am working collaboratively and that Where is at a diversity of perspective and experience when I make when I went to make decisions? Thank you for that answer. I'm going to ask and I know this isn't this is a tough one because we have all heard over the last few months concerns about the transparency of the process. And I know you have not been insulated from some of the concerns and complaints that we and the council have heard and I really want to give you an opportunity to address that if you choose that what do you think about the hiring process and whether or not there have been people who have been left out intentionally or otherwise weather there is institutional racism. You .222 said that's that's what happened. Mostly. What I'm trying to do here. Jason is to acknowledge that this is not been easy and to give you the Chance to save you know, how you how would you move forward? How do you take your department forward? Thank you. I appreciate that question. I Yeah, this you know, when I think about this this process I I think back to when Katherine Lester asked me to be her deputy director. In that moment and after considering that offer and saying yes to her, I knew that I was making a commitment to step in to do an a different level of leadership that I was committing to backing her up in a day-to-day way sometime stepping in her place and very full and complicated schedules in that director role. I also understood that if she was to leave that position that I would either for an interim. Wharf on a permanent basis be stepping into that role and I was always preparing and again new understood that when the ask to be her Deputy was made that I was saying yes to a different level of leadership inside of the organization. When Katherine did departs and mayor durkan ask for me to service in Trump first, that was a great honor and I took that request very seriously and was excited to step into that role also felt confident that I had the tools and experiences and the support I needed to serve in that role. Mayor durkan, you know new mayor coming in and and I as a new leader and Human Services Department. We needed a. Of get to know one another to get to understand your work style to get to understand the bodies of work and to make sure that priorities were aligned. I feel like we've done that during the 10-month. That I served as interim. And there was a point in our working relationship when she asked if I would continue on in a permanent Manner and I in Susie Astic Lee said Yes again. This is this work being in the working in the Human Services sector working in the Human Services field is my career. This is my profession. This is a position that I feel like I have worked my entire career toward and so I again offered and enthusiastic affirmation of my commitment to this department and to her and in in this role as a member of her cabinet. I can't say that I also fully understand the perspective about process and the call for process, you know, many of us who were just at the table before talk about this Seattle process. And sometimes we talked about that and an endless Source Shake our heads when really what we mean is does it have to take this long? But I am someone who who does value process and likes to work collaboratively and understand that there are voices at the table and that those voices are heard and considered So there is a level of understanding. I did not watch or hear about any of the discussions that either took place in in this chamber or around the community and shake my head as something that was ridiculous or unwarranted. I heard the voices from the human services department and understood that they at the core they were feeling on heard. They were feeling like there they were that they had something that they wanted to say. They wanted some level of input into who was leading the organization that they were part of. That is now my work to do again. If I am so honored to be confirmed by this body. I will immediately step into that work. I will want to meet with those groups who have spoken before you and understand make sure that I understand their perspective make sure that we can find common ground and a means to move forward. I work. I'm very rarely work as an individual. I really enjoy and value being part of a team and I want that team to be a cohesive. I want to make sure that folks that are are part of any team that I'm part of that they feel safe and supported and so that is the work ahead of me to make sure that that that level of understanding and that commitment to work together on the many challenges we have in front of us happens. Can you describe And you're 11 months how you have been meeting with or if you've been meeting with people other than in your within your department and outside the community other than your the immediate people that are reporting to you. Thank you. So yeah, so we have a structure that senior leadership team of this department and I meet every week we need every Tuesday for every Tuesday morning for two hours outside of that. It's really important that I or really any leader in this position be engaged with the workforce more broadly. I can't take all of my Direction all of my consideration cannot just be filtered through a senior leadership team. So I have continued many of the practices that have been in place in the human services department for years those include a floor check-ins. So the Human Services Department in the 400 employees that work there work on three floors inside of Seattle Municipal Tower. We also have an office in the central building on 3rd Avenue in downtown Seattle and an office in Renton. So it's important that there is time held and I try to keep that time fairly unstructured so that I can invite folks from each of the floors each of the satellite offices to join me in dialogue. I want to make sure that I'm keeping them updated on the work that I'm involved in and I want to make sure that I'm hearing from them about how policies and practices that I'm trying to implement are impacting. I also want to hear about how they feel they are able to make an impact in the community. I want to understand what gaps are what hardships they're having as they Implement their work. Likewise during this interim. I stood up an internal staff Advisory Group. I wanted to have a group that included a variety of classification is that whether it had an I2 diversity and that was a group of people that I could turn to and honestly work very candidly with to help guide my leadership especially during this interim. There are also other ways that we invite employees to be in communication with me and we have I have a literally an open door policy. I do my work in my office with my door wide open and people take full advantage of that just yesterday. I had a sorry day before yesterday. And yesterday I had 7 to 10 people walk in with you. Now out of a scheduled meeting to talk to me about things that they were dealing with inside of the department. I encourage that kind of open dialogue and I at every opportunity that I am engaged with employees at the human services department. I invite them to give me their feedback. I consider myself someone that listens and I encourage feedback from anyone and everyone that I work with two that end just last year. I conducted a 360. Rayshun where you know 50 folks from inside the department and outside the department gave me feedback about how I was doing as interim director that was critically important information for me. We also conducted and continued to conduct a employee survey. We do this every other year and one took place in September of 2018. That is another tool that gives me information about what the employees inside of the department need and how they're experiencing the work how they're experiencing my leadership and the leadership at the senior leadership team. So there's a variety of things variety of ways that I try to stay engaged but they're also a variety of tools that I use so that people feel like they can access me and give me feedback about the work that we're doing collectively. Thank you and appreciate being able to jump into the Q. This question is someone influenced by the fact that I have to sneak out of here to go to a lunch date youthcare's annual luncheon. And so I apologize. I'm going to get a chance to listen to as much of your answer as I can get Jason and then I'm going to have to disappear. I want to talk about the work that Human services department does with youth and families and in particular the collaboration between the department with the Department of Education in early learning under councilmember Gonzalez's leadership last year. We were able to put up into voters a very successful education Levy renewal program that a lot of the inside school time and outside. The school time is supported by nonprofits who are also class of the human services department. So we are I think very interested in how we can see continued collaboration between hsd and deal and in particular. I want to see if there are opportunities for efficiencies of scale for a lot of those providers to Think Through the application processes that they might go through with the youth and families Division and with the Department of early learning so that we might be able to avoid having a constant process where service providers are applying to funding from one pot. Money and that a plaintiff funding from a different department in a different part of pot of money to find the same kid in the same program where we also might have different outcomes that were tracking within each of those different apartments in different goals and objectives. So, can you talk to me a little bit about the work that the department does with the Department of Education Early Learning and what you might see us some opportunities for improvement for interactions with our clients and human service provider scam. Thank you. Very good question. So Dwayne and I speak regularly. Obviously, we're both on the mayor's cabinet and get an opportunity to work together in that space But it is critically important that our departments are aligned and in regular communication so that we can avoid some of the especially structural impacts that we might have on providers and people doing the work. We are you know, many of the programs and even many of the employees that are part of the Department of early learning were employees of the human services department. And so there are even very informal relationships that still exists between our two important between our two departments and there is a lot of continued collaboration and continue to work that happens due to those individuals. you know in the Short to thoughts first. We just heard a pretty detailed discussion about an important reorganization that's going to occur around addressing homelessness. That is the creation of this new entity is going to have a significant impact on the human services department and I am working right now with deputy director Burien to really start to understand what those impacts are going to be and start to ask questions about why and what investments are program areas are living inside of the human services department and some of those are in the Youth and Young adults space and so there are funds that we hold like that child care bonus finds there are bodies of work that we still do to support young people either in Early Education. War who were who are school-aged and as we go through this process of considering the future of hsd, once this new entity is stood up I will have to work very closely with Dwayne to understand and and an answer the question is this program something that the human services department should hold or should that body of work be the responsibility of the Department of Education Early Learning. So those dialogues will have to happen inside of the work when I think about the work that that the human services department is doing to support young people and the family is connected to those young people. It really centers around employment. It centers around affordability and it also centers around safety. And so as I do that work of trying to partner with DL and understand Why an investment or program area sits inside of the human services department and not into the Department of Education early learning that is the frame by which I'm going to be using one. Is it an opportunity for us to support young people moving into the workforce. So we have our our syep where we're expanding that work making it year-round making sure we support young people as they enter into the workforce and we want to make sure that that Pro level of programming is robust. We do that in partnership with a number of of departments economic development is a key partner, but deal is also a part of an important partner in that work. Affordability becomes critically important we want to make sure that the affordability mechanisms that we control are helping to support family. So we want to make sure that the utility discount program is there we want to make sure that other benefits that city of Seattle families can access are available to them. We want to make sure that there is food security for the young people that were serving and we also want to make sure that there is a strong anti-poverty strategy and work happening inside of the department and that will always rely on us working with deal with other departments to ensure that same place. And then finally, I think this is the area where there's the most intersection with deal is around Community safety. We want to make sure that this is where we serve a lot of the same individuals or families and making sure that children and youth are moving through life here in Seattle free from violence and instable save supportive communities and we have investments in that space deal does as well and it requires a really strong tie Partnerships between our two departments. Cancel my voice one. I know you said that you've got a possibly the Youth Care lunch as well. But that you need to be moving. Then you have a couple of questions schedule long before this meeting was scheduled today. So before I have a couple of questions, maybe for mr. Johnson and I'll get to them in a second. I just wanted to make some Preparatory comments of first of all to thank everybody both Human Services Department employees and community members including homeless community members themselves hundreds of home have spoken personally and committee meetings in my committee more than once some people spoke twice and also the hundreds of people who send emails and I called my office and I'm sure other offices about their concerns about how the mayor was approaching this question of the Leadership off a very important department and I think the line all of this is not just a question of the appointment of one individual by the issues that people care about which is Homeland the homelessness crisis the exploding homelessness crisis, The Chronic underfunding of these services and hands pitting one service provider versus another service provider everybody struggling to get punished for their service. Ultimately everybody suffering because we don't have enough fordable housing and we don't have enough money for services either. So I just wanted to underline that that's at the root of all of this and as I said many times before I think the ultimately the box tops with elected officials get elected officials, but how about the power and the responsibility? So I want to make it clear it's not about anyone executive member old executive leadership in the department also have responsibilities and ultimately you have to also decide to follow your conscience. I mean officially you fall you have Do you report the mayor's office which is clearly understand the chain of command by the same time. I think what community members have said what I mean the sentiment that's being reflected is that they want the leadership to do do the right thing in the face of the deep inequality in this the prices and I really really want to do I give my tanks right dude and congratulations is a to homeless community members who spoke up courageously communities of color who spoke up project should make a special mention of the employees of the human services department who spoke because I think it is we have to recognize how much calories it takes for workers to speak up against their leadership and may not be against any given individual but against the direction of the leadership that takes tremendous courage and there is always a fear of retaliation. So, you know, I I don't know where other elected official stand on this issue, but I wanted to make clear to all of you some of you who are here in this chair. There's been so many of you who spoke earlier. So please convey my thanks and gratitude to them. Especially thank Denis Crown Bell today of the silence Breakers and Gina battery of the silence Breakers who spoke today despite the fact that this is not the me that this is not the kind of public meeting which Foster's that kind of mean. It's intimidating speak to have to say it is really unfortunate that the mayor in in our press conference chose to characterize the meetings by hundreds of employees took the courage in your hand and spoke openly that she characterize those meetings a circus like that is deeply unfortunate. I think that does not really reflect as any kind of real leadership and I think mr. Johnson you did a good thing today by I mean just about over his what you said is that you watch those meetings, but you didn't dismiss them and I'm And thank you for articulating that but of course the fact that you didn't dismiss have to also show up in your actions. So my first question is on on the on the employee surveys and I'm going to ask the questions the way I had sent them but not the way they reached you so. I just want to acknowledge. I just not going to be the exact wording that that council member questions of each doing. Employee survey results and I'm I hope at least employees of obviously, you know, you know the results of the survey that you all participated in and hopefully members of the public have also seen it. If not, please go to my accounts of website and and look for them and the employee survey results have shown. Precipitous collapse in human services department employees confidence in management and I don't know what statistically whether it is accurate to hold you single-handedly responsible. I don't think that it would be accurate in general but leaving that aside and not not don't not implying anything about your responsibilities are not my question is what would role do you think Human Service employees should have ended our meeting the direction of the department and Also, what do you think is I mean just genuinely speaking again. This is again, I'll show you know it going what Denise John Bell said. How do you see the department moving for Words given the results of the survey these are not mine are indications. I think no matter which side you're on on this appointment. You have to acknowledge and so it's a serious question. I asked for to you as somebody who was probably now going to adopt or men leadership. How do you see the department moving forward on this and a and how do you expect to address? What what was clearly a crisis and I want going to the crisis of the reflected in the survey. And then let me actually going to go ahead and also say another thing I was going to say later, but you know, it's part of this question just to highlight that in addition to the employee survey results that were recently revealed during the part-time when the the nomination process came to the city council and came to my committee 130 of your employees employees in the human services department under and 30 members of Protech 17, which is. Union Local that represents at least half of the employees in the department 130 of those members signed a petition circulated by the union of jacked into your nomination by the mayor without Community engagement. So I think the survey results the petition of membership at all of this reflects a difficult situation that the department design and how do you see in terms of the leadership role moving forward? Thanks for the question. The survey is a tool I believe in important tool that helps to convey information. I chew leadership and to the rest of the department to other employees about what the experience of working in the human services department is like we saw in the survey that there are issues around communication recognition of work as well as rsj that came to the top. Grayson social justice the 2018 survey, you know what reflects all of this and it provides us the opportunity to acknowledge our challenges and start working on Solutions. And that is exactly how I intended to use this survey no matter the results. I believe that are similar to 2014 when the survey was conducted that the immense change that has occurred inside of this department has an impact on how satisfied employees are with their work 2016 score in 2018 score. Also to me as an indicator that there was substantial change occurring there was a brand new mayor. Brand new department head and there was some reorganizing that happened inside of the department in 2016. That was a. Of great stability. That was a. We're both the administration the department and the organization itself had a a level of stability intact and then again in 2018. There was another level of a great instability a change in the mayor a change in the department director and the signal of great, you know, again reorganization that was going to occur inside of the department. I'm not saying that those are excuses but they are part of the reality when I look at this data when I look at this survey that I have to take into consideration, it begs the question of me of how can I best support a team of professionals through great change the change. Is going to occur there are going to be anxieties. How can I as a leader help support them in the right way. But it also you know, it gives me especially as I hope to be made permanent director in the space and Lead this team for many years. It gives me Baseline data Baseline understanding understand what things I need to work on. So I need to improve communication. I need to make sure that communication is happening more than what's occurring now. I've gotten a lot of feedback that I send too much email and people want to hear my voice. They want to hear from me personally. I'm so I need to create more opportunities to do that. I have heard that the practice of floor check in and of having, you know, the regular Huddle's that occur inside of the divisions are something that people enjoy. I need to make more time for that. And so I've committed to upholding different kinds of forums we have in the past used brown bags are lunch-and-learns as a way to engage with one another and I want I want to participate in more of those but I think more importantly I've heard very clearly from the employees and Human Services Department that there is going to need to be AAA some real intentional healing that will need to take place. There will need to be some probably facilitated mechanism that happened some event that where we can come together and have common understanding of what we desire you asked. How do what role do I see employees playing in the direction Department? I see them playing a significant role. I want their input. I want to understand where they want me to leave them and we can only do that with with better communication the other element on the survey with recognition. We have ways of formally recognizing staff. We have an end-of-year Max towards we do try to highlight when staff are part of successful efforts. Deputy Mayor mostly is joining me in that effort in when he sees work highlighted to our weekly report. He gets a new ball a personal email. I write personal cards to employees all the time thanking them for their efforts thanking them for their service, but there's got to be more and I don't want to pretend that I have the answer to that. I need to engage with staff and find out from them. How do you want to be recognized? How do you want to be recognized in this really difficult work work that? We're working to undo crate and justices we're working with people who are suffering and so it may not be a lunch a party and a word a certificate it maybe some other kind of recognition that is needed by employees and I need to lean in and determine what that what that's going to be and I can only do that in partnership with the employees. Thank you for that. I think you've got another question. Thank you so much. I appreciate the understanding. So I'll just go ahead and ask it and then Consumers may want to follow up on the other questions in December the human services department send Cheryl a one-year contract for 2019 less than a week after a homeless people from Cheryl Wheeler Nicholasville testified against the mayor's nomination for the leadership of the department that their contract was taught by six months with what I think and what many community members feel was a very thin explanation for why that happened there was no new RFP issued. So I just wonder how do you think this will impact or should impact Human Service Providers trust and not just you but in the department and clearly the directors come from the mayor's office. I understand. But also even if it was I mean many many community members have said that it felt like retaliation Cheryl Wheeler Nicholasville members themselves have I felt like valuation but regardless of whether it was or not. It's not clear why these services that are clearly providing a Lifeline for a lot of people who would otherwise have little to nothing. Why is it that we continue nickel-and-diming those services? And do you envision that under your leadership Human Service Department could have a different approach. So should we contract with Catholic community services on behalf of the shelter programs operated by Cher will and I just want to acknowledge that share wheel has made progress in 20 did make progress in 2018 in regard to their exits to permanent housing but at a point in time when we did have the r p i m State applied at the end of of of of 2017 to be awarded funding they were not selected for funding those funding decision. So it's really difficult complicated funding decisions are not made by me alone. They are not made by the human services department alone in this Pathways home or homeless investment are Peak. We engage dozens of stakeholders to help us make these difficult decisions and the share wheel Catholic community services and to share wheel shelters. We're not selected for funding through that very thorough RFP process. I in partnership with the mayor's office identified six months of bridge funding it seemed too irresponsible to immediately on January 1 cut ties with an organization that was providing a roof overhead for hundreds of individuals. So I wanted to make sure that it wasn't just a month or three months that he was a half-year bridge to be able to offer some transition for the individual staying in their shelters this body continue to find that for an entire year and day and continue to put money into the budget to keep those shelter programs hole. I want to address this issue of retaliation directly. This is in no way a retaliation for anything that has been said inside of this chamber have commented many times today. And another space is that I welcome feedback and if there is something that our department or I personally am doing that interrupts services for vulnerable populations. I want to know about it. And so again, I this is this is this was not a retaliatory effort likewise. It wasn't an isolated effort. We you know, because Cher we all through the Sharpie I was not selected. We are going to pay careful attention to how this program is performing again. We're seeing improvements. We want to continue to support this this programming continue to improve But there are still issues especially issues of data quality and we met with their share wheel organization. Just this week. We went through a very clear performance Improvement plan. We enter into these performance Improvement plans with many organizations. This is again is not an isolated issue. We have performance plans in place from many organizations Abdul hallermann from Catholic community services was familiar with the performance Improvement plan in the elements that we put into that plan that we conveyed to to share wheel and we are going to do everything we can to be able to enter into that second six-month contract. We are not trying to use this as a tool to the Phantom and we are in fact trying to use it as a tool and a way to engage with them to help them continue to improve and and and continue to help Provide safety overnight safety for hundreds of individuals would like to follow up on that and I think council members Gators got a question as well. My experience may be different from others, but my experience with sheer will has been good and it has been good for close to 15 years and what I mean by that is that I have I have visited the shelter's I visited when they are putting up encampments on faith institutions and I've been very impressed with their self management my again I'm saying from my experience. What I have seen is that people have a dignified place to live. I am hearing from others that that's not the case. I'm hearing that they said some people within those shelters are within the tiny home Villages feel oppressed or required to do things that they don't feel comfortable doing. I don't know where the Truth live to Jason and Maybe you can tell us what you know about that and how we move forward because what I do believe is that your will is offering something that others don't in terms of places for people to go overnight where we can just get them off the get people into something warm and stable is contrasted to leaving them on the streets. Yeah, I didn't hear a specific question in your comments. But I think I do have a response first. I want to State clearly that I don't have a bias for or against chair wheel what I do have a bias for his performance and stewardship. I want to make sure that in my role as as head of Human Services Department that we are making sure that the taxpayer Investments are being made in organizations that are working and in addressing homelessness. Whether it's the city the county all home, we are all trying to put oars in the water pointed the same direction and making sure that people exit homelessness and enter into permanent housing. And so right now that is the measure by which I am gauging performance and in my stewardship roll able to analyze whether or not the investment is successful. So I do have a bias there and I think like I said the Catholic community services in partnership with a sheer will organization is showing Improvement in that area, and I hope that it continues I also want to state that we know by standing up more enhance shelter last year that enhance shelters meaning shelters that are that have Services attached to them services that help direct people toward housing are five times more successful in providing per minute. How is providing a permanent housing placement for individuals than basic overnight shelter? that is not a judgment statement against overnight shelter overnight shelter serves an important role and provides life-saving roof over head overnight to hundreds of individuals in this community, but it is in my opinion through case management that the successes and enhance shelter happening. It is through that engagement that happens by case managers with individuals that is helping us see that through put out of homelessness in in Department of Housing and our expectation is a case management is present in our shelter programs and that it is an important we believe is an important role in making sure that the issues and needs of individuals experiencing homelessness or matt. So that's what's been very clear. Not just through this process and most recently working with a number of our muni court judges is that everybody says we need more places for people to go that really to address homelessness. The obvious thing to do is provide more housing to have more housing available for all economic levels. So, The worried that I have around chair wheel is that if they don't continue that don't have places for people to go. So, how do we coordinate with the office of housing with every other organization that is doing this to expand fast the number of places where people can go this is the pipeline question. I make a comment text work. So this is a confirmation process and that is the agenda of the day. It seems to me that this conversation about sure will an organization have tremendous respect and and thankfulness for what they do. Is it committee discussion that's what it seems to me. Now we can ask the directors of views on this. I have such a policy viewing that actually who's making decisions weather's coming from you and your staff for the mayor's office, which I think would be kind of course the executive but I think we need to Daylight that process so because I'm hearing you I'm hearing you say that you don't make the decisions it sort of It's a lot of Staff working a lot of evaluative work. But I'm also heard I think during the service and drink some of my disgust with the employees that the mayor's office sometimes makes decisions. I don't know what the truth is somewhere in the middle. But the my bottom line is this discussion about sure will that again and I'll Stand in relation to me is committee work. So in all due respect to the chair, I'm not sure why we're doing a deep dive on that issue right now cuz I have confirmation questions. I'd like to take to get out. So, you know, this is a fundamental question that is going to continue to come up. Maybe you could just so the masculine form of a question OK or will Is it staff is at the mayor's office at you? How did these decisions come about? Yep, it's all of the above. So there is a really sound team inside of the home of strategy and investment division that works on Contracting for millions of dollars in contracts to address homelessness. They contract with Catholic community services and the share will shelters is one such contract that is closely monitored and closely watched. Like I said, their performance Improvement plans in place related to many contracts and that that level of dialogue about how a contract is performing and whether or not there are technical assistance that our department can offer is a discussion that happens between The staff as part of the contracts unit and their director in this case is Tiffany Washington deputy director of homelessness inside of hsd those discussions do not happen in isolation. We work I work for the mayor's office. We all do that role is very clear. And so there is a lot of Engagement about what is occurring what is occurring with our investments what's occurred with our providers? What did they need? What is the action or next steps that we're recommending? We do that in close partnership and close dialog with the mayor's office. But those kind of you know performance contractual decisions happen at the staff level. Of course, they're run up through me. And of course I flagged him for the mayor's office to make sure that everyone is aware of what's happening but contractual discussions How and when a contractor's put on a performance Improvement plan happens at the division level happens at the staff level. Thank you, man. I'm so sorry baby. That's little time to sorry. I know this is this is our initial confirmation hearing on this and there will be more confirmation hearings and I just want to say a couple things one is I know that chair back. So you've put out a schedule for us to consider this confirmation. I just want to flag that they're in my view may be a need to amend that particular schedule any event that we don't get all of the information that we have requested from the nominee in time. And in the event that we we don't have enough space in these committee hearings actually follow up on those written responses and and ask follow-up questions. It's already close to noon at we started at 9:30. And I do feel that already. We haven't had enough time to have this discussion with with a nominee and so just wanted to fly that as a process concern before we adjourn today, but but my follow up specifically to the line of questioning that was being pursued by council president Harrell is really around a concept of Independence and I want to hear from you mister Johnson what your views are from a principal perspective in terms of your role as the potential director permit director of hsd and how you view Independence in your decisions as a subject matter expert and as a manager of these Investments weather is homelessness, you know. Since we make in the space to end gender-based violence, which we have not spent a lot of time talking about Making sure that we are meeting the needs of aging and a folks who have disabilities in our city. And of course the other thing that is really important to me that reducing Youth and Family Violence in our communities. And so I think it's really important for us to acknowledge that city council members who sit up here on this diet by us many of us are not subject matter experts in any of those areas of business that the human services department likewise. Most of the people in the mayor's office are also not subject matter experts in those particular lines of work. No offense, but I'm not I don't think you have a social worker degree nor do I and so I think it's really important for us to have somebody leading this department who understands that by nature and by structure the mayor's office and the city council are political creature. And as a result, we need to have a leader in this department who is willing to stand their ground and to deploy evidence-based strategies that are not going to be subject to undue political influence. I don't care what your Ben is on her what your perspective is at the end of the day it is about making sure that people can thrive in our community and I am less interested in who gets credit for that and more interested in actually getting the work done so that we can end human suffering on our streets. And so I want to hear from you what your perspective is as it relates to the big diatribe. I just gave you but really what does it mean to you to be independent and to be the leader of an agency who is responsible for deploying their subject matter expertise in a manner that allows every member in our community to thrive. Thank you. Really? Good question. I think that we just recently had a leaders Retreat where we were talking about values and we were trying to understand how our personal values align to the work that we're doing and a value that came up for me was one around autonomy and it is difficult to have autonomy in this environment. I rarely get the opportunity to fully and in isolation myself Jason make a decision that is there's a decision making process that typically involves a lot of people and a lot of perspectives but I bring perspective as well. I am a seasoned Human Service professional. I'm a social worker. I care very deeply about the people that are served by our investments and our Direct Services and I bring that. Expertise in two rooms with me every day. So whether it is having to enter into a debate with internally with the senior leadership team whether it is in my one-on-ones with Jeff Edom are mostly and bringing perspective asking tough questions about policies. I try to live as independently as I can meaning that I bring my expertise with me everywhere I am You know Mark Jones was at the table earlier and in the short time that I've known Mark I've learned a great deal from him. But I've also learned that there is a lot that we have in common and one core value there is around being person centered. I want to know that the things that we're doing are working for people who need the services that we provide again. I stated that I had a biased toward performance. I need to know that the things that we're doing every bit of energy that we are placing into our work is going to have a positive impact on the people that were serving. So I see my role as an independent meaning that I get to bring my expertise in two rooms. I have the opportunity to be a tables to be part of making important decisions and I want to make sure that my expertise might Raining and my long many Lessons Learned through a 25 + your career or ever present. I think I think really what I'm trying to get at is, you know, I'd like to get an understanding of of What are you going to do when you're being pressured to do something that you don't think the city should be doing? How do you stand up to that level of power? Whether it's coming from a city council member or whether it's coming from somebody on the leadership team or whether it's coming from the mayor directly? Yeah, Joe. What I try to do in my work on an ongoing basis is providing options. And those are not always providing options to literally layout options. But to show that if you do this, this is the impact if you do this, this is the impact if you do, this is Stamp Act and I always get a recommendation. So I always have a point of view. I always have a place that I want to go. But if you're asking if I have to have it my way or the highway, I don't know that that is A reality that that that would work very well inside of a political environment. And so I have learned how to press my again seasoned opinion and learned how to make sure that my opinion and the best path forward from my perspective is ever-present but there are times when there are times when you lose the battle there are times that politics win and I will need to be really clear as a leader of this organization what I think the impacts of that are going to be and then start planning for 4 that end result but it is I believe my responsibility and my duty to bring into the room bring to the table what I believe to be right for individuals that were serving and to the extent of can I hold to that opinion. Thank you present here. A couple questions are actually out now in Gonzales has questions which were followed. By the way first what I really appreciate you being here and for those folks that were wondering why we either shifted committees or why we're still doing this confirmation process. It is precisely because this is how it should look cute. This is not a rubber stamp process that we are subjecting you to both written and verbal questions really gets at the core of who you are. And are you capable of leading this organization to segue into the point that Cash America Silas and I are making is that you do have a boss. We understand that you can't pound your fist and say my way or the highway cuz it's likely to be the highway. I think we understand that but on the other hand, what we look for is a council we because of the separation of government. We may have different policy objective. Strategies and budget power than the executive any executive not just this current executive. And so what we look for is something perhaps differently we look for someone that will say look you all are lawyer. I'm a social worker. I know the stuff I live this stuff and I have to listen to all these folks and so it gets the leadership style because one of the criticisms that have been launched thus far in this process, it is really just begun. I mean, there's some preliminary work down at the committee level was that you weren't as forceful or as aggressive in terms of your vision and the Department's Vision Visa V the the mayor's and so I don't know where that was based on reality or not. But now you are openly saying your leadership style. And so again, that's part of the process and so let me ask a few questions. You talked a little bit about recognizing Your Privilege and recognizing your your personal story which by the way is very touching. You are clearly succeeding two women and two after American women who were in that position prior to you with a recognition that your department probably serves more than any other department people that have been directly impacted negatively by institutional racism and discrimination you deal with people that for whatever reason desperately need our services and our sense of empowerment trying to help them. Did did it ever come up in the process that you recognized the props you are privileged in that position you would say and perhaps the deputy American answer this question as well, you know, just like in the police department search perhaps we should open it up perhaps I want to demonstrate that. I am the best person for this job. Based on who I am and I will prove to everyone that I am most qualified because perhaps I am still benefiting from some of the Privileges that I have did this kind of conversation come about and I'm not saying it should or should not have I just want to get a feel for the sort of the elephant in the room and that is how it hits her to come about and I think you in your person for a recognize the Privileges that you you did have. So I'll let you at the dress that Puts the question. When did you understand my question? I think so. If you didn't say it shorter. Yeah, you're essentially as you're essentially asking. What privilege what privilege I understand and the impact of that privilege in this current process will okay. Thanks for clarifying cuz it that's sort of it. Did it ever occur to you that you could have received privileges by virtue of who you are you told your story in this exact moment in time and did it ever occur to you to say wait a minute, you know, that's really take a look at this. This this department is so important work or showing Department that I'd I'd be willing to compete against other folks it did that come about quite candidly that's part of the concern over keep hearing over and over that you are beneficiary of an I want to know how that I wasn't part of any of that and now I'm being unfairly. I think not me personally counts as being unfair to criticize just rubber-stamping a process that we weren't part of so I want to know how that it's her to come about 10 did that recognition ever to take place in and how you process this Thanks for clarifying so first. I agree. I fully acknowledge the privilege that I walk through life here in this country with I you know Katherine Lester brought me to this organization. She and I worked very closely together for nearly five years, and she and I had a good partnership a trusting partnership and a really solid sound work relationship. I was really saddened when she resigned. I felt like there was a sympatico that existed between us that I trusted her. She trusted me and I felt like we were a good partnership when she resigned and was talking about next steps and you know offering her full confidence in my abilities to the two to Mayor durkan she and I had a really difficult conversation and one that sad Mean to the core because she felt that looking back at her experience in this position in this very chamber that I was going to have a much easier time than she did. She knew that she knew that I as a white man was going to be able to move through this work in a way that was very difficult for her. We acknowledge that that was likely true. And there are there have been meetings where I have reflected on that and thought you know what this would have been really difficult for Katherine to persuade this group in the way that I just did and so I acknowledge fully that there are privileges that come with my skin color. I also acknowledge. There's privilege that comes from being male even being male and a female dominated sector like human services and show I acknowledge that I have to check that all the time. And make sure that I am working in partnership with people and working arm-in-arm with others. And so I I rely on my senior leadership team that is 100% female team majority people of color team and they know and have an expectation that I will so my white male privilege in check. So I'm going to start writing it because this is not this the initial meeting, so I'm not going to solve cancel this one meeting here and I want to save it. So here is a challenge I have I hear you in the acknowledged in the Privileges I have privileges to again. We all have that philosophy that I sometimes lose in this debate. I I I I hear you acknowledging that. But acknowledging that and sometimes saying and because of that I'm willing to do something else is sometimes a Quantum Leap. I was very clear that I was willing to go through any process absolutely any process to continue in this position and I let me make it clear. I'm not advocating for that. I want to know who you are and how you respond to my inquiries. I look for a department head is a confirmation process. I'm trying to get to know who you are. Basically what your values are. So I'm going to try to I'm going to meet us some questions out and then I just want you to think about you don't have to answer them today. I don't want you to answer them today. And then in the next confirmation process you could respond in between then and now I do plan on meeting with a lot of The Advisory Group to staff advisor group and their race and social justice Equity saving the employees and and those it want to really chat about it so I can get a rich information and I like you to know what these conversations are. I would have to do with all the TVs running. I mean that's that's not how I want to get this done right now in terms of getting feedback and giving you feedback. I want to get you a real good place in the place going to be having a strong director in place and so my questions that I want you to think about our When we had two African American women in charge of the organization's Jeanette Smith and Miss Lester, it wasn't an easy Road for them at all times. In fact, it was a very difficult Road. And so one of my questions will be when they were in that very difficult Road. What kinds of things did you do? If anything to help uplift them and help support them. That's a question. I have another question I have is the staff Advisory Group. What kind of feedback did they give you? What were they at? What what kinds of what did you hear? And what did you do about it? If a piece of it is I read your answers on that you meeting with the RSG. I change team and meeting with them assume that was you and not designate assume you're physically meeting with them that I'm okay and the people doing a kind of work in your department. They have full-time jobs. This is like our department. This is something they chose to do should have I don't stay on the side but serve on the site, right? This is not there full-time job, correct when I'm tryna see given the fact that the IRS GI issues or so. Important in your organization. Is there any creativity that we should consider whether I was thinking like a an equity officer a chief Equity officer in Orange Julius or something like that given the issues of the surface during the employee survey and and during his confirmation process it rather than just business as usual might want to think about how we double down on this issue since it is come up in your confirmation show more to talk about on that and so it again because this is the last thing you can hear from me today cuz I'm getting a little hungry is I want to thank all of you for subjecting yourself to this kind of confirmation process. It is not a rubber stamp process. It means a lot you've been doing this kind of work your story is very impressive. But we also want to hear from the other folks to do have concerns because this is our shot was only three of us left. Now. This is our shot to really weigh in on department has is this process itself, so I want to thank you for that. Thank you cheer for Of course, I can't remember mosquito. Thank you. Madam. Chair that I had our Council colleagues have asked today and I appreciate the opportunity to have more robust conversation and this meeting and in future meetings as we consider not just a response of today's a partially some of the responses that I'm hoping that you'll go home and think on and maybe get back to us on there's two documents. I would love to have one is the 360 evaluation and the second is the employee survey in what I'm hoping not only to see in those documents. But in response to the questions that have been asked today is some true concrete understanding of what you like to see changed. So I heard a lot about the systems that use engaged in the open door policy that you have the willingness to sit down with Oaks and be open to feedback. But I think what we're asking for is a better understanding of How that information how the response from those two surveys how the process that you have gone through in the last few months with this confirmation process has actually influence your thoughts about what policies need to change. It's obviously a relationship that needs to build trust. You said that there needs to be some I think reconciliation that you would desire if you were to get this role, but in order for us to fully understand what policies you would like to put into place. I need to hear more than you're going to send less emails that you're going to do additional brown bags that you are understanding that there needs to be internal healing. I hear you on those things. I think that's a good for a start button from the policy changes how to make sure that folks get recognized how to make sure people get hurt how to make sure that the systems or the perception of chronic intimidation or harassed. Especially by women and people of color and folks it was in the change team in the silence Breakers that they feel not only heard but that there's two policy changes. Those are some of the things that I like to hear from you and then I'll just have to know how to do this again having reflect a little bit more on how not just you as an individual and I appreciate you recognizing the privilege that comes with being white and being male, but it's the power Dynamic that I think a lot of us are interested in hearing more about you recognizing and taking into consideration as you think about the change in internal systems and policies because that position that you're holding now, it takes a lot of Courage for folks to either come into that open door or to those brown bags and we've acknowledged the courage that it takes for people to speak up here and he are hearings but I think that they're not doing so to be spiteful right? It's it takes a lot of Courage to come forward and talk about what they're experiencing. So recognizing not just you the individual and the privileged that you may have compared to other populations and also recognizing the Discrimination you as an individual also have face, but the power that you now have and that power dynamics that we are hoping to break down in the system that clearly has underscored to ask that workers feel intimidated or harass or at least not heard or respected in some ways. Those are the systems changes that I'm hoping to hear from a director in terms of what your vision is for the Department in Spanish. I think I'll hold my questions specific to metrics and accountability and the ways in which I would like to see our internal Department of being held to the same standards as the external Partners in which we partner with Jennifer example, we've had a lot of conversations about how we could apply similar metrics to our own navigation team and they can share of dollars are being tracked down so that we can report Appropriately some of those internal metric questions, I think our little bit more in the weeds then what where we're at today, but that's what I'd love to follow up with you on recognizing that were 20 minutes over remember, how do you want to proceed without you had like many questions in that conversation. Do you want to issue a few more questions? I'd be happy Johnson. I do recognize a lot of the questions that we've already submitted. I think that there's been a number of questions also put on the table today that I'm sure I'm happy to also share with you the eight questions that I wrote down specifically today that we didn't get a chance to ask directly but would love to have those questions asked directly at a future meeting before moving forward. OK. I think what would be appropriate let's let's do those in advance so that Jason has an opportunity to respond. So I want to say first of all thank you. You've been here for a long time sitting at the table, and I also want to ignore. That it's been a real pleasure for me working with you. I'm in when I was chairing the committee you and Kathryn would be in as a tag team and I was always very impressed at how you supported her and worked as a team. So just for the record if there's been any doubt, it's been a real pleasure for me to have that opportunity working with you and I'm really glad she supported you as her recommendation for her successor because I think you've learned that we have a lot of more questions obviously up here before a final decision is made but I do want to just express my thanks to you. So since it is 12:21, and I think many of us have other meetings were trying to get to I'm going to suggest that we adjourn this meeting and that if you have other questions call likes that we get them to Jason before April 12th meeting. Spray can thank you for being here Deputy Mayor. Mostly. Thanks for being here with us Jeff Sims. Thank you for all your hard work and I appreciate Alison what you've done here at the table all of you veneer today many. Thanks, the meeting's adjourned.", "end_time": 10262.0}]}