{"format": "raw", "annotations": [], "confidence": 0.9245654234558728, "data": [{"start_time": 0, "text": "Okay. Good afternoon. Good afternoon everybody. Thank you for being here in City Hall. Thank you for being here in City Hall the June 24th, 2019 meeting of the Seattle City council come to order 2:00 p.m. On Bruce Road Prison the council the clerk. Please call the roll bag John herbal Juarez O'Brien president Harrell. There's no objection today's introduction refer calendar be adopted. However, I would like to say if there's no objection. The council is relating to the circulation of a council bill for introduction on the preceding business day will be suspended and so we can hear from council member O'Brien on the matter so counts membrane you have a floor great. Thank you, I appreciate you suspending the rules and Collies. I apologize for not circulating this bill by the 5 p.m. Deadline on Friday, but I would like to move to amend the proposed introduction referral calendar by introducing Council Bill one 19558 entitled an ordinance relating to city streets changing the name of the designated Festival Street portion of East anyway between Broadway East and 10th Avenue East to East Barbara Bailey way and superseding the relevant portions of ordinance 4044 ordinance 8991049102981 and any other To the extent inconsistent and by referring it to the city council, is there a second has been moved and seconded to am in the proposed injection Pro Camera state of I cancel all those in favor. Say aye aye opposed the eyes have it. So our interaction for a calendar is a minute all those in favor of adopting the introduction referral calendar as a minute, please go die. I opposed the eyes have it. It is amended. There's no objection. Today's agenda will be adopted. Interjection today's agenda is adopted the Menace of the June 17th. 2019 City Council meetings have been review meeting have been reviewed and if there's no objections I will sign it. the minutes Are hereby signs? Thank you ma'am Clerk. Presentations we have two very exciting presentations. I think many of you are not here to see me sign those boring minutes, so I can't remember her. But will you lead us on our first presentation? Thank you. I'm so I have a presentation honoring the Seattle Channel 4 winning five Regional Emmy Awards. I've Proclamation identifying the programs that received the awards and talking a bit about our love for the Seattle Channel. We have a number of Staff members here from from the Seattle Channel, but before general manager Shannon Gigi make some remarks. I was wondering if I could read the proclamation by the mayor in Seattle City council honoring the Seattle Channel 4 winning five Northwest Emmy Awards. Waz Seattle channel the city's award-winning Municipal TV station is a Cornerstone of Civic engagement from City Hall to Seattle's vibrant neighborhoods Seattle Channel helps residents connect to the city where a Seattle Channel dedicated staff is committed to producing quality content with steps and impact and telling inspiring stories that shine a spotlight on the city's history. It's evolving culture in diverse people and places where at Seattle Center was nominated for 17 Northwest Regional Emmy Awards in program categories, including environment politics and business and a crack categories of Hosting photography and editing and where is Seattle channel is recognized with five Regional Emmy Awards by the northwest chapter of the National Academy of Arts and Science on June 8th for its Arts Sports and historical cultural programming as well as an interview special and promote. promotional campaign Okay, so I have public comment in a second, so I'm going to ask that you sit down. Otherwise, I'm going to find you destructive. So I'm giving you a notice that you're being disruptive. I'm going to ask you to stop. So having said that I'm going to have her removed. Please. Please have her removed from the Corum. Thank you. Thank thank you ma'am. Thank you. now but I'm also Stop forcing, man. Please have her removed and we'll try to. Thank you, ma'am. Thank you. Thank you, ma'am. So unfortunately If you are if you cannot use Security in this case, I don't think it's appropriate. Turn off the video notices you're going to be now. Unfortunately permanently banned because you are not adhering to the instructions of a security officer. And we're going to have to shoot be removed. Okay, please have removed. Thank you for your courage in speaking. I absolutely think we do need nonviolent movement. And I know and I'm sorry. We cannot we cannot just leave her in the lurch like this. We she asked she asked for respond. So I'm saying that I stand with you as an immigrant myself another socialist and this is exactly the kind of movement. We will need movements will need for this about the routine. Otherwise, we're not going to address the climate crisis or the discrimination against immigrants which ice Okay, thank you. I would remind you that we do have public comment coming up. So. Man, would you be so kind as to accommodate the officers? There's other rules of social people don't comply with the officers instructions and stop trying to be as many as possible support using security against AIDS activists. I think she's made a very important point and they should be allowed to stay in the chambers. So so So, let me let me appreciate that the enthusiasm let me see the show you the Rules of Engagement here. So the rules that even comes members to want. I believe supported would suggest that when a person I don't condone this security officers using laying hands on anyone, but we do so it's so I try to ask not use Force, but when a person refuses to to comply with their polite instructions an officer there other rules to take place in so you'll be by No Doubt excluded from other participation Chaucer's she can stay here, but the other rules will kick in so let's proceed with the the meeting. Thank you, sir. Thanks for doing your job. Okay. Now I haven't said that should have threw my rhythm off here to see where was I? Is activist being banned from city hall because I think when comes present how to lose to be in city hall because that's exactly the kind of a movements that we need to, you know to build to support immigrant rights and to fight for climate change. You can present help I can just make it quick, please. I agree with the substance that everything the speaker said and I appreciate the content of it. But we have rules in place that we have to follow and we can simply say the rules apply to some people if we agree with you and it don't apply to other people if we disagree with you and we have very strict rules because people have been coming to this place sticking out frankly saying some awful hateful things for a long time. We've been unable to remove them if we don't act uniformly and use the rules and laws that we have and play them equally across the everyone and shows up. We start getting to a place where we discriminate the People based on whether we like they're free speech or not. And that is not a path. I want to go down and So Cal president Harrell, I appreciate your gentle tone. But I also appreciate that we have the rules of standby. I completely agree with everything that we stayed there and yet we can't have these forms turn into anybody wants to show up with it or supported or not can just stand up and scream out. We have public, coming in just a few moments where everyone can lie Stop and say their piece, and we will listen to that. Thank you, Matt. Thank you cast from Brian. So thanks for those words. Okay, council member herbold. You still have the the floor show City streaming on with Nancy guppy with its focus on Seattle's create a scene where recognized for the winning content which included inspiring look at the Special Olympics USA games a glimpse into the past with a pointed portrait of Japanese American World War 2 veterans a profile of a local man who Powers the sound behind some of the rocks of rocks biggest guitarist in a moving story of a holocaust Survivor and a trio of light-hearted marketing spots and where I Seattle Channel completed more than 625 Productions in 2018, including nearly 340 city council programs in more than 60 events with the mayor providing transparent coverage of local government and serving as an important source of information in a digital era where local news outlets play a vital role and whereas Seattle Channel and local cable Access TV stations are a vital. Part of the country's public media the channels inclusive programming Sparks informed public dialogue gives voice to the people and cultural Traditions that comprise Seattle and serves as an important platform to Showcase and share the city's diverse Arts Community now there for the city council and mayor hereby Proclaim, June 24th, 2019 to be Seattle Channel day. Thank you counselor in her bald before we suspend the rules and listen to our recipients it anyone else want to say any words on this Proclamation. If not, let's suspend the rules to hear from our guests. Thank you. Just want to say no great and produce our programming to the support of the council all of you and the mayor and our department Seattle Information Technology. Thank you. Am I cute while we aim to do high-quality work for a commitment to serve the residents of the city? I want to thank the Seattle Channel staff and contributors who work in service to the city. Some has spheres three weeks up to over 30 years. The people the Seattle Channel user use their hearts and smarts to create compelling programming. There are many who have helped us build the organization to where it is today. So I want to thank them as well. Really value our community and we tell stories and share information that reflects our city from our coverage of Council meetings, and there's press conferences and public hearings. 2R Emmy award-winning programming receive the Continuum of the service to the city was wide array of coverage both and showing the business of government and telling the detailed stories of our community. It really is all part of one thing. So, thank you for collaborating with us and supporting us in our endeavors. Thanks. Thank you. squeezed together if you can see the front of this I can see, you know, Heidi. everybody Thank you. Cancel, my Herbalife for the presentation. Thank you Channel 21 folks. Okay. Our next presentation will be council member or Brian to talk about the green New Deal and we would love to hear. We love to hear a sermon by Brian cast member and you have the floor. Thank you cancel president. I'll be brief. I want to circulate for signatures at this moment a letter from the Seattle City council Lights address to God Green in 350 Seattle regarding the green New Deal endorsement what it says, I'll just read a couple a couple parts of the letter and then I'll pass it around for signatures and we pursue the public comment the Seattle City council members name below endorse your bold vision for a green New Deal for Seattle is outlined in your green New Deal Seattle for a green New Deal endorsement letter which is attached a quote from the letter Seattle has what it takes to be a global climate leader. We have communities who've been fighting Injustice for Generations who can lead the way in showing how we take care of one another will demanding a healthy stable future for all of us. We have neighborhood striving for local resiliency. We have Industries full of workers. Increasingly asking how they can use their skills and knowledge for the public good. We have city leaders who have time and again acknowledged that the climate crisis is not just bought at the United Nations or in Washington DC its spot in one here where we live. This is the moment for all of us to come together and do what we must do what must be done for our common future. I really want to thank folks who are leading the movement locally and nationally on this and I am excited to put my signature on this and we'll pass it around for you all to have a chance to sign that too. Prison how early if I could say a few words, please. Cancel. Thank you. I just wanted to congratulate the movement led by many organizations among the few among than 350 Seattle got green indigenous Community activist. And I do know I've also signed onto the green New Deal program that you all have outlined. And it's really such a pleasure to me to see you. All many of you were also involved in the fight that we had to diversity from Wells Fargo and they're taking steps to for the public mind. No Dakota access pipeline resolution that LNG a resolution to be passed, you know l&g, but of course the fight goes on many of you are involved are still in Tacoma, but I also wanted to say in addition to all of that. Of course, we should be fighting to in a massively expand public transit make it fully electric and free at point of views by by making sure that we raised Progressive Revenue by building political courage to tax big business, but also move on the other thing that relates to carbon emissions in a big way in our city and region which is the retrofitting build residential and commercial buildings for clean energy. And but for all of this we will need resources and we do need to connect are at Green New Deal demands your taxes with tax and big business. I don't think so. Let's keep let's keep connecting this with labor issues by making sure everybody understands that the green New Deal mean tens of thousands of new clean energy unionize living wage jobs. Thank you very much. Mr. President. I want to thank Brian for bringing us forward the folks at 3:50 Seattle the folks that got green. And so many of the other community members, especially the tribal members who came out today for the press conference. I was held with Attorney General of the heat homes. As you know, today is about concretizing the city's commitment to a green New Deal and we've been trying year after year to move forward to Green environmental policies and then met with Fierce opposition much of that counts Momoa Ryan has been trying to lead on whether it's additional transit or by Flame greater density allow for folks to live in the city. We create greater opportunities for people to breathe clean air. One of the headline said that duplexes and triplexes are one of the main ways that we can help economy and a Greener environment in our neighborhood. CO2 in our area we can improve our environment and we hold leaders accountable. We can create true environmental accountability. Let's create those green living right here in Seattle. Thank you for all your leadership fraud to sign on. Thank you counselor. Just out really quickly. Want to thank everybody who is work to bring the crisis of climate change to the Forefront of local and National conversations while no single individual can do everything. It takes to address. The crisis. Each of us will have to do our part. It will take more than just action from Seattle to truly confront the scale of this problem, but as a city that has been an environmental leader in the past. I hope she had Oh Sees the green new deal as an opportunity set an example for the rest of the country in the world has the youngest member of the council a person of color. The last renter of this current council is my hope that we work together at the local state and federal level to bring the change. We need. Thank you all again for being here and for the young people that are here, please please please stay engaged stay involved. Thank you. Thank you cuz I was check off. Before we cast member badshah. Thank you again. All of you for being here. I'm council member O'Brien. You been a leader on this the entire time. We've been on the council and I'm grateful to you for your work. And I'm not very pleased to have signed this letter and also this evening. I'm going to Eastern Washington working with the association of Washington cities to try to encourage that group to sign on as well. So many. Thanks. Before I go to Publix, and I'm very pleased to announce that the letter has been signed by all nine council members. Do we need to ask everyone to be removed now or and with the the benefits of Technology counselor Gonzalez, we had an excused absence is also signed so we are in full swing here and look forward to hearing your comments. So that will move in the public comment on items that appear on our agenda for the day our introduction for a calendar. We have several sheets of signups here. So I think we have close to 40. So we're going to take it down to one minute and try to get there as many as possible so work. I'll call you out to at a time and a start here and use both mics so he could hear from as many people as possible. So, mr. David Haynes you are first Sir Richard Schwartz. If you don't mind using this microphone Mister sports or David you're in the middle of you hear David. I thought I saw you. They just suddenly okay. So Mitchell Schwartz, you're going to pass to okay. So Lydia ringer and Joe Mangan Mangan. So Lydia, are you here Lydia? Yes, man, taking a middle light, please. And then Joe. Are you here Joe Joe you mind taking this mike over here. Thank you, sir. And then the third person would be Zoe Sherman will go back to the mic are you know, no one to the middle Mike and then once we could use both mics, thank you very much. And so Lydia your first and then Joe your second and we'll go that way. Okay, go ahead for me today. Thank you so much for signing on my name is Lydia ringer. I'm a graduate of Roseville High School District 4, and it worked as a Fridays for future before I begin. I'd like to Take a moment to acknowledge the land which we are on today and the history of that land. I would also like to encourage everybody in this room to recognize how this policy will affect and benefit marginalized communities as a student growing up today and a member of the class of 2019. There is much anxiety around the climate and just listing them causes anxiety, but living them causes even more here's what we know the Arctic region. They have its first completely ice free summer by the year 2040 / 99% of the land in California is suffering from drought Earth's five warmest years on record have been in the past 5 years now I could keep going but I think you get my point and I just want to say thank you for signing this and for taking this crisis seriously thinking of you. Thank you for giving me the opportunity to testify. My name is Joe Mangan. I live in District 4 and I also recently graduated from Roosevelt High School. And I'm also an organizer of Friday's for future Seattle. I just really like to thank you all for signing on to this green new deal. But I'd also like to say that my junior year of high school. I redesign the streets around Roosevelt Wilson focus on safety and sustainability and subsequently wrote. He Transportation policy for the 46th legislative district Democratic party. I mention this because we all know Transportation accounts are more than half of Seattle's missions. So I'd like to not only thank you for signing on to this but also to ask that in any green New Deal resolution passed by the city did such a resolution would address the overwhelming of the cars in Seattle have on climate Finally just as an organizer for Friday's for future. I'd like to again. Thank you for signing on to this and for sharing the excitement of all the youth Adventure showing up every Friday and for taking action on climate says, thank you very much. Thank you. Is Zoe Zoe and then falling so is Rachel Heaton Rachel? You mind taking the other Mike we could keep going there. Thank you. I'm sorry Sherman, and I'm 13 years old. I should be in school right now, but I'm not because this is the one of the only ways that I can make a difference all of you have so much more power than that so much more. Thank you for approving the green New Deal. But we need way more than that. It's not enough. It's just a start. It's the best store that has been proposed but it's still just a start. I need all of you to take more action on climate change. I need all of you to remember the future generations and the impact that the choices we make right now have Matte black thing I would like to say is abolish ice. Hi, my name is Rachel Heaton. I am a member of the Muckleshoot tribe and I'm also a descendant of the duwamish people first. I want to raise my hands to the youth that have been coming in and being involved. That's definitely why we do this work. You guys have definitely made it easy. We came up here to ask you to sign campaign. But since you didn't I still want to raise the point that we have 29 federally recognized tribes here in the state of Washington and we are the first ones affected by this climate crisis and just that one policies are being made that we make sure that these are the individuals that are brought to the table that these are the people that you're talking to and not only that but that we are including our youth because they are the ones that are inheriting the decisions that were making today. So Seattle, let's be the leader in policy-making and let's really make those drastic changes and those changes that need to happen and they can't be just the simple focusing on what's Happening Here in the city. But what changes are happening here in the sea? That are going to trickle out of here. So, thank you. On Scott and Marie Dooley and Jonathan thinks fikre, Sean and Marie and Jonathan. Make it up here. Yes, please. Thank you. Wanted to say I reiterate the things in the gratitude that others of Express to members of the city council for adapting this resolution in particular the leadership that we seen from Council Members O'Brien's Salon mosquito. I think it's definitely the case that we often hear proposals for a green New Deal throughout the country, and we've heard them here in Seattle as well a lot of enthusiasm for the specifics of what we need to see as far as free public transit as far as a bike Lanes as far as more affordable housing or a lot of these conversations breakdown, I think is over the question of where we're actually in to get the resources to pay for these things and so often Progressive legislation at all levels of government is diffuse with the record of how you're going to pay for it. So I would like to iterate that we would also like to see a commitment to Progressive Revenue Solutions. We would like to see I'm perhaps a mansion sales tax. Perhaps the city going into debt using its bonding capacity to pay for the things that we need to see and these Revenue Solutions. I think I'm going to go to school. We need to be so that we're not only talking about what we need to see about the roadmap financially for how we're going to get there with Progressive Revenue. Thank you. My name is Emory Dooley. I'm a kidney doctor. I'm also a member of Washington physicians for social responsibility. So, you know that something that's just happening in Missouri. It's happening here. It's just why my organization today and 70 other medical groups groups announced today a call for action and our climate crisis last winter. We were barely able to cope with a flu season. There were no beds in the Puget Sound region all we need a heat wave like the one they had in Europe in 2003 that killed 35,000 people for health system to be over now. We're here because of Sandy conomic policy, and I'm glad today that's the address decided not to assume the role of triage and bandaging our current policy. Thank you for supporting the green new deal, but your decisions today, and the next few years will decide whether we stay healthy or thousands die from heat and smoke related illness. Thank you. Mosaic Jonathan following you will be Ladonna Brave Bull Allard and then Alec common. Good afternoon councilmembers. My name is Johnny fitcrew, and I'm an organizer of a dark green. I just I just wanted to reiterate what's a letter climate change threatens everything. We love from our bodies. Our families are neighborhoods are communities to Mother Earth. All of that is under attack and has been under attack for quite some time. And if that's the case everyone in this room has every single reason to raise our voices and do something about it earlier this month. Green hosted a green New Deal Town Hall last week 3:50 and got green organized a press conference in the mayor's office and we packed the Saturday. We've been talking to me and members about what a green New Deal could look like and what I can tell you about. All of those experiences is that there is incredible energy behind this campaign those things behind us because we remember that a better world is possible. And that's all I want to say. Thank you for your children. Apache wash day. My name is Ladonna Brave Bull Allard. I'm from Standing Rock. I am so honored to stand among you today. These dreams hopes seeds that we have been talking about an indigenous country since 1983 when our spiritual leaders told us to go pray. That we could make a change. I thank you for that. I thank you for divestment. I thank you for looking for the future. I want to tell you I have a great granddaughter that was born. Thank you for her future, but most of all we got to move forward now. I always help at people standing Rock was nothing more than a seed to tell the world. We have to wake up. There's no more time. There's no more time the rhetoric the talk to politics. We don't have time for it. We have to stand up. Now. We have to stand up against Injustice of the fossil-fuel industries. We have to stand up with Injustice the corporation we have to be empowered in ourselves. I don't know when it happened. But it happened when the people waited for the government's to make the decisions when it should be the people who tell the government's how we are going to live. So I thank you for taking out 401k. Thank you. for making history because Seattle has already made history and will continue to make history to be the first to stand up for our climate and our world and Indigenous Community. Thank you. Alec will be Ileana Scott Theron and then Alice green. My name is Alex and Emma organizer with 350 Seattle in Seattle for a green New Deal camping. Thank you very much for signing the letter and taking this first step with others. I do want to talk a little bit about Seattle as an environmental leader in 2001 mirror polish else had Seattle is a national leader on climate. We hear that lot that Seattle is an environmental leader in the last two years. We have data for Seattle's emissions Rules by 58000 tons. And the truth is we are nowhere near on to reach carbon neutrality even by 2050, which is too late. That's not leadership. That's failure. The truth is that if you live in South Park for the duwamish valley or Gorge time your feet times more likely to have a smaller than you live in North Seattle. If you live in South Park islamist Valley or Gorge toe you were likely to die on average 13 years earlier than if you listen to Laurelhurst, that's not environmental leadership. That's failure. Environment Seattle, can we go? We we don't have to worry about the city council like you that is supportive and we have community members like us and together we can figure out how we can actually finally let up to be calling ourselves for 18 years and be a leader on clematis moment when we need it more than ever. Thank you. Highland Indiana stream Chris esponda esponda and then Tony Mills Many of the issues we struggle to address here are ones where we can count on the moral Arc of the universe bending towards Justice the personal and individual cost of delay is real and Grievous, but we can improve working conditions build housing remedy and Justice eventually for the climate catastrophe we face is different if we fail now our children and our grandchildren will not have the opportunity to do better. So I want to add my voice to those thinking you for endorsing the green, New Deal. But words are not enough as the question was asked before public coming. What actions will you take? We need you to take both concrete steps to give all of us a hope of a livable future. And as you plan the steps, I want you to think not just about policies, but also about accountability because the legislation you craft is useless. If you do not ensure. It is followed words are not enough words are just not enough here. You also need to think about how we go about it, and whose voices are being centered too often the voices of those primarily impacted or ignored in designing and implementing policies and remedying this historic Injustice is part of building a better more sustainable future. Thank you. Thank you. Thank U City Council for the opportunity of passing. The green deal. It is an honor for me to be here. I am a DACA recipient and my family was concerned about me attending to the protest about the pipelines and fossil fuel industry and the Chase Banks the Chase Bank shutdowns with Shadow 350, but I couldn't keep quiet and I read everything that I had to be a part of it and it's an honor for me to be here. When I screen movie the the movie called black snake Killaz about Standing Rock. I bought awareness to a lot of people a lot of my family members about what happened in Standing Rock and my nephew told my sister mom. I don't want to live in that world about what happened in Standing Rock and they're living in it right now. So I have to do what I can cuz that's the that's a future generation and this green deal means a lot just how the Muslim ban Seattle was a leader to this nation and it will be because of this green deal as well again. thank you very much, but you My name is Alice. I'm with the green party of Seattle as well as I'm a labor and delivery nurse and I want a sustainable future. I thank you all for signing on to this letter and please keep in mind when you're making policy decisions because politics is supposed to be about making sound public policy decisions politics is supposed to go with policy. Not just trying to get reelected. Thank you for building positive policy. And please keep in mind the signatures that you made when you're making decisions about tree planting Transportation housing health issues homelessness. This all is impacted by our environment that we live in and We all want a sustainable future that's across party lines. Thank you. Names Tony knows I live in District 3. Thank you so much for your represented. It means a lot to finally feel like we have a voice with our government. And so I want to thank you very much for taking a step forward if it's not a popular stance with big corporations. And it's just a start but I hope that your signature is just the beginning of you moving forward in that it's not going to be lip service like so many other policies that have been promised to us. So I can thank you. Thank you very much for taking this step forward. Thank you. Trevor Linda Soriano Randy Peters senior and Jess Wallace Linda Randy and Jess My name is Linda Soriano Lummi Nation. First of all, I wanna thank you councilmember O'Brien for pushing the steel on the new green deal. I just want to briefly say that that is going to affect so much across not only Washington State, but hopefully it dumb and has a domino effect to other larger cities and they will follow what Seattle has been doing. Orcas, why is it in the news seeing whales or washing up this new green deal is going to also help that part also so that our plant life are in the water. It's all being affected. So just hands raised. Thank everyone of you. AllShare aren't you see Hamburg? You can choose people. Maybe you can cuz I'm in the tree. gift from the sea What was happening? The disaster is happening. We come here. Just say hi. Chica. I am I mean, thank you. Thank you for coming to stand with us because this is going to make a difference shrub to line. throughout the land how to Canada Alaska all over this is going to make a difference. Thank you again. I am happy to see our Warriors here. I'm sure the country. Am I support green new deal? Thank you. Remember this my name is Jess Wallach. I'm in organizer with 350 Seattle and I want to lift up the saints that have already been offered for standing with us and support of Seattle's three new deal this coming together today. This is powerful and we're ready ready to get to work with you ready for climate action of the scale of the crisis ready for solutions that are going to make our city a healthier or beautiful more just place to live for all we're ready for Seattle for New Deal. Looks, like investing in public transit for every neighborhood that we have less pollution less traffic and more options that looks like to build out of tens of thousands of units of affordable housing because climate climate can be solved with density and anti displacement that looks like the weather is a sheet of homes across the city creating thousands of good green jobs and lowering energy bills for all that. Looks like all of us coming together to do something bigger Bolder more beautiful than what Seattle has done on climate so far, we're ready and we're ready for you to work with. Thank you. Joanne Shetler Laura Lowe Bernstein Bernstein and Nancy Baron Joanne Laura and Nancy and I really am thankful that you are doing this green New Deal. I hope that the cities of Washington state follow you especially up in Everett with Boeing. I think we need to look at Boeing with all their gas at they use and hopefully that the engineer's my uncle helped design the seven to seven the seven three seven. I hope that those Engineers will start thinking about different fuels that we can use instead of the feels that we use today and I'm really thankful about the building codes as a property manager. I always am looking at different codes that needs to get done and I hope that we also can include many building codes that we can have really sustain. What kind of building products that are coming out these days? So thank you very much. I think also want to also knowledge do Amish people in the people's land that we stand on and I also just want to thank our indigenous communities that are here and the leadership that they have brought to us, and I also say down with ice as well as our concentration camps. Thank you. How many McLaren speaking on behalf of an organization? I'm all volunteers called share the cities that was asked to speak today. I would not go everything that was just said we're very honored to be included in this community push for green New Deal led by communities of color Frontline communities and Indigenous communities. We support ending all new fossil fuel infrastructure within the city limits holding a fossil fuel industry accountable like we heard earlier attorney. Pete Holmes was talking about creating the structures free app for Seattle's being a deal which means an investment vehicle and a task force. We need to urgently find the green New Deal. We heard Sean Scott talked about that earlier, which is going to be billions of dollars. This is going to take quite a lot of funds to accomplish and everyone here is inspiring and I just want to thank everyone our group knock on doors for 70 hours and talk to folks in North Seattle. Where future light rail is coming to Shoreline in 2024 and hopefully to 130th station as well at that time and Light Rail is one of our biggest Investments for the future, but we're not prepared to help people walk safely to the station. We need to make sure that happens. Nancy Nancy and that's falling Nancy will be Asuka Jax and then Dakota case Dakota. I'm Nancy Barron. I'm from District 4. I'm a retired Middle School teacher. I am going to talk about a different kind of climate change that we need the fact that Seattle Police remain employed despite lying in official report should alarm everyone in this city police statements alter the course of people's lives when citizens distrust and fear the police communities deteriorate nationally and locally the public perception of police is increasingly negative largely due to audio and visual accounts of outrageous police Behavior. Yes, the job of serving as a police man or woman is intense and difficult. The emotional requirements are extreme. Not everyone who wants to serve is going to prove suitable. We must improve the pay and working conditions for our outstanding officers and trim Those who fail to meet the standards outlined in the Seattle Police manual Title 5 number 11 employees shall be truthful and complete communication, please. I just got in rap to finish finishes. Good afternoon tricks for always allow me to be here in accepting us are intersex because unfortunately, we're not accepted by a lot of people. So appreciate being included and long are we supposed to be sour in the Forefront that we deserve to be and movements like this? A lot of people do not want to accept or acknowledge that climate change and fossil fuel Industry health issues affect us better intersex. I was born with asthma and allergies because of climate change and the fossil fuel industry. We must pass this green new deal with Progressive Revenue. I should but CEO of high school bus CDL jobs Dakota case. Teeth does yalla pops Jetta tubs? Thank you honorable relative. My name is Dakota case. I'm a warrior thing in the water thing that people staying in here is we have we have to look our children and our face and tell him that we are given given it our all for climate Justice, you know, I get to see climate crisis first-hand. I'm a fisherman. You know what you guys called treaty ride, so I called way of life you not sit there on the water and I sit there are Sam and come last and last Knight come smaller and smaller every year now, we're kind of moping and they have gross on the inside of them from the damage that Fukushima is doing to our water is in our salmon in our ways of life. So I want to thank you once again and raise my hands to you once again for taking the step and given are giving our children another day in life. That's what all this work is about as given our child in a Fighting Chance out like that clean water fresh air and Mother Earth being protected and safe. So, thank you. Thank you. Patricia Gonzalez Stacy Oaks and John Van Vaughn Lake Lahey Patricia, Stacy and Jenn. I'm Sorry Miss Patricia Gonzalez, and I'm also a child tribal member and I'm also part of our water Warriors Council my just wanted to get up here and thank all of you it's been said multiple times. But you know, I just wanted to come up here and speak from the heart and let you just leave you with a c to think about you know, as you're thinking about taking the steps forward that the leadership the human beings that hold these leadership positions across the country right now, you're going to make history and that you get to choose whether that's going to be a negative or positive whether you're going to work with the community and the people who have been fighting for this and you're going to make a positive change and you're going to help us save Mother Earth or it's going to be a negative and you're going to go down a different path and you're going to be known in history for helping us drown. And so I just want to really really iterate, you know, Mother Earth. She was never brought up to be, you know, she's never been selfish with her resources, and our one job is to take care of those resources. So I just wanted to come up here and leave that and that's what's on my heart to, you know, leave those seeds with you as you think about these decisions may that be your first thought when something new comes to you what will I go down in history for? So, thank you. Hi, my name is Stacy Oaks. I want to First also acknowledge that we stand on the stolen land of the duwamish people. And I think it's really important what a few people have said that as you move forward in this process that you really look at. How are you setting the table and who's invited right from the beginning and I think that should start with the do Amish people as well as all of the other indigenous tribes along the coastline here. I also encourage you as you start to move into this process to think what is the farthest you can go and then go way beyond that. We have a decade Maybe. Maybe what does that mean for our children? That means you go as far as you can and then go way beyond that with everything you do connected to this, please. Thank you. My name is Jan vonlane. I'm a Ballard resident and I want to thank you bro, Brian for all you've done for us and I want to thank all of you for supporting this initiative, you know, I canvassed for 1631 and every door the virtually full support and I can't I was at the solstice parade Saturday and I thank you for being called leaders and let's really make a difference. I think last name is John Johnson is old and like I just can't make it out there number 27 and there before Lucas Vargas loose Lucas is Afters old. Emily Johnston Emily Johnson Lucas Vargas all my skills to pull down when I search my handwriting. So basically the same things everybody else for our children. All we have to keep did to do is to keep doing exactly what we're doing now and we are here today because we know that if we don't forcefully break out of the fossil-fuel addicted system. We are going to lose everything on one side is the fossil fuel industry and its minions and on the other side is all of life on Earth. You would think we would have the power to do this and we do but our current system is that is absolutely suck and paralyzed and here in Washington state that has a lot to do with our taxation, of course, and we're very very much hands from but we cannot prepare for climate change nor begin to slow it down. If we don't invest in the people of Seattle and healthy affordable housing in free an electrified transit in walkable vibrant communities. Most of our emissions originated in Seattle are emissions have been rising for the last couple of years. And that is absolutely unacceptable when we know they have to fall by half in the next 11 years worldwide and we should be leaving we should not be trailing behind everybody else, whatever it cost to fix this and fix it now is less expensive than what we're going to do. If we don't do this, this is the time to be Visionary to break business as usual and to do what it takes Seattle is one of the best educated richest and most Innovative cities in the country. We can do this and we have to face Follow me to be Scott Maclay and then Matthew Lang. Thank you for allowing me to be here today. My name is Lucas. I'm a representative for UAW Local 4121 that represents academic workers at the University of Washington. Our members are frustrated at the cities in action on climate environmental justice and we're eager to contribute to the solutions. It's irresponsible for the city to waste the resources that union members have to offer and a serious moral failure not to take action. Now you're approved today is not enough to engage union members Frontline communities and Indigenous peoples absolutely essential if we're going to starve together for Equity. I study the physics of our climate and we don't have a flashy headline. We don't have clickbait. We don't have ways of getting people interested. All we have is the truth that this is a really serious crisis and it's going to take everything we have particularly the uplifting of indigenous communities to make sure that we do this equitably My name is Scott Maclay volunteer at 3:50. I retired early in order to throw myself into climate Justice work because we're falling off the cliff. We're not at the cliff. We're falling off and I want to thank you immensely for signing on in endorsing the green New Deal. I wasn't expecting that that's an amazing statement and now the hard work begins how to implement and make this happen and I want to throw up three things that just to get into your minds. There was huge press for New York saying they're going to cut their missions by 2050 are green. Your DS is 20/30. We do not have until 2050 and that's huge list. I mean saying New York's doing great is pitiful we have to act fast. The second thing is that we're looking at congestion pricing. We have to go beyond that. We have to ban cars from downtown. Maybe there's some exceptions, but we can make downtown vibrant and beautiful and the third thing is a to use and daughters are great for more density, but we have to get rid of single-family housing. We have to move density up. Thank you. Hi there. My name is Matthew Lang. And I'm here today in my capacity as a lead organizer of the transit Riders Union as well as an educator. I first want to appreciate all the work and the presents today of all the tribal leaders that are here. Green 350 Seattle all the youth that are here representing. I really appreciate all of you for coming out and taking the lead on this work. I want to talk quickly about the children that I work with. I've been teaching full summer is now through smoke season and the children that I work with the kiddos are suffering. We have to shut them indoors. They can't breathe. They are having mental health issues where they didn't before we have to do a green New Deal now, so thank you for signing on to this letter. Now. I have some action steps to take on we need to create a green New Deal task force and fund that is funded by Progressive Revenue. We must have find green zones that I take disproportionately affected communities into a fact And make sure their children do not continue to suffer from generational inequality. We must pass moratorium on all fossil fuel infrastructure and hold fossil fuel companies accountable for their damages. Please think of our children and the future of this city. Thank you. Next three speakers Ben Smith Ben Smith followed by Joel Robinson and then Brittany Bush relay been trolled and Brittany. Okay, so Ben's not here Joel Joel hear Joel following Joel is Brittany Bush filet and then JP Kennewick. Thank you counsel members for your leadership on Joel Robinson with climate Solutions. Is here in support of the green New Deal campaign for Seattle. We have been hard at work at the state policy level putting in place green new deal policies that move us toward 100% clean in the Pacific Northwest as Community start to translate the concepts of the Congressional Green New Deal resolution in the policy. We think it is essential that the shared Prosperity be front-and-center as we transition away from fossil fuels 100% clean energy bill that the legislature just passed invest in low-income communities and incentivizes family wage jobs for those workers who will be building our new new Energy Future Seattle has been a leader in establishing strong emission reduction goals and putting in place smart policies to reach them. It's time to take that to the next level and climate Solutions is here to be part of Express emergency and support for Solutions at scale. Thank you. Hello counselor. I Am Britney Bush male. I am the chair of the Seattle Seattle group and I'm here to voice our support for the screen New Deal accelerating climate change is an environmental economic health and humanitarian disaster and there is no longer time to fight it with half efforts and small policies. We need to move boldly and rapidly to advance policies that fight pollution create jobs and sent her the least representatives and most vulnerable. They are Cubs fans with got pre-approved 350 Seattle with our indigenous neighborhood neighbors and our other allies and thank the council for Anderson SC Al Green YouTube. Council thank you so much for signing on to the green New Deal day. And thank you to everybody was spoken out before I join in college like a lot of young people about 15 years ago in something that might the builders in the movement. We're constantly saying to me was sorry that we screwed this up and now you will have to fix it. My wife is 7 months pregnant and I refuse to say to my child. So sorry my generation screwed it up. You guys are going to have to fix it. And I think that's the course we're on and I hate to say that if we don't really really really go for it. I think this is a great first step. But I've also been around long enough to organize and across the Northwest that I've seen a lot of Toothless policy a lot of fantastic resolution fast and little to nothing has changed in that time. So I'm skeptical I'm hopeful and I really really Fat that my kid can benefit from the work that we're doing here today. Thank you. so our next three speakers Kathy law Huntley Lawhon Cathy or Kathy and then Lipa Rossi you light sleeper and then Jesse Simpson. Hello counselor. I'm actually from Tacoma and I live in the sound of the LNG plant I'm so I've learned what fracking is I've learned what 86 times the destructive power of CO2 is I think thank you for what you've done and taking this issue up in front of your Council here. We need to understand a few things William Barr stepped off the board of Dominion Energy in January. This year probably still has her stock. That's what he's doing there. As far as what's going on the Strait of Hormuz with Iran 25% of the LNG and that is in the world goes through the Straits. There's a huge clot in the US and that probably explains why there's a powerful in The Straits to just try to stop that traffic slowdown that traffic so maybe the l&g market can be saved in the US but I think it's too far gone now because people get it now, even though the local media doesn't seem to know the members of the local media. What the hell is going on? So so when that that's the reality and young man. We had some idea and we should have been more Curious and we should have worked harder or so. We are out. Until this until it's turned around. Now these fossil fuels companies have to be stopped. My name is Jeff. I will start studying environmental policy at you done this fall and I volunteer with several organizations including 350, Seattle. Thank you for signing up for the green New Deal. Every day that passes where we as a city and a society postponed pulled all encompassing climate action. I grieve for the thousands of species of wildlife that are dying because of our inaction agree for the children who will grow up thinking. Choking and smoke every Summers normal. I grieve for the communities that have no choice but to suffer from asthma and cancer because of the proximity of to fossil fuel infrastructure. We must remember that we do what we do in the next 6 to 12 months dick taste our survival in the next 10, 20 30 years after all we have ten years to decreasing emissions by more than 50% You have a mere chance to a future so we have to start today not in a month not in a week. But today the second we sign the green new deal. Thank you. I'm Jessica Simpson. I volunteer with share the cities and the Capitol Hill renter initiative both groups signed on to this petition for the green New Deal for Seattle and thank you very much for all of you signing on to it. I heard you though. It's a turn this into a reality to find the funding for Progressive means to get Seattle's fossil fuel to eliminate fossil fuel usage in Seattle. That means Transportation means Heating in both residential and commercial buildings this going to take billions of dollars, and it's not enough just to sign a resolution and all talk about Kumbaya, but we need to identify like a real plan for eliminating fossil fuel usage in the next decade in Seattle. Thank you very much. Thank you. Black black S2 speakers. I have sign up our gym Bethel and then Megan Murphy Jim and Megan is Jim here. Jim Bernthal I live in 2nd District and I am a volunteer and activists with 350 Seattle to your club and a number of other groups are really pulling together to make this happen. I think you as many have for each individually signing on to the Seattle Green New Deal when I first learned of the green New Deal year or so ago when it was introduced in at the federal level. I was so inspired and hopeful because it did the kinds of things that I've been looking and wanting in and dreaming of doing for quite a while now, it's bringing it home to us locally here and I know how hard this could be to make this into real policy for a lot of really good comments from other spokespeople about what that policy will include I will be watching each of you and working as close as I can with. With you to make this happen, but we will not just let it slide and slide and I will stand behind you when you stand up to the kind of corporate interests. It will make the I work hard to find. We have to find it. You've heard that before I will be with you and standing up because most people do support this kind of work. Thank you. Thank you. I was watching democracynow last week and it said that the the Iceland is melting 70 years faster than what they predicted. It was 40° warmer on this time of year and they had like a dog sled and water. So I've heard a couple big-name politicians use the word existential. I think Ensley and Joe Biden and its existence of the first available definition is our existence and the second definition would be our interior exterior conscience of more and we have to accept on an interior level that we are not moving fast enough to eliminate carbon dioxide and the amount of action we need to take is so Eagle shattering that I'm hoping that we as Humanity can director anxiety instead of directing or anxiety at the border and separating mothers from children just like my son was separated from me and Iowa and to separate a mother and a child in the to pillage Mother Earth. It's it's we need to redirect our anxieties. Away from borders and towards green energy. I didn't have to Serta sign ups in the last sheet of Jared. How may or Jared house? Jared's here? No, Jared. Okay, four, please. Had to leave and then Danny lug. I'll Danny hear Danny. Okay? giordani Anyways, yeah, thank you all for saying the green New Deal to step towards them and I'll make you a narc. how to step to being an example for this country and for the rest of the world And the right just right step in the right direction. However I said he's going in the right direction, but the rest but this country's Administration has other plans to issue with their environmental agency and he's been appointed there I have plans to The students are planned to deregulate the Clean Water Act and push it backwards, LOL big corporate entities to him. Louis Malle remove 692 60% of federal protections against water river streams. What have you and allow these big corporations to jump as much pollution as I want to and there, you know to save on funding of course is going to be good for the economy, you know where he's going to make her tell him we could be the greatest economy ever probably the best ever. So all we're doing is a step in the right direction, but we have to be going against her own federal government or own Administration has a lot of it we have to do that. This city has to try and put an example for for the rest of this nation for this for the sake of our children for the sake of this country's future and the future of the rest of the world because they look to this country as an example and a liter. And if they see what we're doing, they're going to go down the same path and just destroy everything with the pollution that affect the next Generations to come and they come and they come and all. Thank you Timmy thick remix. Give me the bills. Please. Read the title of the bill pass any further comments. Please call the roll on the passage of the bill. Deshawn purple mascara O'Brien Pacheco, please read the report of the gender Equity safe communities new Americans and education committee. Gender Equity safe communities new Americans and education committee agenda item 1 cancel blood won't 19539 Lane to Emergency Medical Services committee recommends the bill pass. Customer mosquito of councilmember Gonzalez who is the chair of the gender Equity safe communities and education committee. This bill relates to the King County Wide Emergency Medical Services or EMS Levy, otherwise known as Medic One which expires at the end of 2019 and is up for arthritis the mayor on behalf of the city to enter into an interlocal cooperation agreement with King County regarding the use of revenue for this Levy. This would also also authorized King County to place this wedding proposal on the ballot for the general election on November 5th, 2019. If approved by the King County voters to provide an estimated 436 million dollars and total revenues during a six-year period from 2020 to 2025. This this this morning than Solace on during our Council has a reminder. This bill was held over last Monday because the county was reassessing the tax rate in light of changes to their financial forecasting currently in the legislation, which is 26.5 cents per $1,000 of assessed value. So there is no amendatory works up to this legislation that's in front of us and it is now ready to proceed to a vote by the full Seattle City council so that the proposal can be placed on the ballot for the November 5th general election. Thank you Katherine skater any questions or comments? Roll on the pastor the bill president Harrell not opposed to cancel 1195436 related to performing city code to match provisions of state law for rental housing inspection to give me recommends to go pass this legislation would update on our rental registration inspection ordinance to better complaint with state law as you all know, the real program requires rental properties be inspected at least every 10 years either. I see inspector a qualified private inspector for multi-family buildings on a sampling of units are inspected it unless the unit Falls inspection fails inspection and sdci orders more to be inspected. Prior to 2017 a private inspector is only required to get a city of the certificate of compliance that was issued after any failures were corrected in 2017 the council change Rio 2 require that private inspectors provide a city with a full report if any failures are found so that STC I can determine if additional units need to be inspected this legislation without a third option to Rio for property owners who do not wish to provide the initial results of the sea. It would allow Property Owners to hire private private inspector to inspect 100% of the units and only submit the certificate of compliance it rather than the full report. This change will allow private inspectors to identify larger problems that can provide more flexibility without weakening inspections. Stop. Please call the roll on the passage of the Bill O'Brien Jayco. Ayton favorite on a post in Seattle Precinct located at 10049 College Way North to come you recommend that the city council approved the project as condition with modifications of development standards Court files in application by FAS for approval of a temporary Improvement and expansion of the north Seattle Precinct the temporary span. She would involve adding three Portables in the site which will contain a community room storage and the break room space is currently exists within the main structure symbol in them outside will free up additional space inside for operational purposes. The plan would also reconfigured parking lots in a small number of additional spaces for Fleet parking this application. How far is Council approval because it modifies one development standard to allow surface parking and require front yard along one relatively small stretch of the lot. We receive, from the surrounding Community about this application and SPD in FAS responded to me. This concerns at the parks committee fasn spdr taking steps to mitigate the impact in the neighborhood including protecting trees making landscaping and irrigation improvements and limiting parking to protect some of the Green Space. Think you can spare and Pacheco any questions or comments on this file? This is a file. So those in favor of approving the project as conditioned with modifications of development standards. Please hold. I know the motion carries in the chair with sign the findings conclusions and the decision of the city council for the housing Health Energy and workers rights committee. Housing Health Energy and workers rights committee chanting for Council 1195 31 of Atlanta Housing for low-income households, adopting the housing Levy administrative and financial plan for program years, 2018 and 2020. The committee has amended. Casper mosquito, thank you very much. Mr. President. I'm really excited about this legislation that's in front of us and housing funding policies have been participating in this conversation at the housing committee know I've referred to this as the moral compass document for our office of housing. This is how we dictate to the city how they will spend the money that we have for affordable housing. This is absolutely critical as we think about pulling together the funding that we have available from the housing Levy funds the incentives housing affordability as well as other funding sources that the city of ministers for creating affordable housing how we use those dollars and who we allocate and who gets the approval for building affordable housing in the city is truly moral decision, and we have an obligation to build Going as fast as we can and to recognize that those who are in need of affordable housing are many of the communities that right now at the highest risk of displacement. We must be building affordable housing as fast as possible to address the increase in the population locally and to address the crisis of the cost of housing. We have not responded fast enough to build that housing. We have not built housing density types that we need across the city and we haven't worked with our Community Partners as fast as possible so that those who are interested in working with and leading with a voice of those who are at most risk of displacement can help get to the front of that list so that they can build housing that is culturally competent that is rooted in community that has a women a minority of businesses on the first and second floors that has Child Care Facilities that has Health Facilities that has Plaza Fiesta Plaza. This is the type of housing that we want to see created across our city and we have taken this opportunity through the administration and finance plan to Reconfigure what should be our priorities when it comes to using these housing dollars every two years. We have the chance to recalibrate how we administer the house in dollars based on our community needs and this year. We pulled together a robust group of stakeholders that have helped us craft the legislation in front of us. We pulled together individual to assist and have themselves been eligible for affordable housing individuals from the nonprofit Housing Development world to have given us tips and tools for how we can improve our process organizations that are newly interested in entering into the affordable housing development world to help us identify how we can create affordable housing across Seattle address the unaffordability issues and the displacement that we are observing everyday and we pulled in our labor Partners just make sure that we are building high quality housing using union labor and that were aligning those labels principles in our housing policies. So some of the really exciting components of this legislation, mr. President includes supporting Community Driven development and harmonizing the policies with our Surplus land disposition policy and just by way of reminder. That was one of the first housing policies we passed last year to make sure that the city if we had Surplus land that we stopped selling it off at the highest dollar figure and we held on to that public land and use it for the most important public use which is housing right now. And we said as you hold on to this land is first people that we should be working with our to make sure that we are organizations that are working to make sure that those who are the highest worth of displacement are getting affordable housing at the time Community organization said, that's a great thank you for holding on to that public land and not selling it off your assistants with getting the dollars in hand so we can build so this document today compliments that were from last year. We have also emphasized that we want to call locate not just housing units, but to truly create Home and Community, we've included throughout the document the emphasis on child. Care facilities health services and other community services like public spaces and plazas in Greenways so that we're investing in housing and we're creating community space at the same time in here around Community preference and affirmative marketing so that we can have an Innovative and directive approach to prioritize and community members with historic ties to neighborhoods for that new affordable-housing that we're building in areas, especially at highest risk of displacement. So the people can continue to have a place to call home. That is Affordable and we don't continue to see high risk of this or high rates of displacement. We've also created more funding and more of a directive for acquisition of property is so when properties come up the Seattle Housing Authority nonprofit developers Seattle itself through the office of housing has more of an opportunity to put forward the funding to acquire existing building so that we can actually create affordable housing and we've heard from folks like that Seattle Housing Authority and others that because of the cost of land. Unlimited space that we have the cost of materials and labor. Sometimes it is more affordable for us and quicker for us to get housing online if we can acquire existing building versus starting to build from scratch. So we made sure to include that as well and lastly I want to think again councilmember purple to with our office and in partnership with the unions and Building Trades comprehensive strategy you to address an advanced labor equity in our housing investments and maybe you'll have more to say about that but really excited to make sure that we look across our housing policies so that we lift up some of the work that we did last year and you might remember the case site work that we passed last year. And be infused in there through conversations with labor ways that we could see a friendship utilization jobs looking at ways that we can make sure that individuals have the opportunity to get Into the Building Trades and have the ability to the housing but not necessarily be eligible for it to make sure that we lifted up that language and silver harmonizing that across-the-board play. Mr. President on maybe I'll save some my thank yous for the end. But I just wanted to say again underscore the importance of this document. That sounds very wonky. It is like alphabet soup. But the reality is that this in combination with the public land disposition policy last year will allow for us to build more social housing socially-responsible housing housing. That's affordable and accessible for communities across Seattle and see what's up with the urgency that this housing crisis deserves this member. Cuz remember her both thank you. I'm in addition to working with Trevor mascara on how to Advanced strategies to Advanced labor Equity outcomes in City funded rental housing developments. We also asked sha to begin now to look at how they can use pre apprenticeships on its housing construction sites. I really appreciate the opportunity to use the plan to Define housing first principles as the expected approach to providing housing for homeless populations. We made clear that we wanted to address the concerns that we read about Mutual termination agreements in the we read about concerns about the use of these agreements in the impacts on on evictions in the losing home report that the Seattle women's commission did with the King County Bar Association and moving forward. We're going to require that are providers have policies guiding the use of mutual termination agreements. Included an expectation that housing providers comply with fair chance housing are Star City is Law related to criminal background checks and then two other three other pieces. I want to I want to lift up. I want to lift up some of the language related to incentivize they kept her must get them mentioned. Our desires are to use more publicly owned land for social housing. We also are incentivizing the use of Levy funds for preservation of existing affordable housing the stuff that we sometimes call naturally affordable housing by allowing for a more robust revolving Loan Fund. And then finally, we have some amendments that I think will help increase affordable housing options for low-income housing specifically amendments increasing the subsidy for three-bedroom home ownership units for low-income. Large larger families and then also specifying that Levy funds can be used to build a new detached accessory dwelling unit. In addition to making changes to an attached accessory dwelling unit consistent with the pilot project that counts member O'Brien was instrumental in making sure that the office of housing work on in conjunction with our new Adu legislation that be voting on another week. Any other comments before counselor mosquito closes the debate closing remarks. I have to underscore that as we're talking about climate change in the need to address climate change with urgency to see in the city of Seattle. And we do so through and affordability and racial Justice lens and a gender justice lens that is specifically affordable for working families that are retirees and displacement. We're helping to prevent people from having to move to in 3 hours outside of the city to have to have a car that has high carbon emissions or to take a bus that doesn't get them to work on time potentially because they've been pushed so far out of our city. This is part of a much bigger strategy that we need to address climate and I think as we create affordable housing throughout the city it's going to take this intersectional lens that we need to apply. Housing to Transit 202 holding the polluters accountable and much much more. So I just wanted to underscore that connection today because of the leadership you all have shown on that issue today specifically some of the organizations that have been working on those climate Justice and a housing policy have been at the table to help this crap this policy and some of these individuals and organizations. I'm have been part of our community housing Roundtable. I just want to thank Sam Puget Sound Sage got green Rainier Beach Action Coalition, but I said Development Fund black community impact Alliance Community collaborative Chief Seattle Club Delridge neighborhood Development Association africatown duwamish Valley affordable housing Coalition home sites kiptopeke VA housing development Consortium. Thank you for all of your work and thank you again to the the labor unions in our friends from the labor movement including the Martin Luther King County. Labor Council Seattle Building Trades Laborers Local 242 Northwest Carpenters, Local 86 If you were part of the work that we did last year on the case. I pilot that lifted up labor standards and part of our efforts this year again to make sure that we conquer ties that commitment and the ANS plan. Thank you again to the folks at the office of housing. Especially director Walker. We know this is your last month with the city of Seattle and I want to underscore the amount of attention that are office of housing gets at the national level for the work that we've done. We need those funds in hand and we need to expedite our commitment but we couldn't have done what we've done so far without your leadership and thanks to your team including Emily Alvarado. I want to thank our committee colleagues who are up here today Central staff including a Tracy Radcliffe who's in a ton of work on this for your collaboration on this legislation already thinks our council member but I also want to thank on my staff are in House who has put a lot of work into pulling together all of those organizations. I just mentioned and everything. We just stepped out who helps convey. I can see how the round table and to acknowledge and recognize her mother who's with us today. Thank you for being here. So these are very excited to have you as our daughter's doing great work. Thank you with the passage of this proposal and the Amendments that we've included building on the foundation that the office of housing in the mayor's office sent down to us. I think we have a fully rounded out our moral compass for the office of housing over the next two years and look forward to working with you to expedite the creation of affordable housing throughout the city. Thank you. Mr. President. Please call the roll on the passage of the bill. mascara O'Brien Pacheco the branch if kind of Desire. Thank you for friending you. Please call the next the governance equity and Technology committee. Please read all three a job at United torgie Madison and Steven n maheshwary as members Community Technology Advisory board for terms of December 31st, 2020. The committee recommends these appointments be confirmed to reappointment to this the Community Technology Advisory Board have to tell you these three folks came to the committee and they were indeed impressive. Not only are they technology Guru says you will see by their Background by their commitments to environmental sustainability affordable housing Cuban civil rights issues where you was just astounding so I present to you the first Very impressive young man named Renee Peters Jr. He has been going to the meetings for sea tab pretty regularly. He works at Microsoft and then a zoo or division with a broad knowledge of cloud Technologies in an understanding of artificial intelligence. I'm proud of this use a chemical engineering project manager at Procter & Gamble. He has a BS in chemical engineering from a mighty and an MBA and Ms. In design Innovation from the Kellogg School of Management. Got to know him a little bit personally actually hails from New Orleans, Louisiana. So I'm going to bring around District 2 to mention some young folks. And so we're very pleased that Renee is asked to do it on the commissioner. Next person is torgie Madison and torgie has been on C10 for 2 years and he's been contributed too many projects including the FCC stance on comments on net neutrality and in on our Council surveillance, Oregon. Your privacy rights are protected is vice-chair of sea Tab and culture of the privacy and cybersecurity committee to 15 year career in Enterprise scale software-as-a-service development to Pursuit independent video game development. He worked at a blow he's worked at several places, but indeed tour tour tour you thank you for your leadership in your commitment. And our last one is a reappointment Steven. Mahi-mahi schwary who is a chair seat apps are Steve and I slaughtered at a table and I slaughtered it here. But he's the marketing lead Amazon working on products and services for underserved communities. He's a graduate from Harvard with a focus on sociology and economics his background includes a Fulbright scholarship teaching in Borneo Malaysia where he developed programming to teach social and Entrepreneurship English and creative nonfiction writing as well as introducing online tools to his school. I told you it's a pressure group with their commitment to their communities is also equally astounding as their achievements or that I would ask you have any comments or questions of these appointees. If not those in favor of confirming the appointments, please vote I vote. No the motion carries. The appointments are confirmed. I can't believe that gets through our no does not. I apologize for that. I was then turn my page. Please read the report has a sustainability Transportation committee 1371 appointment of Vicky Clarke as member Levy to move Seattle oversight committee for turn to December 31st, 2022. The committee recommends the appointment be confirmed. This is an appointment this appointment replaces by Nessa to Stepping off the community for being on there for a long time. The key is a policy director at Cascade bike club. She has a master's in public administration and I think she'll be a great addition to this committee. Thank you very much any questions or comments on this appointment? If not those in favor of confirming the appointment, please vote. I supposed to know the motion carries an appointment is confirmed. I believe that concludes our agenda items. Is there any further business to come before the council? Cuz remember where I was just looking at the clock, so we're going to have stuff on this meeting. I think we will adjourn it in a second. We will start the park district meeting at what time can I take a five-minute break five minute break five minute break.", "end_time": 5970.1}]}