{"format": "raw", "annotations": [], "confidence": 0.9342986664958506, "data": [{"start_time": 0, "text": "Good evening, everyone if I could bring the meeting to order. Thank you all for being here. I am, so I went on the Seattle City council and counsel number for District 3 which includes where we are right now, which is the central district and I wanted to thank the Church of New Hope Missionary Baptist Church and the senior pastor Reverend Jeffrey for generously giving us the space for a very important Community issue. I wanted to remind everybody that this is not the first time that the church has lent their space for community events are last community meeting our last committee meeting on renters rights, which is which was shared by me. I was also in the space and that was related to the struggle of the working class tenets of the Shadow Apartments many of whom we've been joined by here today. This is a special meeting of the Seattle City council of Human Services Equitable development and renters rights committee. The time is 6:16 p.m. On Monday, July 29th, 2019. And we will begin the meeting now. Sandberg Juarez is office. Another member of this committee has informed us that they would not be able to make it and don't remember how those offices have told us that this meeting was on his calendar. So we might be joined by him. Later. Tonight's meeting will focus on Equitable development and it's far more common and unfortunately far more common opposite which is displacement and gentrification, which is the opposite of Equitable development. And there's lots of discussions about who's to blame for this. Yes. We know that hire paid workers are moving into the neighborhood and it's it's a part of gentrification. However, I think we are all gathered here today because we recognize that the prime movers of gentrification are the the way the housing and construction Market Works under capitalism as a whole and the role played by wealthy developers developers corporate Property Management corporations, and many of the entities who make enormous profits to the process of gentrification and what gentrification and displacement does is economically ethics and prices out. Both working families and Hazard issue today will show small businesses especially immigrant on people of color women-owned lgbtq own small businesses. Maybe we'll be discussing with about that clay and work you Google shut the owners of saba Ethiopian cuisine and with many Community supporters who will be here their business their life's work and a community Gathering space has been economically evicted writing. It is important to note that we are in the Central District which was historically the side of racist Redline overtly racist redlining and we don't have that overtly racist redlining today time to the struggles of many generations of race activist who fought against racism. However, we do now have a systematic process of economic redlining we're working families who can't pay the rent at the Sky High Ranch and small businesses that are getting evicted because of new development are getting economically evicted. And it should be noted that sell bows situation of eyes facing the situation not because they were somehow unable to run a successful business but instead because of a rapacious developer Alchemy in Centric Partners who purchased the property that's about it rented for years for 20 years to demolish and redevelop as many of us know to move to a new location is very expensive because especially for a small business. They not only need to find a new landlord. We're talking about a restaurant that needs to be remodeled has have stoves fire suppression systems refrigerators install and many other costly things in order to Simply move in. And the entire burden of finding the funds to accomplish all this is now put on the shoulders of saba while the carpet developers will undoubtedly make enormous profits. And the lost the community is something that we cannot put a value on and we are going to be focusing on Sabbath issue today. But this is this is she was important also because we know that this repeatedly keeps happening especially for immigrant and black and brown owned businesses and we've seen this happen in the Central District our community lose part of its culture and identity every time this happens. I've no doubt that's about to be able to find a new location. But we believe strongly that all coming the developer needs to offer relocation assistance to make that possible. This should be standard in our view. It should not require us to have to mount a movement and a campaign to achieve that it should be the law developers who are profiting from development should take the responsibility for the relocation of the Working Families and the small businesses. They end up displeasing. Although I would say what we really want is not just relocation assistance. We want the kind of development that will allow small businesses of every origin to try your hand for Working Families regardless of income to find affordable housing in our city because we go to work every day and we make our cities run we have the right to our city. Unfortunately at this moment and this is why we are gathered here today. Unfortunately, it is almost unheard of for big business to take responsibility for the impact that they have the negative impact they have on our community and that is why we need to get organized and I'm really very I'm gratified that we're going to be talking about this issue because it highlights how many struggling small businesses especially of color and other minorities. I think we need to join hands with Working Families renters and homeowners struggling to pay their property taxes because we have a lot of our interest in, and his bag later in today's meeting. We will be discussing with Central area churches who have had land that they would like to use to work with the city and with nonprofits to build social affordable housing on Reupholster gentrification, but that does not mean that we want the infrastructure of our neighborhoods to stagnate and fumble. We want striving neighborhoods for people of all incomes. That is what we want. And as soon as I said, he invest in our Parks roads and streetcars big landlords and developers raise the rent and displace the residents who used to live. We we want families and businesses of all income to be able to enjoy all the development that are public resources provide for keeping in mind, especially that those public resources are funded through the most regressive tax system in the Incarnation. Meaning the poorest Among Us have paid the most for the public infrastructure and they are the first one to get pushed out. This is completely wrong. It's lopsided. The Bulldog panels or they will be discussing two different issues will touch upon the same larger team of affordability and livability in the central district and the city at large array looking forward to hearing from both tunnels before that. We have a public comment and some of your sign for public comment. We I think we can do 2 minutes. Get depending on how many people are sine of 13 people are signed up. So if we give every person 2 minutes, and if you all please stick to the time, then we can get to the first battle. The first person who is alcohol out three or four names at 1. So, please come in line up here. So we don't waste time in transition the first person who signed up as Emma Jean Williams II is Alexander Berman artist Caleb Sanford and forth is Miss clay method. I'm sorry. I'm I can't read the writing. But if you think of all of your names, please Imogene Williams, please go a week ago on Saturday. We had a rally for rent control and there were 400 people. One of the speakers said that her landlord had notified her that her rent was going to go up 130% think about it if it's going up 100% that means her rent is doubled but it's going up another 30% on. I don't remember that she told us what she's going to do. But this is impossible a person that works in Seattle should be able to live in Seattle without working three jobs. What do I have here is these are signatures we collected in Othello. I'm just going to read a few of them where they wrote. Why we need rent control? To support those who cannot afford a home to have one. Seattle for all In order to live a healthy life. in Seattle Arma Seattle use I need a place to live. Seattle is expensive. The rent is too damn High. I'm sick of not knowing how long I can live here because my rent is always going up. I hope this year. So, it's clear. We need to check. We need to change this. Thank you. G5 my brown Nazi socialist alternative fascist with Christopher and she might principal my name but I see some don't, leave from White Collar season come from brown and Blake to I give you a classic example of when we don't feels as if you don't stop in front of matter what I see is what is not me where is come from church seventh most keto approved 11 trespasses my 400a why because I have different opinion about rent about everything only because I have different opinion. So absolutely not legal stand for 40 year. I don't come you don't talk it. What is she talking right now is the pure BS and I know this because I professional business Castleton and I went to class action because of million people I'm good because right now in downtown only 10,000 Empty Apartment 25% empty for a couple years for a few years. I'm talking to this is never today love your taxes when she for example talk like I talk and stuff on Amazon for 6 year every meeting. What is a take me out with this problem stopping Amazon every price don't stand up America Vineyard, Columbus, Georgia Chamber from this freaking nuts. My name is Mildred clay. And I'm here today. I live to hear the state of Seattle for almost 20 years and I got sick and I would home my family took care of me and I came back when I came back in six years. It has been a tremendous change a shameful change. I wasn't able to even afford rent if I wanted to come back and see another town that I grew up in that I foster care TN. That work in a community in and you can't even afford to pay rent. It seems that I have to go back to Atlanta where some common sense is. Is time out I'm here to say is time out just said. Move over move over move over. It's time to stand together. Before Caleb goes on just wanted to read a few more names after him and Whitney Lawrence Petrie Megan Murphy David Hackney for the record. I understand what that guy said he can admit I did. But anyway, my name is Caleb Sanford watching the Goodwill Baptist Church. I'm also a small business owner real estate developer and activist, but I guess you can say I'm one of the good ones because I'm from Baton Rouge Louisiana myself. I don't know if you guys can hear the accent but my living in Seattle Washington now going on three and a half years I come from priority. I come from you know, the South some of the places the worst of the worst and in what I can tell you is that Seattle has an abundance of opportunity and the thing that I can understand and I and I've learned is that it's not that people don't want Greek communities or nicer homes are nicer places to live. They just don't want to be gentrified. They don't want to be displaced if I can come anyone in this room, and I said I can bill you before you know it for bedroom. Island kitchen bathroom with you know, all type of marble and certain things that I don't want to get deep into cuz you know, you might not know what I'm saying, but I think people would go for that but long story short is a Wii with the near my initiative at the Goodwill Baptist Church. We work to make sure that people of small communities and under-privileged communities do not be gentrified is placed where they live in their own businesses. Thank you. Do you want to speak you're going to be up there? So we have Megan Murphy next David Hackney. Please line up here and then Mindy Lee. Thanks for hosting this I'm not a politically active because my grandma was a political activist to my aunt and I'm smaller and I lost custody of my son and because I had a feeling I was being stalked and you know, I read that letter tonight how people were going in the restaurant and banging tables and the kind of bully people inside to come like really into read. I read the color of law which is recommended by a librarian and they take neighborhoods of color and back in the 50s and 60s and They would have its people after they paid higher rate rates of rent and then they would make a huge profit and then sell it based on color and now we're in like a meritocracy where if you can bear it to be a part of this money clientelism, then then your set but you have to have certain values and I don't think it's a value of a community to be fractured in such a way as this because you know, what's global warming I imagined like the desert and like the Earth is cracking and like Society is cracking apart and what we need now is like solidarity. We need to restore healthy relationships within the community. So I think that this restaurant should be provided assistance with moving just like the people at the Chateau are being provided assistance and I think Me ASAP because I do not have the diagnosis and I will fight and I will organize so I come here and I quit myself with knowledge on how to organize on my own behalf and on my own case cuz I'm the only one fighting it but I've I've gathered signatures which I've learned from these places and dumb. I only hope we can do the same to hold this neighborhood together and its gems its cultural gems. Gave David your next and after David will be Mindy Lee and then Michelle Reese if you can please line up here. Good evening. My name is David hockney and I'm the legal redress chair for the Seattle King County chapter of the NAACP. I first learned of this memorandum of understanding that the chapter signed with the developer that was evicting Saba just a week ago. The board was never provided an opportunity to vote whether the chapter was going to be part of this. We were never given any information on it. And this I realize now we saw Prescott press release today. We're now the chapter is backing. This is embarrassing and it reflects poorly on the leadership. The organization should be involved in something like that without speaking to his board speaking to its members and doing the basic research to understand what your sign before you do Elmo use are not binding but it is a public agreement to collaborate. We should be collaborating with the community. We should be collaborating with our community leaders. We should be collaborating with Saba. We don't need to be collaborating with the developers. Thank you. We need to make sure I don't want to talk about n-double-acp. Nobody better not come with mr. This is this is an official Seattle City council meeting at no, please please. Please don't speak to me. That way I am and please don't speak to me that way. I do not I do not I do not. I don't think that tone from you as warranted. I am the city council member running this meeting. This is an official city council meeting. I do not account for what people say in public, because that is their right. I don't play please. Please do not interrupt me this I'm running the meeting now. We absolutely want to have a meeting that is centrally focused on the issue of saba and addiction and displacement. This is this is a meeting that has been organized by my committee, which is an official Committee of the Seattle City council member. I have no interest to take up any organizational issues. That is not my goal at all was at the same time. I'm I am not responsible for what people say in public comment what happens on the panel is my responsibility and we will make sure that the issues that are discussed on the panel are absolutely 100% about the Saba issue. And also how we can address this place when I get to vacation in the central district and I think We it is extremely important for us to be United in our struggle against gentrification and displacement. There will be disagreements. But those disagreements will be should be handled outside of this meeting because this meeting as I said as an official city council space and we will be running it with a hundred percent focused on this about issue and the Central Area issue. Hi Mindy Lee. I'm a member of Puget Sound Advocates retirement action. And no I don't live in the Central District. But I am definitely in the process of being gentrification Island in Green Lake in every time I say that people think I owe Rich got a lot of money not true. I've lived there for many years. And when I first moved in there, there was a dairy there were little stores that people went to you everyday not anymore. All of a sudden the community property has become very valuable as being bought up by large corporations Bartels is gone in there. I'm not putting disparagement any any other corporations but there are people that are backed by money and the those of us that live there such as those of us are older going to end up in a retirement home somewhere and that's nice. But that's also redlining. I don't want to go there. I want to live where I'm at and it's getting too expensive and I believe that is what we're here to address is to stop that going on all over the city, but especially in the Central District where you guys are heart Michelle Reese and after Michelle will be Asha. Hi everyone. So first let me take a breather because that's a whole lot of different energy up in this Sanctuary. So I think we all need to just take a moment and like really come to a piece cuz I think that's what a lot of us are here to get is some peace and some understanding so yes, there's a lot of political situations going on. That's as normal. My name is Michelle. I'm from the CD. I'm a community care coordinator at Odessa Brown. I work at Leschi Elementary as well. I grew up in a CD graduated from Garfield. Yeah, and I'm just here walk from Garth walk from Judkins Park. My kids are at football practice and cheer right now. There's so many ins and outs I see. A very good community advocate here who's trying to do some pillar some different things in the community for us. I'm coming from a black woman's point of view and I don't know anything about Saba, but I do know that there's been plenty of our Businesses that we started originally in this community that have been pushed away or organizations. Non-profit organizations don't have spaces and places to continue to do the healing process and all this stuff. That's cause everyone to have all these mental health issues, which nobody can serve those either right? So we have a whole big gist of everything and until we get all like even coming in here and having to deal with all that we got to get all that together all these different political organizations and everything. We really got to get together. I appreciate the invite the public invite but really coming from a point of I work and working in Seattle for years, but I have to live in Redmond just because of displacement, you know, everybody they don't get married and have a picket fence and they don't do all that in life. So, you know, I'm a mother of incarcerated father one of my Daughter son is no. My daughter's father is no longer alive. So then now I'm really a single parent. So been on my job for 8 years, I work for a prestigious company, but I cannot afford to live in the city you look at me. I look will and all that and everything so you get judged by that but I can't afford to live in the city with my kids. So that's the real issue. And I don't know how many of these community events are happening, but he needs to be happening with people like us like real people that are really working and really that you know, like this really is really a serious thing. And then you have brothers that are trying to build things up for us and then it's always is always these loopholes that you have to go through to get City money to get this to get that when you can clearly see what's needed. You can clearly see we build everything up and then it gets torn down and then it you know, so that's where I'm coming from. I'm coming from my kids are Seattle public school student. I'm coming from Odessa Brown. I'm coming from Garfield. I'm coming from Judkins Park from CD Panthers Community nonprofit c a y ya girl track. I'm coming from all these places and spaces where we've all been pushed out, and we don't unable to even have a space. Thank you. Thank you after Usher. We have so Sosa. Ngolo, am I saying this right if you think that's your name, please please come. The game it's a gay. Okay, put up. Please come so you can speak after her go. Hello, I live on Columbia and 19th. And I moved to the central district about six months ago after my cannabis business failed and I was almost homeless for a while and I I'm a product of the 1965 Immigration Act my parents and my uncle have small businesses in Long Island and in Michigan. So I have seen my family. Velvet small businesses in the east coast and I studied business at the University of Michigan and Eastern, Michigan University. And I had a good career as a management accountant in many big cities including New York City San Francisco and Washington DC at NPR as a senior financial analyst and over the years in every city. I was in San Francisco in the early nineties when gentrification was starting in the Mission District and now Mission district is so disgusting compared to what it used to be with the small mom-and-pop businesses and everything. And what I have found in all the business literature and all the city literature as a receive the city of Bellevue Obama presidential gold medal in 2010 for the project I did and I've seen how cities operate and I find that they need to be doing a lot better. It's almost like they're not skilled enough. It's like why do we need to be begging but I rides when we have a history as a nation that you know, if you don't have property you got nothing. And where there's a will there's a way we talk about local flavor to resume paying so much in his learning a lot and what the hell are they doing for? Our local residents that provide the character that most essential culture and character of sleepy. It's about 15 time the city do a lot more and get a lot more educated and become Global in its Outlook. Thank you. So gay and then after that the last speaker is Robin how to get Walden. Good evening. My name is a galago. Actually, I'm not ready to talk much, but I'm coming to support and save Saba restaurant. Thank you. We have a REV Howard Walden who's going to be the last week or end and then panelist. Please make it rain. Good evening. Good evening. My name is Reverend. Well, then I'm here to just to talk about gentrification. I mean. We started this fight in 1992 when weed and seed came in and this community didn't stand up to help. I mean we knew that it was going to be at city was going to be gentrified. We also knew that the other communities like Ballard and all the other communities would come to be part of that. I watched every city council ever elected city council over the last 25 years give most of the property to the developers. I mean, obviously it was a good example of that and now we want to talk about stopping gentrification and all of that, but if you pull up all the council members records over Here's they all voted to give away the property and even with the high with the up zoning that will that will will get most of the elderly people who have property in the central area in other places. They going to lose their property because their taxes is going to go up. So I think that we have to be really astute and hear and understand that again of saba. It's part of this now but we've been talking about this since 1992, you know, we took the hit for it. We took the hit for it Mothers Against police harassment, we told the whole nation about identification. We send it down to Los Angeles to my cousin's in an old Panther. He's sending out Across the Nation and what we see is is it is an influx of our European Americans coming back to the cities that they left to the Negroes in the rats 40 years ago and now they coming back with a vengeance and their capitalized they have money, you know, and so I'm just here to talk about gentrification. In the whole day, and I hope that that this this situation can have a good resolution. We've lost a lot done and you know what America wants to change the narrative they say it's a country of immigrants. But you know, we the stolen ones, you know, we didn't come for freedom and we didn't come for safety. We haven't known any since we've been in America. We have to rewrite the narrative. So we not written out of History. We need to understand what's going on. Thank you very much. Thank you so much. I've been Walden for providing a really good starting point for R panel discussion. I wanted to say a few things about your breakfast and then invite the speakers and we're going to prioritize Miguel Shannon because she has to leave early and then we will of course begin with saba and working to hear their story. And then we have many Community organizers here in solidarity with them but fall. Oh, okay fine. Thank you for letting me know. I just wanted to 12 Echo Revan Walden's point that the work that we will be doing and hopefully as soon as she said hopefully will be winning a resolution out of this and something bigger and I'm not just a resolution for Saba but on the shoulders of that when something larger, but you think we should keep in mind that all the work we're doing is on the shoulders of many generations of community organizers here in the central district and region why the the fight against systemic racism to fight against gentrification. It is not a new phenomenon. Unfortunately for us it has been decades long, but we are now here in in in a we are alive on this out. So it is our duty to take on that mantle collectively and fine and just to emphasize. Once again, we want to be United in the struggle many organisms. When's have been part of this struggle already? And I want to give my respect to many of those organizations and also again restate the objective for me as city council member conducting this committee meeting tonight. And in this on this Hallowed Ground that we are we want to have a United message about defending saba and also about raising larger policy proposals for how can we prevent this from happening to every business that end up setting shop in the Central District? How can we ensure that the fabric of our community that is being done on that process can actually be stopped and what are those three white and reason why policies we should be talking about and we we have speakers here to join us and that and I have some point you make as well. I just wanted to emphasize that you want to have a positive discussion about the issues at hand. And also thank you in advance many of the organization that I've already played a big role in on these issues not just on this about question, but on the question of gentrification and there are some organizations here who have joined us in solidarity of $100. If I don't acknowledge you please let Jonathan Rosenblum from my office to let me know and I will make sure we know that you but as far as I know, I'm one of the first express our gratitude from my office to the n-double-acp to Africa down to Posada the Puget Sound Adventist retirement action when to use book Tenants Union B, Seattle who are my many of the activists. She or socialist alternative the transit Riders Union. I also wanted to acknowledge that Miss Angela Ray from the Department of neighborhood has joined us here. Thank you so much with rate for being your and we also being joined by King County council member Larry Gossett think he's sitting somewhere in the back. Thank you for being here. And we also have a representative from Congress member Adam Smith's office. Yes, thank you. We really appreciate you all joining here joining us here in as I said at the beginning of this meeting so much gratitude to the New Hope Missionary Baptist Church in the Senior Pastor Robert Jeffrey for Lending us the space and we want to respect that space and have a positive discussion having said that somebody did you want to start the discussion by talking about your experience? Sure. I also sorry for just for the record just the way we do this meeting. Let me go across the line just went very wants a brief one sentence introduction of everybody for the record and then I can start yet shirt. Hi. I'm Saba tekle. I'm sorry. I'm stopped at Echo. I am the daughter of work. He was a shit. Who's the owner of saba Ethiopian cuisine? My name is Lawrence Petrie on the Central Area Chamber of Commerce president. Wake me up at 4. Ibuki. My name is ky can Garrett president africatown Community Land Trust? My name is Kayla Shannon group and the Central District Community organizer. Thank you all. Good first, I want to start by thanking the Seattle City council starting with kshama and her team Jonathan and Adam for putting this together for us in the sport. They given us this entire year. So just this past year of you know, as in Oakridge, just to take it back on what she said earlier. I family restaurant has been open for 20 years. Just last year though. There was a sign that came up and I was our introduction to wet felt like a death sentence for the restaurant. Okay, and I know you guys seen those signs that says a six-story building or whatever building is going to have, okay. So that's why it was pretty scary and we found out it was going to be sold for 6 million, but prior to that, you know a lot has been going on that we haven't shared and we decided not to take a passive role. Okay, we want to be really active in knowing what our future was going to be. So we try to do some digging to find out who was going to be purchasing it and so on and so forth. It was a lot but first week, I would like to say we were patient after the sign had went out. We were hoping that someone with kind of tell us something in the Mist. This we haven't had communication with her Lambert at the time because they had a management company in between them to not really communicate things. So after some digging and you know, if a patient, we finally found out who was the who was going to be purchasing it and the people that were involved you scheduled a meeting. We wanted to know. Hey Will we be relocated what's going to be happening to which most of it was like well your lease is your lease and so on and so forth. So just to give you a little bit of idea and ideal why we were evicted or least technically expired. So anyways, we start with him and after that mean we felt like we didn't want to just let this go you really don't want us not, you know, not fight for this and we went to the Seattle City council and anything anybody that would really pretty much listen and help us fight this fight. We were knowing we're going to be getting into anyways, we finally met again with the with one of developers or one of the people involved and even though you know what we started the petition by this time and even though you know, we Nothing in writing that you made it to relocating if we stopped the process of petitioning. Okay. Alright, so then we started this process that took about five months of finding a space and then getting a build-out cost which was $327,000. Now we didn't come up with that number they did. All right, so short you know, this also doesn't include in restaurant equipment. This is just Bare Bones empty restaurant. Okay, so when having this conversation about who what where and why it if it fell on let's just say on deaf ears because they never funded the project and they disappear shortly after this was the end of March. OK and April it end up selling. Then in June 16th, my mother was served and intent to evict papers and while we were preparing with our lawyer. We called on a meeting for them to again to talk about relocation and about the future and what transpired was they requested to meet with my mother alone. And that that that was the only way they were going to meet with her and they also said they were happy to meet with her and then this happens someone that my mom's kind of share with what happened. So June 24th because I got the foot soldier and I want talk to him what's going on. She emailed me back. I can meet him on the 24. I know I know but they don't want anybody to come with me. So I said okay on 26th, July 26th. I want to get office there was two of them. So I was expecting you know, they were tight. Okay, you know this this is because my neighbor and his head so I say what's going on what you just put out. And I forgot his name. Stop the screaming and just lamp in the table. So I just look at him and I said well lots of next then. Own expense because you have too much petition too much politics. You always Jonathan and just everybody else wanted. All over Seattle of the petition is not only me. It's all over. Yes now 2424. So she are here again scream and t-shirts. She just got the table again the second time. When the second time I just start crying I guess I don't know. What is my tears coming down because I never expect like this. Even when I was a child now, this is so I just quiet and I said, okay, what's my neck is stiff and he If you tell me to go to court in my mind, I'm asking myself. What am I here? Slap the table again the first time I really don't know what I'm going to do. So I was so quiet and he said to give her a call. That's what happened. Now in those documents, they just kind of went over some emails that I sent them. Of course some of them coming from Angry daughter. And those are those ain't too happy of but you know, some of those emails came from you know, a space of dinos a Seattle we believe in is Seattle Seattle that both can merge businesses can be built. It went from Mississippi belt. We can be together to if they're not going to help us we're going to fight they didn't didn't like that. So they try to put the blame on me and some of the things so even after that though even after the yelling and screaming we try to work out our issues would hope that they were stopped evictions. They didn't stop. In fact, they sped up the process lighting Court still cash the check and caused her in all of us to pretty much make a quick decision to throw away good expensive food and and just move out and in the process for 9 days when really it was all we really had was the weekend and even when we requested more time, they took their sweet time to a point where if they were going to get back to us. We would only have a day to move so we just decided to go. All right, so We didn't have enough time with their way of those stuff, you know that damage of alone of course can affect the reopening But Here we are now, we're still calling on them to to get into writing something that's legally binding to to cover the cost for move. You know, we have a lot of support from the city council and members of the community and NAACP also has been trying to assist to help us with this Bridging the Gap between acacian now and again, this isn't the Seattle. I know the Seattle. I know we stand up for what's right Seattle. Oh, I know really do care about people see how do I know if the people that's in this room and we know we can make a difference. Okay. So right now, of course if they didn't choose to buy it or they didn't choose to develop if she would have still been there and all the money that she's invested. That's we already know the cot wolf. If you don't know if there's a lot of cops that goes involve into running restaurant. So anyways were here today pretty much just to hold him accountable for them to take responsibility for their actions and to pay the relocation and we need your support in that that's why we're here today. But thank you so much. I just just a couple of points before other speakers also join in and we have more of a discussion of thank you so much for being here and thank you for letting us this important space. I just wanted to shed on on some of the account that work against about shared with us. I wanted to share with our community members here that my office sent a letter to Alchemy concentric Corporation the Development Corporation in June concerned that they had issued an eviction notice to Saba the business and that we didn't think that was appropriate and in that letter I ordered them immediately recent recent the eviction notice and begin negotiations with Misses a shed on what specific assistance they would provide to ensure the restaurant successful location to a suitable new site in the neighborhood and it was we were completely outraged to find out that rather than have a meeting where they would have a respectful and you know just resolution to this crisis that Buying the business in that day instead use that meeting to be completely disrespectful to mrs. Will be shed, which is problematic on so many levels. I just want to be part of the letter that I sent from my office just on the 23rd of this month in response to what we heard from someone working, which is this I'm outraged that instead of working to resolve matters you and your colleagues have escalated the matters and you know that unilaterally evicted the restaurant that's unacceptable conduct is a clear example of the systematic gentrification and displacement that is causing so much harm the Working Families and small businesses who have transformed the Central Area into a community while corporations like Alchemy and Centric make exorbitant profits our community suffer and your actions are being noticed in the broader community. Community members my Council Office and I are disgusted to learn from this rubbish at mrs. Will be sure that you and your partner met with her not to find a resolution to the problems. You have created for her small business, but instead to be raped her and subject her to threats table Banking and other similarly abusive Behavior as you have hard as we have heard you have cheated mrs. What we should be complete disrespect revealing your true position to versus immigrant on business that you're forcibly displacing and I think that it is important that we all as a community standards sub against this completely unacceptable behavior and And I think one of the main points we want to highlight today is that not only does mrs. Babish at deserve a sincere apology from the developer, but we are also fighting for the full relocation cost that they are going to experience to shift to a different location, right? I want to invite other people to join in please. You know, my name is Lawrence Peachtree again. I am the President of the Central Area Chamber of Commerce. You know, this is A continuation of behavior treated among people of color for a long time in this community. We continue to go through this left and right and I apologize that you had to deal with that because that That's that's wrong. And you know, one of the worst things that we can do as a community is is no longer stand up for this type of inappropriate behavior, and we did it at one time and it was called the Civil Rights. And for some reason or another we've come become so apathetic to believe that it won't happen to us. But the nature of this is that it is because we went from 90 + percent of a community down to 12. If they even that being born and raised here, I can honestly tell you that I think why came talks about it a lot the root shock that many of us feel that still live in this community. I walk my dogs and I'm sure in this briefly because I want people to understand that this is not just affecting the businesses. It's affecting residence. Also, we no longer feel as even as we belong here. And you didn't ask to be here. And so, you know, I can guarantee you one thing that that type of behavior won't be tolerated not from the Central Area Chamber of Commerce and we will support you wholeheartedly we will help you. We will do anything we can because you do deserve that relocation funding and you should be given an apology. And if that Pieology doesn't come then you need to let us know because I think I only can speak for the chamber. But I know for myself I will go down there and demand an apology because that's not how you treat people. So, you know, I am appalled that this type of behavior is is is going on but this isn't the first and that's the sad part about it. You know, one of the things that I really just briefly want to say is that we as a community need to stand up we can no longer be a pathetic we can no longer pretend as if this doesn't affect us because our kids are Bustin they don't even live here anymore. And that's even sad, you know as a local artist. I raised I was working with some of the schools and I had the kids raise their hand and ask them how many of you are born and raised in the central area and there was only two or three that could do that out of a class full. and so, you know again, the biggest thing that we can do is really stay informed, you know, if you haven't read the Mueller report yet you should And stay informed what the regulations are around here. You know when you see those signs go up that there's something going on. We need to notify each other immediately. Let's not be reactionary Let's Take Action because we're always seem to be caught on the short end of the stick because now we're having to react and I firmly believe if we honestly look at these land uses and actually take action upon them before they happen a lot of this could be mitigated and so much. I'm I'm going to push back just a little bit on some want in regards to the churches. The churches are last peelers. So I would say to any church that is left in the community. Do not sale. It is not our responsibility. To create affordable housing. The churches are not responsible for fordable housing. The city is responsible for fordable housing and we need to demand that. So I say again, Reverend do not sell. so well, we're not going to be able to portable houses. We don't want the church has to go anywhere and I apologize if that's not what you're saying. But I just want to say that because churches have been sold in the community. So respect to you know, but I'm not concerned about the accuracy. I do not want anybody to walk out of here with the understanding that the city's talking about selling the judge that is not the plan. I just want to clarify that that is not at all. Well again, I might have misunderstood or unwrapper wrote down what you said, but irregardless of that bottom line is is that the church has our last pillars and we need to keep these pillars. And so I personally am requesting that we do not sell our churches and that we hold the city responsible for creating family housing and affordable living. Thank you. I just want to clarify that is no disagreement on that whatsoever. Well, I'm here in support and solidarity with a you know, a valued what I was African Town business and our community for many years. I remember when the doors were open for us to host open mics in that venue many years ago. And so just what I heard. was completely totally unacceptable but We know from history that when you know, the smiling face doesn't work. That's when the terrorism shows up. And that's all I heard is what transpired was attempt to terrorize and intimidate a woman a black woman a mother elder in our community and that's one hundred percent totally unacceptable. We called years ago for a moratorium. on development that displaces that's not Equitable that's not inclusive of the communities that have been here. We spoke in January at the design review built design review hearing about this project in Emphatically opposing the proposed development which is not affordable by any means did not include any affordable and they then wanted to talk to us about the design and maybe we can include some artwork and this and that and that's not something that we were interested in entertaining. We are not about symbol without substance. So yes, we want our community on third in the art, but we're not going to become Museum pieces in a community where we were we going to the journey The Blood Sweat and Tears. That our parents and our grandparents and our great-grandparents have put into this community. And so yes, we want that represented in the design and the built environment but more than anything we want to make sure that our community our residents are businesses are organizations are present to be a part of the future of the community and we think that this is just another example of the ruthlessness that underlies, you know, this process and so We are going to stand continue to stand, you know in solidarity and we all need to be talking and calling for the moratorium. on this type of predatory development and Policy at a policy level we need a reparations. Package for what has been adored by our community in the Central District because it's documented it was even documented when HB 1918 passed in the state legislature this year. There's been systemic. public government and private practices that have disenfranchised And harmed the residents of this community. So it's documented that damages have been done. Then the next step is to discuss what? reparation to repair and make all a community that has been damaged. And lastly. I just say it's important that we have Unity because some think that was happening to them is not happening to me. Maybe they're not working hard enough. Maybe they're not saving that money. Maybe they want to buy $200 sneakers. But then it shows up at the next person's door. So let's not wait till it's at your door till your children are also being devoured by the system to understand that the system is not been set up and operated for the benefit of any of us and don't let them pit us against each other we must unite because the capital is very much United and very much working together and saw us as human capital. we must come together and use our resources and pool our resources because we all have resources we all have assets and we need to put them together so that we can all be protected and build a future that includes all of us Seattle, you know wants to be a world-class City, but how's it going to be a world-class City without the communities of the world that have made this city, and I said it before and I'll say it again it have Brought some of the smartest people on this planet here. To be a part of the Space Race where they figuring out how to build condos and communities on the moon. On Mars. So that means if there's enough intelligence there's enough resources in this region to figure out how we can help communities that have been here grow and thrive in place. Yeah, my name is Kayla Shannon and I grew up in the central area. I can't I can't live here no more because can't afford it. But I did grow up here in community organizer, and I've just seen so many businesses disappear. In fact, I can't think of you. No one, you know one black business in the Central District anymore. Because of what's going on with Developers. When I heard what happened to the Saba family. It's really bothering me really bother me because I rarely do anything like this. I don't sit up on panels. I don't you know, I don't give speeches. But when I heard how disrespected the developer Alchemy was to the Saba family, it bothered me so much that I felt that it was important for me to be here this evening and And let them know that I'm staying with you. I'm staying with you and I and I think you know some of some of my colleagues up here. I've said, I said that that we need to demand an apology and I think I should be the next action to demand an apology for the way you have disrespected these black women in the Elder. That's what really bother me the way they disrespected the Elder. And so, you know, it's really important that you know, we are in solidarity and that we are working together and we really need to be like having these someone said earlier having these meetings when this happens when these developers come in and are you know buying up everything we need to have these meetings so we can know how to support, you know, support support each other. So I just want you to know that you know, I'm here and whatever you want to do next, you know, I will stand with you and I know that many others will stand with you. We cannot continue to allow this to happen. I just want to add that I just I just I just returned from the original Africa town in, Alabama. Kansas City and st. Louis and was able to share because the original Africa town was established by Africans who have been kidnapped from Vernon and brought here and when they were freed, they would not able to go back home and they will not even given any land by The Doors who had stolen their labor for years, but they still pulled their resources and bought the land back from the same plantation owners and made a community. That was the original africatown in the late 1860's and now they're looking after work that's happening in the Central District. As a model for how they can Revitalize and lift up their legacy. And this is the same thing as st. Louis and so I'm saying that to say that the eyes of the country black communities all over the country are going through the same thing and I just black communities working clan on Highway Journey communities, but black people are usually first, right? And so the eyes on you Seattle Seattle U a council person in the city. The mayor is an opportunity to lead. They LED with weed and seed and water spoke about weed and seed it was started in Seattle Washington pilot it here before being taken out and spread across the country and we heard a brother Lawrence speak about the population. So it's very clear who was identified as a weeds and who is identified as The Siege. So let us raise the bar. That is Seattle going to be the leader and a solution. Or leader in how to destroy communities. I just quickly the other thing I wanted to add. I know why Cain talked about the reparation part of it, you know, one of the first things we need to do is actually do a complete survey of what was and what is today so we can actually get an actual amount of actually and show measurably of exactly what's been taken out and I would like to throw their proposal out to the city that we would like to be able to do that survey so that we can go around and take accountability and find out exactly what we have left in our communities because right now I don't think anybody really knows so in reference to what you were talking about. I think that that would be a great start, So I would like to throw that proposal the other one is is we need to figure out a way for we have a lot of development taking place here. But one thing that we haven't talked about is the ownership part of it, you know, we Talk about inclusivity. We talked about having black owned businesses and minority-owned businesses in the community, but you're renting. Now that's a problem for me. How are we going to acquire? Well if I'm renting so I also would like to throw this back to the city in regards to how do we start a campaign in regards to creating holding these developers in general? How do we get that that that conversation? Because it doesn't do me any good to come back into the city only to pay somebody else's rent. So if I'm going to sweat the labor and I'm going to be producing the product then I want to be able to acquire some wealth also because the developers are already getting their piece of pie with their tax breaks, you know, and so my point is is that we have to look at this from a different perspective and say well if you want me here then I also should be able to get something out of this. And so again that's part of the demand process, you know, we can't go in there lacks a daisy. I know that why I came in the guys are working a lot of great things that are going on right now to consolidate businesses to help black owned businesses minority color people of color businesses, but we need to take it even that much further because we've got to be able to look at this and say to ourselves. Hey, wait a minute. I'm not owning nothing now. We used to own businesses but developers have knocked that out the box. So why can't we on so again thinking about what we can do those are type of conversations that we need the moratorium. Those are things that we need to add to that conversation about on it. You know, I'm tired of renting because it ain't get me nowhere. So the last thing is is the reparation there should be again, I think so want you did so on you did talk about this. There should be a mandatory policy that any businesses that are taken out of the community need to have that relocation from we shouldn't beg for anything. We shouldn't be big. You are removing us. Therefore you should compensate us. And so again again again, we as a community need to stand up and we will be united we will work together and we will figure this one out because I guarantee you this ain't going to be the last. And the only way we're going to stop it is to work together and to say to ourselves enough is enough. So I pledged each and every one of you and I asked each and every one of you tonight don't just walk away from this and share the conversation with somebody else talk about some of the solutions that we need to be doing and get with one of the representatives of the community or the city council or whatever and start demanding that we have these things put in place because I guarantee you 45 Don't Give A blank about us. That's all I want to say. Again, thank everybody special on the Panic panel kale Viking Lawrence, and the city council and endl ACP forever. Everybody's participation and assisting us and thanks to New Hope for hosting this and continually hosting stuff. I came here last time when they were here for the Chateau and I think that's just awesome what they're doing. So here's our next step for a guess you can call at our next action step is to organize a delegation to go to the Centric office together as a delegation and deliver a letter that will contain our community demands and support for our small small businesses. We want to immediately in in and ask for that for full we location assistance in a full apology to my mother who sometimes can't sleep at night quite honestly because of this experience Absolutely. Thank you. Thank you everybody for all your extremely important words are very very important. And we're also making notes on some of the concrete policy proposals that have come up and I wanted to go to go over them in a bit. But first in connection with WhatsApp, I just mentioned in terms of organizing a delegation of community allegation. We were also in consolidation with, community members be prepared a community sign on letter that Sasha and others from my office should have many clipboards of this but I just if he said he wanted to start circulating that I just wanted to read the substance of that so that you know, what is on it and Our appeal would be that all community members here join us in this the sign on the door says we the Seattle Community Support Saba Ethiopian cuisine on 1st Yale located in central area. We demand that sending Partners LLC support the restaurants immediately location. We call on them to reach adjust resolution to relocate the restaurant in the neighborhood for 20 years. Abba has been a beloved fixture in the community on 12th Avenue serving tens of thousands of customers its own are working but we should have supported nonprofits donated food and provided Gathering space where everyone is welcome and I should add I have personally been fortunate enough to experience the the wonderful Gathering space that's about was and it is personally gut-wrenching to me that that space is no longer available for us. And so I have a strong interest and I know the community she has a strong interest in seeing Saba up and running and making sure that you win Justice from the developer the letter for their says we are outraged alone. Saba was recently evicted by Centric Partners throughout our community systematic gentrification in economic eviction is displacing working families and small businesses by Parker developers like Centric Partners in LA. We make huge profits. This is unacceptable. We are united in our demand that sounds like Alchemy immediately raise reach of their settlement of saba providing the full resources of the restaurant needs to relocate to a new space in the neighborhood. So I really invite you all to sign this as the music members, but I also wanted to say if you belong to a community organization that is also as an organization signing on to it, please make sure that you also provide their organization's name, but if you are not a member of an organization or if you are but you don't know if your organization supported yet that's fine. You can sign as an individual and then be in touch with my office to make sure that you let us know if there are more signatures we want we want to have as much support as possible this I know this is going to be part of what the delegation takes to do alchemy Centric when we go up very likely next next week. I just wanted to quickly summarize some of the points that came up. So so we we have that on record for the next item also because of the committee members were going to be speaking on the timer also brings ONN I want to make sure we do that before everybody has to go. I know everybody has families and dinners and homework and everything to be a bit so we won't be don't want to keep everyone too long. But I want to make sure we have that discussion as well. But just to acknowledge absolutely as Lawrence was saying we absolutely want our entire Community to be organized in support of all our community members, including our church spaces. And in fact, some of the point that Lawrence was making reminded me of what Miss Michelle Reese who spoke in public comments said which is that more and more especially African-American churches in the neighborhood and the churches are still surviving somehow, you know, they're struggling to maintain a foothold but they're still here but their parishioners have been pushed. Of the neighborhood and the city so really what we're talking about is bringing the community that built this community the community that build a community is actually now this place and economically evicted and that is why we do need to talk about larger policy solutions for affordable housing. I completely agree. It is not the board and should not fall on any charge or any Community member organization. It is absolutely the political and the moral responsibility of the mayor's office and the city council to provide for this and it is deeply unfortunate that I'm the only council member share. This is a council meeting and show my appeal to you all as if we want this message hard and we need to get organized and I really appeal to you all to get organized with my office and with many of the organization that I mentioned before and of course, I should acknowledge the Central Area Chamber of Commerce is also alongside us and so many of our churches and church pastors are with us. And so we need to make sure The mayor's office in the city council understand that it is our responsibility off the mayor and the city's legislature, which is the highest elected body of our city just solve the affordable housing and homelessness crisis and unfortunately the leadership that leadership has failed so far and this meeting in our view as our as all my fellow panelists have said is a meeting to highlight that starting with Justice for Saba. So we absolutely want to talk about not only about relocation assistance from Alchemy Centric for Saba, which is absolutely a starting point. But we want to talk about a Citywide policy of relocation assistance for all working families and small businesses that are displaced because developers by up your building and then they want to demolish it and put up an expensive place there. So I hope that we you know in general we have a community agreement on on the topic and I just wanted to share the idea of relocation assistance to small businesses and nonprofit is not a new idea, but I didn't invent it nobody my office invented the fact is that if you look at the city state and federal government website, you will see that the federal government provide relocation assistance to small businesses that are displaced because of federal government's construction government provides assistance when it's a state project and the same obligation extends to the city and this is all enshrined in law. So why should private corporate developers who profits so enormously from developing the city? Why should they be absolved of this responsibility, right? They should be they should be having to pay relocation assistance. And so coming out of this meeting we want SuperSU. Question off in a Citywide policy, why aren't corporate developers being made to be mandated to pay relocation assistance to small businesses. I think it absolutely should be in the law. The other thing that I can come up so far, but I think is it related is also the question of commercial rent control for small businesses because rents are skyrocketing not only for Working Families, but small businesses are facing the brunt as well rents are going out for commercial spaces as well. And so we do need to expand the conversation into commercial rent control again would be a good policy and I wanted to also include in our conversation. We won't have too much time to talk about this will come back to this in September of the council break. But we we know as Laurens mentioned a very important point about Community. I mean ownership of home home ownership for our black and brown community members are low-income community members and I wanted to point out that the question of residential rent control plays into that because I just wanted to share an addict. It's an anecdote, but I think this is this going to be statistically proven as well one of our community members in the Central District. Her children grew up here. One of her sons move to the Bay Area he and his wife lived there for several years. They had rent control their because of rent control because the rent was skyrocketing every year they were able to go to the ranch or manageable and of what a fordable meaning no more than 30% of your income. If you're paying any more right now, if you're here, if you're you're in the church and you're paying more than 30% of your income in rent than just know that is not affordable. You are in critical need of affordable housing. That's how I would Define it as an economist. Anyway. I need the number to told me that her son and daughter-in-law. They had rent control in the Bay Area because of that they were able to save up and they are now come there a community of color. They're coming back to the central district because they were able to save up to buy a home in the Central District. So We need to unite homeowners and renters together because our interests are tied together and rent control an actual rent control Universal Mind control policy free of corporate loopholes will actually also be one of the Avenues to watch home ownership because you're not spending fifty 80% of your income in rent and becoming, you know priced out of the neighborhood and in a far from being able to buy a house and we also want to extend the conversation on public bank because predatory lending specifically targets are black and brown community members. And so we want to talk about, you know affordable home loans as well. So this is a larger conversation. We're having not going to be able to do all of it today. But we we take all of these points on advisement. Also the point that was made about a community survey about the businesses that are being lost in another very important point something that something that we need to revisit by the city council discusses the budget in September of this year. So I really urge everyone who's your to join. People's budget movement as well and and we will show our next steps. We will be organizing a delegation to deliver a letter and the community sign on letter to Alchemy Centric next week. And the last one I wanted to add in relation to rent control is that on September 17th? This committee will be meeting again. Unfortunately, this probably will be at City Hall, but we will try to organize it in the community if if possible and there we will be discussing residential rent control in much more detail why we will be bringing forward a draft legislation and someone so lot of lot of points to discuss. I really appreciate all the committee members who spoke in public comment and also on the panel and we need to revisit this issue, of course, so please stay in touch with my office. Make sure you sign up on a sign-up sheet. Even if you didn't speak at public comment really urge you to sign maybe the rent control petition there so that we can keep in touch with you and invite you to the next meeting when we will all be organizing if you want to make sure I'm not going to just stalking your we want to make sure real Justice is delivered to stop by which means real dollars of relocation assistance and a real apology to mrs. So I did not going to be easy. So I took the survey wasn't just about businesses being lost but he was speaking about wealth being stolen from our community coming in. We couldn't get along there was contract selling and the Weaver charge more and now wealth is being stolen again people can only sell at whatever they can sell that and someone else comes in and captured the real value of the property based on the hubzone. So we want to talk about wealth has been stolen from our community. Do doc of immediately formulate the the proposal for the study. So just real quickly relocate wouldn't I just want a piggyback on what she was saying about relocation being real just understand this when I talked about earlier about some things that we didn't talk about. We took a passive role in what was going on. Meaning are her previous landlord. Try to fight her on the lease. Okay, so it didn't invent it she ate lost. But the point is they don't want to keep the lease has to give the to enforce relocation. They wanted her to be as wonderful as she was so they can she has to fight and go public. We do live in the days of social justice, which is important, right? We can go to the people we can change but they do Benz and a broken system. So she has to be vulnerable like a lot of small businesses that are not restarting and not you know, they're empty in these phases. If you noticed all these new buildings are empty. We watched a building be built the MC for 4 years all commercial space, right and what's wrong with that? Why right? So not only is the problem of leaving people vulnerable there people are scared to sign this lease. Especially with the growing rent. It's ridiculous. Anyways, I say that to say that relocation is real but they do put you in vulnerable situations that we all have to learn from. So again, you know, what it Where Carlos of a hat what happens feel free to reach out to me. If you have questions about how to like really secure yourself in your future because you know, it's not happening a lot right now small businesses that are closing aren't reopening why why it's because it is thank you. So yeah, we have lots of steps to follow up on in my office will be working on those things and we are nothing without the active participation of our community members. So I really really wanted once again thank all the organizations that have already been in support of saba and I came here today in solidarity with them and we will be following up with my office will be following up with Lawrence and biking another organizations on what the contents of the community survey should be. But if you are here and haven't spoken to your not on the panel, but you have input to give on that. Please let me know and we will we will make sure that is included and that is something that we have to know the conversation will continue. Revan event coming up there's an event coming up to follow up that's dealing with this issue aren't well a community tradition is Emoji fast has been our community of the 7th at Madison Mardi Gras next Saturday and then it come down to Judkins Park, but on August 10th, we're having our second Central District design weekend. We will be discussing connecting the dots not only between with focusing on projects that africatown had with our original presents. So if we want to plant, how are we going to be in the Central District South Seattle Renton Tukwila? Federal Way all the way down in Tacoma with dealing with the same issues. We have to design our own planned. What's happening is that were victims of planned because we don't have our own plans are not executing them as effectively as others are and so we need to come together. So we're not always reacting also and so on August 10th at Washington Hall, it'll be a full day of those activities and all community members and organizations are invited and encouraged to come and participate. Thank you so much. And the design meeting you at my office will be represented at both events. And I hope community members will join in as well. Thank you very much. Just because of lack of time. We have to go to the next event at the next agenda item as well. And can we have a round of applause for all the I apologize to the panel for the second agenda item for the delay. I know that people are passionate about the issues we're discussing which is great. That is what I wanted to see you because we cannot fight these battles alone. However, we do need to get going. So actually because we are so delayed put can all the conversations. Please be taken outside. Sasha please take all the conversations outside. Please take all the conversations outside. I like to be very relaxed, but we have to respect their time. So let's have very quick introductions and then shout and I will let you just introduce it without any remorse for me. Give me have one side of the directions from everybody. What biking is already introduced himself Robert Jeffress pastor here and and done working with Sharon to build low-income housing. Sharon Lee low income housing Institute Lutheran Church of the Good Shepherd Joe Staton with c a y so I just want to see do we have a representative from the Goodwill Baptist Church and Eve are presented from Goodwill Baptist Church. Okay, cuz I'm Bishop Tyson cannot be here. But he was going to send a representative. All right, we can get going then. So we wanted to take this opportunity to talk about the housing needs in the central area. And I think it's very important to note that the demographic has changed so much but there's actually a lot of opportunity. There's a lot of opportunity with historic churches and nonprofit organizations that currently own land in the central area and instead of selling this land they could develop the land but they will need significant resources from the public sector as well as the private sector. So instead of redlining the community the opposite needs to take place there needs to be a significant infusion of capital public and private sector capital and we can preserve existing housing in the Central Area + build new affordable housing and mixed-income housing. So that residents who have been displaced can actually return so that you blackguard a task force in conjunction with the United black clergy are interested in working on a plan to have five hundred to a thousand units of affordable housing new units are preserved units return to the central area. And so we brought a number of the organization's here to talk about what they see as possibility on land that they own not that long ago. There was a Central Area fund and the Central Area find help Finance afforded. Housing low-income housing the fund is now depleted. But since then there's not been a focus on resources dedicated to the central area. I just want to say who Lehigh is we're low income housing Institute. We're a private nonprofit organization. But if you go around the neighborhood, you will see some of the buildings we developed specifically to offer housing for existing residents of the central area. So we completed Ernestine Anderson place, which is on 20th and South Jackson. We completed Abbey Lincoln Court. Also, I'm next door. And then we also own Columbia Court and then we help the Goodwill Baptist Church develop three properties are Dale Mitchell Norman Matt Alma gamble Norman Mitchell Manor and so we have the ability and expertise collectively to bring about new housing in. Statuario for residents historic residents of the community when we least stop Abbey Lincoln Court, we made sure that there was significant marketing and Outreach to Central Area businesses and organizations. So 75% of the residents were African-American or African or people of color primary African Americans. So this is possible to move forward with land that's already under command control. So I want it on maybe Reverend Jeffrey to talk about the opportunities here. picture I think you know the battle is not lost saying there's a lot of land still available in the central area. And what we have to do is be strategic is through how we develop that land and then make sure that we develop it in a way that brings African Americans back into the community in conjunction with work africatown is doing a historical reality is that we're in this dilemma because redlining sorry been said poor City Planning and decriminalization of an entire community. I bet you know, for example, I believe that this is place that you're sitting in was a target of weed and seed church burn down without real explanation in 95. because of our advocacy and they said it was an accident. I live three blocks around by the time I got down here the whole building was destroyed. And this is a new building that we built and this building is fireproof. All of the bricks or concrete the only wood is that wood in the ceiling. We built this building because this is a building built out of resistance and in spirit of resistance, and we're working now with Sharon. To all continue that idea that it's not over we have Laying across the street we have laying here and not know it been stated that we should deal on affordable buildings. But one of the reasons one of the dilemmas we have is that the bank refuses to refinance our debt in a way that is amenable to us-98 and a half at 9% interest is not Amenable to a church to spend in this community for almost seventy years. That is the rate that the bank continues to give us. We have two as a as a matter of survival and is a matter of just Integrity not allow ourselves to be treated that way. The bank continues to treat us as though we were predators and there's no way were aliens and that's not the case. Most of our members lived in this community built this community in a lot of have since left, but they left forcibly because they couldn't afford the property taxes and they couldn't afford then the bank wouldn't give him money to redo their houses in a way that they could anyway, that would be Equitable to do. So, this is a warm in this is an economic War Wing waged against people of color against black people against black institutions against against those of us who resist And will not go the way of the dinosaur and just leave. So we're we're delighted to work with sharing. Our commitment is to work with other churches and we have letters of intent to work with us from at least five or six churches and pastors and organizations and Community people to help develop land that already exist. And what we need now is somebody said that it is not our responsibility to do this. When I agree. This church is building those townhouses on the corner primarily because of survival. Because we have to dig ourselves out of a hole that we were put in against our will and against everything that we stand for but you know, we have to do this but we're asking the city to make those units affordable for middle-income people because I don't want is you can't just bring poor people back into the community. Some people have to be come into a middle piece of middle-income people who can afford the level of of rent that may not be at the poverty level mean this community existed with all kinds of people. And and it should exist again in that same way. So we're committed and we're working with the Lehigh because we believe that they have the capacity and sharing this great person and I added that we're working with whoever we can work with to make sure this gets done our church partnership with me. I initially to do the Chinese village on yesler. And so this is just a continuation of that partnership. Thank you plan to develop a hundred units of housing on two sides that the church owns but that is highly contingent on resources resources. We will develop our life and we will develop it in in other ways. We're not going to be Beggars at the bank at me when I go to beg people to do. What's right. We have property we will even do the right thing as a city to do the right thing or we going to use the property to make sure that the people of this community and the people of this church prophet. Sounds that and I want to be shy and can you also quickly say the numbers? What's your estimate of how many units can be built on this property? Well on rev Jeffrey new New Hope Baptist a hundred hundred units plus possibly a Early Learning child care & Wellness Center, so it could include kamee facilities as well as affordable housing. Yeah. So it's a look at the land across the street here and then next door right until he doesn't need to go buy a new land and then I want to introduce Steve Tucker. He is a trustee with Lutheran Church of the Good Shepherd and he wants to talk about some of the demographic changes. He seen in and their church as well as opportunities for housing. All right. Well, I'll start by saying that we have a four-year partnership working with the low income housing Institute, and it's been very positive and important part of our Outreach Ministry at Lutheran Church of the Good Shepherd. We're located one block from the corner of 23rd and Union in the middle of Seattle Central area, and we host the first tiny house Village in Seattle. And we have definitely seen how gentrification and displacement has change the face for a community over a Year's best example is our annual Vacation Bible School was as one of our most successful Ministries and we used to go out and recruit 8200 kids all ages through that's 70s and 80s and while canvassing the neighborhood the same in the canvassers are from the neighborhood. They know they know the neighborhoods in ovale. They know Madison, they're up on Cherry all the way out to Jackson. And so they know the name that's where the families were and I not there any longer. So now we're down to maybe 10 or 15 kids. What's long with some kids from the congregation? So after that East Union Corridor was rezoned several years ago, we continue to receive multiple offers each year to buy a property at 22nd and Union and to answer the gentleman before that's never going to happen and the developers of course are ready to build apartments and condos displacing any even more of the long-term residents. These buildings are going up around us now, but our mission will remain the same which is doing we can to assist in the homeless situation. We have here and Seattle area. We host a Nickelsville encampments twice over the early part of the decade then as we began working with Lehi to move from the tent cities to the new tiny house Village, we had to explain to our congregation and the surrounding community. That this New Concept would be much different there would be no porta potties no scrap wood barriers faced the neighbors and none of the drug-addicted population down the street. Unfortunately a lot of the population as we all know does not want or need need help but there's a lot of people that do I need the help or want to help we would be connected are tiny house Village is connected to all utilities included electricity oil heaters restroom, showers waste and recycle service. And even the one in Jeffrey's includes laundry. So 3 even proven on that and we have a nice fence constructed out in front. The same as they're our neighbors would would construct. We explained that the population wears helping in those are those individuals and families that just need a break examples host of the family of 5 4 out forced to move out while the belt first moved in they needed two houses. We believe there's a mother of three kids and school and this is, finally escaping dangerous an abusive relationship at home. So these are the examples of people we've come in contact with military veterans suffering from PTSD trying to get the life back together unemployed parents with newborn child and of course individual men and women looking for help and wine are held lehi's model of case workers providing counseling and access to much-needed Social Services keep our tenants moving from tents or their cars onto the tiny house and then on to the compartments, I don't have the stats. For this type of movement, but the numbers are impressive insured might be able to help us some of those but there's a lot of movement which is quite a bit different from the tent encampments. So even though Good Shepherd has hosted the very first tiny home Village in the Seattle area. We now hope to continue planning with leave Lehigh to use two of our Lots we have for two on Union and 2 on 22nd. So we hope to use two of our plots to replace these houses with much larger low income apartments with space for a social services or nonprofit on the first floor. We are aware of the EDI funding proposals and we welcome the opportunity to join Collective efforts of the black Dollar Days task force and others to assist with the urgent need for a permit long term housing for those members of our community experiencing homelessness. Thank you. Thank you Steve. Thank you. And Nick's I want you to do some Joe Staton and I'm from c a y Central Area Youth Association and they also own property on close to 23rd and Jackson. Thank you. Good evening. I don't know if everyone knows but Cy has been in existence. This is our 55th year. Not necessarily being at this location right behind us here. We're on 23rd between 1st and yesler and we've been having our challenges over the years like everyone else, I guess in one of the things that I found out. Wow. Vintage director of Heroes. How much is affecting the stiff acacian and all this is affecting the kids. There's a hundred and thirty or so homeless kids over at Garfield that we're getting ready to start feeding out of our kitchen here at Cay because that's my school. My dad went there and graduated 1929 and all my whole family went there except for my mom. And I feel it's up to me now to do something about that crises. That's just one of the things that we're going through here is does homelessness we have People coming into the community like we're staying alive. The people are saying here today buying up all the property and not doing the things that they should do with it. I've had a couple of people come in to buy our property and so forth and help us develop it that it and it never happened and it's because of a lot of people come and do a lot of talking some of it was my fault. listening But the property is still there. It's still owned by Cy and it and it always will be and I've made sure that that will happen and that will stay here in the community, but it's not that easy talking but we got to have the funds to do so and it's very expensive to be in the Central District. Now, we're two blocks from Paul Allen's development and we're right in the middle of like kings development and Paul Allen. So we have to do something quickly because our property is is it's just sitting there actually it's been in use and stuff that we have to develop it. I've talked to Sharon recently and we're going to try to work on something to get Cy developed. And get it back into place. It is supposed to be I remember when I first started at CA why I was the gentleman who founded CA why was Booth Gardner our past Governor and Noel Mitchell? Who was the black man and just a wonderful guy and they've done a lot for all the kids here in the community and so far so I have to do something to the step that up. I'm looking at some of the developments that's going on around us. It's I can't even get down the street. It's so terrible and so big and gaudy and so forth and I'm looking at all these houses being destroyed and stuff in wish to run around this neighborhood and play and have a good time and The whole Community was African-American and I don't know if anybody can understand how in-depth this was. I grew up in the neighborhood where? I'm going to name a few people who were in my neighborhood. This is five blocks right up on in Madrona. the littles the hunters O re Henry. Mrs. Harbor the Flores family my family Janet Jones Preston name is Alonzo, Aaron Dixon McKinney and Delbert. We all live within five blocks of each other straight down 33rd. And no the Chappelle and other people in that area and I go by there now and oh my goodness. I can't even recognize the area anymore. And it's kind of sad, you know of me because when we moved in those houses and so forth. They were anywhere between 10 and $15,000. And I drove by there the other day and the house is started by Tammy and I saw two or three million dollar houses in the same neighborhood that we grew up in that didn't make any sense. The kids asked me all the time Mr. Johal on how can I buy a house? You know, it is hard to talk to a kid about buying a house when they cost $800,000 with $15 an hour. So there's a lot of stuff that we need to go through in and I've noticed these Developers. Only got to do is write a check and they don't have to put any affordable housing on the top that's got to stop for houses. Got to go everywhere. They can't just write a check somewhere where I can check when I do that. Let's go ahead and move on and $3,000 rent a 300mm very proud of my king. for his accomplishments because a lot of people have moved back into the community because of his efforts and I know he didn't do it alone, but You could afford to move back here without what he's done over on 23rd 24, so I'm happy about that and they'll be more developments like that. But we going to have to help him, you know when we can just talk. We just really cannot see a lot of talking going on, but nobody's really doing anything. We got to get together and help each other. I know. So I don't have a whole lot to say right now. I'm kind of tired. I've been going through a lot these last few days trying to deal with these developers, and they're giving me a headache, but we have our property where we wanted to be and we have about 11 to 12 thousand square feet is not a whole lot, but we're trying to go out to the corner. So we're going to have to put some affordable housing and stuff on our property. It isn't what we do when the kid business, but that's part of being in the kid Business Development property and finding places for these families to live. Thank you. Thank you. So I was hoping my king. Would you like to jump in and talk about Africa town and your efforts? Sure. Thank you. I'm a I'm a product of the Central District. I'm a product of CA why does my baseball coach Joe Staton and you know, the Central District have been written off. There was a moratorium on low income housing in the Central District. Now that needs to be a moratorium on predatory development think that was about 20 years that moratorium on on on on the affordable housing was here and the Central District have been written off in MN people were basically giving up. I think the city was only talking about the south end and and an immigrant and Refugee populations as a related to you know, needing housing or services are preserving those communities and in Chinatown International District begin, you know, feel pressure and so they were recognized but the Central District had at 4 as a black community. Have been written off and so it's very encouraging to hear now after you know, really pushing and raising the issues that we're not We're Not Dead 1 we're still here and we just we really wanted to see our churches, you know, stay because there was a lot and some have gone. recently, right and we said if you develop the property. input housing there that people your congregation can afford to live in then we'll have a community to see that coming to 4 wishes, you don't have to we have this community and we have new communities and we need plans to develop both the total Pan Asian Community doesn't live in Chinatown International District, but I still their cultural and economic and so we don't all have to live in the Central District. But this is still for almost a hundred forty years. Then the heart of black African descent people in the state of Washington the Northwest and so that should continue and one in tea Can develop enough because if you look around you see crowned cranes everywhere. You see Vulcan got there cranes this group. They claim this person had a crane. So to create any type of balance. We know we need 10 2000 Liberty Bank buildings, and it's not just the Liberty Bank building as affordable housing, but the next step is definitely ownership. but as you heard and as you know There's a big gap between what our community has been. Excluded from economically as the city has grown if we participated equitably in the growth of the economics of the city then yes, we will be buying $800,000 houses as well. But because the school system has been systematically failing black children for x amount of you know years 50 years and not included in this high-growth tech knowledge base economy. Yeah, we we are still out of working class level. And the city has to have places or I wouldn't say has to have places. It should have places for everyone that needs to be here because everyone is not going to be a developer a programmer at Amazon. Someone has to someone's doing security. Someone's doing fulfillment of these boxes. Someone's working in the coffee shop. Someone is taking care of the children. So where are these people going to live? Because they're going to be a part of the economy. So africatown has been about maintaining preserving the Central District as a place where the beauty the Brilliance and the best of the black experience and African diaspora weather is here in the city. But we didn't start here we came from somewhere and we had greatness there that we brought here and we didn't start on plantations. We had greatness that we brought there. So and we're all over so we want to have our community. Where are Harlem Renaissance are Motown or Black Wall Street or Egypt or Timbuktu our afro-brazilian or afro-caribbean all these different Rich experiences can be Built and inspired the development of our community. We don't Define our community based on deficit we Define our community based on richness. The problem is that are rich in it has been exploited in stolen for so so often and so now we want to make sure that as we go forward we're able to capture the value from our culture and our talents and our genius the same way others are like the Seahawks right? Look at that team Starbucks Ethiopian coffee ceremony a piece of African culture and it goes on we can keep going but that's what African town is about as acid-base comprehensive is a big tent we can all be in it together. those of us that have been here for many generations those who have migrated more recently and added new flavors and richness and how do we you know build on that and add value not only charge each other in our community but to the city and to the world from his place and so we are calling for Robust fun we've identify week. We need at least a billion dollars over till we need to at least two three projects a year to keep up with the pace of what's going on and it needs to be grounded in the fact that our wealth has been stolen through many different policies as we said before contract selling coming in. They were stealing wealth from us depressing are property values the red line and while we were here stealing value from us, you know, and so I'm paying higher rates for things. And so now it's time for us to have some justice we hear about social justice in Seattle. We hear about shared Prosperity race and social justice initiative Equitable development, but we have to make that real in bricks and mortars and we need to own the land. We don't want to be developed for we can work with But we need to build the capacity in our in our in our in our own. We're tired of being exploited by, you know, so many other people that are not particularly the ones that are impacted by what happens in this community. Thank you. I'm sorry. I'm just once again Reverend Jeffrey among other things that you all bring up in your upcoming point and especially Sharon if you could I'm hoping that are coming out of this coming to discussion we could have my office can have some guidance on what next steps we can pursue to begin bringing this to fruition and some of the questions I had our do we talked about how it an estimated 100 units plus Childcare Center and something else you meant Wellness Center of potentially just on the property of Jeffy shirt, or do we have a similar accounting for other churches and and then But also overall can we bring together churches community churches that are interested in doing this project and can we come up with an accounting of how many potential units we could build and then flew in from that what kind of funds were looking for? How do we go from there? Okay. So Reverend Jeffrey can build about a hundred affordable units on his site and Goodwill Baptist Church has some vacant land and they are ready own three apartment buildings and those apartment buildings could also take on more capacity because they've been up selling some of the land has been unveiled and some of the buildings are very very old and then Good Shepherd has land that they could I think that's like two lots approximately two lots that they could build and it's directly directly across the street from luxury housing. They are surrounded by Cherie multi-family housing Yeah, and then we also have a tabernacle Missionary Baptist Church also has land. I think they would need some help with zoning. I think they were I think they're zoning is very low density. But I think if you work with Reverend man away, he would be interested in looking at higher density housing as well. So and then we also have a Greater Mount Baker right and they also are sitting on property right next door to the Vulcan development. So there are quite a unfortunately the church that's next to Uncle Ike's just put their property on the market for is it 4.6 million or so and so they are there property is on the market already next to Uncle Ike's on 23rd very unfortunate. So I think if we can develop a plan. M4 how to reverse the trend build a thousand units for Central Area historic residents of the Central Area. I think we can dance start reversing that Trend but I think we need Target at financing to do that right now. It's not enough to say, oh we'll do one project in the Central Area every 5 years that is not going to get us there. So with your Leadership Council Mission sawant maybe while we can persuade the council that there ought to be significant Focus because the greatest gentrification and displacement in the entire region has been the central area. So it's it's it's deserving of extraordinary resources to now we do know that the mayor and the council you're selling the Mercer Mega Bloks and then you're also raising additional funds and then also a council member Larry Gossett has Resources for affordable housing as well at the county level that could be targeted to the central area and other places so maybe no no they have that they have transit-oriented development funds available. Okay, that could be targeted as well to the central area. Okay. So I think if we can get we can get to the point where we have like five or six new housing efforts going up in the Central Area per year, then we can definitely reverse the you know, what's going on reverse the trend and then I'm Reverend Jeffrey want to announce something to First one to say some of the people who had to sell out a good friends of mine. I mean, they didn't sell because they wanted to we sell because this is a very nice the exploitation is just real I mean marijuana shop open up right next door to to a church where you have young people coming every Sunday morning. And nobody said anything about it. I mean, I mean, I mean exploitation and the disrespect is just just palpable me. Nobody wants to be disrespected like that and nobody wants to be treated like that. And and where is your capacity to do anything about it? I mean your membership can generate so many dollars, but that's not going to help you fight the kind of development funds that are coming into place like Uncle like sand and the kind of tax breaks. He's getting to basically terrorize you out of the community. I mean, so, you know, I'm not defending selling you feeling I'm just saying that there are Where are systemic reasons why African-Americans left their homes weed and seed was a Monumental part of that just to just a total land grab and and then just the the escalating property taxes and then just to disrespect that is going on in terms of Institutions. Like, I'll carry but you know, we have to to partnership with Lehigh. We are creating we've created at what we call New Hope development Institute, which is going to be chaired by Denise. Lanesha deductible Avent. She's the head of the museum the Polk Museum and she's going to be touring VP the housing project me. I just I believe that there was a way out of this. I think that the city needs to do its share, but I don't hold out a lot of Hope. Because it seems like the city is just totally blind to what its responsibilities are as it relates to the preservation of Integrity Integrity of of the city planning process. I mean these people just I mean the people many people have just been totally just ripped from their their properties in and they have no way to get back. I have no way to get back. I have a house if I sold my house tomorrow, I wouldn't be able to get back here and she's locked out and that's you know, that's progress. But that's also a consent that's almost the same way to to move forward that's not happening in places like necessarily like valid in other places where you have this Uncle in such a certain extent but not the way it's been here, but there are protections being given to certain communities that are not being given and that weren't given to African Americans and I I just think it's it's unfair and so we need the help of the city 2 to do this. There are churches right now when the head of the black group African American ministers Group, which has about 17 18 20 churches wrote a letter and they want to do this. If they want a way out everybody wants a way out. You know about you know, that is that is that is fair and that is going to bring people back in not necessarily their members, but people of color black people who have historical plates here. They want to bring them back and they want to do their part to do it. They're ready to do it and they're organized to do it not only the churches but the institutions like c a y and other institutions, but I mean there has to be some movement. I'm not going to beg. These churches are sitting on gold mines. We're creating a Development Corporation so we can teach them how to leverage that gold. Mine. I'm not going to beg you to do what it should be doing. We're going to ask City. We're going to pray that the city does what it's supposed to do. Before other things have to be done that with none of us want to do but there are ways in which we can leverage our property. I don't apologize for those ways because I'm not going to lose my property because I let too because I didn't do what was necessary. Does that make sense? Are we going to and we're going to teach others to do the same and we going to be building a homeless Villages wherever we choose the building. I mean the days of us apologizing and on our hands and knees. I mean, you know, it's just this is a responsibility of city government to do something about this problem since a glaring problems. Let's do something we have people lined up church is lined up organizations lined up by King is doing his thing. We need a multi-faceted approach to do this and the city needs to get on board. We are together the city needs to get his act together and get on board. I would just like to ask at a point of clarification. I'm not doing my thing africatown Community Land Trust was established because there was no development entity in the Central District that was you know, had the capacity to develop in this is where the Partnerships and things of that nature came. So one of the things that we've been doing is driving to build that development capacity into our community and that we have Trust which are used for long-term ownership to keep things affordable or two for whatever the mission of that situation is. And so, you know, we would like, you know, we would hope that we would have the support and now I know there are many new initiative we know about there's a PDA that's being it is, you know formed and so we what we want to do is try to concentrate our efforts as much as possible and leverage the strips that have been existing and been being developed so that we're not always also Reinventing the wheel at every turn right and so how do we you know organize things in that manner in collaborate in that manner so that long-term with thinking about our future and our next Generations. I represent a different generation the support of the previous generations is critical in terms of A viable institution because it was in a void that we had to raise and build something from scratch and that should be embraced and look at how can we collectively strengthen that with the access that we have in our community? And so I just wanted to make a note of that that is not a person that was not my thing. I want to community all of this is about community. And you know, I have utmost respect. I don't I didn't mean to imply anything about that except that it is an effort spearheaded by you and others. That's alright. That's all I meant to reference me. I did not any in any way intend to tell you I mean because you had a pact. Place up here full community people in that place and the housing that you build its 95% full of African-American, so I have nothing but respect. Thunder respect, but what I'm saying is is that this effort is multifaceted. It has to be multifaceted and that some at some point we're going to have to do some profit baking stuff because ultimately if people don't step up to the plate and we have to create a level of wealth ourselves to get done what has to be done and I don't apologize for that. Thank thank you so much to everybody who spoke on this and shed light on a very specific kind of initiative that we can take with the partnership of so many charges in our district and as shown correctly said we don't want like a trickle of a one project every 5 years that is simply exploding around us and it is, you know, just destroying our community and displacing people in the tens of thousands. And so this is I would say, in fact this is the very least that the city should be doing and signing off on this year because we need much much more than this but in the end it just out of respect for everybody everybody that you know this because it sounded meeting we have are audio-visual technician from the Seattle Channel and I wanted everybody to thank them as well because they've been here All evening and I do want to bring this meeting not the issues but the meeting to a close expound on this as a as an expert in the field is that you know, we're being told about that the bond caps at the state right around, you know, the 4% financing and it said it was so, you know, if there's a way that this the fund can be a used to specifically expand, you know, the bond cap with a focus on the Central District. So that would like to add that to the you know, specific technical points and that should be that can be grounded back towards again again HB 1918, which identify and documented that there has been systematic practices and policies that have injured disenfranchised and harmed The African American population that populated the central district for many years and we also have Seattle vocational Institute which you know is a very important project and we don't want a repeat of what happened at Coleman school, which is supposed to be sore after a world-class African American cultural Museum and cultural heritage museum and cultural center that we have an anchor institution right now. There is no anchor institution in our community has no place in this community that you can go to deal with black Innovation. Black Economic Development black cultural development. I mean, they made into an event space at the art gallery, but I'm talking about actual Center where we have our media Studios. We have our technology for say we have all of this emanating from our culture. So when I hear that you We're looking to bring people from there to now be on top of our development. That doesn't sound like a good start. Right and what we see going on with this PDA proposed in the inside behind the scenes non-public process to repeat and take us back after we've been making some strides. We cannot accept that. So I want to put that on the record. We are not going to stand for that part of things going back to what got us here because we got here while certain people were on the watch it on the post. So that needs to be clear. We are trying to put things back together. So I just want to put that on the record and so that we can keep things going forward cuz we don't want to be slow down now we got traction. We got a big ten. We got africatown. Everybody has a place in it or all religions churches my Black Hebrew Jewish, whatever we all Be there we need Economic Development. We need cultural Development Across the board. So I just want to put that on the record. Thank you so much. And I think if I think that the Venetia is a great person and she was not involved in whatever happened at the Museum to look at the board. That's who hires an executive director and that's who said policy she came from Detroit and she's working her a PhD in this work. I don't you know, I don't I don't I don't know only thing I know is only thing I know is All I know all I know is is that we don't want to repeat history. Next one. Next year will be building low-income housing or we'll be building townhouses next year after that. We'll be building low-income housing go with built-in some more townhouses next year after that. We'll be building low-income housing or we'll be building some more time house. Once we get wealth enough, then we will be allowed home low income housing. Thank you. That's all I know. All your points are well taken from all all panelist. It's extremely important that you all give me like I cannot thank you all enough for for speaking so frankly and pointedly about the problems. We're facing and what Solutions we need and my office absolutely I intend to follow up and we will be in touch with Sharon and then in touch with everybody through that but I just wanted to outline some next steps publicly before we close the meeting one is we will be in touch with All the organizations represented here to get as I said of a quantitative understanding of what kind of projects were talking about and Sharon. If you go to the house. Had that it would be extremely valuable for us all of the group and sort of a counselor everybody so that we can have a Clearinghouse to do all of this and I pledge my support to work with anybody but I don't want people incorporating me against my will I'll sit at the table with anybody and talk about anything and do anything to solve the problem absolutely be the successful project in the community like the Liberty Bank building like the project. Alia has been involved and they didn't come about without community support and organized coalition-building. So we absolutely need to do that. Toilet inside in addition to some of the some of the quantitative information that we need to talk about what kind of funds we are looking at and we know a lot about the timeline like how many units would go up at what time you know, and how many units will we see what you know, you're from now to year from now what you know, I think that will give us a solid basis move forward and then one thing that you already mentioned as yet bringing that Coalition together, nothing Viking made an important point, which is that we're not with this is not something about any specific religion. So we should absolutely be doing as a correlation that is building together. We need to start actively doing Outreach Tomas and other community places of worship as well. And if there are if they have landed a disposal if they share in our gold which I have no doubt that they would if they had land. The disposal then let's include them in this conversation as well. But let's let's also get the numbers right because you know in inside the city council is winding down at work for now because I will be going into a break in the last two weeks of August. And then when we come back in September, that's when we will be discussing it at the budget discussions. I can tell you. I mean, I've been through enough five of these budget discussions and every year, it's just unless we get organized and fight or something it is business as usual and it's they're tweaking making a few tweaks here in a few teeth tweak there, but it's still the same business as usual budget every year where the police department get the biggest chunk of the resources while the question of Housing and homelessness is neglected, but I think the biggest problem that we face is there's just not there's not going to be enough Revenue. 3 year we face this problem and that is why I really large everybody to join our people's budget movement. And I think this project this whole project that we were talking about a collective project of housing units in Churchland and other places of worship. I think we need to make that a rallying point for the people's budget movement cuz I'll tell you what happened. Because I can tell the future as a question with a crystal ball. But because I've been through this many years every year the question if if there's love to themselves the city council in the mayor of proposed this question as robbing Peter to pay Paul and rather than get into that kind of divide and conquer. I think what we should focus on is Raising Progressive Revenue to find all the projects in the central district and there are many other deserving projects of communities of color and I'm not being funded in the last several years, even though we know that they have everything ready to go. Hugo they just don't have the funds and so let's make sure we do Outreach to other communities as well outside the Central District so that together we can fight for affordable housing funding on all of the use of a project locations. I know that Ethiopian the Vietnamese and other communities also have product ready to go but they're not just not being able to find the fun and and the city council will keep talking about something of the Equitable development initiative and there was something that was fought for by Community member that did not exist without that but it is all of 5.5 million dollar. This is not going to give us the funds that we will need. We are going to need to fight expand the revenues and so let's include that in our conversation as well when we going to September, but my hope is that by the time we come into September and we'll have some of these numbers lined up and also have built a larger Coalition the next time we meet let's let's let's our goal be to have more people at the table who share this goal in the central list. Let you that Outreach work between now and then and just in the interest of time and interest of the staff members have been standing. There's one of them has been on his feet after all this while just out of respect for everybody. I want to just two projects in the Central District also that are important the fire station 6 which is part of the Equitable development initiative, which is supposed to be transferred so we can repurpose that as an innovation of and then we also would like to ask you to look into why our community is being excluded from Equitable participation in the King County records site because that is a government on site and the Central District which has been African American Community, but we're being excluded from Equitable participation in the Redevelopment of that site, which is receiving public funds to do it. So I public funds should not be excluding us from participation. And then lastly I just want to thank you again, for constantly. Is standing up and fighting with the community and raising the heart issue. So I just wanted to make sure that that was said And I really really appreciate the Toro manner in which everybody else participate in alderpoint. Please please do also follow up with my office. If we if we don't follow up on one of those points just because we might have just overlooked it accidentally just make sure you are all the important points that came up. We need to follow up on those systematically and community members. Thank you so much for being here. I know some have already left because it's almost 9:00, but I really really appreciate it. Love you until the end. I cannot thank you enough and really really just incredible and you know what? I I like that we did this meeting in the community and it's not all you know stiff and boring and where there's a political Point behind is when meetings are run City Council meetings are boring. It ends up excluding in disenfranchising community members because people are working so hard that you know, Bubbling with two jobs Steve Jobs have to put food on the table in the city council's obligation. That meetings are in the community in my office twice as much as we can't do this here and we will continue to do that and hopefully all the discussion that you can have on this topic. We will try to do it right here if Reverend Jeffrey because of the face plan on doing. Please stay involved because I totally agree. Thank you for suggesting that but but don't budget time. We're going to have to build a fighting movement. So at that time we're going to need not just everybody was here but hundreds of us because there's clearly such exciting initiatives that can be funded and should be funded. Thank you so much and meeting a jar.", "end_time": 8787.2}]}