{"format": "raw", "annotations": [], "confidence": 0.9593977505510504, "data": [{"start_time": 0, "text": "Good morning, everybody. Thank you for being here for a regularly scheduled briefing on May 13th. 2019. I'm as I described as the Clark and I discussed it will be the new process by which at the beginning of the council briefing. We will approve the minutes of the last briefing and we're doing this because the state auditor in our city clerk of looked at the rules and looked at the consistency of how we approve minutes. For example that are full Council and you'll see some slight changes on how we approve minutes for standing committees and this Council briefing. It's a formality but again, we will publish the minutes and make them available to the public. There was a complaint that that this kind of document was introduced, but I will make sure we're squeaky clean. So you have a copy of the first minutes. It shows the attendance and start time and ending time and whether or not we had a executive session of that kind of detail. So having said that if there's no objection the minutes of the May 6th 2019 meeting will be approved. Hidden objects in the minutes are approved and again will make sure that's online and available to the public. I'll start off as we go around the room and do a preview of today's full Council actions are nothing for vote this afternoon from the governance equity and Technology committee. I do want to make mention that on after this meeting. We have a split budget committee to starts at 10:30 and for the next couple of Mondays actually Tuesday and B5 28 by the next Monday on 520 will have a select committee on Civic Arenas and then on Tuesday, May 28th at 10:30. We'll have a select committee on mha I know she look confusing here says on next Monday 5:20 at 10:30 right after Council briefing. Okay, really? The point being is that after our briefings for the next couple of weeks? We have a select committee committee meetings right after I'm okay. Why don't we go around the room and talk about anything you'd like particularly the actions for the full Council a council member she want. Thank you present. Hello. Good morning, everyone. There are no items on today city council agenda from the Human Services Equitable development and renters rights committee. The next meeting of the committee is scheduled for its regular time tomorrow, Tuesday, May 14th at 2 p.m. At that meeting. We will be discussing with the Department of construction inspections about their newly launched renting in Seattle web portal. I don't show you all that hard to Central District and Capitol Hill. And also more salt in Seattle have been head by several shootings over the last two weeks including last Saturday. When a very young African American men Royal Lexing was tragically shot and killed. Our deepest condolences go to his mother Laura Walker and his family and the entire black community that is appealing from this tragic loss. There were also shootings later that night and then also one on the previous week, I believe on May second and third where there was no loss of life, but this is extremely troubling to all of us my husband and I actually live in that neighborhood and we hear shots from our house. So we completely understand the anxiety in the fears that community members are feeling and that they concretely want to end gun violence. So I will be myself and I will be discussing this hopefully in my committee tomorrow, but also going forward and all of last week and I just wanted to share with don't remember that my staff were in touch with several community members who live in the vicinity where the shootings happened and also we've had some really important input from community members who live on a particular block of a block of 21st between union and Marion and it's a block where approximately 3235 children live in the block. So it's very it's a it's a very crucial issue for the council and the mayor's office to consider because Dad has being a particular Spade of gun violence on that specific block. They're in the last school year. They're being a tour in this ongoing school year there have been three major shootings on that block. So we will be discussing some specific proposals from community members to what they feel would reduce the especially the drive-by shootings. I'm not an expert on these issues, but they have some concrete ideas that we will be looking at and we will be coordinating with the police department to share about what's happening. And also with the Department of Transportation. I do have one more item, but if you choose not to respond to this is fine. Thank you for addressing that the the fatality in the tragic events that took place and thanks for having a discussion involving the community. No Bots. I just want to know Sure that both of the Public Safety Committee and other people that the we keep our structure such that everyone we're coordinating at the best way. So Public Safety. It's such a huge for half of our budget I think is very tempting to try to pull off some but as a process at least what I would my world has tried to do is try to centralize as much as possible sister. They're going to chime in this while this affects your District clearly in the central district and Senate committee members affects every District. They've the kinds of preventive work we should look at and so I want to make sure that it's it's become centralized as well. But that's not say move forward and do it and and things whatsoever their specific questions related to the Department of Transportation, not the department of the police department that we would like to discuss and I am happy with a regardless of whether it Ending my committee are in another comedy. That's fine. And we're happy to coordinate a duck. The question is the most important issues that don't look like those questions get arrested last week. I had a briefing from Human Service Department on it was very good and I encourage all off you think a couple of you've gotten a briefing on what kinds of things the least executive in the department thinking about in terms of violence prevention, and I enjoyed the briefing thoroughly. And so I'd encourage all of you to try to take advantage of the briefing. They're just trying to gather some feedback from us as they move forward as always. Thank you so much. I really also appreciates and I kept Marissa want bringing up an issue with it in a lot of ways disproportionately and I'm certainly directly impacts District 3 in particular as a relates to gun violence and just would welcome an opportunity to coordinate with your office council members. How to make sure that those issues decentralized within the Public Safety Committee we focus a lot of our work on gun violence prevention and routinely hear from the police department on statistics and other type of work that they are doing that isn't simply an emphasis Patrol response, but also looks at some of the strategies and Outreach they they do to connect with what are referred to as violence interrupter. So a lot of the geographic areas that you've already highlighted are ongoing Geographic place-based issues related to gun violence and that we have had the pleasure of having the police department come in and talk to us in previous month's about sort of what the the holistic approach is that the that they're taking an order to reduce those gun violence issues, but would be happy to hear directly from Community about what other things I think should occur within your District as it relates to Gun violence prevention and would welcome the opportunity that I coordinate with your office and opportunity to have time in my committed to have that conversation cuz I think it's really important and timely given that we're heading into warmer and warmer months and time and again is cuz present her mentioned it certainly is it I think in certain instances of cute in districts read but I think it certainly is a Citywide issue and would welcome the opportunity to partner with you to find the conversation. Thank you. I appreciate that. And yeah, absolutely. I was actually hoping that we could have something scheduled your committee to at least have a initial report back on what the police department thinks is happening and perhaps also work together on how to act on some of the concrete proposals that have come up from community members of sleep are not experts on any value in those ideas. But we need to have to come in at visors on that. There's a lot of history. International District in South Park and Georgetown around putting together Public Safety task forces that look specifically at not just crime and disorder issues but livability in neighborhood issues that could be particularly helpful to to inform those conversations by members and the community whom I already have Initial Ideas. We are having our next committee meeting on May 22nd. I can talk to staff and our office is comportate about whether or not there's time for May 22nd. That sounds great exactly to your point. Sandberg Gonzales some of the proposals that day that the committee members have have nothing to do with policing. It's mainly environmental design and lighting parking Road coordination, you know stuff like that. So which potentially go videos and and if it's going to have other benefits as well, then why not look into it because in my arm We also I think that that will help these are blocks by a lot of children live. So traffic coming. Don't I think would be useful regardless? Absolutely National District Public Safety task force report and the South Park and Georgetown Public Safety task force reports. It's it's it's perhaps not so surprising to see how many of those recommendations actually involve improvements to the built environment that really make the environment feel safer. So there are more people walking around engaging in positive behavior and activity lighting cleaning up garbage service those types of things. I'm absolutely are important things for us to look at in terms of improving Public Safety within particular neighborhood. So happy to coordinate with your office on those things super important. Yes, I agree with that and I will instruct my stuff to work with your stuff. I'll just one last item. I am passing around a proclamation. Indy honor of the Eritrean independence day and this year's celebration on May 25th will take place in SeaWorld Park and it is open to the public and so as I said, I'm circulating it for Council Members signatures, and I believe my office. How do you mail the text of this proclamation to your offices last week? Thank you. Good morning. Good morning. Just like to know some of us were here on time. I'm just giving you a hard time Lisa. Signs of us. Okay. So there's one item on today's agenda recommended by the Civic development public assets and Native communities committee counsel. One one nine four. Nine-six is an ordinance regarding partnership between Seattle Academy in the South Park Community Center. The parks department has requested more time on this bill to follow up with council members and the community in which has more questions about the agreement itself. I want to thank Aunt Sandra Gonzalez and counseling for her boat who work with parks in Tracy to strengthen and clarify the term sheet and I'll let them speak to their amendments this afternoon. My understanding is that they will proposes amendments to cancel today. So we move forward to a final vote. There will not be a sip namini on Wednesday and the next one will be June 5th last Monday. I hosted a District 5 Town Hall on Public Safety. I was joined by mayor durkan to members of the Seattle Police leadership assist including Chief Green from and Captain celaeno from the North Precinct about a hundred. Over a hundred residents attended and I appreciated excellent questions from the audience. Not being Indy 500. I heard all the way from D5 how really great that was and what the responses were and I want to say thank you to Chief Greening and I saw him later on in the week. But thank you for doing that. I think that that kind of bringing together the neighborhoods where is really helpful and back to the septet conversations that were held just moments ago between council member Gonzalez in council members who want you really been a champion for that? So I just want to say I heard it all the way from D5. Well I should add and I appreciate my colleagues at checked in with me to make sure everything went fine. And I think these are the type of community events you have to have when people are reeling from particular issues that are in the news and so we talked about those difficult issues about the unsanctioned encampments in the homelessness issue in the health issue in the public safety issue or we talked about what's going on in the North Precinct and their concerns about property crime and police response time. We had well over a hundred people we use the device called on I'm going to say it wrong pigeonhole pigeon something. It's the computer thing if people put in their questions, and then we can always set the tone. Will you set the tone that this is a community meeting and we want people to talk to feel safe and have an opportunity to share their concerns and that, you know, we recognize that we were indigenous land and that we were all going to behave and be kind to each other and allow people to speak and that's exactly what happened. So we had a two and a half hour meeting and it was great seeing everybody. We have no idom's from the finance and it puts a committee this afternoon, but immediately after our meeting this morning. We're going to get an update from then Noble on our general fund status. And as all of you will recall last year. We passed a biennial budget then we'll come in today and talk to us about the 2020 projected revenue and tell her What a good job that he did on pinpointing how much money we were going to be able to expect this year and I can give you a forward hand his that he's going to tell us that we collectively have about 5 million dollars more that we can anticipate spending and if you divide that by nine council members that's not a whole lot of money. So I just acknowledging now and early on that with a biennial budget. We have a small amount of money that we're going to be able to tweak for this when we come up in October. I sorry about all my word. I am offended by the remark Financial condition report. He is coming in as our internal auditor to discuss how well we're doing and I want to once again as a spoiler let you know that this is 2017 is the last full data that we have. What the news is darn good and I do want to acknowledge last Friday and say thank you to the Seattle King County advisory Council on Aging and disabilities. They had think it's a semi annual meeting. But thank you for all signing the proclamation that we signed last Monday recognizing them and thanks to the council members and also to Kathy night. Then Jason Johnson's Irene Stewart for putting that together and also another plug for each friendly Seattle. That's what something that we have signed onto and so I'm hopeful that this year we can continue to make the connections something that can swim but Gonzalez was just talking about with the septette for those who are wanting to walk around they want to feel safe. They want benches to sit on they want their the bushes cut back and neighborhood areas to make sure that they can see so thank you for that good work and again to The Advisory Council on Aging and disabilities all the people that Provide their time there. And also thank you huge things Chief Scoggins to Lieutenant Kenny Stewart for firefighters. We kicked off last week our low-acuity also now known as health 1 the pilot downtown. So we'll be focusing on the low Acuity problems that are firefighters have been challenged with over the last number of years and that's going to be going on. We hope and the third quarter of this year and I've asked Chief Scoggins. I want to be one of the first people that get to ride around the van not that he's picking me up, but then I got to get to be in the van. I'm working with him on that. And also lastly thanks to Randy angstrom. He brought this shift passes by last week. So I'll look who is really late. Can we just acknowledge? Thank you Arabic Shaw. I'm sorry. That was before I start with my report. I just wanted to take a minute to go over some of the items that comes from mosquito asked me to share with you today in her absence. It will not come any surprise to you. These two items are items that we lift it up last week in anticipation for this week. The first being that today has been designated as bees day last week counselor, Mas Que te introduced a proclamation honoring and recognizing the life of Beatrice Catherine Alder and does it need to be today May 13th, as bees day after a complicated pregnancy be all there was born in November 2017. Sadly died 36 hours afterwards due to medical issues. These parents Rachel and Aaron were devastated Rachel who works at the city's human services department and gave birth to be was in the middle of physical and emotional recovery after losing her child and she learned that due to an inadequate bereavement policy that the city she would actually not get the time that she needed to grieve due to a gap in the paid family leave policy is she could not take time for her physical recovery either. While recovering Rachel and Aaron had to deal with procedural gaps, and we're only able to find the time they needed due to the sick leave donations of many of Rachel Rachel's HST coworkers. We really need to take times like this to recognize identify and talk about how to fix the issues that impact women disproportionality. We need to talk about how women of color of substantially more likely to die during childbirth. We need to talk about how people need time to grieve the loss of a child due to Aaron and Rachel stylist advocacy and specifically advocacy with counselor Muskegon is office the week before last and announced that she will transmit legislation for consideration by the council that would like allow for time off after loss of a child is an important step and it would not have happened without Rachel and Aaron in the legacy of be short but very impactful life. So we've dedicated today Monday May 13th the day after Mother's Day as bees day. This is a real life example of Grassroots. Advocacy individuals with live experiences sparking policy changed. So no other family goes through the same experience as they did. So today we honor Aaron Rachel in the life of bee who's had an impact Beyond her 36 hours the other action that we took last week that comes my mascara has asked me to hold up. Today is the proclamation that we passed sponsored by counselor musket in recognition of affordable housing week this Proclamation designates this week, May 13th through May 17th as affordable housing weekend Seattle and it is organized by the Housing Development Consortium of Seattle King County. This is 165 member organization of affordable housing organizations working together to make sure that everyone can live with dignity dignity and safe healthy affordable homes with me within communities of opportunity. This week will be a week full of events celebrations and advocacy across dozens of cities in King County to ensure that everyone has access to the safe Health affordable home. We know that countywide we need a hundred and 56th. It's still hard time with this number 156000 for double homes to meet the current need. Affordable housing because intended as a testament to the collaborative nature needed to meet the scale of us need for affordable housing in the region and through Events & advocacy opportunities catered to each City in the county affordable housing week shows that every city has work to be done to get to the school and we're going to do this work together. This is the cities and the County Sports year and the biggest year of affordable housing week with over 30 events across the region. You can learn about these events and how to participate at www housing Consortium. Org, they'll be building tours and open houses showing what affordable housing actually is discussions on intersections of housing with issues, like now house immigration hunger and more. And now on to my items, I don't have anything on the full Council agenda coming out of the create a committee. But one of the items that I believe is on Full Council today coming out of council member of this committee relates to the agreement between the Seattle Arts and Sciences Academy and South Park Community Center partnership agreement, and I have an amendment to the ordinance requesting that DPR submit their final partnership agreement to counsel for review before signing. There's also languages language that has been developed in partnership with comes from Gonzales including specific revisions to the terms of agreement to provide more clarity on field use for the community and accessing the demand of the field. In my committee tomorrow the Civil Rights utilities Economic Development Arts committee. We will have a briefing by the city auditor on phase two of their review of hate crimes in Seattle. The auditor has found an increase in reported hate crimes in Seattle from 2012 to 2018 of nearly 400% assault with a hate element. We're up 524% and incidents with a bias a racial bias increased by 427% Again, that's from 2012 to 2018. The report notes that increase reporting doesn't necessarily mean that the number of Ennis incidents has increased but it can reflect increase law enforcement tension SPD has definitely played their part and increasing their attention to hate crimes in recent years. So that's an important part of the picture but the same time FBI data and a study noted in the audit by the center for the Study of hate and extreme extremism at Cal State University San Bernardino show. Both Nationwide increases of hate crimes during the last four years. So that would indicate that even given as CDs increased emphasis and attention to this this area of crime that there is actually something going on here in Seattle that goes beyond that that increase in in reporting an increasing increase law enforcement detention. We will be discussing a council bill that I've been working with the city attorney on for the last several months that will allow easier prosecution's of misdemeanor hate crimes prosecution's are currently linked are currently limited to the city specific protected classes of only marital status political ideology age panel status and homelessness. Those are the only city specific protected classes that we currently can use the the protections and enforcement of malicious harassment to address only 23 cases were prosecuted from 2012 to 2017. This legislation would newly allow for prosecutions also based on the state protected classes of race color religion ancestry national origin gender sexual orientation gender expression or identity mental disability physical disability and sensory disability. It includes a requirement for the City attorney to issue an annual report to the council about the demographics of not only the the victims of which 100% are members of protected classes, but also the demographics of the defendants as well. The purpose is to track how the legislation is being used to dress hate crimes while keeping in mind concerns that we've heard about existing disparities and prosecution. Where are members of protected classes are disproportionately likely to be prosecuted for violations such as assault and so that's sort of across-the-board not specifically for hate crimes, but given that there is an underlying disproportionality. We went to really keep an keep an eye on how that disproportionality does. We're at a door does not as a relates to the hate crime legislation, finally 85% of offenders protect prosecuted by the county. And 77% are white and 19% are black. In addition in the creative committee will be hearing a presentation to release the spending Proviso on the ship canal water quality project. This is a part of the city's CSL control program which seeks to meet state and federal permit requirements to reduce the size and number of sewer overflows into receding water bodies. That consent decree is required to bring us into compliance with the federal Clean Water Act spu has developed a plan which proposes several projects to reduce combined sewer overflow events ESO events. The largest of these projects is in fact, the Ship Canal water quality project and addresses Wastewater storage capacity needs in the Ballard Fremont in Wallingford areas. Only 70% of the city's cso's associated with the plan occur from these basins. And this project will store Wastewater in a deep underground tunnel that is generally in the street. By the way, the presentation will focus on again. We will be lifting a Council budget Proviso that we placed on this project specifically on the tunnel portion of the project getting us through the design phase and with the idea that we would lift it before we entered into the construction phase if we were happy with where the project was as it relates to a timeline and its budget and as we get closer and closer to construction there is greater and greater certainty about about the budget for the project and I think folks attending please good news presentation discussion of the appointment of Robert Lee as director of The Office of Economic Development, and we will be having an update also from Office of economic development on the implementation of The Legacy Business program that I've been working on for the last three years time. I refer to people space okay with me want to just make note that we will be circulating a proclamation this week in time. Hopefully for a couple of memorials coming up later this week for Sharon Jones. I think we all know Sharon. She's a real change vendor who has graced our our presents with her time before the Council on advocacy related to housing and homelessness many many times her passion and vision for this these issues. I think his has moved us and she has been really fantastic advocate for her herco vendors at real change as well as homeless people. Folks who are vulnerably housed. I'm all over the stage. He passed away on April 28th after succumbing to Lou Gehrig's Disease. She is not the first vendor to have passed away and she's not the first person to have passed away. We know that this year has seen a very large number of deaths of homeless people and increase in homeless people have died due to violence and I think honoring Sharon in this way is an important recognition as well as the larger impact of living unsheltered has on our on our community. Lastly as far as events coming up this week that I'll be participating in out in community on Tuesday. I'll be attending I believe customer or Gonzalez walls will be attending the business Improvement Area Public Safety for him. They'll be focused on some of the findings in the prolific offenders report on Wednesday. That will be the set of firefighters Department Awards. Luncheon. Thursday is Seth opening night. Thank you for mentioning counselor Bagshaw and in Friday, the Northwest immigrant rights project will be having its 35th anniversary gala on Friday Sam Stein who's the author author of Capital send it city transportation. The real estate real estate state will be speaking at Town Hall on you liberal Seattle the city as investment Anchorage books to attend. And then finally I will be presenting out at kexp on one of their ongoing forums called master. Hustle and engagement with folks in the music community on how to better promote their craft and be able to earn a living in this very high-cost City and the specific topic for this event is can the Seattle music industry survive. Thank you morning morning. So we have 22 + related items on Apple introduction in a referral 19 points of design review board and three of coins to the Seattle Planning Commission there no pleasure later items on the full Council agenda today. The next plus committee meeting is next Wednesday, May 15th, and our agenda will include the 19 appointment set design review board commission 949 which man's land use codes. Any major institution the master application master plan application has been master plan application from Seattle Pacific University patient to counsellor. Mascara in Council Grove Brian for the lunch and learn with the scooters last week. I was personally just enjoyed it very much future else want to send appreciation to counselor must get up for her work session in D4 on confronting harassment discrimination last week as well. I had this weekend in opportunity to do a U District clean up where I was the judge for the trash collection. And that was a lot of fun. So that's two trash cleanup district for us. I want to send my appreciation to the community groups that have organized it this week. I will be participating in listening sessions at the Laurelhurst Community Council. Never going to Bryant Community Council and the Wallingford Community Council. So I will be going back to to some of the neighborhood councils this week. Listen about what I can best do over the remainder of this term. Very good. Thank you. Brian has eight items on this afternoon's agenda on a six of them or appointments Andre appointments to the freight Advisory Board and two of them are an appointment and every appointment to the levy to move Seattle oversight committee. The Stanley Transportation committee does not meet again this week, but we allow the meeting next Tuesday. That's it for me. Thank you by Bryan Lanning the Gentiles agenda item one and that is counseled dial one 19509 cast member bags are already spoke to him briefly is a budget action item. Authorizes the Seattle Fire Department to establish the mobile Integrated Health Unit pilot program referred to by the executive now as healthone. This Council bill was amended in committee and recommended for passage by my committee last Wednesday May 8th, which I placed on me $5,000 in the finance General and it reads these funds to the Seattle Fire Department for the purpose of operationalizing the mobile Integrated Health Unit by the third quarter of this year the original budget Proviso and dreams sheet were both sponsored by Kel's more vaginal during last year's at budget deliberations are really want to appreciate her dogged commitment and tenacity around making sure that the funding was there as the budget chair shed a lot of discretion this year to be able to make sure that it was baked into the budget. But also this is something that I think killed mer by Charles has been I'm Yelling to the Sky is for several years and really glad that were falling out of place where we have a high level of confidence in the model proposed as a pilot by the Seattle Fire Department really grateful that we've been able to work with both the local union and with a fire department near ship to ensure that we have the right size model right now for the pilot program with with a strong commitment from fire department leadership including Chief Scoggins that they will be doing a pretty in-depth study and evaluation to ensure that the pilot program is meeting at the full scale of needs of low-acuity calls for those folks who will be relying on the mobile unit to meet those needs. So really excited about having that in finance committee this this afternoon and then really quickly wanted to take a moment to to acknowledge take us to the point of personal. Also just Pride for the legislative Department as a whole I wanted to take a moment to congratulate our very own Joseph kiha from Council Central staff Communications last week. You may have heard that he was honored with the Mary's Alton Memorial award that was given to him by the municipal League. He was recognized as a volunteer of the year for his work on making voting more accessible to the general public and I think that we should all be really proud of Joseph and the work that he's been able to do on both ends City Hall, but outside of City Hall in his truest commitment to ensuring that programs like ready set vote are designed to make voting research easy nonpartisan and to also highlight all three branches and how important they are and our Democratic process. So congratulations to Joseph and if you see him, I hope you will personally extend your Congratulations to him and give him a high-five for his volunteer work outside of City Hall really proud that one of our own could be acknowledged him in his way. So congratulations to Joseph and I'm just really quickly quickly this Wednesday May 15th. I will be down at the US states district court house. We have a status conference with judge robart on May 15th. That's a Wednesday at 11 a.m. Where does rhubarb will walk us through his opinions and thoughts on whether or not the city is still in full and effective compliance as a result of our settlement with the sound police officers killed in that collective bargaining agreement it it's a pretty important pivotal hearing for the city of Seattle as it relates to our ongoing work on the Decree, and I will be there as a representative of the city council and look forward to reporting back the next week. What we heard from Judge robart. I'm sure you will hear about it in the news before I get to you. But if you have any questions about how that hearing when I will be back in the office, assuming that the hearing goes efficiently I should be back in the office by 12:30 p.m. Or 1 happy to connect with any of you that might have interest hearing hot off the press what occurred during that particular hearing. I'm also I will I just wanted to make note that I will mention will be up in Ballard at the Nordic Heritage Museum at the second. Associations. I will also be joining on Wednesday and Thursday friends and old colleagues from the Northwest area foundation which represents the Northwest Quadrant of the of the country and focuses on philanthropic work in reducing poverty throughout the northwest region of the country with a specific focus on granting up to 40% of actually a minimum of 40% of Grants to tribal communities and a First Nations for purposes of Economic Development and poverty reduction really excited about actually having their annual board meeting one of their board meetings here in Seattle really happy that they have chosen Seattle as a place to come and learn and I'll be present and looking forward to joining with them on Wednesday for dinner Thursday morning at a conversation around Century race in philanthropic work on Thursday really excited. I will be at the Northwest immigrant rights project on Friday afternoon. And on Saturday wanted to let folks know who might be interested. I am I was asked by vote run lead a National Organization that focuses on recruiting women to run for office at all levels of government to speak at their candidate training on Saturday, May 18th at we work really excited about joining that a nonpartisan group around making sure that folks understand what it means to run for office and encourage more women to be part of our democracy. So I thought your your signaling to me. Okay. Congratulations on your appointment Sound Transit before removing executive session. Will you pass these out to council members herbal Pacheco and O'Brien? Wait, I'm not. I'm just saying that I'm going to go over the issue again for those three that at the beginning of every couch associate with this that at the beginning of every briefing. We this is based on some work that the state auditor in our city clerk and Monica. I want to thank you for all your work in this there's a process by which we will approve minutes of our briefings and I would need a quorum here to do that officially and that's a sample of last week's minutes that we did approve this morning and we'll do that every time and so you could see that again will try to start on time and have that at the beginning of the at the beginning of the agenda and this was based on a public is a complaint for the public complaint for us to say it on that. We weren't making this available we do. Keep minutes, and we've always kept minutes that we thought they weren't as they weren't published as we will do now. So I just want to know that'll be the process of moving forward. Okay? Okay having said that we are going to move into executive session and is presiding officer. I'm announcing that the Seattle City council convenient executive session with purpose of this executive session pending potential or actual litigation and this gives us an opportunity to discuss confidential legal matters with our attorneys as authorized by law. However, illegal monitor is always present to make sure that we reserve questions of policy for our open public sessions expect this session last approximately 15 minutes without a b s e that's 1035 10:36, and it goes beyond that. I'll go back in a public session announce. It's expected duration with Atlas Moving executive session.", "end_time": 2647.2}]}