{"format": "raw", "annotations": [], "confidence": 0.9287564814090729, "data": [{"start_time": 0, "text": "So we will start good afternoon everybody. To wear on yes, we are. Okay. All right. Good afternoon. This is a meeting of the Civic development public assets and Dave qts committee. And the date is April 17th. And the time is 2:03 a.m. Council member Ward sure the comedian I will soon be joined by a council member Gonzalez and councilmember badshah. Thank you all for being here today. I will go ahead and proceed to the chairs report. We have one item on the agenda for today regarding the King County Conservation fund Futures Levi, and we hope to run this meeting efficiently to accommodate the select committee on the library Levy that is to begin at 2:30 with full Council that as I share that will happen the minute that we're done with this committee. And so with that woman to public comment and on again, I'll let you take it from there. And as you know, please state your name you have 2 minutes to address items that appear on the agenda, which we have one item on the agenda and will move forward with that. Cancel memories. We have one person signed up and that's Alec Zimmerman. I'm not cigar picture at Animal Farm. What is recovery right now? It's pretty interesting to me right now. So Approving future Levi fun without city council approval is very interesting though Innovation we have right now. So I suppose it's going so never cared about was just about to the election. So don't involve this business has a bigger and bigger and bigger. So right now. That was 700,000. Idiot. Nobody care about is cockroaches as they can do in evidence. And what is one I love this Innovation everyday right now. No. Console no public present. No freedom of speech no more America bigger and bigger and bigger principal. You know what this means simple. So I spoke right now to everybody who listen to me Kansas have any opinion posed to be going to probably carrying in people posed to become a member people. Don't come come today 2002 country * 1000 idiots. And this new fashion. Trans people talk about that. Okay, anyone else that concludes it? Okay, so that includes concludes public, council member Gonzalez. Thank you for joining us. I apologize for not waiting for you. I can stop the cameras. So am I making you laugh you and that's why I love about you. Okay, so we are going to move on two items of business own again. Why don't you read our first item into the record presentation? Great item one Council bill 11949 for an ordinance relating to King County Conservation Futures Levi proceeds authorizing the mayor to amend the interlocal cooperation agreement between the city of Seattle King County authorized by city of Seattle Ordinance one 14978 to allow for the acceptance of conservation Futures Levy funds without city council approval and authorizing the use of a new Amendment template for future amendments to that agreement. Thank you. And so I'll let you guys and introduce yourself and welcome back. Thank you will go ahead and make introductions and then I'm guessing you and ship will walk us through this and then we'll do vote. So go ahead say, my name is I am the intron interim superintendent for Seattle Parks and Recreation planner for Seattle Parks and Recreation. So my part of this is very brief cuz Chipper's the expert here, but we know we really appreciate you need to talk to you about this proposed legislation and end. This is speaking about our conservation Futures tax program, which for over 30 years have has provided matching funds to allow us to access parks and open space across the city. We've used it to match run from all of our previous levies and are using an automatic some of our Park District funds. And then what were you hoping to do is is revised interlocal agreement that currently exists between Seattle and King County that literally she's going to streamline the process for us to get the money back that that comes through these through the CFT in terms of matching funds and I think is triple. Walker sweating we can save up to a year in terms of the time that it takes it took that funding back. So with that I'm going to come and actually turned over to chip in and have them walk us through this. We have Maps you when he's out. So so these are the maps that sort of show you Been purchased with the CFT matching funds as you can see. It's a pretty broad pretty pretty pretty good coverage across the city. And and the reason you seem sort of that the bigger red. If there's somebody's property unfortunately are a rather small, but just cuz that sort of nature kind of buy property in the city like Seattle, but just continue on here. So just phone with Jesus said so conservation Futures is is a countywide property tax. It's used to buy Forest Farms parks open space and since 1990, the city has acquired that you can see in these red dots has acquired about a hundred fifty separate Parcels, but a hundred thirty acres and has gotten over 60 million dollars in matching funds from this photo this grant Source spend they all the major matching funds source for all four of our acquisition programs the 90s had the King County. I was facing violence program that we had early 2000s the pro Parks Levy 2008 parks and green spaces Levi and now the park district funding and I think one thing to note is Future's is a matching fund. We need to put in 50% of the funds. And with that we get matched equal back and the more funds we have available for acquisition the more funds we can get historically we've gotten about 3 million a year currently. Our acquisition budget is 2 million a year which leaves a million on the table. So we're hoping that in the next round of Park District funding we can bring that back up to 3 million. Here's the map that you have in front of you. You can see why we opted for the bigger map cuz it's hard to see there's often a multiple multiple small Parcels were acquired with this property with this funniest horse traditionally. We use it to buy green spaces. And we we are our goal is to buy in Holdings and all of our major green spaces, you know, the duwamish Greenbelt in Thornton Creek Longfellow Creek on the last 10 years. We've also used it to buy Urban parks in our in our densest neighborhoods on North or near we just closed down one. So that continues to be a priority. So what kind of projects do we acquire the last three years of of awards are up here and they really range from Green spaces Lakeridge Delridge Park additions. We've got Bear Lake Playfield Edition who got duwamish Waterway Park Edition. We've got some neighborhood parks like Broadway Bear Lake open space in north or near and so it's a wide variety of projects. We we get funded through this funding source, and these three years Awards actually have not been reimbursed because of the challenge of getting legislation to both the county and the city and hence. One of the reasons were asking for an expedited way of getting reimbursement. Before we going to exactly what the what the changes are. What is an interlocal. It's really the agreement between the county and the city regarding these conservation Futures towards these are the words are in the County Council budget and then we end up having to Amanda interlocal agreement to allow us to get reimbursements executive in the mayor would sign the interlocal agreement. That is correct. Yes. So why are we changing it where trainging it to streamline and shorten the process and save up to year when we can get reimbursements and to reduce some loot duplicative legislation both on the county side and the city Side. So our current process is it's about two and a half years. So I'll apply for apply for a project in March will end up in the county budget in November. Then sometime in Spring the county will enter will do legislation that allows the county executive to enter into a new local interlocal with a city and then sometime later in the year. The city will will do the same legislation that allows the mayor to enter until interlocal with the county and then we get the two Executives to sign and then I can finally ask for reimbursement about two and a half years after I have applied for the original Ward. The new process is streamline in that we take out the middle steps. So we still have to apply we still get in the King County budget. But then we are allowed to just have the mayor in the executive King County sex reassignment amended in her look up with the new Awards and then I can apply for reimbursements right away. Why is this so it will send you a question but you know what to do with the timing of legislation. So at the county they have to wait for the budget to be passed and then they have their 3-month process to get legislation through Council and then we have to wait for that legislation before we can start our three-month process and by the time all that happens. It just it's just time it's not that it's hard. It's just time spent so the duplication that were so they're two things here won the the county started this process because they felt they already gave authority to have these projects in the county budget. So they've already given Authority and so it was just duplicate of authority. They were giving in the city that city council looks at our Acquisitions in two ways you appropriate the money every year for our acquisition budget. You give specific thority for certain acquisition such as neighborhood parks Parks additions and last year you passed an ordinance that gave us authority to buy green spaces and identify the areas so we can buy those but we always have to come back to council to get those accepted. So you do see every acquisition we do at least once and so by eliminating the CFT interlocal you're still you're not you still be able to see all of our acquisitions. So this would allow us as an example. Those three CMT Awards are about 6 and 1/2 million dollars and we'd be able to get reimbursed for those right away. And then every subsequent ones we could get reimbursed at the beginning of the year right after the budget passes for rather than waiting a whole nother year for reimbursement. questions any questions for my colleagues customer just one overarching question. I was mostly tracking the distinction you were making it at the end of your remarks. But to me this legislation seems to limit both the County Council and the city council's oversight of some of the acquisition questions and just the overall implementation of the program, but I'm hearing you say that maybe it doesn't actually modify the council's ability to continue to exercise its oversight just a little bit better what the impact on council's role as an oversight body will be if this legislation is adopted for the County Council. So I approve all the projects specific projects through their County budget. So they have already looked at all this specific conservation Futures Awards and and approve them as part of the budget. I'm in the city council. I think there are two ways that you still have oversight over the acquisition program you appropriate money every year for our acquisition budget and all neighborhood parks Park Edition anything outside the green spaces you we have to have specific legislation for approval of those Acquisitions and all green spaces. You've already given us approval to buy within certain there is but we always come back to the council to have you approve. Have you accept those Acquisitions after we've acquired them. So you always see every acquisition that we've done and I'll back up to see if T interlocal does not include all of our Acquisitions is just Acquisitions that have gotten grant funding. So you do see every Act was an outside of the city of tea in a local Okay, so if that the one will forward anything else from okay, we'll move over vote. I move the committee pass Council Hill 11949 for the King County Conservation Futures Levi interlocal agreement, and we will present this to Google cancel a recommend to fill Council on Monday. Thank you chip. Thank you Jesus. Thank you for the memo and the school note. All right. So before we adjourn let me make a few comments and then we'll move to adjourn the city development public assets a name treaties committee will be Wednesday May 1st at 2 and with that we stand adjourned.", "end_time": 994.1}]}