{"format": "raw", "annotations": [], "confidence": 0.9370525521891457, "data": [{"start_time": 0, "text": "Good morning, and welcome to the July 9th meeting of the Civil Rights utilities Economic Development Arts committee. It is 9:38 a.m. I'm Lisa herbold the chair of the committee and representing West Seattle in South Park joined at the table by members of the committee council members O'Brien and so on and we're going to get right to it the items on the agenda include approval the general public comment items of business one item of business. We have nobody signed up for public comment and if there are no objections the agenda is approved. So we'll move right into the first item of business know but got out of one is every other week garbage collection pilot background and findings. I give a quick overview of 2012 pilot was known as the one less truck pallet project 800 residences with a while longer and is in SVU. Thank you for this opportunity. We're here to talk about Seattle Public Utilities 2012 one less truck pilot. I'm also known as the every other week garbage. I'm as you know Council authorized new Solid Waste service contracts early this year including supporting Fleet Investments are these contracts and Investments support the continued weekly garbage along with weekly yard waste and every other week recycling in this context spu has no plans or contract Provisions to shift to Citywide every other week garbage and the Executive also doesn't support anything other than weekly garbage for every part of the city every week. So we also believe the robots 2012 findings that we will review today will demonstrate significant economic and environmental and customer challenges and any other scooter any future considerations of every other week garbage including limited operational savings for collection contractor's unlimited potential Fleet emission reductions potential future customer garbage bill Savings in under 10% company a customer perception that the service will be reduced by half a by 50% I'm at a particular concern to spu Mayor durkan the findings that lower-income households a larger household and diverse communities with less supportive of the change in sure we believe the pilot findings and current context accurately capture the financial neighborhood environment of limitations for every other week garbage today and in the future and continue to believe the current collection model right now is the best for Seattle ratepayers in so I'm going to turn it over to Hans and he's going to provide a little bit more background and launched into the presentation. And before we launched into the presentation just want to see when we get to the discussion around the findings around customer satisfaction. We going to delve into that a little bit more. Should I hold my questions until we get to that or is Okay. Thanks for the intro and we'll go over some of the findings from the 2012 pilot and just for septic set the stage for contacts right now the frequencies we have we collect recycling every other week garbage in yard waste collected weekly and in just for contacts similar amounts of material are collected in each of the waist jeans from the single-family households here. And so we do have you ever other week for the recycling and are able to achieve the fleet and cost-savings there. And then this is particularly just talking about household Services, of course, my family and business services are collected many times a week depending on their needs. So this is just focus on the household Services savings. How have you have you captured those as far as being able to quantify what those savings are? Yeah, we do have a slider to that touches kind of what the operational efficiencies might be from that shift recycling cycling for 20 years here. And so so that hasn't changed. So we've been able to maintain that so we haven't seen a shift in cost one way or the other there cuz we continue that service by doing it. Every other week is supposed to Once week so we don't have a number for say, okay. So every other week garbage in other cities just by the way the services in place in Tacoma Olympia renting in Portland have the service today as you're probably familiar also in parts of Canada and Europe. It's it's used. How many years have many of these cities had the every other week garbage Shore less than 10 the ones in Puget Sound and same with Portland. They've all been one that brought about the last decade or so, so not forever. Yeah and then longer in Europe, I would say yeah, that's a good question. And then in terms of a couple notes in terms of how these other cities implemented it off and it was done when yard waste went to a weekly service and the and the food scraps were added to that yard waste collection. So often when they adopted there every week garbage is when they shifted and added food scraps the weekly yard waste collection and then also both Tacoma and Olympia. We should know tour Municipal run operation city employees were running nose operations. And so they can sometimes be more dynamically capture the savings through their own operations on a on a month-to-month on a year-to-year basis. They have more up to capture the savings at times because their direct employees and then and then Into this song, but but all of them had some challenges in the near term for sure and implementation and then generally today it's working okay for their customers. Sodium sulfate so as it relates to the Everett the other cities can we get a break out of specifically which cities implemented every other week garbage collection together with their moving towards every other week for their for recycling and or yard waste in which ones did it separately separately at least half of them dead, but I'm not sure how they look at the last year and help us understand a little bit more about why it is that cities that had their garbage collection Services performed by Municipal Employees were better able to capture the savings of going to every other week garbage collection. So, Picture wise we contract for the services. We do a contact for about a decade and a Venda private firms that bid and provide that service will belay amortize over that term over that decade term, and they'll have Labor contracts easy for 5 year labor contracts, but that might a line as well. Where is with a beautiful operation? You might be turning of your Fleet in kind of on a regular basis, you know, you might be just fine just like we do. It's at the water department. We just buy new trucks as they come up. So it's so you're more turning over your Fleet on a more frequent basis and then you might have more opportunity to change your Labor Staffing to retirement and things like that. So just a little more Nimble and year-to-year accounting then we are when we contact out for a decade and some of the finances a line. So it's more episodic in the Contracting that it is fact, not of anything that's inherent about the source of Labor. It is not very different employees are generally not paid that much. Differently, they're all well represented and have good benefits in general and stuff like that both in the private public sector that I have is the final bullet says other cities experienced challenges and implementation and then positive customer reactions after adjustment. Any information about the length of that adjustment. I will check on that for you did some Outreach what you know, when we did the pilot project and so that I think there's a little more day to their them from that Outreach you concussions Okay. So for spu our involvement has been that so we can just mention we just started contracts this spring so that go from 2019 to 2029 and the prior, set of contacts went from 29 to 2019 and we just finished them in March and in preparing for those contracts the RFP requested prices and then we did receive prices for what happen if adopted every other week garbage and there were a couple price options so we had that that the window and we hadn't had it in advance prices to make that transition in 2009 11 13. And so that was kind of contacts for doing the pilot in the 6-month trial in 2012. And then like we said before those were accompanied by that shift to the weekly yard waste in 2009 that we went from every other week and then all food was added. So yeah, the pilot was as was mentioned earlier a single-family customers and to look into the financial neighborhood environmental benefits and challenges and benefits in the challenges with six months in Anne of 2012. 800 households is is Brian mentioned in four different neighborhoods. And then in in each of those neighborhoods, everyone had to participate we had entirely new customer bills. They had options, you know to keep their same size or to change the can size. They had a new bill structure that was adopted for the pilot everyone participated and then we intentionally went after a diverse mix of neighborhoods to allow us to look at the impacts in different communities. And it's two slides here. So it will touch him some of this satisfaction elements customer satisfaction increase for the experience of the pilot that is to say before they were more skeptical than they were after or 63% of them are satisfied after the pilot and in and out what that increase from before the pilot, but we certainly noted that that's much lower than our Citywide satisfaction for a current services at the time 89% which is which it is today as well around the same level and then about 53% of the participants said they recommended it for us to go Citywide with that. So what was the Baseline satisfaction with the stars of pilot? Remember my head? I think it was I want to stay in the forties or so. But yeah, and how is how did it in the in the survey? How did we ask people to to measure satisfaction on a scale of 1 to 7 instead of a converted this 200, you know, there was smells or oia thought I should have gotten up more reduce pill or what? What are the what makes up delved into some of those elements and service elements of those Elements which most contributed to either people satisfaction or lack thereof. That hurt and I totally promise to you that the thing that people were most upset about was this notion that they were expecting their bills to be reduced by half because their service was being reduced by half until I'm trying to get a sense of it is is is that the largest factor that contributed to dissatisfaction or were there others and how do we how do we weigh them? I think that think that had the highest residence was the challenge that the service they perception of service being reduced more than their bill, you know, cuz it kind of the financial constraints around that and then it buried by Community to as well. And in the in the household, you know what their individual needs were so all of those came came out not wanting to have their service for 2 weeks that there was something back on neighbor conditions and we also monitored for that but that wasn't as high as some of the other feedback factors in the bill savings we talked about and then there Yeah, yeah, you just waiting did the I think the other one that that I recall there was not wanting to have had to hold on to it to manage it for 2 weeks what came up as well and I'm in this is some of the feedback that was highlighted satisfied person has been said they liked the efficiency improvements. They like the cost-cutting they like the fleet reduction and they didn't receive negative impact. So those are the folks that were on the higher end of satisfaction in the lower and satisfaction a concerns regarding Heaven garbage too long. Like I mentioned in some potential for smell an odor from their their waist. So those are those were the two kind of concern factors that were Hyacinth a tunnel Essex satisfy. According to this Slide the issue of Bill savings is is not rising to be one of the factors that led to people being less satisfied and that's contrary to information. I've been to their recommendation, you know, should we should we go for Citywide but then then their experience piece of like what what they like to didn't like about it where they satisfy. Satisfy I think The dissatisfaction about reduction and Bill size is something that we could prior to looking at another pilot or another similar Chef option of a and often option those sorts of things. We could educate the public much better this time to manage their expectations and explain why bills don't aren't going to be reduced in half on the on the front end and I and I think again this is a seven-year-old study. I think people's expectations in the light of climate change are a little bit different for what they expect in return for participating in activities that address climate changed and you know, and I also think people's tolerance level on the storage of garbage garbage is is different too because I think a lot of people actually don't take the garbage out every week because they were there. accumulating that much I just go back and make sure we covered this. Yeah, so we can meet some of the things that were concerned about recommended Citywide the service protection the bill say things and then and then we could we talked about the other cities, you know, and then we can follow up with you a little bit that I want that with that dip. Look like kind of and there's the demographics of the satisfaction. This is once again their overall satisfaction with the program which was on average 63% and in so you see there is a difference both in income race age household size and then whether they had diapers in the family racial demographics represented there is a group there a bother What? Yeah, I mean obviously not actually it is it is under other, but I'm just I'm just surprised that you have a breakdown for Asian, but not far. Other like rotten eggs are black. But yeah. That's interesting as well. We can provide that. And so again, this is the overall question around General satisfaction. Right? Right. So that's all in there as well. And I thank God that you know the disc highlights where it where there was a Delta really, you know, so there's a lot of other demographic of persons were there the Delta wasn't so significant and so that doesn't show that as well which is interesting to note to pursue also. I just want to know though. Is that even though even though there is a Delta and it's interesting to see that? It's reflecting majority support for every other week. I mean, even if you look at the big difference is like the house which had diapers to dispose of sounds of the didn't have diapers, even though households which had diapers 58% it satisfied. Is that what that's right now? All right. So in terms of some of the operational elements moving up in the customer side, this is kind of what we saw it in the pilot and in the negotiations kind of that led up to that service contract as well. So provided some context for the garbage household garbage collection flee the the trucks that are serving just garbage just from households. It look like about a 35 or section in the fleet and so similar reduction in emissions and and the and just have to buy contacts. There's not actually 50% reduction because people still put out the clothes to the same volume of garbage say so they're out to get a little smaller and it's a little you served and maybe $400 a route 630 up some more trips and stuff like that. So it's not just like you can cut the fleet in half. So hope that makes play some intuitive sense and then Still pretty fantastic. And so yeah, and then and then you feel like the whole Fleet which includes our recycling always played a commercial for your mother kind of nice Lady represents. Maybe about 15% reduction in Flint, Michigan. Being accurate in my own head when you say 35% reduction in Fleet emissions. You're basically the metric you're using his number of craps, right? I think of it. Yeah. Yeah. Yeah. Yeah. Yeah. Here is the reduction on your street cuz that's where you had unit 1 week you had three trucks come in and the other kid to and then you would just have to each week. And so that's the 25 is a big goal. And so we're measuring this to the number of miles were used to go every other week pick up a good way to think about cuz there's variables about which fuel we're burning and was truck and a Truck sub oven cleaner as well. So there's those things going on, you know where continue our mission through technology and this is about I think miles is a good representation of it. And given that you know for Seattle, the our greatest gains in addressing climate are in transportation, and I think it's 67% is is the surf so I think the more that the city and its departments can do on the vehicle emission side. That's that's again where the where the greatest gain is for for our city. So then recycling benefits side, we looked at that in that study as well. And we did see that cross those 800 customers garbage is reduced recycling was increased and food waste diversion was increased the estimate at the time was that every other week garbage would produce about 9,000 you tons a diversion for 2012 a number of things have happened since then, we made a requirement that food waste need to be in your yard waste in 2015. We did a lot out reach around and still to this day. So that number is probably a bit lower today because two other policy measures we've achieved significant diversion, but it's likely that the program meaning of that shift would still help people on that final step of take things out of the garbage container. So on the financial side just big picture is Ken mentioned. We don't have any service or contract price options in the current contract for this. So we don't can't provide any specifics there when we looked at it before it suggested that the operational savings could be about 30% And so that's similar to lovely talk for the flea production. But also there's other fixed cost there that you won't save and then the amortization of Fleet needs to be dressed. So we just started new contacts with new Fleet. And so the amortization. Is the most challenging right now and then I'm a customer said we talked about this before that because of the number of cost that are covered on their garbage bill covered house for Recycling yard waste and house Reserve support Clean Cities that help support a number of other efforts as well as its costs and historic disposal disposal things like that that the actual savings on the bill would be under 10% So going forward future options, we as can stated clearly plan to continue weekly garbage in the near future and it's Best Buy in the current contracts along with the fleet investment that was there to support that service. So there's a whole new Fleet on the street today supporting that frequency one option that you mentioned that was mentioned was that we could consider in the future of voluntary opt-in option provide terms in a contract to allow that to allow customers to opt-in individually one-on-one and us to be able to track and support and Bill for that one challenge in the last bullet. There's we probably would need to identify additional Revenue Because the actual savings would be minimal certainly initially. And so if you just did it cost to service reduction, it would be very minor which is one option. But if he wanted to do if the city wanted to do that at Ballantrae often and with a larger cost to serve a larger Bill Savings of some sort, then we would find it not need to find Revenue. Instead of looking at a voluntary voluntary subscription every other week per household. Is there a way that we could consider because I don't see how we would realize any reductions in vehicle emissions if it was based on individual households because you started drive that street if you know, even if one person is opting out of weekly garbage, so is there a way that we could do a voluntary often per neighborhood as a way of actually combining? Desired outcomes both of the residents and not have the garbage picked up every weekend are public policy objectives of realizing reduced vehicle emissions. Yeah, it's good question and I think because I don't understand I don't see that the voluntary often per individual accomplishes anything but I would guess, you know, that's kind of a Tipping Point thing, you know, like if if you're going to participation then they would be proud and Achieve deficiencies and and then and then you would get you to gain so it depends how many people have today and I think so. I think that's a matter of scale how many people opt-in on that on that part of the question and the question is could you just draw a lot, you know do certain neighborhood. I think the contract terms would support that the same piece of the question is there if you would want to offer that neighborhood or neighborhoods, you know more than a very minor discount then you would need to find the city. We need to find Revenue to support that and inside that Just be the financial challenge. If you wanted to give them, you know, it's like discount for making that change in that neighborhood. Then there would be a revenue question. But I think operationally the contract terms would support us moving at if that was a desire for the city and I'll just say that I was the final stats wide of substance. So I guess I don't know if you would call this a bigger picture question or not, but maybe this will discussion previous meetings and I don't recall but what is what is the rationale from spu and the executive about why Seattle should not go to other every other week when many other comparable cities have when there are strong or arguments for in a carbon emission reductions. We have on our side of very strong recognition on the part of the majority of the household in Seattle about the dangers of climate change and the need to reduce emissions. I mean, I really don't question the commitment that ordinary people have for for this and I also seen again this is this last part is anecdotally, I don't have statistical information absp you. But I have anecdotal information just from my own experience like my own household and you know people I know that every other week actually and and the understanding of climate change it does prompt you to change your behavior and consumer horrible. You were mentioned this earlier the the behavior change that you see if it is quite remarkable introducing garbage itself because you know, he's not going to be picked up for several days more and you don't want to deal with the smell and odor and you will really take pains to make sure that you and items of reducing garbage and even Can you you know make grocery shopping decisions, but also when you're doing garbage and recycling taking the wheelchair to separate things out and and so on so I just feel like there's so much going for us to do move towards this decision and given that other comparable cities have done this. And as you said, yes, it's it's less than a decade maybe but but roughly eight to ten years is a long time that other cities have done it. Why isn't until what is the rationale behind all of that? Either one. I mean that's that's that's asking us to restate we send them again in Canada and I can do that or you can do that either one of the community's making sure that we didn't increase from a from a cost of service issue, you know that we're not passing on the additional cost and we're trying to be more mindful of affordability. So there's been a lot of analysis and in conversations around understanding that you know, while a certain segment of our city population is okay with moving forward as other choice. So as it relates to cost so that even though there'd be savings associated with every other week pick up you're saying that the costs are are associated with the contract is that is that correct additional costs anything for us to is that it? We just signed a new contract, right? So remind me is a very open person that contract. There are no real thinner. So I mean in the contract, is there a 10-year contract with it with the extensions to to your extensions after that? Because I anticipate different models in the contract that we could try different things earlier term. But at any given day with any Contracting partner, you can sit down and say maybe we could change them and there is language that would allow for some sort of an option subscription that's in the contract so we could have a conversation about what that might look like in a way that could conceivably allow for on opt in for a larger geographical group. Of course, I would be totally interested in looking at every option possible. I'll just say though and I've said this before another contacts often are not the best way to go about things because it does have a real dampening effect on how much a pro any program is subscribing to unless you know in any other things we see the problems with OP 10 in Are related to services for the underserved for low income people on food assistance and all those sorts of things when you depend on top 10, it doesn't work as well as when you have you automatically Target the households that needed obviously you're talking about something slightly different. It's about the larger goal of reducing emissions, which we want everybody to be committed to adjust. I just feel like I don't know. I don't know if I'm up Dennis the starting point. Francois really appreciate the report and and the reminder of the work that was done seven years ago. That's helpful. I appreciate the clarity that this is not currently in the plan received a letter from the mayor this morning. But this is not a plan that we're planning to. Do. You know, I don't wake up in the morning thinking like how can I make life less convenient for people who live in Seattle and clearly going to garbage every two weeks to be less convenient. See my less convenient for folks. This is not driven by customer satisfaction necessarily. It's doing buy another set of goals, which we have the most convenient thing is probably just to throw our trash on the curb and let someone throw it all in a dumpster and haul it off to the landfill in our goal is to not do that. So I'm looking at the the recycling report that came out last week I think and so appreciate that update and at least my quick read it looks like we've kind of White wine to the last few years and unless you guys have some tricks up our sleeves. We are nowhere near going to meet our 2022 Targets in the single-family sector. We need to increase our recycling rate 10% in the next three years. It went down 1% last year the multi families of we need to increase at 17% to 54% So we need to double the recycling rate in the next three years in the commercial sector similar 10% increase needs to happen. So I get saying that I don't want to be the person that tells people we need to change our behavior and go to one ever the day. I'm looking at you all but I imagine I realize your messenger is here. I'm interested in hearing is the department in the mayor of saying we're giving up on her zero-waste targets. We want to redo the 08 targets or is it like we don't think every other garbage is every other week garbage is a strategy to get there, which is I think what we did in 2012 sure the other strategies there and get us a 10% increase in weight reduction next three years and it's going to require like change in Behavior. I mean, it's a hassle to start compost and Recycling and garbage right now and yet we do it because we were appalled is a community at the amount of stuff. We're sending to a landfill and we wanted to meet this commitment and Frankly, I haven't seen any changes in the last 2 years that are putting us on that trajectory. So I would love I appreciate the mayor of saying she doesn't want to do other week garbage. I would like to hear the mare come back to us in a month until it. What does she plan to do to hit a 10% increase in the single-family zoning next three years and if it's not every other week garbage, that's great. Cuz it's you know, I I get the complications. What are the things going to do instead of his just crossed my fingers and hope the people do a better job. I don't think that's going to work wants to come back and I will probably disagree with that but it was at least be clear that we want new goals that are less ambitious if that's the policies were going to say that until I don't know what you would recommend committee chair ask for this briefing because I like you and frustrated that we aren't pushing forward. And implementing some of the solutions that I've seen are the jurisdictions Implement. I was specifically this particular strategy for climate change event in Multnomah County Portland director of their version of the office of sustainability environment to give a presentation and talked about the actions that they had taken in their climate action plan and this one jumped out at me and I remembered the pilot. I remembered the what at the time you felt like a decision that was a political decision backed up by a customer satisfaction survey to not move forward and I just really feel strongly that a seven-year-old report and people's attitudes of change and I'd like to test that theory that I have not only of people's attitudes have changed their expectations of their government. To provide a bold Solutions and and ask for their as in the communities collaboration and partnership on the solutions. That's what they expect the bus and I really feel strongly that people's perspectives have a very likely changed in the last 7 years. I'm also as it relates to a meeting in our waste reduction goals. I've been trying to also push a legislative change in the land use code specifically building construction code for multi-family buildings to make sure that new buildings have every other so I have every floor have garbage compost and recycling facilities located on every other floor because St use on own studies show that that is the one thing. That would make the most difference in improving our recycling goals in multi-family buildings that this is another element of that. I think would really go a long ways that I'm looking forward to getting more support from from the executive on on that effort as well. So I'm With You by Brian it's not this what face you can look forward to collaborating on that and I I know you are capable doing amazing work, you know, you've been doing this work for years and I've been impressed and I also recognize that this work requires off an uncomfortable conversations and pushing people's behavior because that's the part of it is is is policies and about how do we require make a convenient make it easier make it less? Play all those things. How do we make it the cheaper alternative to do what we want them to do and at the end of the day, it's also Behavior change and that requires a type of political leadership. I'm so that you guys can do what I imagine, you know, we're capable of and I'm just you know, I'm going to personally hold myself accountable here, you know, my first few years on city council. This is an area that is paid a lot of attention to how to say in the last few years. I've it hasn't been on my radar and I know that I have not been providing the political leadership necessary to continue to move the needle and I want to go back and look at the report from the came out last week and where we are. I feel like I've let myself down and let people like that represent down and I want to figure out how to how to start the game again Hill Seattle. I think has been a national leader and waste diversion for decades and I feel like I feel like we've been Turn on lorals for a few years. Because I think that the your team isn't capable and doesn't have a bunch of ideas. But the guys are there hasn't been the political demand to save all those ideas that we want to make it happen. So I think we have to do with the mayor to shift that they damn. I can kind of unleash the potential that I hope you guys have to to make something happen. And I think we just we need to be really clear about what that's going to take and it's going to take Behavior change if if you know, I agree with councilmember herbivore one. I think I highlighted in 2012 the majority of the people that went to the pilot recommended. We should do it narrow majority for sure and it's it's shifted since then there are race and social justice implications of that and I think I appreciate highlighting. That would be good to know where we are. But let's start a pilot a mandatory pilot in the wealthiest whitest neighborhoods in Seattle first then if that's our concern then let's let's see how that rules out and let's see what we learn and let Work on you know, if diapers are the issue what are the type of you? No odor sealing bags that we can offer everybody with diapers in the household. There's things that we can do to address those concerns that takes a little bit of work in some political leadership to do that. Let's do that. And so I don't know that the council is position to come up with the specifics. I think you guys hold the expertise. And so I think how we can ask the mayor to support the department of coming back to us in the next month or two and saying there's a road map for how we think we can get to you know, if we hit ever, you know hear the things we need to do if you want to hit a 2022 goals in the next few years and it's going to be ambitious and require more resources because we're going to do but let's at least have an honest discussion with the public on what the options are before us in this community. Are we ready to come and live up to the goals? We set a few years ago or we saying no we were going to give up on those and it just our goals and and and be clear about what the changes going to happen. I mean I scheduled a briefing on this 2017 report as a way to initiate a conversation. I'm not quite sure why that prompted a 9:25 a.m. Letter from the mayor basically saying it's not a conversation that the mayor wants to hang up. So I hope that together we can work on changing that so that it's it is a more open and collaborative discussion about what the possibilities are. Can you own your aura feels like you had a point about how in the other cities the satisfaction went up after the results have been in the program for a little while and I don't know there's a just one bullet points. I don't know whether it was up here a month or yours or whatever but I think that's also something that we should take into consideration. I mean if we if there is genuine agreement not just lip service with genuine agreement that we need to go to words. I mean we need to take every possible measure we can at the city of Seattle publicly to reduce emissions then we we should take the example of other cities by the satisfaction did go up because they saw that it does make a difference in everybody's well-being if the carbon emissions of the city of the whole city of the whole already has which I have no question in my mind that the majority is strongly Which are you horny people understand? We don't we don't need to explain to them. They understand the need to reduce emissions. Honestly the question of whether there's political leadership in City Hall to do that. And then the other question I want to do raised as far a button to just walk again to highlight that even in the city of Seattle pilot program. Everything I mean all the satisfaction number bars you had in the bar graph or a hall in the majority. So yeah, some of them may be slim majorities, but it's important to know that their majority. So I'm still I don't want you to repeat what you already said, but this is a question really directed to the mayor's office and not so much to staff as I still don't see what the compelling evidence is to not move forward when even the lower satisfaction was in a majority Direction and then the other last question. I wanted to ask you if you don't have information about this right now that surely find in fact, I would like it and informal sources you can send it electronically. Be very useful is One of the point that you brought up was a question of whether having employees in house in a public as a public employees vs. Contracting with a corporation if that was a variable that had some impact in other cities. So I don't know if the top of your head. Do you know if most of the other cities that have moved to other every other week also happen to have all their garbage recycling in yard waste employees in house or not. I would be interested in seeing that I I do see I I do acknowledge the point you made about that the the wages and benefits of the workers are are are compatible but setting that aside, what is the cost of the city of a contract with the for-profit corporation vs in the house when I think there's a lot of evidence to show that service abroad in house overall the cost of the city go lower. So rather than rejecting this program as a whole would we would expect is the in the different kind of leadership where we talk? About real options to bring services in house. If that is May going to make a difference when I'm just generally speaking that it often does taking those measures to reduce costs to lower-income households rather than saying what low-income houses don't like this. I don't even agree with that on the face of it. I think low income households are very clear about the dangers of climate change there on the front lines of the problems related to climate change. So rather than put the onus on them effectively. I think the owners should be on us. What there no other thoughts. I think I'm going to talk to my colleagues on this committee to talk about how to move forward all also continue to talk to folks as to you and and the and the mirror to see whether or not we can craft a path forward again. I I believe that the public expects us to do more and we'll be talking as well with the folks on the ground who are taking taking the lead on pushing us as elected officials to do more to address climate change as well. Thank you for your presentation. Appreciate it. That's its 10:23 and the meeting has adjourned.", "end_time": 2724.5}]}