{"format": "raw", "annotations": [], "confidence": 0.9444948691840566, "data": [{"start_time": 0, "text": "no, I just A leader we are now. Yes, we are. Okay. Great. Okay. Good morning. Everyone. Let's do a call to order here. I was going to say good afternoon. This is a special meeting for the select committee on the library Levy. The date is April 8th in the time is 10:51. I'm canceling Wars chair the committee and I'm joined by a council member bad shock and Sarah Gonzales and councilmember O'Brien. I want to thank you all for being here today. The rest of our colleagues will be here soon. This is the when do the chairs report briefly. This is the second meeting to deliberate the 2019 proposed Library Levy renewal are essential staff. Asha will be walking to the council issued ID list while exploring for potential amendments to strengthen the ordinance in preparation for this meeting. I should also provided a memo last week for your notebooks. An important notes of my colleagues as we are on a compressed schedule. So amendments are due no later than Tuesday April 9th at noon to allow staff to prepare a second round of discussions at our April 11th meeting this mean includes a public hearing as well for any other items including the potential Amendments of interest that come up after the public hearing on April 11th. I asked you to notify my office and nausea ASAP or Nadine by April 12th at noon. So if that will begin with public comments and on the game tell me how many people are signed up sign up for public comment. Okay. So since no one has signed up for public comment and then we will close public comment at this time. Thank you for joining us council members who want? Please read the first item of business into the record. Cancel Bill 11949 1 and Ordnance relating to regular property taxes providing for the submission to the qualified electors of the city at an election to be held on August 6th, 2019 a proposition to lift the limit on regular property taxes under chapter 4 .55 RCW and authorize the city to Levy additional taxes for up to seven years for the purpose of sustaining investments in Library operating hours collections technology and maintenance while expanding access to opportunity for additional hours Library materials and technology and undertaking seismic retrofit source of three Library facilities authorizing creation of a new fund and ratifying and confirming certain prior acts. So I'm guessing do we have everyone we needed the table? Yes, we do. Can you go ahead and identify yourself that I have a few Comics to make and then I'll let you launch in Oshawa. You've been doing a phenomenal job. I cannot tell you how much I appreciate your memos you're riding in a research. I'm just a quick recap for the folks that weren't here at the last hearing that we had we did a brief overview of the Seattle Public Library, which was established in 1890. We talked about in 1998. There is a Libras for all which was a bond measure that we talked about in 2012 did the libraries for all which was a property tax levy, which I think was 210 get that wrong 123 million. Yes, 123 million. And so and what we're looking at now is for 2019. We're looking at a property Levy coming up for 213 million, correct? Yes to in 30 minutes. We have a 90 million-dollar difference in their my understanding is that of the 213 million that will be discussing and proposing 167. You know that is to retain those core services that we providing since the 2012 Levy and then the additional 45.9 million is to enhance and improve services and I want to point out that the target areas in the categories in the emphasis that the library has focused focused on in 2012 for the same measures that were focusing on again those for dedicated categories were open hours and access collections technology and maintenance and size medic say that word. seismic Seismic, thank you seismic Metro fit so basically forget an earthquake they can stand it. Got it. Okay, so I'm going to leave it at that. I'm going to hand it over you I should cuz I know you know what you're doing. So as it comes my burger or as much as today is the first of two sets of issue ID. I'm such a boat today and at Thursday's committee meeting I'll be talking about issues that I've identified as requiring clarification a potential additions to the levy and items the council members are interested in discussing. About to be on the library have been really great about getting me responses to both my and your questions because of the tight schedule. I may need to follow up on further questions you have today and hope to answer them on Thursday when he meets for the public hearing. The first issue that's identified in your memos as needed clarification is around funding for maintenance and capital costs. There's some confusion around which funds have been supporting these costs and which ones will continue to support capital projects moving forward before the passage of the 2012 Levy a combination of real estate excise tax or and general fund supported capital projects, essentially the bond measure passed in 1998, the projects in that were completed in 2008. So between 2008 and 2013 3 in the general fund supported these projects as of the approval of the 2012 Lobby starting in 2013 Levi funded Levi funding replace the majority of four major maintenance. For the 2012 Levi. 31.8 million dollars was anticipated in collection of Lobby funds and 7.8 million dollars of eventually end up being collected. Anticipated to be between 5 and $700,000 annually between 2013 and 2019 and this is mostly true except for in 2016 and 2017 when there were some unanticipated costs that are associated with the Central Library those costs were not accounted for in Levi planning as well as the expiration of a lease for storage facilities, which resulted in the library wanting to acquire a multi-use off-site facility. Essentially the cost for the Central Library included replacement of some warm flooring assessment of the curtain wall, which is the non-structural face of the building a combination of a lift. So that that assessment could take place installing some anchors to facilitate cleaning of the curtain wall and inspecting the fire suppression system that work ended up costing 1.25 million extra and refunds in 2016, 750000 and 2017. And then was allocated to support construction of public restrooms in the library one of which was in all gender restroom. For the multi-use off-site facility at the time. The library was looking to acquire a permanent location to consolidate its Building Maintenance custodial Services Landscaping storing where the library Vehicles were at that time to lease that the the library currently had for building maintenance was going to expire at the beginning of 2016 and planned expansion of storage facility was not the best use of Queen Anne storage. So that time in 2016 the library entered a lease a five-year lease at a new facility so it could sell Queen Anne storage and a little over $500,000 in Reedsport was needed for tenant improvements to that location. 2018 2.8 million dollars in proceeds is currently on being saved for the acquisition of a permanent facility and those proceeds come from the sale of Queen Anne storage as well as projects done during the library for all capital project campaign. Essentially what this what this means is for the proposed 2019 Levy the amount of refunding is anticipated to stay at a between 5 and $800,000 per year. The levy funds collected for these projects is 55.7 million dollars. So as compared to the refunding a 4.8 billion dollars, it is primarily Levi finding that will continue to fund capital projects and major maintenance for the library the point here I guess is that it's not that would be fun to replacing a decrease in read support. They continue to be the primary support for these projects Andre continues to be a limited source of funding for capital projects for the library. Thank you. I think it would be helpful. If you spoke a little bit more about the uptick that seems to be a bit of an outlier. When were talking about refunding an allocation of read dollars to capital projects. So I think that was in 2016. I think in 2016. There was a significant increase that went up to 1.25 million dollars in RI and it has been argued by some in this town that treat is a more appropriate source for supporting at the library and all of its needs rather than a property taxes proposed by this proposal side. I just think that people some some of those folks are hanging on to this reached a bump of 1.25 million. I was in 2016 that we see and I'd like to have you speak to why there was a 1.25 million dollar real location in 2016 in the in the Serta for contacts of what appears to me to be a more traditional contribution of somewhere in the 500 to 700 thousand range as it relates to read. I'm so the the 500 to $700,000 essentially accounts for the re-imagined spaces, which is sort of a restructuring of the libraries for newer or excuses. And so Baseline that's that's what read funds and in addition it also fun some Ada improvements that tend to come up year after year and said that's the majority of it the addition in 2016 essentially was to account for the fact that in 2012. It wasn't entirely anticipated that there would be these needs at the Central Library the Warren flooring. Was unearthing the curtain wall because it was new architecture from when the downtown library was renovated a variety of means that didn't end up being worked into the anticipated planning for the Levee. Because of that refunding ended up being a mechanism by which those necessary improvements happened in 2016 and 2017. And so s once those in prison for taking care of refunding dropped back down to what its average Source was in 2018 at about $550,000 in 2016. There was unexpected additional Capital project related costs that were not in existence in the years that were leading up to the planning for the for those with medicine projects Etc. And that required the city both the mayor and the city council to re-evaluate how to prioritize limited rate Dollars to meet the unanticipated capital project cost of the library as he just described is that is my understanding, correct? Yes. That is my understanding as well. And I understand that part of the capital projects and I'm looking to library folks right now is there was an actual issue with the floor sinking and that was not anticipated. So, I mean, I think it's really important for us to make sure the public understands that that yes, there is some discretion related to how we can appropriate and allocate $3. But but not all of the library needs will and can be met to the scale that is needed by simply relying on Ray. And in my opinion that's an oversimplification of the availability of dollars that they exist for for this really important uses. And so I think it's really important for us to make clear to the public that that 1.25 million dollars in 2016 shouldn't be read as a signal that there are ban Limitless amounts of Any available in that bucket for the library to meet its capital cost that that was a discretionary decision made by the city council and by the mayor in order to meet and unanticipated costs that wouldn't have otherwise been able to have been met through Levy dollars and an invasive don't want us to be put in a situation where we are creating a fallacy and turn those options available to us and the library to meet the real needs. Thank you. I will move into the second issue which is about the proposed elimination of fines. What was the library previously discussed? Sorry to each other up here as long as well. Every previously described. It includes funding to support a fine free policy in the context of of this policy is rooted in the purpose of the library for this Mission and what its principles are until the primary functions of the library are to provide free access to information that also includes eliminating barriers to access historically children's materials and English as a second language materials have been fine free between 1990 and 2009 that was the case and those fines were reinstated because it's Financial constraints created by the recession currently 88 patrons and mobile services patrons are exempt from fines and materials as general category. Do not have fines associated with them. For all our patrons and other materials overdue fines are charged a $0.25 per day for material and access is blocked when science reach $15 as it stands 20% of the library's current accounts are blocked. So as a policy goal to achieve the library's Mission the ideas to increase access and for a long time, it was believed that finds where the mechanism by which people would be incentivized to return their books on time. But in reviewing research on the experience of other libraries turns out that finds better than incentivizing books being returned on time decrease access because the funds accumulate accounts end up being blocked and people with lower-income communities often cannot pay those off to get their access restored. The patrons of more resources can pay resulting in a disproportionate impact on those communities who score lower on the equity index, which is a Community Development uses to evaluate opportunity before you go any further. Can you just share with us? We know there was a study in San Francisco and I think it's that has that same just maybe briefly for council president Harrell, so he understands that there's just not going to be a run on the library and everyone's just going to take books and never bring them back. But I just clear that up. So the Seattle Times understands that I wouldn't bet on them understanding but the distinction between those two is that finds accumulate for overdue materials fees are incurred when an item becomes lost or in need of replacement and so I'm looking to the San Francisco study essentially what they did is collected data about all of their users about the community services were from which accounts had access limited access or blocked access because of the fines that had made that activated that blockage what the economics of those communities for like and they spent a lot of time talking to other libraries that had either already implemented a fine elimination policy or were in the process of eliminating fines for either all materials or very specific materials. And essentially what they found after talking to all of these libraries is that either returns ended up being the same or the timing on returns with shortens? There was an increase in speculations that happened at multiple libraries as well as data collected the said that it was the negative interaction of people having to go and pay Off Their fines that that decrease incentive to go back and get access restored. So it's not only the existence of the fine for the actual interaction with the with the library that was negative people wanted to avoid I'm looking at that they also looked at common concerns about eliminating fines and one of them was about fines as incentive icing returns, but also as instructing people on what their civic responsibility was in terms of returning those things on time and one of the things that they noted which is in line with the Salem public library Mission is that the mission is to provide free and equal access and so the policies that the library put the place are intended to be in line with those and so if they found it San Francisco had found or found that the responsibility of Patron was to return items in a timely way and to teach them to do that finds would be necessary that and that actually works the policy would be to keep those fines because that's what we'd best to free and equal access as it turns out given all of this research. It seems clear that the route to free and equal access is in incentivizing people to return books, but that isn't a policy outcome that is driven by a fine. I'm so I just read from one of the the quotes from the study of overdue fines. Do not turn irresponsible patrons into responsible ones. They only distinguish between patrons who can afford to pay for the common mistake of light returns and those who cannot I can just have you hold it one second there cuz I believe cancerous want has a point to make it that I have a few follow-ups cuz want thank you and I'm sorry I missed what you said last I can maybe relate to one of the questions I had in terms of the San Francisco city first of all, and maybe if you mentioned I apologize for a mistake, but what what was the. Of time over which day studied this and clearly they did it the data they're using is not only the library the library system data about which books were. Tottenham how many and circulation is he mention circulation my. But also there was a survey component because it was really interesting you mention one of the things was not only to find that are orange but the negative interaction of having to go and pay the fines that that's I think that's a good inside and do what what people are thinking if you could go a little more into a whole number by how much did the circulation go out? Like, what's the just as a guideline for us here in Seattle and I think the solution the last point you made it in terms of income like that. Do we see significant change in circulation as far as low-income households are concerned and I don't know what it is. And if they didn't measure it while I would be interested in knowing what kind of factors do you use to measure it? Like what how did they classify someone as low income? And then the last Is did it have any positive impact for example for circulation of books by children and young people. Thanks. Go ahead whenever you're going to be ready. In terms of this study was done to make a case for moving forward with in the NF. I'm free process. So I'm not entirely sure what happened specifically in San Francisco. I can go back and check but in talking to some other libraries they found at the Salt Lake City Salt Lake County Library experiencing a 11% increase in the number of borrowers 14% increase in the number of items borrowed in the year after they eliminated fine. So it increase circulation there. Let's see in Nashville they found About 50,000 cards were blocked out of 300,000 users. And once they had eliminated Vines there were it does have a percentage but a number of people returned to the library after that policy change happens. Question sure you finish to answering that question in our first meeting when they issue of having a fine free environment was broached. I just want to make it clear that I fully support not in any way penalizing people with Without the resources to pay the fine. I fully support that. I want to better understand the issue is I look at what all the possibilities are because again, there could be people willing to pay fines and I think they find Revenue around 8 million dollars per year and if you look at the administration Of the new Lobby. It went from 1.4 to the old Levi. The Baseline is 2.2. And I did have some questions as why does the administer I still don't Flinch and white Administration goes up just because the loan or rather the love amount goes up. It would seem to me that their economies of scale and play. I I just don't understand why it keeps going up just because the amount goes up to the way soon then if we push the amount down and we didn't support the full proposal of the executive that the administration fees go down just because the dollar amount so maybe I could understand off line wire that goes up but the fine Revenue even if it's if we and I don't know if it's a pilot or if we look at how you can still capture. Find from those willing to pay without penalizing those that can't is there a middle ground because even if we captured 20% of those that are willing to pay you're paying for the administration, so I don't understand why I think still most Library. So I have some kind of fine mechanism that can you tell me that the fee is when they just don't turn it in at all. That's the feet. So what is the fee Revenue in the fee structure still in place? It seems to me that Why not get away with a feat penalty structure than because if they don't turn it in wooden wooden some of the same folks that are unable to pay the fines not training books and then they're prohibited from borrowing again as well. So I don't seem like we should either go all in and look for some kind of pilot or something. So the fee revenues is is what do we get or is the find ate mine is that include the fees from the past Lobby. The front door 8 million includes both fines and fees with moving forward on the projection is that fees will create about $200,000 worth of Revenue in each year. So most of it's fine. It's just a small segment of these are people just don't they just for whatever they might have lost the book. Is there forgiveness if they just lost it I mean or they always say they lost it all I can say I took it you're not getting back right depends. So so once a certain. Of time has passed so I think it's 40 days after 48 is gone by and anything that is currently in overdue status. Turns to feed status so it would essentially be you've lost it requires replacement. And so the fee policy from what I understand is in place because the library does have a vested interest in getting its materials back and so that the difference between the fines and the fees is that with fines. It's primarily an overdue issue. So it's about getting the item back in a certain. Of time as far as fees go up because you're looking at lost her replaced Books they need to to be able to replace that copy of the book was so it's it's the balance between if you can pay to bring something back in a timely way or not. So I don't know who you put the schedule but I'd actually be interested in a waving the penalties for fees. Because of usually some people live in in our operating a higher theft area than others and it's in I don't want them prohibited from being able to borrow from this public asset just because they can afford to pay the book back. So I think we should look at waving the fees. But I also think that on the fines we should develop a process by which we don't enforce it in terms of they can't borrow any more but if they're willing to pay for it and you have parents using the library, I mean I grew up in the library or just letting you know, I probably projecting are because you just had to get the books back. So when we probably could capture millions of dollars on a voluntary basis that the San Francisco study and had brought up was the negative interaction in terms of coming to the library to pay off fines. And so that it could be assumed that that negative interaction would also include what it look like to have to provide your in. Information in terms of if there's some people that pee and some people that can't those people that can't pay would have to be able to prove that in Subway. There would have to be some sort of rush bowls with utility. I was simply suggesting that that it could be a positive interaction, you know, your your fuel leak say we try to encourage people but you would have all this but if you can't pay or you're even in the willing to pay you can still borrow but here's what it would have been had we had a strict him policy in place, which I wasn't talking about intelligent and income eligibility. They just a voluntary basis by which people can pay for late books if they just cuz my guess would be don't most people pay for the fines. Is it the delinquent amount just like 10 or 15% What's a delinquent about 20% of current accounts are blocked 1% of the people are unwilling to pay and I wouldn't suggest we penalize them at all. But if you have an enemy, even if those people even if the 80% people that are it really affects them adversely be willing to waive that but I just don't understand why I don't understand the policy reasons for waiving millions of dollars when there might be some people willing to pay Well it really I don't know if they looked at that all we need about this so far in terms of this these questions, but I would say you I don't see I mean just speaking from a study angle. I don't see how and studying enforcement I know. I don't think I don't see how we can have a system where we say. You don't have to show your income information. But if you're able to pay you should pay so what's going to happen. If you if you want to do that kind of policy, which seems completely wrong headed to me what it what would happen is people who can afford to pay would pay and I would be impossible it was going to be an implicit shaming of people who can't pay and then there are children who who shouldn't have to figure out whether their parents are able to pay or not. Just seems to put the Just on the individual families to decide what they should do. And I just don't think that that is it is worth and if you're worried about millions of dollars then and yes, that's about it things you can be concerned about but then the council should be talking about Progressive ways of raising those revenues and more than that, but not not trying to accomplish that on the basis of applying fines for library books. I think this is the correct direction to go in I'd also note in terms of physical impacts the revenues from fines and fees have been dropping over the past seven years. So back in 2013. I believe we were collecting about 1.6 million dollars. And as of 2017 on that a drop of 1.2 million dollars and some of that is due to the increase in usage of a material is rather than physical materials. And so assuming that trend is going to continue its the production is that those revenues are going to continue to fall for me materials. I'm stealing of materials from finds the larger. She's I just think it's a significant part in I want to make clear. I'm not talking about having a fine structure and people that are able to pay I'm taking how to find sex with people willing to pay huge fundamental conceptual difference. They're so not penalized. And the last point is we are going to ask these voters to pass a love you from that was once 122 million all the way up to 213 million and we have to impress upon the public that every property tax of $11 that we are asking them to pay is is part of a large scheme of intelligence here. So yes, I'm finished. I'm off that soapbox. I'll be back in a minute, We have to talk about ability and willingness. I I I really think that this is just in terms of having a sense of proportion in a in a city and state which has the most regressive tax system and in the context of some of the biggest corporations actually paying a net negative tax rate meaning they get more from the regressive taxes, and then they pay into it in the context of the Dodge Dodge Motor Corporation are getting more subsidies. I don't think we should be talking about the willingness off. You know, the Cordon word willingness of households to pay Library fines were talking about essential Services for Families, especially families who have no other options and rely on libraries for various needs not just the books all but also for internet access, I think we should make the access to libraries as obstacle free as possible and really not engage even in a conversation which sort of implies nickel-and-diming these households. Okay. So what am I to do appreciate the opportunity to address this very quickly. I first want to highlight the fact that it's my understanding that the library system serving Snohomish and Island Counties have Using this approach for over 35 years as to the issue of allowing people who have costs associated with overdue or missing items. I think the structure that we have created allows for that because people will still be charged for an item that is not returned. They will be charged the replacement value in people who are able to pay for that replacement value will have the opportunity to pay that replacement value. Nobody will be blocked from accessing Library Services as I understand. Thank you. I'm going to make a few of them. Sorry they can work with the library if they are really unable to afford those please. So they're not totally block they could just possibly I'm not understand Charly black. You're not getting those fees waived. So I'm going to I'm going to wrap things up just it in one point here cuz I want to get back to the whole philosophical point for someone to just start with just the basic legislation on page 5 line for talks about overdue fines have little impact on returning materials and such Vines have a disproportionate impact on low-income families which discourages Library you use we know that eliminating fines equals higher usage. And so this is the more philosophical point which actually has its roots in just basic fact and common law in history is that libraries are not a revenue-generating essential governmental function or service by Nature libraries are public institutions that are most intensively used and valued in every Community across this country. So we can go back and forth about 8 million or fines or fees but the point is going back to our four categories on over open hours and access and I believe we have attachments to the legislation on the heat maps and what what what communities are not being able to get back into libraries and that is the focus of this. I'm not trying to make light of a 213 million-dollar Levi, but there is a greater good here in the greater good is public libraries are public and the whole point of having them is to have people come in there and use them we have learned that public libraries are what they call the people's called The People's University that is their whole point. And so with that I would hope that we keep that is the the narrative in which that we should be looking at how we would look at this level and then second of all, I do appreciate that. It will be 230 million dollars, which cancer what was the math on that at? 450 do you remember what it was or how much maybe you can help me? How much how much was it empty? How much is it a month or our year? It's I believe it's 8492 per household for average median household and only 84 per year, which is about a dollar fifty. $7 a month. Okay, so that's what we're talking about here. So and I think that's just important because that is the history of our country and why so many people have become including me had an opportunity is because we use public libraries and without a public library. I do not believe I would be sitting here today. So with that can we move forward or any other questions? I'd be interested in some quick analysis to look at what inflation has done in the seven years since we did this Levy and then also a population of a serving a lot more people in the city my back-of-the-envelope math shows that when you account for population change in inflation there were talking about a 35% increase in the levy amount after those adjustments, but I love your analysis. Receive not to check them out for me. And then the question is just you know, we're talking about doing making some changes in pressure within the next couple weeks and let voters West what? Thank you. All right. It's going forward. Third issue is slightly related to this in that it deals with the rising cost of materials. So as currently proposed the lobby provides would provide $5000000 over seven years to support the increase in cost of materials. This is at the low end of the estimate for what would be required to maintain the most critical needs to keep up with demand if the growth of use of a material's if you take a look at appendix b i which is attached to the end of your memo, there are two figures the first talks about physical materials and digital materials as part of total circulation. And essentially it shows that there has been an a study increase in the use of digital materials that is that compares with the decrease in the use of physical materials and then the second Figure it's actually shows the difference in circulation by format in which the electronic materials have increased quite a bit more since 2013 season 20-17 numbers. The last figure figure 3 shows the difference in cost between a hardcover book versus an ebook or the audio and for this particular book, which is becoming by Michelle Obama hardcover is 16920 knit versus paying $55 to lease it essentially for two years. And so the costs are quite a bit more for a materials throughout the period of the 2012 Levy. There were four Falls associated with the increase in acquiring materials, which were filled primarily by private owners getting donations to cover those gas moving forward and Levy funds would support these that you materials cost but because of the rapid fluctuation both in the market and the the constant changing of Licensing conditions, for example with the 24-month lease now could be 6 month lease for the next copy of the book that the library purchases because of that. It's really a constantly changing number as to what's going to actually support the demand for a materials Brian information on the demographic of who uses hard books for Susie materials. Obviously take some sort of Technology on the user in to do that and I'm curious if if it's just for a few materials are disproportionately supporting one population versus hard materials technology better policies in Placer. I don't know maybe working with a big Corporation in town that could donate e-readers to low-income people so that they have access to it, but I'm curious if there are options like that. And the other question really is less to do with the Levi and I keep looking at our folks from the library out there as we see the cost go up for these and I assume they're probably some additional cost for digitizing but I can't imagine really there much. It's got to be more expensive to print a book than to Simply email file and we're paying three to four times that amount for that access do we know if that additional money is going to authors their support writing or is it all being captured by technology companies and distributions in publishing houses to the levy, but maybe there's another world where writers are getting our starving and we're paying a lot more money and it's all going into the hands of the folks that are controlling the industry and probably not a lot we can do it and see to change that but if there are things Can highlights about that Trend be good to fly get? Go ahead. I sure I'll have to get back to you on your ladder to questions about where the money is going and whether the library has e-readers on loan, but in terms of the demographics in conversations that I've had, I believe that the use of a materials is higher in areas that are not or tubing areas that are better off communities are using any materials more and I can get some numbers on that for you all. Go ahead. I just note for these not the the capital issue but the elimination of fines and the rising cost of a materials issues. There are proposed options in the memo about what you can do are obviously can do anything but a specific options that are laid out here to the extent that anyone is interested in pursuing those for the elimination of finds it would be to accept the marriage proposal to eliminate fines and keep the proposal as is modify the proposal to decrease how much Levy funds supports those operations and then eliminate that you can lean dollars altogether from the Levee. And on the E materials on the options are to accept the proposal as is at $5000000 or modify to provide more or less than 5 million dollars. The next piece of this is a potential additions to the levy the first is around providing air conditioning and or elevators at the three libraries that are scheduled for seismic retrofit in for the Columbia City libraries for Green Lake and the university Branch to add air conditioning. It would be an estimated $500,000 per Branch with for a total of 1.5 million dollars and that elevators are green like in University would cost $500,000. Each to add on to Columbia would be an additional $100,000. This is this is an item that was discussed but didn't get added to the mayor's Levi package essentially to add air conditioning and elevators to all the branches would cost 2.6 million dollars adding air conditioning would increase the level proposal in terms of average annual median home by 60 cents and adding elevator. Increase it by $0.44 and that's added to that 8492. The options that I've laid out, there are except the levy proposal which doesn't include funding for air conditioning where elevators or modify the proposal to add air conditioning or elevators to one or more branches. Does Keppra covers want I'm sorry Jarred Juarez. It's a question from the earlier section on the basic proposal on the question of what the policy should be if the materials are lost. But you said a thing is the current pozoles for is the membership to be blocked and then the person can talk to the librarian. I'm just curious as to what other cities or Counties have done from the study that you're referring to. Is there any sort of consistency in their policy on that just curious and if you don't know that's fine. We can have to get back to you on that. Because we don't have the central staff memo being the scroll through on the screen. What page are you on? I am now on Page 6. Okay. Thank you. So the second item here is Absentia lad is the potential for Library space at Denny substation. As I think you are all aware Seattle City Light has been constructing this new substation. And anyway, and one of the free spaces in that substation is some community space and there's some potential that that space could be used as a non-traditional Library space programme could be a pick-up location for hold materials. I just a place where there's Wi-Fi access or places to rent out a laptop any kind of renovation that we could use the library this way would not open until 2021 but is it currently stands? There is no Levi funding for post for the sea used and there is not sufficient funding to support this use in terms of the library's budget. So as leverage to provide some projections about what using that space as a library space. Wood and tell and it looks like it is about 6.1 million dollars to provide maintenance and Staffing furniture books in materials and to provide any kind of tenant improvements. And so that would if that were added to the levy would increase the average annual cost of the median household by $2.44. Yes, I appreciate it. Why this location of there been like an assessment of the city and the different locations throughout the city that would benefit from these additional non-traditional Library services and this Rose to the top and her standing it wasn't it didn't come so much from an assessment of those kind of faces as it did from the opportunity that having the substation in that location and that sort of empty space had so this is not the only proposal for that space. It could be used for public garden could use for any number of things and this is just one of the potential and things that could be used for it just seems to me that We should not be led to make investments Shirley on off tunity, but we should be led to make these Library Investments based on where the greatest needs are. Something at the library for post. This is something that is just spend in conversation about a potential space usage. Thank you. Thank you. So before we move on Usher have you wrapped up because before we move into the next item, are you ready? Because there's something I need to say. Okay. I'm going to cancel Amber Gonzalez. This is an issue that's important to her is on page 7 and she has to go. So I'm going to give her the courtesy of allowing her to talk to this issue. And then I'm hopefully you can follow up with us. How's that? Ankle before you I know you have to make your but I have to leave in 5 minutes. So unfortunately, I won't be here for the ongoing conversation. I wanted to talk about the specific item of Interest accounts member of the first one which would be adding programming for children Birth to 3 years of age. I want to thank the light. Weary for the work that they have historically done in this space. They have an early learning section on their website. This is this is a critical part of their programs and services at the library and really it's an opportunity to nurture childhood development at through a much more creative accessible ways to Early Learning and at this is a program that I think is very popular across the city. And in fact, when we requested additional information from the library around you said I was blown away by the numbers in terms of who and how the services are used. So in the last year there have been 2866 events that are at the fall into this bucket of early learning and literacy programs for children birth. To 3 years of age and there are over a hundred six thousand people who have accessed these programs at the libraries across the city and we have more granular detail the table that is included in the memo that I should prepared is a condensed version. There's a lot of other tabs and really interesting Rich data and information that was provided to us by the library as it relates to this kind of a programming. So this would be programming that would facilitate the ability of parents and children to engage in these early literacy Early Learning programs that include play time for example, and in my research, I have noticed and found that there is actually a paper policy paper that was written for the association for Library services to children that talks about what constructive play looks like at libraries and a point out that These types of programs are absolutely critical to making sure that children are ready to learn when they show up at kindergarten. So at one of the things that we are doing here at the city is investing a significant amount of money in our quality preschool programs, and we have also found ways to support other Early Learning programs into the the leadership of former council member Tim Burgess and beverage tax on for is it is an example of some of those Revenue sources. So again these programs and I think are really important for us to continue to support to make sure that children have a maximized opportunity to learn how to read and to be ready for for classroom time when they arrive to kindergarten and I think this is a really unique opportunity for us to braid this type of an investment into the library Levy over the next several years, and I just like to Remind myself in and other folks that I gave up on adding more funding education preschool program with the hope and promise that we could include some early learning funding in the library Lobby. So this this one is a is a really big priority for me as a chair of the education committee. And is somebody who really strongly believes in how smart these Investments are in our littlest Learners and their parents and there are so many amazing examples that are evidence-based of play to learn programs across the country that are also being used by the library currently and I think this is a really amazing opportunity for us to continue to invest in that area. So I'm hoping to be able to pull together as a set of resources for be well colleagues to take a look at it and hopefully be able to Garner your support as we evaluate the potential of making an amendment to this Levy to Add some dedicated Revenue to support this type of program, and we are still waiting to get some cost estimates from folks over at the library and I ate and I certainly want to be conscientious and and and attentive and careful about how this could impact people's pocketbooks, but I really do believe that the people of the city would find a lot of value in investing additional dollars per month in this type of programming at are libraries, which again is heavily used almost a hundred and seventy thousand people use the programming at our library is already and I just I'm hoping to be able to get folks support in this space. So thank you check warrants for allowing me a moment to talk about that. Cancel. Thank you very much. And I want to thank us for putting this in the central staff memo. I want also indicate our interest in expanding upon this concept as well. I'm not specific to the program which I absolutely support and would love to work with you on the dollar amounts there. But we're also in the midst of doing additional research on what it would take for additional capital investment for space for childcare facilities to be run out of our public libraries across the city as folks know one of the biggest issues that's creating lack of access to high-quality Child Care is the actual physical space and when we have those places we can do incredible programs like the type that customer Gonzalez alluded to with our Professionals in the early learning field of one of the things I think that we are interested in doing a scene if there is an Avenue and All Shall we haven't had chance to talk about this yet. If there is an Avenue for these type of capital dollars to be included in here and I'm in partnership with the libraries and the union folks who work at the library is to see if that is something that they would be supportive of to include additional dollars for building out. The space would be very interested in working with you all to see if that's a possibility. So I apologize that is not in the briefing memo and we'll be looking forward to sharing more information with you on that so that we can build out additional space for traditional infant and toddler facilities throughout the city, which I think is a nice complement to the proposal item. Number one here as proposed by council member Gonzalez the second item that's listed here is a discussion of adding more hours system-wide essentially before the recession hit libraries are open for a little over fourteen hundred hours system-wide per week when the recession hit in 2010. Those hours were cut by an additional two hundred hours. With Levi funding the library was able to increase those hours in 2013. And then again in 2016 to the point where currently libraries are open 1377 hours per week. The additions that are currently in the Levee package to increase hours would increase one more Sunday hour at all branches. Will. That's not specifically I love you funded as it is an item that can be added without love you sending but that would increase hours 26 hours per week open for branches on Fridays and add evening and morning hours to three other branches. There's an additional proposal that was not in the lobby package as transmitted by the mayor which would be to add an open hour to make an open evening hour Monday through Thursday. I'm across the system for an additional 108 hours per week in currently estimated at 5.6 million dollars. The libraries are getting me. The more detailed information about that amount, but essentially it would allow each locations to open that one additional hour each all 27 libraries. Do you speak Italian Army likely to bring an amendment to do that extend the hours for me for me to wait for an extra hour couple reasons. I want to highlight for colleagues one is just those evening hours or could be really important for users to access libraries and more hours are generally better of the other thing is we have Community spaces that are often co-located at libraries and community members ability to use those for meetings. It's a great free space to use for Community meetings. But in the evening when libraries are closing at 8 or earlier, it makes it really hard to schedule what's off in an hour and a half meeting cuz people need to be out of that room a half an hour before and so we run into problems. I'm most familiar with at the Ballard Library wear that around the city where folks have scrambled to find new locations to hold Community meetings, and we Struggle because we used to manage that buy but using some of our district coordinator has to have keys and access the library's but it seems like we have an opportunity here, which I think would be fairly straightforward to serve a couple needs which is any libraries that a lot of places based on Monday to Thursday to 9 p.m. And also essentially opening up making much more realistic that people could use free community space for meetings in that case of gleyber is open till 9 till about 8:30. We should facilitate the type of some of the community Gatherings. It would like to support we're still working on the actual dollar amount that would be its is a few million dollars for sure. And so hope to have those specific numbers by by Thursday and I'll whoop you in on the puzzle. The church just to understand so the mayor's additional proposal and council member O'Brien's interest that's in addition to the overlap there. Can you show the mayor extended some hours with the closing hours in the evening still? I think that the lady that most libraries are open till 8 on Monday through Thursday some clothes. If you are late this way that an additional hour till 9, but the problem with an ATM closing on Monday through Thursday means a 7:30 meeting in time. And that means if you have an hour and a half or two are meeting you need to start at 5:30. Most Community groups are starting their meetings at maybe 6 or 6:30. And so it's not impossible and some folks have made it work, but I think this would allow a lot more flexibility for Community meetings to be happening there and because it would add an extra hour in the evening for folks to be using the library for a variety of needs. That's that's the old number. So we're looking at 5.9 or so and maybe another one or two or so. So then that I add all that to the to 32.39 to 2:13 the 213 million dollar number which is over 7 years proposal you were just describing was already in the 213 on the marriage. I thought in addition that after it was submitted. There's another five pointed with Kelso Road Gonzales with her concern is we don't have the numbers yet on how what the cost would be. So it'd be 213 is a baseline plus whatever those cost would be as a what council member I'm O'Brien is suggesting that would that would add 5.6 million over the 213. But right now Baseline is 213 for the base legislation that's cracked. You'll come back to us to what those numbers look like. Okay, great. Yes all about the numbers in the memo for the additional hours per week the way I read this and I think it's it may be a supposed to be a cumulative number. But the way I read this it looks like the extra hours would add additional 108 hours per week. Yes, or is that all of the ads? Nope? That's just the opening system-wide essentially would be one more hour per branch. Is one additional hour per day for four days. So it's four hours for hours for branch including the Central Library. So that's if you open it Friday or Monday Tuesday Wednesday. So the total of all three options together would add 150 about 210 hours per week over and above what is currently but you did that. This wasn't an addition not a cumulative number additional. Start new so I need your stuff tomorrow at new president Harrell still has his Library background in him visiting us wants a president partner with nonprofits or Community organizations to keep libraries open later. I will have to get back to you on that. I'm not sure that the Partnerships are specifically targeted to keeping the libraries open for longer. So one of those things that I'm constantly thinking about it, I know cast member bagshaw's always doing this brainstorm as well as with all of our both public facilities and then private Partners as well where we have space where people could potentially be sheltered especially in our harsh Winters and cold and wet weather for sleeping unsheltered outside. I know we have to be sensitive to adding additional dollars to this Levi because we wanted to pass in order to be good stewards of the public Dollar in many cases. I think for example here at City Hall. We have partnered with nonprofits to keep our first floor and basement floor open for those who need a warm place to stay at night. I don't believe that that has actually been a huge hit to our city budget to have those facilities open until one of the things I might want to do in Madden share. This might actually not apply. To the levy if we could figure out a partnership scenario, but if there was a way for us to identify as spaces across the city where unused space in the evenings, I'm picking up our large Bob facility downtown. We're to be used as a shelter. I'm and we could partner with nonprofits to do such housing that couldn't get could be a potentially good use of public space and it could also not add dollars to this Levy. I'm support of a council member O'Brien's suggested Amendment here. I had considered whether or not we could add additional hours and especially to create that space in the evening. I recognize that would be large price.com chair. I'm so in an effort to think of a creative Alternatives may be partnering with nonprofits to run additional spaces in the evening is something I'd be interested in if we need authorization in this Lobby that might be something I'd like to chat with you about Madame Sher, okay. Before we before you wrap up. Is there anything else or my colleagues? Okay, so just just so we understand this Levy only is for 25% of the total Library budget the rest of the money to run our 27 libraries come from the general fund and empty was shaking his head. No that we do not currently partner with nonprofits for the question that counselor mosquito had posed. No, I have my own ideas about how we can have revenue streams in the brick-and-mortar that we own the saying some coffee shops. Maybe I don't know but I think we shouldn't just focus on nonprofit groups. I think there are a lot of There are a lot of profitable groups in this city that have the funds if they were civic-minded in good neighbors that maybe they would consider contributing in assisting Us in some of the issues that were raised today, whether their extended hours whether they have extra space for Sheltering weather. We have longer hours for more people can get to a library anyting that focuses and contributes to the four issues that we have been focusing on since 1998 open hours and access collections technology. And then of course the maintenance and I can never say that word says medic seismic. Thank you earthquake proof. And so I I I really want to thank empty and his team are head librarian because he's been so accessible with all the information gained us the data hiring a social worker full-time and a part-time person in the downtown live. Ideally libraries are are like I said our people's University for books and for Learning and for Access, but they are the most public of Institutions since this country's founding and so I'm hoping that as we are in the twenty-first century that we continue to look at libraries like we do it other institutions that they're just not your library of the 20th century that we provide other services as well. And so with that if there are any other questions, I'm going to move will I got to make a copy of my sheet says I have to make a statement but Josh, is there anything you want to wrap up with? You? Good? Good job. Okay. So let me do this before I adjourn the next meeting of the select committee on the library Levy will be Thursday April 8th at 5:30 at this meeting essential staff will host a second round of discussions on issue ID and the committee will include a public hearing on the Levee proposal and with that we stand adjourned. Thank you.", "end_time": 4100.6}]}