{"format": "raw", "annotations": [], "confidence": 0.9300088501486938, "data": [{"start_time": 0, "text": "It's not easy. I mean I understand. Good afternoon, everybody. Thank you for being here is the March 18th 2019 city council meeting of the full city council will now come to order that asked you to please turn it down a bit. Thank you very much. It is 2:05 p.m. And Bruce Herald president of the council that work. Please call the roll O'Brien president Harold in the introduction and referral calendar will be adopted. Let's see. Just one moment here. I did have a note that council member Bagshaw. I think you wanted to amend the introduction and referral calendar would like to leave the Human Services Equitable development and renters rights committee of its obligation to appointment 1237. That's the appointment of Jason Johnson is a director of human services department and by referring it to the select committee on homelessness and housing affordability upon which we all set for a minute. Okay. I can't remember back shells you like to say anything about it is and let me just try to take my understanding that the appointment of mr. Johnson's been around for a while and the committee level there's been a resolution that was made by consumers want that did not pass. We're still in the middle of The confirmation process you're still seems to be a lot of work to be done toward that confirmation and this select committee is co-chaired by you council member Mesquite and customers want the Selectmen on homelessness in the housing affordability so that the appointment would move to that larger committee. Fresno. Few comments disappointment was originally and it still until this load happens in my committee on Human Services on March 4th. The council majority completely disregarded the overwhelming Community input into this question and refused to support a resolution to ask the mayor to take their input to take public an employee input into consideration when making her nomination, which I thought was an eminently reasonable position to have As I said the council majority disregarded Human Services Workers Human Service Providers and the clients of those Services now clearly don't remember that are attempting to run to the appointment results of the human services department employee survey from last year showed that sends messages and Johnson has become the acting director of the human services department confidence in management has dropped precipitously. For example, when asked for the human services department workers agree that quote the executive team keeps employees informed about matters affecting us and quote the results fell or shocking 38 percentage points in two years. I would think that in light of these shocking survey results down two members rather than attempting to push through this appointment would be reconsidering decision their decision to do this week. Disregard the input of the Human Services Workers. But instead today, they're going to be doubling down on ramming through the mayor's agenda and they're attempting to do so without bothering to inform the impact of communities that they're stabbing in the back. I learned of this amendment to the calendar only a few minutes ago. I don't agree with this approach. I think it is shameful and I will be voting no on this real referral most haunted numbers. You have never voted. No on a mayoral Department director appointment and the question that the community has and I have is what would it take for them to decide against get another rubber-stamping of the mayor's agenda whom would you have to hear from was not already come forward to demand that our voices be heard and respected and we're talking about a whole gamut of employees at the city of Seattle community members, especially community members from the black and brown community and the homeless communities. So therefore I vote no on this undemocratic surprise maneuver to Ram through the mayor's nominee. Thank you customers want any comments customer bolt that before we act on the confirmation after it has been referred that we consider doing some of the elements of the public process that we are concerned that we're not done by the executive and I would really welcome the opportunity to talk with the chairs of the select committee on homelessness about how we can do some of that. I think I'm counting my schedule has a resolution today about how we can improve the process of moving forwards. So we we know that we are going to have those voices heard and I would like to also have those voices heard by the council members making the decision on interim director Johnson before we vote. Any further comments, I'll make a common. I guess we'll vote. Number one. I think your point comes in. Her world is well-received. I think we should do much more work council members wants points to speak to her points. I just strongly disagree that we will I think she was in a ram through I think that was a term. We're not going to answer anything that we need to do the hard work. We need to Define to the public to the employees to all of our constituents exactly what we expect in a department head. We need to draft a clearer letter of expectation. We need to look at the outcomes of the measurements that need to be defined. We need to meet with the employees that Apartment Therapy. Apparently, there's been a lot of feedback I'd met with several of the employees and I will continue to meet with employees and I would urge my colleagues to meet with these employees in large groups to find out exactly what's going on in this department. We have to do the work of the confirmation process to date. We are I don't think we've done the work as a council to really know whether we should confirm. We're not confirm. So let's do the hard work. Let's make the confirmation process meaningful councilmember skate on your leadership. Thank you and others that chimed in on that resolution to talk about what a strong confirmation process looks like so I would suggest that we are doing the exact opposite rather than rubber-stamping anybody in this in this city that we will do the hard work and we have it at a committee that all of us are a member of the select committee on homelessness and affordability. We are all members. We have three co-chairs. Let's do the work and take this confirmation process very seriously about to Ram through to Ram through it. And if someone is disruptive they will be removed. I just warned you I don't even know who it was but that was your warning show to to Ram through would be the exact opposite of what I think the intended strategy is here to any further comments. Let's do the work. Okay, all those in favor of the amendment to the introduction referral Calendar, please say aye aye all those opposed say nay. How to get pass for the introduction for calendar is amended. All those in favor of adopting the amended introduction for a calendar, please say I I opposed the eyes have it. So we'll move forward to the agenda. There's no objection. Today's agenda will be adopted. Turn objects in today's agenda is adopted the minutes of the March 11th. 2019 City Council meetings have been reviewed if there's no objection demesne will be signed. Turn objects in the minister being signed presentations believe we have a presentation from councilmember Bagshaw. Jodee, Waits here today Jody. Are you all good and also is Benjamin Warren here with you? Excellent. So I'm going to read a little bit about the proclamation. I hope you'll join me at the front so you can say a few words. So what we are honoring youth care for today and others is for creating a safe place and a safe place is a program that connects runaway and homeless youth ages 12-17 to Services either by reuniting them with their family or providing them with emergency shelter this phone belong first to YMCA of Greater Louisville, and it's grown to include nearly a hundred and forty programs nationally including in King County. So just a few phrases from this Proclamation. It's always good to see you Jody by the way more than 350 9315 900,000 years have been helped at a safe place location or receive counseling by phone as a result of safe place. Information received at school at since the program Inception in 1983 more than 15 million years have been educated through National safe place Network safe place Outreach efforts safe place maintains a 24-hour hotline for youth can directly connect with safe place staff and the average youth age is 16. So if you can just imagine a sixteen-year-old alone and scared without family and out on the streets and selves in the good work that you have done. So, this is this is National safe place week, and it will be celebrated across the nation during the week of March 17th through March 23rd. This Proclamation has been signed the Seattle City council and the mayor hereby proclaim the week of March 17th as National safe place week signed by all of us. So thank you very much for your work. I guess. Rules are suspended. We just want to on behalf of you care and minors in our community and crisis. Just thank you for this incredible Proclamation and to remind folks that 24 hours a day 365 days a year young people are concerned adults can call one eight hundred four to two team, and we promised within 45 minutes anywhere in King County. Our team will intervene and ensure for safety immediately. And again, we think of our most in crisis and vulnerable young people. It's those use that are making that truck out word without a plan and let's be the first to greet and get folks to somewhere safer back home as soon. Thanks. Thank you Jodi. But this time we'll take public comment on items that appear on our agenda today or the introduction or Pro calendar or 2019 work program in the public comment will be accepted for 20 minutes unless it is extended speakers are limited to I we have six sign up sheet. So speakers be limited to one minute to hear from as many people as possible. I don't even think we'll get through all six sheet, but we do the best we could and we ask that you begin your comments by identifying yourself so we can use both microphone. So I'd ask that I'll call you off two or three at a time to ago this make fun of that my phone so I Janet is it mature. Are you at the first hear Janet in the middle? And then Jane Hart Hartford Jana be over here and then Sean make mceachron probably Slaughter that name for that. I apologize will be back at the middle microphone. So Janet your the floor. My name is Janet mottola and I represent a large group of tax-paying residents from the North Capitol Hill Neighborhood for asking you today to remove Amendment 4-18 from today's vote. The amendment of zones eastlake's Boylston Avenue East from low rise to mid-rise permitting the construction of 80 ft tall condos or luxury apartments on Boylston. This single action will permanently destroy the current and future Seattle residence interest the unique public view of the downtown Skyline Lake Union the Olympic Mountains and the Space Needle from the east side of I-5. We are for affordable housing but don't believe 4-18 will accomplish that goal on Boylston. We are greatly concerned that if the amendment is passed there will be no ability to claw back the result in permanent damage to this part of the city's natural beauty. We are counting on City council to respect the fundamental purpose of the Seattle and code specifically its environmental policies. Jana Jana be followed by Sean mceachron and then Julia piss piss piss Kyoto. I'm Jana Hanford. I've been a satellite for over 50 years. I love Seattle and I want to provide affordable housing to all and to my grandchildren who are up all colors, but I want to protect her beauty Seattle is incentivize Developers for over 20 years without adequate results building more luxury apartment is not the answer developers get rich. So maybe another one can buy the presidency of the United States as stewards of this city. You have a duty to help protect unique features within the city. It's not just a plan map of the city to look at you need to look at the three-dimensional character of the city and make judgment accordingly. So, please vote no on high on height increases you can see from this Photograph what it will do to public viewing for the 4th of July for every day. And for our New Year's Eve, please let the neighborhood to help you make the decisions on this picture. Sean Elsa president You know I can send you for like I wanted you guys to see me around and I just want to thank you all for what you guys do. I look around I seek out of the political environment and I just realize how tough a job it is you guys in the amount of stuff that you put up with that you guys are really shouldn't have to put up with so that's about it for me. I just I looked at your guys plan and I think it's great that you look around. You. See all the light rail go nowhere and you see okay. This is going to be in it just looks great. So I think it's really fun day. I hope that stays that way and that we can really put the stake in the ground and look at what she I was going to look like not 10, 20 30 40 50 years from now. I think you're really cool place. And the only other thing I have to say is that I'm not running for office. Not now, not ever. Chili just before you begin. Let me call three names out. So Mackenzie Chase will take the middle Mike Ben. Aloha shirts. I think I'm allowed. Ben and Marty Bennett Mackenzie, Ben and Marty Good afternoon council members. My name is Juliet prosciutto in the policy analyst and researcher with Puget Sound Sage. We have long been supporters of inclusionary zoning long before mha was the acronym of the day. I looked back at our records are first advocacy started in 2008. So I feel like we're excited but we're also feel like we're about 10 years late. We believe that strong inclusionary zoning policies are needed to share in the benefit of increase land value created through public investment and increases and Zoning capacity. Mha will help reduce the impacts of the affordability crisis for future residents of Seattle, but the policy does not doesn't do much to prevent impending displacement and eventual houselessness of currently house low-income communities and communities of color does why we support energy to adopt a companion resolution which sets out a somewhat comprehensive anti displacement work plan and thinking forward to Future policy LC. The next couple weeks councilmember herbold a plan to help mitigate displacement. Thank you for your hard work on this. Let's move forward so we can talk about displacement. Hello, I'm McKenzie Chase and on behalf of the Seattle Metropolitan Chamber of Commerce. We urge you to pass mandatory housing affordability Council bill 11944 for this legislation has been under consideration and development for several years and it's critical that we move forward now consider that had mha been in place last year. We could have raised another 87 million dollars without raising taxes. The chamber's engage on this issue because High housing prices push people further away from where they work making it harder for our 2400 members to recruit and retain workers on hold. This is an important opportunity to share Prosperity. So that Seattle is for everyone. Finally. We want to thank you for supporting an amendment to support the creation of child care centers. We know that is Seattle's population has grown it is put a strain on child care to thank you for this opportunity, and please move forward with this critical step to promote density to ensure that Across the income Spectrum can find an affordable place to live which helps our economy our community and our environment. Thank you. I'm bennewitz. I live on Harvard Avenue G to remove the mha amendment for 18 episode of Boylston Street, which is not had Community input Amendment for Eighteen With introduced to the public just several weeks ago with councilmember Johnson saying misleadingly quote this change to mid-rise allows for slightly taller buildings to be built in actuality. This is a change from 30 to 80 feet multiplying Heights 2.7 * extinguishing views cherished by the entire city and violating. Mha design in process guidelines luxury units with towering views will hurt affordability not help affordability that may Cheney is gold have goals of quote moderating development within 500 feet of freeways. These blocks are right on Interstate 5. The increase of 2.7 * is not compatible with T is most importantly we learned just this morning that the city specifically avoided public comment on this issue to do an active. Play Community lawsuit. This amendment should not proceed without the hard work of getting Community input Amendment for 18 will extinguish the views of the fireworks mountains and Lake Union sea of an ATM without a single. Can I give you a meeting? Just want sex just one second. Let me call out three more. So following Marty be making Cruz and then Judith Judith. booty But before you start the time as to Harold, I respectfully request to two minutes that I have made this proposal for if you would please so that sounds reasonable. I don't disagree, but the problem is I'm trying to hear from everyone. So can you just try to get it into minute Place highlights? Mr. Alive deeply appreciate that sir. Off of your office of housing web and this is ended indicative of the oversight on these programs with the city of Seattle. The mha program says this individual making $40,320 a year can have a one-bedroom apartment for $1,008. Now if you take his salary and times it by 30% / the 12 months, it does come out to the $1,008 monthly rent. But this is a 30% Ami unit his salary $40,320 is 49% of Ami and he is not eligible for 30% unit is eligible for a 50% unit. He should be paying 1680 and that is not reflective on your website is up zones in 27 neighborhood are going to have a displacement factor and the affordable housing requirements of the mha program will not yield enough low income housings to curb. Such displacement displacement and gentrification are two of the root problems of the homeless crisis in the city of Seattle and your affirmative vote today increases that problem. Thank you. Thank you. My turn Megan Megan Cruz. I had an article in the Seattle Times this past weekend calling for a density Bill of Rights to a man this legislation and some of its negative impacts encourage you to read it and support it. And we've seen these things happen. It's driven is speculative housing even further out of reach its created dozens of new towers without affordable units. It's displaced people in low-income buildings and put leverage on the city to approve an adequate and environmentally harmful to designs or lose fees. The worst part is divided people in this room for being for or against affordable housing. We're all for affordable housing, but it has to be done smart. We've had a chance to see how the grand bargain works. It's time for a new deal and a density Bill of Rights. Thanks. The truth before you begin. Let me call three more names that be Marty kooistra rust Sanders and Chris Olson Marty Russ and Chris and Marty will be over here. I'm here on behalf of friends of Ravenna Kalin and I want to thank Our member Rob Johnson for pushing Amendment for be so that we have a National Historic District in that area. Unfortunately, they're over. Over 50% of the urban Villages have never had a survey done at historic survey. We will be losing due to all the ups and it'll be too late. And so I would urge you to postpone this. I know you won't but I'm going to urgent because you will be losing historic resources throughout the city some of which we will regret our next generation will regret and it will be your fault because even under your own comprehensive plan. It says you're supposed to do your historic surveys in conjunction with planning that has never happened. So that's what I'd like to say. I'd also like to give a shout out to 3 neighborhoods, Beacon Hill East Lake and South Park the most polluted areas in the city, and they should not be up soon. Thank you. Open in Council Members. I want to thank you for this opportunity. My name is Marty Cloister and I work for the Housing Development Consortium Seattle King County want to express my gratitude for all the hard work. You've done during each of your respective 10 years. On the council to help Seattle get a tool that has been missing from our toolbox for far too many years. How much opportunity to ensure that Seattle is truly for everyone has escaped us. It is not too late. The journey today should move us from a voluntary program to a mandatory one a vital tool in our tool kit that will provide homes to those who make up the fabric of our daily lives and make our city Thrive this remodeling project. If you will was extremely complicated. It would have been much easier to have this program in place as the city came to be but that's not our reality. In fact, I recently heard an urban planner say that you don't get to create a cig just once This is your moment. I want to thank each of you for your leadership and your perseverance, and please vote this mha program through today. Thank you. Thank you. I'm Russ Sanders and I want to speak about how we often take Aurora for granted and do not give it the respect that it demands is a 7 Lane Highway that serves Seattle in the surrounding Community the expansion of the pedestrian-oriented district along Aurora adding 5000 + apartments and above the commercial put the public health and safety at risk. It is a simple Google search of proximity to Highway shows the public health issues surrounding this you've ignored your own. He is the Department of ecology. The CDC the American Lung Association State of California on Howe and countless medical studies about how dangerous this is of what you're doing. I heard you not to use. Mha as a means to clean up Aurora it puts people at risk. It's a public health and safety issue. Thank you. Thank you. Chris before you begin. Let me call three names that be Maria by Yola in the middle Micron morning and then patients. Melava Maria run and patience. If your High Council Members, my name is Chris Olson. I'm for the mha preferred alternative but against amendment for 18. I sent you a postcard. I hope you had a chance to read it. I don't think it changed your mind. So I'm going to make three new arguments today. I'm one in an article yesterday councilmember Johnson defended 418 setting workshops in previous years were there was quote interest in increasing density near I-5 specifically step down style or wedding cake zoning. Okay, and this isn't the scale but I drew a map of these two shows at 4:18 is none of those things. This is 418. That's the mid-rise zoning. Okay. So I think councilmember Johnson. I don't think you've thought of Capitol Hill when you when you were when you were saying these things I think he's like that is but not Capitol Hill is Upland from from from these from this mid-rise Zoning for 1800 violate the mid-rise zoning criteria in the Eis. States deadrise designation is limited to the following property in areas where Upland developments are of sufficient distance or height to retain their views over the area designated for The Miz rides. I think this is owning is illegal the King County tax assessor methodology factors using the value of our property. This is a taking of that of that property think you could take the skeleton out of the closet. Thank you, sir. Thank you. Good afternoon. Council members. My name is Maria batayola. It has been a long journey and perfect as mha maybe the Beacon Hill Council or just its passage with a companion resolution that provides Pathways to addressing our neighborhood concerns for displacement historic resources preservation an approach to home ownership and retention of are small and cultural businesses further. We aren't you to resolve the city's documented interdepartmental race and social justice report reverting family housing back to three bedrooms as we badly needed in Beacon Hill and include and strengthen council members her roles and tie displacement measures and monitoring for acceleration of re-segregation. We look forward to working diligently with you and the mayor to bring this companion resolution intentions to full fruition. Thank you so much. Ron horning. I'm here. I'm a resident of Green Lake for the last 19 years. My neighbors have been trying to acquire my property for a parking lot. That would be also include the school district. under mha the widening of Aurora the heights along Aurora come into play as far as the parking in that area. They're they're building a new part of the school on their parking lot, which would displace the sparking and then are trying to acquire other property to do that. I am here to protect my rights under the Fifth Amendment of the United States of America to keep my property there. Thank you. Thank you. Patience for free and let me call three more names patience is next in zole Grant on the cold is Anna Nicole Nicole grant grant Nicole Grant and Elaine Ike so Nicole Elaine and then Steve bub stello. Okay, good afternoon council members. Thank you for this opportunity to testify. My name is patience. My lava. I'm here on behalf of the housing development Consortium and I'm also here representing Seattle for everyone. I'll call the Asian Partners who have been working very hard to get this legislation across the Finish Line. First of all, I want to thank you all for your hard work for your due diligence and for your leadership and getting us to the Finish Line. This has been a very long journey and today I called today his story because it's been 5 years in the work and everyone has been waiting for this day. We excited to see this. This is one day that chatter pot to building an inclusive affordable City and we are excited to see this happen. And I also want to say that this is not just about building more homes for people who desperately need them. This is legislation that takes proactive action on climate change. This is active action that really takes us to a park where we allow more people. Live near Transit needed jobs in the amenities. We look forward to working with you and implementing the city station. Thank you. I don't see Nicole she had stepped away. So it will go with Elaine Elaine and following Elena will be Steve and then surging Secret. Good afternoon city council. The world is full of terrible choices. It seems today friends and family of color have been displaced from the central district and particularly from Columbia City displays to the Rainier Beach area, and now it is up for up zoning, and we still haven't adopted any ordinance to protect the environmental aspects of Green Space nor have we done anything to to to work on the displacement that seems to inevitably happen with the episodes. I understand right now that council member Lisa herbold has a plan for mitigating displacement, and I'd like to see that adopted before any kind of vote is taken on episode in any neighborhoods in Seattle. Thank you. so here we go again we've got a proposal which is going to hurt the city in many ways. First of all, you're going to increase the homeless because you're raising the cost of housing in the city. You're increasing just placement because why you can't see it in the North End. It happens in the North End as well as the south end in the Central District. You are becoming a city of only people of wealth and to help solve this problem in your mha you're going to not require that the housing that does come back the little that comes back is even in the neighborhoods where you're taking out the affordable housing you're going to further getaways the city and I don't know how far you're going to run the trains to bring in the people to run the city, but I don't know where you're going to go, but it's probably Beyond reach. Steve eye surgeon before you begin. We have actually exceeded the 20 minutes that are rules allow. We do have several more people sign up. So unless you're subject Chanel extended for another 20-minutes keep trying to plow through and so Sarah Jane after you will have three more speakers that BtoB thaler David Ward and David Hinds Toby David and David Soto be if you don't mind coming over here cirujano flourish here. Thank you so much Sarah James Siegfried. I'm a member of Dallas are gross and scale living in Lake City. I want to ask you today to postpone just for a brief. Of time the resolution which really was only available to us very recently and it is faulty and not fully baked hasn't been fully vetted. I'll give you an example in section g where it says develop a consistent and throw monitoring and Reporting process regarding housing production and loss of households at 3200. 3% Ami it's the units the actual apartments that need to be counted not the household. If you count the households, you're counting people who are already gone and we want to count the units. So that needs to be addressed. You still haven't addressed the definition of family-sized units. It was changed a couple of years ago in the dark of night from three bedrooms two two bedrooms, and we don't know what we're counting. We're not really addressing family-sized if it's not three units. I have a number of other concerns section D. It says continue to conduct Outreach to low-income and elderly households when it's only low income elderly households know and that are eligible for the senior text property tax deduction. So I just asked you to think about taking a little more time with this would have no effect really on outcomes. Good afternoon. I know what you're going to do today. Enjoy the moment. Toby Taylor from Fremont. I'm going to do real quick. Mha process if the city had actually honestly engaged with impacted Community starting in 2014. When the Hall of committee was appointed. The ordinance would have been adopted by now. You would have inclusionary zoning summarizing info. I gave you on historic resources and Fremont many hundreds of units are likely to be removed without replacement of affordable housing Fremont has experienced significant displacement in the last 4 years that's documented in the is South Park does not meet the Urban Village criteria your vote for Council bill 11944 for basically is a sentence of gradual dismemberment of that low income in minority community of homeowners. I support inclusionary zoning. This is not it Anna and the companion resolution is absolutely essential to fix some of the damage you're about to cause oh, I'm David and David word. I'm up person in the Seattle Coalition for affordability livability and equity and scale want significantly more affordable housing, but mha will not create. More affordable housing amount proposed is Tiny compared to other cities. It's simply won't be affordable provide affordable housing for everyone at 3 to 10% of 4 Double housing lonely view affordable housing for the 90 to 97% of the people will not have affordable housing. Mha, create significantly more displacement than affordable housing already in the U district. There are 165 units and 8 projects that are lost and lonely 88 units of affordable provided. So there's nearly a loss of 88 of 80 units and a new table create significant displacement in South Seattle with a ohming overwhelming majority of people are people of color, and there's already been significant loss there and will be double increase even more under. Mha thank you. Thank you. Leave no doubt. There's a revolutionary about to give true democracy cash out for a great American housing filled out without nonprofit unqualified getting it away or ruining the neighborhood and don't fear Baby Boomers sellouts desperate to flip their double triple mortgage dilapidated inflated perception of value house built in 20 Century on side of road propped up by the oppressive supply-demand squeeze that sell out so live it take it off of that creates a modern of local citizen homeless while foreign-born creepy Bank celebrate the focusrite the most run-down houses in America. We need a 20th century development with Advanced Architects civil engineers and vocational education for massive amounts of Carpenters Union fraud workers who built the homes needed for everyone in this country Seattle government continues to accommodate desperate housing owner speculating off the demise of other people. There's going to be a nationwide boycott of cl to disempower the very people who are born on what Colinas import following that is Bonnie Williams. Is it Stacy? Zanca or Stars Anka So stay tonight. So Bonnie, are you here by The Williams Kay Bonnie Stacy and Sharon Levine. Call Steve Zemke. I'm sorry Steve Steve. So Bonnie Steve and Sharon Levine. Good afternoon. I'm so cancel Bill one 19443 and and when 19444 and if the if the if the hollow public Outreach was really about listening to Neighborhood residents instead of being loyal to the Grand bargain possibly a better plan would have evolved. The inflexibility was apparent as residents offered recommendations and try to shape policy and countless Hall open houses hearings and Council meetings for the last couple years the burdens of mha for neighborhoods far outweigh the benefits the whole city should be turned up should not be turned upside down for only six thousand for evil units in 20 years when capacity exist without ABS own image and Heights resulting in loss of trees green space Gardens. Play spaces private spaces sunlight reducing parking requirements does away with density live in its weeknd's design review. We are missing impact fees from developers legging concurrency and rezoning will increase property taxes and displace lower and middle-income residents. Neighborhood feel like Partners, but not like second-class citizens. Thank you. affordable livable for 10 years ago screen replacement FNP 2911 0902 Beach exceptional tree at Rio Vista in all zones Where are the trees? I can stay. Sharon before you begin. Let me call three names after sharing to be turned in Martin Jordan. Right right to and John Lisbon or Jordan Ram. Thank you. I'm Sharon Levine, mha is deficient because it does not mitigate the cumulative impacts of increased density code and up zone changes will have severely impacts the potential tax burden on long-term Property Owners mini with multigenerational household and retired people on fixed incomes will displace citizens and force many from their beloved residences. Mmha is primarily about density and money generation and makes no Provisions to increase schools libraries community centers Parks Byron police protection another infrastructure and services that will be needed as population increases route Seattle. The city has been disingenuous and stating that only a small number of single-family home owners will be impacted went over 12,000 homes are currently proposed for up zones as high as low-rise one in low rise to more homes will subsequently be UPS on Winford. Queen Anne's residential Urban Village has more than doubled by up songs as for the comp plan. You should delay the mha vote until every single property owner who will be up Sodor impacted by code changes his individually notified and has a chance to comment on your body of City officials and you should delay image until you include mitigation for impacts on the environment Transportation infrastructure parking trees Urban wildlife and on livability. Turn on can you I don't start turning question is your mic working. Can you just do my check there? I don't think it's working. So let's just try this middle Mike. Best test. I think that one is working late and you could been a little close to if you like. There you go. Okay, you got it. Good afternoon council members. My name is tearing and Martin. I'm here on behalf of future wise to encourage you to adopt the mha Citywide policy the process of public engagement impact assessment and substitute revision on this policy has been an extraordinary one to say the least because of your leadership and the work of many dedicated housing Advocates today. We stand ready to expand inclusionary zoning to neighborhoods across the city futurewise recognizes that changes to Neighborhood character can be divisive and also that far too often throughout our City's history marginalized communities have borne disproportionate amount of the costs of growth the policy before you today is not a perfect one. But no policy. This transformative can be we cannot expect Perfection from policies with goals, like environmental sustainability and racial Equity. We cannot expect the disastrous impacts of climate change to spare us while we fine-tune every detail. We cannot continue to deny those with home but Homes housing in the name of perfectionism imitate Citywide as a pragmatic and Visionary policy, and we needed it yesterday last year and 10 years ago. Please pass it. Thank you for your leadership. Jordan jaundice Ben and Alex Zimmerman get your third on that that call for Sherman not quite ready for you. So start with Jordan then John and then Alex Bento many many meetings about this. Hollow works great for the white privilege and mha is avakin promise. You know, I hear lots of lip service about ending redlining but his eyes see at the up zoning is just a new redlining building homes that lower-income people cannot afford in the developers only require two out of all three percentage of affordable housing or pay a linkage fee, which will allow them to build ghettos of lowering of the lower-income in places where the more affluent will not to have to have them as their neighbors and they to use we're really only work if their rent is Affordable to those of modest means currently the code which no longer requires the owner to live in sight and does not require a street parking is just another giveaway to the developers as I see it. As we sit here is on her way to becoming a city of a singular demographic and that is a wealthy, and I hope that this meeting is just not mandated by law for you all to listen to but you're actually taking some feedback here. Thank you. check check check check check. Thank you. So John following you will be Alex Alex. If you don't mind taking the middle Mike and then Calvin Jones will follow you. So John Alex and Calvin. Oh council members. Thank you for listening to us today. As you know, I'm not a big proponent of mha from the beginning when they have a committee was comprised mostly of interest that would make money from development to the back door dealing of the grand bargain to the Eis which had several flavors of Alternatives that were all the same basically and from the public Outreach. That was mostly a Roadshow and a marketing public Outreach Danny with West need had it right when he said it was all baked in already. And Peter steinbrecher. I just met said when he asks when he was asked for Community participation Community feedback. He was informed that from a senior planner that the whole point was mute mute. so I'm skeptical because of a couple reasons one the naturally affordable housing. I'm running out of time here, but what I would say is I was a business person for 15 years and I listened to a consultant who told me it's really a good idea to have your employees give you ideas cuz I'll make it a lot easier to have things done. Your ideas implemented and I suggested the same thing in the public sector. Thank you. Thank you. I didn't think you're going to take the side my Galaxy Sol bat falling you will be Calvin Jones. I do want to say that we are just right exceeded the second extension, but we'll keep flying through for a few more and we'll see like my counselors think of you ready to move on with our agenda. So we have it will have a few more speakers while call out Alex Calvin Jones and then McKayla daffron. FedEx Carmike Theater, I'm not together, but you're not a criminal and kill it. Guys, I spoke to you I like you you like a small children from fifth grade Common talkin and talkin and talkin like her every day for many years. You send beer starting again and again and again ready freaking idiot. Wake up a canvas for a minute. Mr. Zimmerman you a notice even though you don't hear me and if you could address agenda item I will have you removed that you speak to an agenda item. Yes, sir. Yes. Absolutely. I'm insult everybody because I honestly I did not hear an agenda item. So I'm going to hold you as disruptive cuz I don't hear any agenda items sir. I will. I don't hear I'm going to find you disruptive. What a surprise. Okay? Okay, okay. Okay. Bye. Bye. So Calvin Jones Calvin Jones be followed by Michaela and then Louise forever Ferrero. Hi time, Calvin Jones. I'm a renter in District 3 and an organizer for a check for housing. I think a lot of arguments against mha and Progressive housing policy in general take some form of we shouldn't take action because we need to do some analysis or listen to some neighborhood group. But I think I really fail to acknowledge that we have dual housing affordability and climate crisis in front of us and that we don't really have time to do endless analysis before we actually do something about it every day that we spend talking about. Mha and we lose on average two units of affordable housing set means two families. Don't get to live in the city that we all love to families. Don't get to live near beautiful parks and two families don't get access to our amazing and green public transportation system that we have in the city. So congratulations on putting together an amazing policy for the city. Let's pass. Mha and then move on to raise more Progressive revenue for affordable housing and Water zoning reforms to legalize more types of housing in our exclusive single-family neighborhoods. Thank you. Michaela I'm after Michaela. We have Louis Louis Borio and then Allison is effing a maybe and then Nicole Grant. Play hi. My name is Makayla. Fern. I wear many hats today. I am a renter. I am a resident of Capitol Hill and I am an advocate for a more Equitable and livable Seattle. My also work for Capitol Hill housing and help staff. Something called. The Capitol Hill Eco district is 2 / 1400 households in Seattle and review. Mha is an essential tool for addressing the ongoing housing and homelessness crisis once adopted it will create thousands of new homes affordable low-income families in Seattle who desperately needed and feel the creation of new market-rate housing opportunities for our rapidly growing population. We are grateful for the thought consideration and time Council and City staff and fellow community members of put into the spinal legislation to encourage you to vote Yes on this important policy to ensure that Seattle will remains welcome. An affordable to all thank you. Well done. Good to see you watch. My name is Luis Barreto. I share a culture of Atlanta transportation of the Planning Commission back in 2015. I was part of the sd3 transit to the analysis to located west Seattle Light Rail stations, and I want to hear to leave legal record against amendment 151164 send invites cuz I'm a member Harold only 3 weeks ago. It's the first time they've for the opportunity to leave record. First of all, I believe that it was flying process. There was an idea not to change an individual neighborhoods rules and that was overlooked in this case to make it a very particular solution number to eye you look at the video of our 255-2317 of of the last of February twenty-five you realize that there was misinformation spread around there. Not too there's not a decision between two locations of one light rail station 10 and 7 blocks. There's two Light Rail stations happening. And the ones that were talking about are in the corner of a village within one block of each other, so that should not be an argument to change this councilman Gonzalez did not have to recuse herself and more importantly goes against the concept of what we're trying to achieve and I love to have you between to talk more about this with you. Thank you. Thank you. And then Nicole Grant I was told you or hear I don't okay, so you'll follow Allison Place. Hello council members. My name is Allison bolgiano. I'm resident District 4 and I'm here today representing Bellwether housing Seattle's largest nonprofit provider of affordable housing people who make up the social and economic fabric of our city should get to live here the people who teach our children who care for the sick seniors folks experiencing homelessness. We has all of those people we want to house more of them currently have plans in the land to build large new projects in Roosevelt Rainier Beach in First Hill, and it requires city funding to build these projects, and we're thankful for the partnership of the office of housing, but we need more funds each year nonprofits put in projects that just can't get funded. Mha could more than double the amount of funds available. Thank you. Century council president Harold council members, my name is Nicole Grant and I'm with MLK labor representing unions in King County, and I wanted to take this moment to every single one of you for the experience that you participated in to hear from your constituents about how to move forward with your boat on mha today in all sectors of the economy, and they are consistent and sharing with us how difficult it has been to have a home in Seattle today. We have this incredible economy. We're bringing people from all over the state the country in the world to work in Aerospace Tech Maritime, but when you come to us sharing this experience we have to rise to the occasion and make the homes for people to live in so I hope Stay smart and active and keep pushing the envelope for housing in Seattle. So we've heard from a little under 40 speakers this afternoon with extended public comment a little more than twice. And so unless there's a motion. I'm going to conclude Paula, and I would remind that I would remind the public that we've had approximately 40 public hearings on this matter. I think approximately seven on this particular bill, so it hasn't be so I'm going to conclude public comment unless I hear another Direction move to payment of the bills. I will not ignore the question. I think there's probably another Oh 30 people are so I signed up. But but again, I think we've heard of Mary out of opinions. And with that I'll move to the payment of the bills in the parents there of 11941 motorcycle bill pass or any for the comments. Please call the roll on the passage of the bill. Herbal eye Johnson Juarez. Mascara O'Brien salon Before we move to committee reports. I'd like to ask that the public in our colleagues just indulges for a minute as we take this a moment of silence to stay with her brothers and sisters and her sister city of Christ Church in New Zealand. I think all of this has followed the headlines and we want to make it very clear that we do stand with our Muslim Community and there were 50 lives lost in our hearts shouldn't go out to the victims and families or so before I get in the committee reports. Just take a few seconds of Silence. Thank you very much. Thank you very much. So let's move to committee reports technology department for turn to January 1st, 2023. The committee recommends the appointment be confirmed. So before we get into the substance of this very important appointment. I'd like to first I move to amend the appointment 01252 to include the letter of expectations in the clerk file in this has been circulated both input in the public forum. And so before we do that, I like to amend the appointment is there second has been moved and seconded to amend the how to clean include the letter of expectations in the comments all those in favor of the amendment, please go die. I opposed the eyes have it. Having said that this appointment is a pointing side Bashir as the Director and chief technology officer of the shallow information technology department and during the confirmation process. There was a request not a directive to not change the name again, but that was just some humor and maybe some insight that they've been several name changes. What is the CTO of this position while the CTO manages a 277 million dollar Seattle Information Technology budget. It leads a department of close to 700 actually 680 full-time employees and oversee the delivery of all technology services for the city. The IT department manages our information technology resources which includes telecommunications data supporting our physical infrastructure Oliver applications or application infrastructure are Computer Engineering and our operations are data centers are servers are stored or backup equipment or desktop mobile apps are putting devices are cloud services are digital engagement Services. It's quite a swath of work and part of the it consolidation process. They are now response for managing all IT projects in the city and the most recent buy a biennial budget reflected the new set of a project Centric structure with a Citywide portfolio portfolio of a 450 million dollars. Who is Saad Bashir? Well, he's has a quite impressive background least in my humble opinion. He served as the executive leadership roles in the city of Ottawa since 2010 your serve as Ottawa Chief Information officer since 2016 and under his leadership the IT department of transform into a world-class public sector it Department recognized by many new shoe Authority for that work with an increase productivity agility and a greater focus on clients. He managed a hundred-million-dollar it budget for Ottawa and lead a department of 350 it Professionals for about twenty thousand Presley 20019 thousand Floyd clients and I'll bring what I think is a good balance of public and private sector background and offers offers up there a practical change to management expertise. He submitted several reference letters. I could quote many of the reference letters, but the short of that was that the he is just no Phone for his leadership style and is very collaborative style of how you make decisions and how it works of people are the process itself are the Mets are conducted an extensive search process that included National and international candidates. The CTO search committee is comprised of business labor and nonprofit Leaders with an experience and technology and technical engineering operations the search for a new CT laws include extensive internal Outreach to various city of Seattle groups, including our it Department race and social justice change team and City employee city employees union at first was committee on February 5th at 9:30. And I was the first initial discussion and again in March 7th or 2nd discussion, and we had many members of the table and it was voted out with full passage from the at a special governance equity and Technology committee. I won't go into detail into how he gave such an elaborate of description on the questions. We posed to him but I just said a couple things that he very I thought smartly assess nine areas for improvement and not only address the areas that we thought there were some urgent opportunities but actual strategy on how we will Implement those and so I say to my college it is absolutely my pleasure to introduce side Bashir too many of you as potentially are new CTO for the shell information technology department any questions or any comments before we take vote, Okay. Those in favor of confirming the appointment, please. Vote. Aye aye those opposed vote. No the motion carries appointment is confirmed and Miss Rochelle that we can find. It's been a real I'd love to hear from you. And I do want to thank many members previous people in the position and the leadership team for stepping out during a period of transition. They just did outstanding work before this appointment. I wanted to acknowledge if I can work that how many people have done to get us here. So, I'm sure the floor is yours took on this job in acting capacity and my natural tendency is to have to get to work and do what the job requires of me about this confirmation process also actually gave me a bit of a pause to reflect on the several hundred conversations. I've had with people in it as well as with client departments and have uncovered a strong desire from people who won to reimagine Xavier unlike the operations of your delivering Services Xavier interacting with our client apartments and more importantly Xavier interacting with an IT amongst ourselves. My federal department heads and their leadership teams. I've met with many of them have made it absolutely clear that they are going to do whatever possible to make sure that I T continues to be a performing in a much more higher-performing team. So I really am encouraged with those that with those comments from them and just want to say thank you to the city council for your vote and Trust. I deeply appreciate mayor Durkins confidence and giving me this opportunity, and I look forward to working with you, which I think is going to be a bit of an adventure for the next few years. Thank you. Thank you, Miss Fisher. Please call the next item to record. Appointment 1265 appointment of Richard F shordt as member Seattle ethics and elections commission for charm December 31st, 2021. Thank you, sir. May I see the full Council to confirm appointment 01265 which is confirming an appointment to the ethics and elections commission. Mr. Richard short and he's been approved by the committee on March 7th. He came to the Meridian gave a very impressive interview as you know from his resume and the public file in your file. He serves as senior corporate Counsel on T-Mobile's compliance and ethics team has a strong background in compliance. His responsibilities are especially relevant to the seecs commission's administration enforcement of the ethics elections logging and whistleblower codes a pride of moving to Seattle. Mr. Short spent nearly a decade in Washington DC working on Capitol Hill as a legislative director for the United States Representative Marcy kaptur. He was responsible for ensuring staff compliance with the houses code of official conduct and he and extensive interactions with registered lobbyists and activist and coordinated with the house ethics. And office of congressional ethics to maintain familiarity with application ethics guidelines were developed a sophisticated practice representing clients in connection with both civil and criminal litigation here in a Bachelor of Arts in political science from the University of Toledo and a Juris doctor from the George Washington University law school in Washington DC. And without I'm very pleased to request of the full Council confirm is too short to the Shell ethics and elections commission didn't comments or questions before we take this point. Okay those in favor of confirming the appointment, please vote aye aye those opposed vote. No the motion carries and the appointment is confirmed congratulation. Mr. Short. Please read the next agenda item select committee on Citywide mandatory housing affordability and item three cancel one 19443 willing to lend you some Indian style comprehensive plan to incorporate changes way to mandatory housing affordability as proposed as part of the 2018 comprehensive plan annual amendment process is amended. Okay, council member Johnson, and I know we have some amendments that you will make so would surely let you walk us through it. But Katherine Johnson, you have the floor. Thank you cancel presidents we have four items related to the Citywide image today in sequence. We're going to start with the First Council bowitch immense the comprehensive plan will move to the second Council go with a men's the Seattle Municipal codes Implement. Citywide image. Third will have an solo bill that implements Maj on a TOD side in Northgate and finally a resolution which is a companion resolution, which is consistent with what we've done in all of our mha zoning changes under our individual amendments are several of those who all dress those as we get up to it, but I wanted to start if if you'll indulge me council president by just reflecting a little bit for plus your process that has gotten us to this point and then after those prepared remarks walk people through some of those individual and then please Personal issue I think probably wanted Seattle not issue has changed. We all have stories to dramatize. How are cities changed over the last decade being something is where it is now struggling to make rent in Seattle's brutal expensive housing market to something is wistful as missing a favorite neighborhood Hans because it's closed down for my part. I miss Daily's and East Lake with its great shakes and lucky charm but Eastlake is a great example of how organisms can work its neighborhood without single-family zoning, but with a lot of character, it's the place where I met and married the girl who lived across the hall from me and our little 5 unit apartment building and it's where we had our Twins and what would still be today if we hadn't realized that after doing the math we were going to be paying more in rent then we would have if we bought that little house in Ravenna. It's about time adoption for many seattleites. Now a majority of whom are renters ultimately too many of our stories are about struggling and struggling to make the cost of living struggling with traffic congestion struggling to make rent or struggling to find affordable housing to begin with like many of my little 5th generation cousins who struggled to afford to live in the neighborhood, I grew up in the source of that change is no mystery Seattle's going at a phenomenal rate consider that the beginning of this decade Seattle was 25th largest city in the United States, but by the end of this decade while past Washington, DC Boston and other East Coast cities climate 18th biggest in the United States during this decade in raw numbers, we've grown from 608000 to more than seven hundred and thirty thousand people. I knew 20% jump and whether you're maneuvering your card in the grocery store, or waiting to board a 36 to go to work whether you're stuck in line at a pharmacy or 2Pac restaurant before a show on a Saturday night. It's impossible not to notice you Does weed from a mid-sized City to a major Metropolitan Metro Metropolis? Unfortunately, the rules we have in place now, I'm not kept up with that pace of growth and in fact the status quo policy which bars us from building townhouses and low-rise condos in West Seattle has undermined which should be a real Boon to us has the city economic success and population growth, but we're too many of us has turned us into a source of disenchantment, but it's time for a city government to step in and change that status quo. I'm proud to say my colleagues have risen to the occasion. My colleagues council members mascara and Juarez have been rightfully getting credit for their work. Highlight organism as a critical social justice issue. My district to colleagues have worked hard to build winning coalitions neighborhood by neighborhood block by block simplement image and their districts and three different mayors work to get us to this point starting with memories 2015 proposal to Mia Burgess who sent the NHL Mha Bill to Council on 2017 Camaro dark and who is helped us get the bill here to the Finish Line countless City staff from o p c d d o n o h s TCI the Planning Commission to La Dept the mayor's office put in long hours to make this moment possible. And I'd like to thank some of those folks this afternoon directors Kathy Nyland died in Sycamore St. Walker Andres Mencia and Nathan Torkelson. Thank you for your leadership staff members including Sarah. Maxanna, Jeff wentland Robert feldstein Michelle Chen Nick Welch Jessica brand Suzy Phillips, Lori. Huiett Walker Jason Kelly. GM Petro Lindsay Masters, Mike badowski, David Clark, Jeff Weber, Leslie Price, Emily Alvarado and many others who have five left off. Thank you for your long nights and many tears that we've all said around image and I want to thank John Howell who facilitated the Committee in the council's community design workshops for your leadership John and I want to thank the thousands of neighbors who participated in our community engagement events. We relied on the help of our clerks office and our Council Communications team are essential staff land-use team has been critical in the last few years and I want to thank Ali penuche keto Freeman list Woodson Yolanda home and Eric McConaughy for their good work. I'm also want to thank my team he's worked on this legislation since the whole recommendations were released on the same day. The ballots were mailed out in 2015. Amy Gore Noah on Spencer Williams. Jerry Morris Patty Camacho Maya, Alicia couldn't have done this without you guys, and I'm so grateful. I want to say a quick thank you to Katie and our girls who spent a lot of nights on the Rhone because of the number of public hearings that we took together. And finally I want to send extra thanks to my vice-chair councilmember Gonzalez. You've been at Champion confidence and passionate advocate for the program and Loretta if if I'm allowed to do so, I like to bestow upon you an honorary master's degree in land use planning for all of your meticulous work over the last three and a half years. I'm really passionate about zoning. It seems like a trivial thing that makes for boring meetings in migraines, but however, I think my colleagues have realized that within the finicky zoning formulas for low-rise 1 low rise to in residential small light housing. There's a formula for equity and today we passed that formula formula that provides for growth and affordable housing it. Does this by creating more app. Chains for multifamily stock what's high in that new development to an affordable housing fund and the mandatory housing affordability program will create 6000 units of affordable housing in the next decade that girls should be synonymous with creating a sense of place a place for everyone to live and that place should be building more housing housing for single moms, like Jessica a service worker who moved back to your to pursue her sociology degree when she found affordable housing in the Tod project on the light rail line housing for graduate students like Marlon who couldn't afford Seattle. A subsidized apartment in a new affordable housing building in the Central District housing for young parents like Laura and Matt who live in an affordable housing townhome on First Hill with that three kids housing for social workers like Natasha Hunt Lee who lives in bellwethers housing on Stone way, and she said she wouldn't be able to attend good public schools in Wallingford if it wasn't for that affordable housing. Inshort we're embracing growth by embracing inclusion. And today we're embracing inclusion by updating plans that were drafted 25 years ago largely by single-family neighborhoods. And we're acknowledging what we've learned in those last 25 years or more. So even in the last 5 years that effectively planning for growth means sharing space to make room for everyone who wants to find their place in Seattle. So for a while we were able to get by without original approach one that may be didn't fully Embrace Equity because Seattle was going on the incrementally and many of us did notice something unfair was happening but while can count is grown by 13% in the last eight years Seattle's gone by 20% while our fastest growing cities such as Redmond and Bellevue have added about two thousand people in the last year. We found it nearly 17,000 people. So we've had to jump into action and to create a proactive housing policy. We had to get proactive about engaging the community and to create that policy. We are doing Gage Moore, Seattle. So we did that biotin more than 200 meetings on Maj when it was first proposed since 2015. We've knocked out more than 10,000 doors the city council itself assistant more than 40 public meetings including Community design workshops open houses and public hearings. We drafted and considered more than 80 amendments to create more child care space in new buildings more affordable small business spaces to protect trees and historic buildings to incentivize more affordable homeownership opportunities and allowed for taller buildings to be built in their frequent Transit service without Amanda to without mandating unnecessary and unaffordable parking requirements to my deep satisfaction that Outreach has been accompanied by something policymakers in the city haven't seen in the past and that's a surge of pro housing activism from diverse Coalition of stakeholders more representative of the Cities housing Deeds. This Coalition reflected what Solutions can look like when we all work together. We regularly had the MLK Jr. County labor Council show up to support building more housing for their union members the Chamber of Commerce often stood by their side. Groups like the Sierra Club in 350 Seattle recognized. This is an environmental issue enjoying the cause for additional housing Advocates like HDC feature-wise in the Seattle Transit blog will join my new groups. Like welcome in Wallingford Seattle for everyone Seattle Greenways Seattle tech for housing share the city's the Miller Park neighbors that Capitol Hill rent is initiative an herbalist and they all helped us frame this policy with one guiding question. Who is this city for our new mandatory housing affordability policy answer that question by saying the city is for people like Jessica and Marlon and Laura. I met a Natasha and without I'm proud to introduce this legislation Council. So I would like to move we've got one technical Amendment which would require adoption of an amendments to attachment one. It would reflect changes to the urban center in Urban Village batteries that were adopted by the select committee on February 25th. And 9th amendment is shown in attachment a of the central staff memo. So with your permission cancel present, I move to amend Council Bill one 19443 attachment 1 by submitting version 2 4 version 1.06 on the amendment only all those in favor of the minute, please go die. I opposed the eyes have it. It is amended. Did any other cast members want to speak on item three we have several companion items to follow but I wear on item three as a minute right now. Pretty good on this one pretty good week passes from first, okay. Please call the roll on the passage of the amended Bill O'Brien Salon president supposed item number for the short title cancel one of my mind for 4 for relating to mandatory housing affordability resign certain Landon modify and development standards throughout the city and implementing. Mha requirements modifying existing development strategies to improve livability. The committee recommends to go passes amended where that there. I believe there's four minutes and so I'll just try to let you lead us through the amendment process. You have it right now with Sprite regarding the base legislation. Thank you notes president. So this is the man Citywide mha legislation the previous Bill adopted the comprehensive plan changes to incorporate changes related to mha this is Attention bell of the Citywide zoning changes in the 27 neighborhoods. There are three amendments proposed. I believe Amendment 1 is a substitute version of the bill that reflects Technical and clarifying amendments to maintain consistency with other parts of the legislation including fixing typos and drafting errors to ensure the code language is consistent with the council and sent it retains some provisions of the code related to incentive zoning and adds language clarifying that the requirement to dedicate 5% of mha payments to homeownership projects can be dedicated over multiple years. So in order to affect those changes, I would move to a man Council Bell 11944 for by substituting version d-94 version 8 a and bicep student version 44 version 3 of attachment one about substituting version for 4 version 3 of attachment to as presented on the agenda. Okay, I want to follow that got to know where is could you repeat that, please? Okay. This is just for the changes described a council member Johnson all those in favor of the amendment, please. What I I oppose Nae. Okay. We have an amended the First Amendment and attachment to to remove areas that were studying the University District. He is from the Citywide. Mha bill it would also remove requirement for upper-level setbacks along the ad giving the no zoning changes on the I will be part of the legislation those reasons in the U District are going to be considered as part of a separate countable that was introduced in today's introduction Pro calendar. So I would move to a man Council bill 11944 for by amending section 55 deleting 23. 47 a 00 9.3 and by adding a new map a H2 attachment to as presented on the agenda. Remove the second amendment number 2 has been noticing any further comments all those in favour amendment number to say. I met this amendment number to his past Alexa turn it over to R.Kelly councilmember O'Brien for an amendment related to the Phinney Ridge Greenwood neighborhood, right? Thank U health member Johnson. This is references of amendment 5 ammo move it and then I'll speak to it. I move to amend Council bill 11944 for attachment to buy substituting version 5 4 version 4 of the reference map and by adding a new map AI that excludes a site located at 7009 Greenwood from the rezone as presented on the distributed Amendment 5 Second moved and seconded to pass an amendment number 5 cast member and you like to explain a little more. Thank you this refers to a project to this going to a contract read. Process call exam every call last year. We proved that contact rezone as part of a quasi-judicial process. Most of the country's owns. I believe that are currently underway have been excluded from the mha bill to allow them to be the additional height and the affordable housing requirement to be required as part of those negotiated deals. This this particular parcel was was actually left out of that pattern. So this would put that back in here. The the project is still quasi-judicial. It has our decision last last year has been it was appealed to the superior court and that has since been remanded to us just last week so we will be I'm likely taking something out in the next few weeks. I'm by excluding it from mha with that allows us to continue to do is to Address the affordability height changes along with other design standards that we previously had addressed in the property used in development agreement and I my recommendation would be to continue down that path since that path is what we've been exploring to date and I think makes the most sense for this particular process partial very good. Thank you for all those in favor of amendment number 5 vote. I was opposed both know the eyes have it. Consumer Johnson you have any other amendments just one more this amendment Amendment 4 without a finding of fact that you would recite the background of legislative history related to Emma. Jay's implementation describe the planning a context for the rezone and implementation of mha and the reason area and address the relationship of the ordinance to RCW 36.75. 400 Amendment 4 as shown in attachment of the central staff memo. And this would again just add some findings of fact, so I would move to amend countable 11944 for by adding a new section 124 which adds a new attachment 3 finding is a fact as presented on the agenda has been moved and seconded amendment number four has been moved and seconded to describe a counselor and just any for the comments. All those in favor of amendment number for say I know the motion carries and that amendment is approved cancel present. I would defer to others that might want to make closing remarks and ask for the privilege to close out those closing remarks before we take final action on this bill. Absolutely. So we have an amended Council one 19444 and with any customers like to speak on the the overall amended legislation Al hell out with you this would be the time so remember O'Brien, please leave this and your dedication to this quite thorough process over the past few years and I appreciate the remarks she made and so many people vote City staff and citizens members of the community living work here have worked hard on this there's a lot of work in compromise is done. I wanted to speak to to my involvement of this around affordable housing which goes back even a few years prior to that. I'm in the spring of 2013. The city was considering up zones to South Lake Union. And as part of that process we had previously received a report from a consultant who did some analysis on the incentive zoning process at the time and I Report pointed out that we could charge higher fees for incentive zoning at the time without impacting the amount of housing that was being built or other construction. It was happening as a result of that process. There's a lot of deliberation on the floor at this time. I'm ultimately resulting in my recollection was a 5-4 vote to increase the incentive zoning and the amount the amount of the additional housing we required was limited by the analysis we've done in the ability to get to five votes on that but simultaneously the council passed a resolution resolution 31444 in May of 2013 that passed unanimously and it should work program for us to upgrade update our City's affordable housing incentive program. From that we went and hired Consultants three different sets of Consultants who worked through to 2014 ultimately releasing reports that talked about a linkage fee program and in October of 2014 the council passed resolutions 31551 indicating their intent to pass a linkage P program HUD program outline different tiers similar to the legislation. We see today high low and medium tears and different levels of requirements for affordable housing at that point soon to be new mayor mayor Murray, I guess he was a new man at that point form his own group to come up with a counter proposal and I tell you that personally I was committed to the linkage fee program because it produce significant number housings and seeing if an affordable affordability levels and in the back and forth I said I was continue to be open to new proposals if they produce more affordable housing at 3 / 4 Jodee levels in the agreement that memory brought forward back in the summer of 2015 was the program that we are looking at today. Now that program the commitment was to pass that 18 months ago that has been delayed significantly for a variety of reasons, but I'm really thrilled that we have a comprehensive program today that I get a support colleagues current and past it's been a pleasure working on this with all of you. I'm really proud of the piece of legislation we have today and again councilmember Johnson. I want to just reiterate the amount of work you've done in the past few years to get us where we are today. It's no small feat you were not in the counsel of when I member of memory said we will do this in a work where I was going and every single neighborhood. I said, I do not know how that will happen in that time frame and frankly councilmember Johnson. We wouldn't be here without your leadership to get his hearing. Thank you. Thank you. Okay council member Beck show. Thank you. I'm a number of people have already been recognized by my colleagues. But I also want to say that there people that are hiding in the back feldstein you got started. Thank you. Steve Walker. I think you were there as well. And I appreciate that. There's so many Emily Alvarado you're back there as well. This has been a long journey as councilman. Bro. Brian said we got started on this really very much in the beginning of our terms at the beginning of 2010 people were talking about this there were some fisticuffs at that point and we really made a lot of progress here. We all know why we're doing this. We're trying to link getting more affordable housing to keep up with the growth. We had thousands and thousands of new jobs in our area, which is great. We need thousands and thousands. In fact, I'll be talkin about the number I think is 244000 across our region is what we're going to need your going for. I regard this is a very important drop in the bucket. Frankly. We've done some great things but there's something about this process that's made me grumpy and I'm going to tell you about that just a moment. But again, I want to acknowledge council member Johnson. Thank you. And your staff Amy. Who's there Noah Jerry in our Council Central staff. Thanks to Allie penuche Freeman and lash Whitson, Eric McConaughey and Yolanda go. Thank you all because you made a huge difference now, here's where I am yesterday in Seattle Times council member Johnson Road a pro article. I thought was great explained why we're doing what we were doing in the number of times that we have been meeting. You've already heard a lot of that. I don't need to repeat it all but here's what's makes me grumpy. There have been so many things that have been said on the con side of this that I just think have In our way and repeating gun proves over and over again simply doesn't make something so empty at beginning of yesterday's it's at Seattle Times con article and said railroading neighborhoods is not the way the dictionary definition of railroad and we all know what it is. It's to force somebody to do something or divorce and action especially quickly. I don't think four and a half years worth of meetings and 200 and Community engagement meetings and 20 meetings of the select committee. And anyway qualifies. We also have reached a point where there's things have gotten conflated and I I want to acknowledge something that I think is really important. I personally up supported up zoning and there are downtown my neighborhood years ago. I feel that across our city and certainly cross our region we have now. We really need to be making space for our kids and grandkids. My kids want to come here and it is a struggle with a college education to be able to afford something and it's so difficult if you are behind the 8-ball in anyway, so I want to say thank you to all of you who have shown up over and over again and block by block with the Ada amendments. But there was a statement in yesterday's paper. This is this will eliminate all single-family zoning. Nothing. Nothing could be further from the truth. We are going to be retaining 94% of single-family zones that's remaining short of 6% of single-family sounds is going to be changed to rmha but that's existing and proposed Urban Villages and thousands of units are going to be added for rent restricted units across our city over the next decade. We have heard complaints pro and con about the in Luffy's people said you don't do enough people say you do too much. But what we know is that thousands of units are going to be added the in Goofy allows us to leverage the money that the city puts in three really great examples and I want to say I think Daniel Beekman is here. You've done some great reporting on this and three items that you brought up. Where are three projects Liberty Bank building. We're leveraging almost three-to-one that hirabayashi building in the International District almost 521 we're leveraging and they are Bora Court in the U District almost 621. This is going to make a huge number of difference another argument that was brought up in the con side of the article yesterday is that we are eliminating single-family housing regulations. And we're going to have Adu legislation today that is going to destroy all this. The ATU legislation isn't even part of this today. The hearings are going to start next week. The changes are voluntary. It's going to allow people to make right size choices for their families in the property that they have owned in some cases for decades. Also, there was some I think Miss statements about the Planning Commission not liking these a to use what we hear is that the Planning Commission all along has been consistently and favor both what the mha is doing today and the prospect of ATU legislation which isn't part of today. So please let's try to get this straight and lastly and I want to stay as one of the people that was charged with being a lame duck politician yesterday. I am anything but a lame duck and my colleagues over here who are also been working so hard you will see us working through the end of this year. We've been working on this for five years to vote today and I am actually pleased as could be with the amount of work that has gone into this and the hard work that you have demonstrated want to say council member Johnson say say, thank you to Katie for me and the girls the number of nights that you have not been home. But working on this we are working hard we are dedicated to making City that's wonderful the city as we possibly can for everybody that is here. People are coming irrespective if income so to my colleagues and all of you who've been part of this many. Thanks. Mosquito thank you very much. Mr. President for those words. I think this is such an exciting day today possible. So thank you because the people to vote for more inclusive Seattle. Thank you for helping to respond to Seattle's of growing population and the housing crisis. We know that change is inevitable but change and development is happening right now and it's happening over the last few years because we haven't been able to include mha it has not been the change that many of our community members have one in in fact much of what we have heard in terms of concerns about mha haven't had anything to do with mha at all such as child care in building such as healthcare clinics in new building such as such as the ability to make sure that we have more pedestrians owns. These are You have wanted to do mr. Chair Johnson for a very long time and have been stymied. And today we're able to take the steps to make sure that development is done right that mha ensures that we do it more inclusive it because not just affordable housing and income restricted housing, but creating more homes overall and it includes the vision that you all have put forward after years of making sure that it's not just homes that we are building but we're creating truly inclusive units or buildings Transportation Center child care centers open spaces grocery stores. We need to thrive in our city not just survive and happy home to go from place of work to home. We want communities that will be thriving centers and through mha we have begun to build a building blocks of what a truly inclusive Seattle and neighborhoods look like It's helped make sure that as we're developing we're meeting the needs and the values of our community. I was really excited to work with council member Lorena Gonzalez as we worked on creating inclusive space for childcare facilities. This is the number one thing we hear of not just from families who need childcare minutes to hours to get to their home and their kiddos place of child care when we ought to be able to create affordable housing in the city that includes childcare. This is why I'm really excited to pedestrian environment so that people can really commute on foot or by bike or buy scooter or by bus and have the opportunity to have a healthy environment because we've included additional commercial space on the ground floor is included setbacks have seating areas outside small business owners. Businesses in right now, they're getting the size of a unit. That's good for the next one. We really need the size for the next TC tacos. Like my family started 60 years ago in a small hole in the wall commercial spaces that are affordable so that people can truly get out of generational poverty. We know that this is not about buildings today. We're making a vote about people we're taking a step to make sure that we can actually live our values and councilmember Johnson. I want to say thank you again so much for your help to Champion this through here. I've only had the chance to work with you on this specifically sitting on Council for the last year-and-a-half, but I know many of an audience of had the chance to work with you over the last few years. I want to thank your staff as well for their intense work on this you already mentioned this Dental staff want to take my staff Erin hallas appropriately in the back for fighting for additional affordable housing and my former staffers as well. This is really an incredible process of intense policy development extensive Community engagement the most extensive he is Alice has ever conducted on Seattle land-use policy in our history a legal battle that lasted an entire year and even though we struggle through some of the amends and I didn't end up supporting some of those what you have today is a comprehensive package that includes the vision directly from the community involved and what's happened in the mean time since we've waited for for 5 years now to actually pass this legislation. We seen that people have been displaced people have been pushed into the streets are community members have had to leave the city because there's not enough affordable housing we have seen because of the delay up for pressure on the cost of housing because we have failed to be able to create an affordable housing. We haven't rezone to create the density that we need to not only respond to those who are coming but affordable housing for those who are here. I talked to the firefighters the other day that said, you know, I do want to make sure that we welcome new folks that are coming but I'm concerned about the folks. We're here. We're not building enough affordable housing like House member bagshawe said That our kiddos can afford to stay or that we can take care of our elders in place in the city the consequences band that there's been a dramatic increase in the cost of rent and we know that $100 increase in the cost of rent sequel to 15% increase in homelessness. In fact, the Chamber of Commerce. Thank you for testifying today. Your own report said that there was a 96% correlation between the cost of housing and homelessness. This is part of our response to the crisis that we see every single day. And for the folks were asking what we are doing and how we are trying to respond to the crisis of Housing and homelessness. This is one Element, but we've been delayed for years. And today we finally get to move forward. Obviously, we need additional Housing Shelter and health, but this is one component. So we're going to continue to work collaboratively aggressively collaboratively with our friends at the state and the regional level to make sure that we're building affordable housing that we get additional funding in place to create that housing. Zoning changes that we need also at the state level to match we haven't been able to do at the city level. I applied Representatives. It's given a center of Columbo represent represent to Macri's were really working hard to try to lift that floor at the state level and I'm sad that we're not actually having a conversation about Citywide changes. I think that is the next conversation to have I think some of those amendments that we were talking about wouldn't have been so challenging for me if we were talking about larger changes that really create a more inclusive Seattle. We're getting this is just an effort to look at 6% of the single-family zoning in our in our city and I want to pass out again for the viewing public and for our colleagues here. So this is an effort to truly right the wrongs in our city. Will we have over the last few decades is we have Zonar city backwards. We've actually expanded the amount of land. That we have included in the city for single-family use now. We have two thirds of a residential area throughout the city of Seattle that is included exclusively for detached single-family homes, basically blocking or prohibiting the type of apartment that I currently live in a 1902 beautiful brick building as you've talked about before only we are prohibited from building that kind of gentle in cell density because we have actually scaled back. So as we talked about before we're trying to actually look at the fabric of our city look at the history of how we created and inclusive City in the past and try to right some wrongs in the 1920s as the housing Commissioners Seattle Planning Commission report said some residential areas began establishing racially discriminatory covenants to prevent people of color and other ethnic and religious groups from buying houses in 1920s. Potential District allows detach single household structures that allows apartment types of historic wrongs that were trying to correct today. Their report goes on to say is the most popularity an existing zoning is resulting in the construction of large expensive homes at a time when more people need more affordable places to live they say this is not just an issue of addressing the legacy of discriminatory housing and land-use practices. It is about building an equitable Seattle for the present and future Generations talked about before this is our effort to try to write some of those historic wrongs. But again, it's just the beginning of that effort. We're going to continue to work and my committee and I believe in Greater inclusive opportunities homeownership opportunities with who just amended today. So that more folks can actually have the chance to live in the city to thrive and not just survive. Thank you so much for all your work on this. Thank you for those words. Stuff together here. So I went to just underscore a little bit of what we heard in public, today the history of this legislation dates back further than it's been 6 years further than 2013. It actually dates back to 2007 when the city started passing an incentive zoning programs throughout the city and many people at that time when we were doing incentive zoning. That's when not when you provide the up zones and then require the the housing affordability requirement. It's when the additional zoning capacity is available and exchange the developer invest in affordable housing even at that time in 2007 many of the people in this room today, including the Housing Development Consortium in Puget Sound Sage. We're advocating for a mandatory program so that we could capture An increment of the value of additional zoning and devoted to housing that call from community members and former council members then helped pave the way for where we are today. I'm going to share some of my concerns but it doesn't it shouldn't be interpreted as lack of support for inclusionary zoning. My concerns are based on what's happening in high-cost cities across the country including cities that have inclusionary zoning. We all see the same problem the lack of affordable housing but we have disagreement on the impacts of our approach to deal with that lack of affordable housing. I don't believe it's just fear of change. I believe it's legitimate concern that this bill won't raise his enough affordable housing and too much will be torn down to make way for new buildings that are actually out of range of most renters to afford an average 2-bedroom apartment. Seattle to workers need to earn $20 an hour or one owner $40 an hour a recent study cited in the Seattle Times reports that 85% of new housing built in this region is luxury housing with this legislation. Today. We're going to we're going to shift that a little bit we're going to it's not I probably won't be 85% but it's still a lot of housing being built for folks who can't afford to pay the rent we talk so much about making it possible for people to live where they work. But are we making sure that low-income people will also be able to live where they work. We refer everyday to the thousand people a week that moves between turn but as counselor musk a dimension. We don't talk enough about the people who have been pushed out of Seattle count them. I wish. I wish the affordable housing contribution was more five to 11% of the units as well as the payment in Luffy's does seem low when compared to other cities, but to my knowledge no other City ensures inclusionary zoning it all residential and Commercial development. So I'm hoping that the comprehensive nature of our bill can counterbalance that the developer obligation / project seems rather low. We've also heard concern about the division between performance and pay in lieu. As you know, we've set the goal for the Split between number of developers who pay in lieu in the number of developers who performed as a as a goal with 50 50% split. I think we've included in this ledge. I know that we've included in this legislation and amendments that requires us to monitor that and to make adjustments if we're not hitting that goal and then finally as folks have testified today will be continuing deliberations around a bill that would help address and help protect existing housing that might otherwise be redeveloped and I would really urge the folks up here with me today as well as members in the public to take a look at what's happened in California in the state legislature over the last year or so last year Senator weiner had a bill called Senate Bill 80 to 7. And this is a bill that Statewide would require. All municipalities to do high-density development in certain areas areas like Transit areas and within certain watersheds that bill did not get the support it needed last year because of the concerns of what I refer to as you know people who think of themselves as Urban as by think of them as social justice Urban if they are people who are really concerned about just opening the floodgates to development without having measures in place to protect existing housing tenants organization the local Sierra Club local Mayors. We're all really concerned about the impact of this Phil. So there's been a new-build has been brought forward this year. It's called Senate bill 50 and it's got in trying in the bill itself a Prohibition against using this new Authority in areas where there is any Housing Development? It doesn't A distinction for affordable housing development and it actually requires a look back for 7 years. So if there has been housing in that location for 7 years and that's that's a that's one way to make sure that landlords don't use other unfair ways of moving people out of out of buildings in order to redevelop them and as a result transporting it and so I really think it's really critical that we look at what other cities and states are doing to address this problem because you know again simply Building more housing and earmarking a small amount of it to affordable housing is not sufficient to address the growing need in cities that have extremely high cost of housing. So I look forward to working with my colleagues more on that in the upcoming weeks. pets River So what you like to speak? Shanahan's going to thank you present Harold. I think they're tremendous amount of work that was done by city council Central staff on this on the whole body of work that is represented by the night manager be housing affordability legislations. I grew up in Mumbai where my family lived in a 450 sq ft flat which was the only affordable housing for available for working people like my parents. I think density is a good thing for cities and Metropolitan regions both for affordability and for sustainable eating that is why I am glad to be voting in favor of this legislation. But it is also my duty to point out that the affordability that will be generated through. This has been described in inaccurately grandiose and greatly exaggerated terms by many of the elected officials. What will be implemented is small affordable housing mandates on the big real estate speculators and developers who have given our friends and other housing cost and were directly responsible for displacing and erecting tent or thousands. Or maybe if you add up hundreds of thousands of our neighbors the affordable housing requirements in this legislation are totally insufficient to even prevent Seattle's hemorrhaging of affordable housing nevermind actually bringing Ranch down. However, it is better than nothing and I support every single affordable home. We can win as I've always said it is important to remember where mha comes from and not the Chamber of commerce's version. But working people's version of where mha came from in 2014 after a Grassroots movement won the $15 an hour minimum wage. It became clear that the next big struggle would be and would have to be over the accelerating loss of affordable housing in Seattle, which the laws have started ballooning in 2010, even though it happened long retarded happening long before them. The salty affordable housing prices are movement knew that we would have to fight and we still do have to fight for a major investment in social housing which is publicly owned affordable housing paid for by taxing big business and also for Citywide rent control to undercut that movement that I just begun Seattle's biggest carbon developers and former mayor Ed Murray of the democratic establishment launch the so-called housing affordability and livability agenda comedy, otherwise known as the Halla comedy or some affordable housing Advocates, but also big developers and in the end as these things go when you bring corporations to the so-called table, the corporations will be given a virtual bicho on the recommendations of the committee at that time the city council resolution as councilman Brian mentioned. Linkage fees, which is basically a type of impact fee that would have required all developers in the city to pay towards affordable housing. The big developers on the Halle comedy video. Baby doll rent control, they vetoed any taxes on big business to fund social housing. Mha came out of the hollow, because that was the only thing that big developers were willing to accept and the reason is simple reason that they were willing to accept it is because it is so limited. So I'm very limited in what it accomplishes for affordable housing and it has zero impact on that ever expanding opportunities for profit a man as a legal mechanism is extremely limited especially in how it is done in Seattle on how much affordable housing it can generate but the fact that when Halla was before word, they were successful and disorienting the movement for rent control by getting affordable housing ad. Well-meaning affordable housing Advocates on both sides to fight each other over whether the zoning changes will result in more or fewer affordable units. Some excellent affordable housing Advocates of subsumed Adam and into the support for the energy absorbed into Seattle's population growth and suggesting that the market will bring rent back down one developer has are encouraged to build in of zoning zero zero evidence from anywhere anywhere in the country anywhere in the world that that would prove the hypothesis that you left for the for-profit market expand construction. And at some point in the future events will come down. There is no such case if you can see if you can find that can show it to me and I'm happy. I'm happy to correct my position, but my position is based on hard evidence that there is nothing no. No hypothesis of no such a hypothesis has been proven Branch.. Don't go down because for-profit development continues. There's no such case in the past and I doubt that they will be in the future as a matter of fact. At the same time, you know just to give you a snapshot since 2010 construction has bloomed in the city at the same time rents have skyrocketed by 69% Housing is not become more affordable affordable affordable and at that same time the same time that people are being evicted from the city in Italy economic well-being double-digit vacancy rate in many neighborhoods. Why is that apartment? And why aren't people moving into them? That's because they can't afford so let's not let's not buy into fake and mythical supply-side arguments by neoliberal Economist because there is no evidence to support that they that that idea it is true. Undoubtedly that we need more housing. Absolutely. There's no question about that. But what we need is affordable housing and a for-profit market under capitalism is not interested in producing that so it is no not that there's no point in holding our breath to that someday. The for-profit market will make housing affordable as a matter of fact Mike Rosenblum of the Seattle Times has already said and I'm quoting him because I want to go to a non socialist who said that it is it is it is it is, you know, it's imaginary thanking me thanking to think that rents will come back down because that doesn't ever happen. What is happening is real estate secular speculators getting a better return on their investment building luxury unit and buy luxury. I mean not necessarily high-quality. I mean they may or may not be what I mean is expensive unit out of the reach of ordinary working people Seattle has been the construction crane capital of the world and all that. And during that time Ranch have gone down. And the mha payments that this legislation will require of developers will be available to build publicly affordable housing. Yes or summer publicly affordable housing will be will be the result of this mha but nowhere at the scale sufficient to address a massive need and not to mention that there is no accounting though. There's no statistical accounting of Market available affordable homes that are going to be lost in the same process. And Anna getting to be precise Market available affordable housing is going to be lost. Mha or not. I'm a j because of the for-profit market is not because or despite images because of the for-profit market and to the extended mha is tied to the for-profit market. It has the same limitations and failures the regional affordable housing task force recommendations at this meeting show that 156000 and 4 doubled homes are needed to meet the city of Meet the need countywide. And the need is 244,000 affordable homes by 2040. This is an official a study by King County the couple hundred each year goes by Seattle would literally never solve the problem. The problem will keep increasing in size working people will keep getting this place in Seattle will continue to be a place where only rich people can live and that is why we need massive policy and board board policy that fights like rent control and taxing big business to have a massive expansion of social housing, which is publicly owned permanently affordable housing so that people Working Families no longer have to remain at the whim of for-profit Developers. And so I think that you know, when you look at every piece of evidence shows that America is not far from the solution that we need. I will be supporting it because I support density. But I want to be very clear our real fight for our movement. If you are interested in fighting for affordable housing for yourselves and your neighbors and other working people than we need. We need to fight for rent control and social housing that and I just want to clarify that for-profit market development is not going to solve the affordable housing prices, but we should also I don't agree with opposing the mha episodes either because it's not you know, it's not the main problem. The main problem is the for-profit market. At least with the mha the developers will have to pay a small amount to go to affordable housing. And as I said, I want affordable affordable home we can win and that is why I have and continue to support the images of zones. But at the same time it is crucial that we now as affordable housing Advocate. We avoid falling into the corporate rat trap of thinking that this has any kind of fundamental solution to the massive affordable housing prices in Seattle focus on energy has been used to describe the most impactful demands of the affordable housing movement. As I said, particularly social housing by taxing big business like Amazon and rent control and I can guarantee you big business is not going to support either of those dramatic and you know, what that's a rule of thumb is big business is not supported. You're probably on the right track to do something good for ordinary working people. So I am glad to be boarding yet. Yes on this legislation. I vote Yes, because it will you know, it is pro density night and I favor density. For working people. I've already asked because it would help raise some funds for affordable housing, but I am also glad but this world that I have and I hope that now affordable housing Advocates can focus on the real fight with his for rent control and for taxing big business for massively expanding Social House. Councilmember consalus housing affordability legislation over the last four and a half years. I really appreciate all of the work that our staff across the city family has contributed to getting us to this point today. I hope that you all are proud of the work that you have done. And and I hope that you hear from us up here that we're proud of the work that you have done and it's been a lot of time away from your own families and friends to dedicate yourself to this work. So thank you so much to the entire city family for all of the work you have been putting into this and all the sacrifices you have made both in the legislative department and on the executive side to get us to this point. So as I usually do in my tradition I'd like for us to The city staff with a round of applause for getting us this far. Cancel my colleagues and members of the public today is a significant day after four long years of legislative legal and Community engagement processes. We have arrived at a place where I believe it is time for us to say yes to more density. Yes tomorrow affordable housing and yes to more neighbors and 27 additional neighborhoods throughout the city of Seattle for this mandatory Housing Authority ability legislation goes too far for others is mandatory affordable housing legislation does not go far enough. So let's chat a little bit about that Dynamic contrary to the name of the select committee on Citywide. Mha this legislation is not even close to Citywide. There are approximately 127 neighborhoods in the city of Seattle this legislation only released to 27 of those 127 neighborhoods impacting a total of only six. Percent of existing areas currently and strictly zoned as single family homes owns adjacent to existing Urban Villages. That means that even with the passage mandatory housing affordability legislation, approximately 60% of the city of Seattle is still under the cloud of exclusionary zoning laws. So let's talk a little bit of this City's history with exude exclusionary land-use and zoning laws across the country including right here in Seattle racially restrictive housing covenants became common in the 1920s those covenants were challenged in the courts and in 1926 our US Supreme Court put a stamp of approval as a stamp of approval those racially restrictive covenant layered on top of these covenants were Financial lending policies that prevented the sale of single-family homes located in a racially restricted area from being sold to a non-white person. This is how redlining came to be in Seattle and across the country according to our own city of Seattle archives a typical racially restrictive housing income Covenant as follows. No person or persons of insert your race blood lineage or extraction shall be permitted to occupy a portion of said property a domestic servant or servants who may actually and in good faith be employed by white occupants. Check your deed of trust that language is still there. The effect of these widespread racially-motivated practices is still felt in every major city across the country today in Seattle and meant African Americans Native Americans and asian-americans were prohibited from living in neighborhoods outside of southeast Seattle the central district and the International District. Meanwhile Broadmoor Greenlake Laurelhurst Magnolia and Queen Anne were historically off-limits to people of color. 22 years after the Supreme Court said yes to racially restrictive housing covenants in 1948 the Supreme Court held that these covenants were not enforceable. It was not until 1968 in additional 20 years later that the federal fair housing act of 1968 was passed and that law prohibited discrimination of sale rental and financing of dwellings and other housing related transactions based on race color or national origin religion sex close quote this law officially made the use of racially restrictive covenants in housing illegal 1968. And in 1968 the city of Seattle followed suit with a passage of the Seattle open housing ordinance after a hard-fought Grassroots civil rights movement that spanned from 1959 to 1968. Show me be clear. I'm not telling anyone a racist. However, the reality that we are living in a city that has a history of implementing and preserving housing laws design designed to keep certain people out of certain areas of the city. And as a policy maker it is my duty to understand this history and to support legislation that will begin the process of dismantling exclusionary zoning laws that are historically rooted in the intention to exclude people who look like me from owning or living in a single-family home. I acknowledge that these covenants are no longer enforceable, but the vestiges of segregated Seattle surround us. The question is what are we willing to do about it? Seattle is home to some of the richest people in the world. I don't have to name them by name you know them. But that Prosperity is not equally accessible to all Equitable access to home ownership and housing stability is not a reality for many in our city and this is in part due to increasing income in a quality. And this makes it harder for everyday people to afford to live in the city. They work in people are housing insecure or experiencing homelessness in part because we have a housing shortage crisis, especially for our residents there that are in the extremely low income category according to a national Income Housing Coalition report released just last week profiling the housing cap and Washington across the state 230 4360 to renter households are extremely low income and 71% of those renter households are severely cost-burdened across the state. There's a shortage of 160 5340. 5 affordable and available rental homes for extremely low-income renters Seattle Tacoma and Bellevue are experiencing the brunt of that shortage with an estimated shortage of 9,000 affordable and available rental homes increasing development capacity is just one policy tool available to the city council to address the housing gap for people across the income Spectrum. We must build more affordable housing and Marguerite housing to meet the demands of the people currently here. And those that are still coming here this mandatory housing legislation is one tool in our toolbox to both incentivize the construction of affordable multi-family housing or capturing precious and limited dollars to provide our nonprofit housing developer Community the tools they need to meet the demand to construct more affordable multi-family housing throughout our city and especially in neighborhood. Of high opportunity in my mind does not destroy neighborhoods. This legislation will enhance neighborhoods by create a pass for workers students and others to call our Urban Villages home. I want the thousands of Jessica's Marlins Natasha's Lawrence and mats to be able to call Seattle home for four years. We have listened to concerns regarding livability by taking into consideration issues related to bulk and scale at consistent with environmental laws. And where it makes sense bake those modifications into this proposal. So what we have before us now is a policy that not only impacts a total of 6% of single family homes owns zoning around the edges of existing Urban Villages and increases development capacity within those proposed boundary. This is good for Seattle in 2010. I rented a condo in the west Seattle Junction open Village in 2011. I bought one of the few condos on the market literally at the end of the block ride than renting for a year. It seemed like a miracle. It still seems like a miracle to me. Would it be possible for me to own a small piece of the junction and call it my own? I was thrilled been and I'm still thrilled today to be able to call Seattle and the junction my home. Every morning I catch the 55 right in front of my condo building or I can walk a block to catch the C line or the free shuttle to the water taxi. I live within two blocks of multiple grocery store Safeway QFC Trader Joe's my husband. He's a service worker. He works in a restaurant. He serves expensive food to people in our neighborhood. He makes minimum wage plus tips. He walks 3 minutes to get to work and sometimes takes his bike. We get to enjoy bike rides to Lincoln Park or down to Alki. This is the Seattle that I want to see built. It's the Seattle. I believe we can build if we do it together. It is a Seattle that I think is possible for far too few people and through this legislation. We take a step towards allowing this to be an opportunity for more people in our great City. Delay doing nothing stopping development. All of those things take us backwards not for all of those options asked us to pretend as a growth will magically stop or delay. Today, we have a chance to move finally move forward as one unified City and as a Seattle that can be for everyone who chooses to live here. So today, I look forward to voting. Yes for the mandatory housing affordability legislation, and I want to express my deep gratitude for the leadership of council member Johnson and for the sacrifices that your family has had to make in order to allow you to leave this city council and our entire city through what has been an exhaustive and intensive process to put forth in front of us as your colleagues and opportunity to correct some of those historic wrongs in to make space for new neighbors in new families. So thank you so much can swim Johnson. Thank you Katherine Gonzalez. I just want to say that I will be voting. Yes today and I want to thank councilmember Johnson for all the hard work. A lot of these means have been contentious difficult emotional. We've had them all over the city and I'm glad that were coming to a close and thank you Katherine Gonzalez for reminding us of what are what what the history was of how this city was deliberately planned and I'm glad we're moving forward and Enlighten way and in a good way. I want to end this on OneNote with wisconsin-river Johnson left us with when he asks the question who is the city for this city is for all of us. Everyone of us long after I'm long gone and my kids who are 28 and 25 have children and I have grandchildren. That's what we're looking at. Today is a perfect know to have more work to do you bet we'll learn more about our neighborhoods in the density and when light rail comes in but I just began want to say thank you not only to staff but again to cancel Amber Johnson and all his hard work the times that he's been in my office the times I've been in his office the times we talked about amendments and I can just say that I'm really proud of my city today. Thank you. Where is Transformer Johnson's like to close to base. So I want to say how grateful and colleagues for those kind words. This has been a labor of love for many of us and I'm proud to have helped Shepherd this important piece of legislation across the finish line for me the idea of a simple one. We want to give everyone in Seattle access to neighborhoods with great Parks reliable Transit outstanding schools green playgrounds affordable housing quality groceries, robust infrastructure and health in sustainable environment and passing imagej Begins the job of creating that universal access for people throughout our city. Two years ago, we pass them specific images of zones. They're working their generating thousands of new units and in 2018 alone generated more than 13 million dollars for affordable housing if we've been able to implement the program a year earlier would have been generating 90 million dollars for affordable housing affordable housing that at a time when we desperately need it where Steve Walker would definitely love to be able to find more of the bellwethers and the mercies and the Capitol Hill housing in the world's who want to be building more of our affordable housing and it's all throughout the city, but now by taking the ABS on Citywide, we're starting the process of dismantling walls around our neighborhoods that have given exclusive groups. So I access to the resource-rich communities around our city and as council member Gonzalez, so eloquently remind us the hard data shows us that that privileged group has been predominantly white and the Ugly history of redlining and racial segregation shows that that exclusionary approach with some time. Intentional is out of sync with Seattle's values. And so I think this is a Citywide up zone for Citywide Equity yard signs around our town so that world welcoming City and we don't support walls. Well zoning is both a metaphorical and a literal wall around our communities. And today we begin to take those walls down. Given the broad consensus we reached on mha it's clear to me. The council's poised to create even more Citywide quality cities such as Minneapolis are already eliminating their exclusionary zoning altogether narcity needs to take a look at that policy as a council member Shepherd of this legislation across the council Finish Line. It's my sincere. Hope that today's vote is not just to embrace growth and a proactive housing policy. But a policy that's intend on doing barriers to Universal Equity policy that's in 10 on allowing more and much more housing for everybody in our city throughout this process. We've talked about allowing more housing in Seattle Transit rich neighborhoods in our asset rich neighborhoods, and then I'll resource-rich neighborhoods. But today by passing this legislation will recognize him if there's something more important than Transit rich neighborhoods in resource-rich neighborhoods. It's housing rich neighborhoods. The only way for us to credit that universal access to housing is by building a housing Rich City. Meanwhile in a wide variety of housing type stitches townhouses and mid-rise condos and low-rise buildings in can really help ensure that Seattle values like inclusion don't ever go missing. So let's simply stop talking about moving people to Transit rich or resource rich neighborhoods and talk instead about giving people housing rich neighborhoods because of housing Rich City to see that welcomes multi-family housing not a city. That's where he of it a house in which city is the city that supports multi-family development. Now the city that segregated housing city of the city that shares its neighborhoods not a city that sequester's it's neighborhoods and mandatory housing affordability is the first step in establishing a housing reach Seattle and I believe it has a camera Seattle. Is it just seeing if you can spend Johnson? Okay, I think we are ready to vote. Call the roll on the passage of kampsville 119444 as amended. Hi O'Brien president Harold mabern unopposed. Please read agenda item number 5 the short title. Capital One 19445 to wait until I knew Sansone many chapter 23.32 * 4/3 page 28 of the official land use map to rezone land in the north gate or Rent-A-Center the American mint civil pass on a TOD site in the Northgate neighborhood. There is one technical Amendment that's necessary which updates the base code language to reflect changes to the land use code made in the bill that we just adopted. This amendment is shown an attachment of the central staff memo. So I would move to Amanda Council bo1 19445 by substituting version 2 4 version of 1 be as presented on the agenda. Moving 2nd at 2 am in Townsville 1 1 9 4 4 4 4 5 by the substitution crab, it comes from Johnson any questions all those in favor of the amendment, please don't I know you guys have it. It is amended customer Johnson. I've nothing to add. Any comments you for take both on this agenda item number five is a minute. Please call the roll on the passage of the bill as amended Johnson Juarez. Mascara O'Brien SWAT president Harold and favor not opposed. Please read. Agenda item number 670 calling for additional measures by the city and its partners that complement mandatory housing affordability implementation to promote mobility and Equitable development in medicated displacement and address challenges and opportunities raised by community members during the mha public engagement process. Customer Johnson throughout all of our zoning processes of the last couple years implemented mandatory housing affordability program. We've traditionally. To the companion resolution that identifies additional work at the council would like to have a city staff City departments work on this is the companion resolution for the Citywide. Mha program. There was one amendment to incorporate a minor additions requested by council members after the resolution was introduced are summarized in the central staff memo and shown an attachment G2 that memo they out of reference to child care request further analysis of zoning anomalies and Zoning artifacts, including example parcels and request further analysis. The proposed density increases within the U District is also the place where many of my colleagues who unfortunately not been allowed to include proposed amendments for individual Parcels inside the base legislation. This is the resolution where those suggestions live I think about afford. Housing opportunities for example in council member O'Brien's District, which we talked about at length Where the Boys & Girls Club is interested in redeveloping to allow for more affordable housing on top of butt because they're outside of an Urban Village. They were not studying this environmental impact statement for our previous legislation this resolution calls on that property as well as dozens of other properties around the city to continue to be analyzed by the planning department so they can be included in future legislation. So without further do I move to amend resolution 31870 e by substituting version 6 4 version 5.8 and by substituting version 2 version 1 of attachment 1 Their second. Okay. This is just for the amendment has been moved and seconded to amend the resolutions describe icons from Johnson all those in favor of the amendment, please vote aye aye vote. No the amendment is passed Katherine Johnson anything to add any comments on this resolution before we take both comes from a skater president. I just want to say thanks for the chair again for his work with our office to make somebody amendments. We're really excited about some of the language that we were able to include in. The companion resolution to include Community is most at risk of displacement and thinking through how would you implementation and how would you next steps again echoing what we said earlier recognizing that? Mmha is one element of how we will make sure that we're creating more affordable housing. There's a few pieces. There's actually three that I just like to highlight and again thank him for his work with our office to get these included. In the property tax relief program for seniors and individuals with disabilities so that those homeowners can have additional relief currently. We only have about one-third of those who are qualified for household are qualified for the program actually enrolled in King County interested in working with the city and the county assessor's office to help increase enrollment in that program specifically to enhance our community priorities and ensure that new development includes elements such as child care art and cultural space. This is one of the issues and I'm looking at her friends in Beacon Hill where we heard repeatedly how challenging it was to include for example art on that outside on the facade of the Roberto Master Plaza as we create a new buildings that are intended to be for not just houses. For community space and plazas and green areas. We want to make sure that we're listening to the community and how we incorporate some of the ideas for how to truly crepe place in create a sense of neighborhood. The last thing is I'm excited about some of the books that were going to be doing at that's mentioned in a resolution around Community preference and affirmative marketing to ensure that longtime community members in areas in high risk of displacement are prioritized for building more home. I think we've all said and I'll repeat again. I'm creating additional housing is a key element to helping to address displacement. We also want to make sure that as new housing is created as those affordable units go online those who been in the neighborhood have the first chance to get back in and through the community preference policies that are friends at the office of housing have been working on for a while with Community Partners. We're really excited about camping that up. So thank you to the share for his work with our office and getting some of those pieces then. Do we have in a minute resolution or Jamie like to speak out of cash around her Bowl? Thank you some. I need to work on which I really appreciate again commitment to carry out a variety of initiatives identified to address placement, especially focused in neighborhoods of having a high risk of displacement in the growth in equity analysis prioritizing investment in neighborhoods with highest placement risk and neighborhoods were fries were generated and also to create more family size housing. We also in this resolution signal our intent to evaluate the enforcement of ordinance 1248 61 past with former council member Burgesses leadership. This is an ordinance that requires owners of certain low income housing to notify the city of the proposed sale of building. This is an ordinance that has been been on the books for a while and I'm eager to work with the office of housing to look at how we can actually enforce it so we can get some of these properties in to Inter-Community ownership. So that we can have Community Driven development. We're also interested in looking at expanding this ordinance beyond the scope of multi-family housing folks in the Morgan Junction in particular are interested in using this this ordinance or a successor ordinance to create a pilot to incentivize owners of property to make that property available to groups like Homestead Community Land Trust to encourage entry-level homeownership opportunities highlights our intent to develop and Implement strategies to support and incubates small independent businesses as it relates specifically to some of the district-wide issues. I just want to highlight a couple for Admiral. We're asking the office of planning committee development to update neighborhood design guidelines to address transitions between zones along California Ave in the Morgan Junction in addition to the Affordable housing Pilots that I mentioned earlier. I'm opcd is requested to collaborate with Community stakeholders to determine the conditions for pedestrian Zone And in regards to the West Seattle Junction, we're highlighting the community's interests to begin working with opcd on planning and conjunction with the future light rail station opcd has committed to begin background work in 2019 and planning in Earnest in 2020 in the community is eager to get started and then for Westwood there is some early a request of opcd to bring South Delridge into the planning for the rest of Delridge South Delridge has been neglected part of Delridge, and we really need to make sure that we're integrating the planning for that part of the court or with the rest of Delridge and then Finally at 44 South Park. We're really interested in working on examining the question of whether or not South Park meets the criteria for Urban Village designation as well as I'm asking the department of neighborhoods to support Community efforts to protect historic resources in the neighborhood and then finally working with scci to see if there are specific public and private public use of the duwamish river that should be protected within the bounds of the Urban Village. Thank you. It's going to have to be moved. So I will move to adopt resolution 31870 as amended. Play all those in favor of adopting the resolution, please don't I don't suppose about know the motion carries a resolution is adopted and share with sign it. Please read the report. Of the Civil Rights utilities Economic Development and arts committee lgbtq commission return till October 31st, 2020 the committee recommends you plan to be confirmed in healthcare with specifically with a focus on disability programs his priority Focus for the lgbtq commission is access to healthcare for the LGBT community. He has co-parent it as an adult child who identifies as lgbtq and his goal as a commission member is to provide insights and representation of the lgbtq specifically for parents and elders. Those in favor of confirming the appointment, please. Vote. Aye aye those opposed both know, you know, she carries an appointment is confirmed. Please read the report of the finance and neighborhoods committee neighborhood committee agenda item eight cancel the 1 19476 Surrey Lane to the Pike Place Market authorizing renewal of the agreement with the Pike Place Market preservation in Felton has already come only known as The Hills Lookout agreement for a term of 10 years. Can you recommend a bill passed very much and after all of what we've been going through the last couple of hours. I've got four items will try to get through them quickly. The first is the hilt Licata agreement that it comes up every 10 years it lays out the rules and regulations and stipulations regarding using priority the Pike Place Market space and add our committee last Wednesday. I was very impressed Mary bakerella was there she's the executive director of the market as well as our staff as well as a couple of them. Who talked about just how well the process went? They spent a good portion of the last year discussing the process the new agreement and it was very clear that the groups of work together and there was much more positivities. Then there was 10 years ago. So I want to say thanks to all and finally thanks to Kenny Pittman of our office of in a government relations and liquids in our Central staff who helped Shepherd this ordinance through so we recommend I'm adoption of this renewal. I get any other questions or comments. secure Play please call the roll on the pastor the bill. mascara O'Brien I didn't say banana post 57204 Wichita to the 2018 budget include the 2018 through 2024 Capital Improvement program that can be recognized the bill pass for corrections to our adopted 2019 budget and reconciles department and the CBO Financial systems as he Bo launches the new system that will help us have departments talking to each other more closely. I'm it's going to increase Appropriations for the 2019 budget by two million and $73,000 2 million of this is a technical correction. It's not like we're changing the revenue but it applied appropriation Authority consistent with the council's adoption of Greensheet 10 - 8 - 8 - 1 So the remaining $73,000 appropriation increase is going to be due to an accounting correction. And it's what they call a double Appropriations 75000 is moved or 73,000 is moved from the general fund to the arts and culture fund associated with Council budget actions. And then there's a $2,000 decrease and refunding from Parks project, which was all part of the executives 10 million dollar funding swap. So we move adoption of council Bill one 19478 Stop. Please call the roll on the pastor the bill 9mm favorite unopposed estrogen item. Agenda agenda item 10 Capital One 19479. How many organs 1257 24 which stopped at the 2018 president created the 2018 through 2024 Capital Improvement program recommends of All Passes amended. Thank you. So this Council but one 19479 would reconcile the 2019-2020 adopted budget with the 2018 4th quarter supplemental budget the ordinance updates CIP project allocations and CIP project pages and adds new CIP projects adopted as part of the fourth quarter supplemental and that supplemental adoption ordinance was one to 5739 and we recommend adoption of council Bill one 19479 Please call the roll on the pastor the Bill O'Brien item 849 which endorsed a budget for the city of Seattle for 2020 by step 3D a new attachment that corrects technical omissions and errors committee recommends a resolution be adopted to make a number of technical corrections to the entire to the endorse 20/20 budget and it will make the following projected appropriation changes first a technical correction to reflect future double appropriations of $50,000 from the general fund to arts and culture fund associated with Council budget actions and a $175,000 reduction in the fix-it-first budget summary level of the route to Capitol. I know you're excited about this. I do want to say thank you to council member Gonzalez once again for hanging in there with me. And again as I mentioned this morning that we were very pleased with that Lisa Lisa casework. Thank you. I know things got a little complicated, but we got through it just fine. So in recognition of all that we recommend adoption a resolution 31869 any questions or comments. Okay those in favor of adopting the resolution, please go die those opposed both know the motion carries and their resolutions adopted and sure was silent. Please read reported the pool city council pay for the city council agenda and 12 resolution 318 68th Lane to the city council confirmation and reconfirmation of City department heads describing the steps at the city council intends to follow a lining material that should be submitted to the city council prior to and as part of the nomination describing General criteria that the the council intends to consider when evaluating the search process for an appointment and department head candidates and servicing resolution. 309-623-1868 Moved and seconded. Would you like to speak to it before I do mr. President actually a man resolution 31868 by substituting Version 9 4 version for be which has been handed out the move in 2nd Amendment as described. I can't swim ask it any question just down the amendment all those in favor of the amendment. Please hold. I oppose vote. No K the resolution has been amended. Mr. President. I just want to double-check with the clerk. Do I need to save for a Cuz it's at 4 be here. Okay, thank you. I think we did that correctly. Let me get back on my scripture. I'd also like to request the council rules be suspended to allow consideration of an additional amendment to this resolution. The amendment has been distributed but was sent afternoon deadlines. So this is a formality. So just one mom is here. So. Punch-Drunk this time of the day. So so should we suspend the rules elkeles suspend the rules are no objections to have some explanation of what we're trying to do here at the Twist and I'm sorry show just for the viewing public the the sum of the language with did not meet at 12 deadline and we are suspending that rule if there's no objection to allow for the consideration that language did not meet at 12 deadline. So Catherine skated, perhaps you could talk about what we're trying to do with this amendment time as you will see in a minute there. I literally nine additional awards are adding our just including the words the city of Seattle and Friends of employees including a language that says with other relevant information such as on this is just clarifying language of small technical change on that was helpful for the readers and perspective and what we thought that it was a helpful Amendment from the team providing feedback. very good Do you want me to speak to the underlying bill? Okay. So let's adopt Amendment first those opposed about no. OK the amendment is adopted go ahead counselor mascara from that have come forward and really have brought up some legitimate concerns or questions and asked us to consider the process that were using at the city council level for considering potential nominations. I think the council members to want for hosting a number of meetings where individuals have the chance to come forward and raise questions about process. It really underscored for a number of us on Council the desire to make sure that moving forward it was a clear and robust understanding of what the council's expectations are when it comes to a new nominees for leading our incredible Department. I want to reiterate what I've said over the last But this is not a substitute or does not specifically pertains to the conversation regarding hhsd or Human Services Department. In fact, it is about a larger conversation a desire to make sure that we have a clear and transparent process that we clearly set out our understanding of what council will consider and would desire to consider in evaluating nominees from the executive for future department heads the resolution in front of you formalizes a process and formalizes conversations that many council members in the executive expect when putting forward nominations and also conquered sizes some of the desires that we've heard from Silence Breakers from members of the labor unions have been involved in conversations about how they want to have a seat at the table for new director discussion and includes since we heard from members of the changed and other employees as we begin to understand best practices a little bit better traditionally as we all know how Worked on the Frontline managers are hired and they're putting the place and employees are expected to serve those managers. But today I think we're leading by example. We're showing that a best practice should include all parties at the table and should include making sure that the manager and the selection process is inclusive of individuals who have a direct impact on the lives of individuals they serve and who they work with the selection confirmation and reconfirmation process that's outlined in this resolution affords the city council and the public an opportunity to hear directly from the executive and then mirrors in the future goals and Visions for department heads as well as the desire qualifications experiences accomplishment leadership concerns or other qualities of the department head needs to sort of outline for us or the process should outline for us as the council considers these nominations the resolution before S Health Council that I understand the process that the mayor will use and the engagement sessions that will be held and really We asked whether the racial Equity toolkit and a racial Equity analysis was used and who had a seat at the table. I'm really excited that this has been drafted together again. I understand that our conversations are separate, but I think that the conversation that we have had in the past few months has really underscored the desire for more transparent inclusive, and actually just a greater understanding of the background and the inclusion of folks at the table. So I'm excited that you see in front of you a few changes that came directly from council members in our community if I met mr. President, I just want to read through for small changes for say more collaborative process from the onset. Thank you, Remember her bows for your work on that section 2A highlights that we are Desiring an assessment of the nominees commitment to racial equity. As we all continue to underscore that the racial Equity toolkit and our commitment to that is more than just words on a piece of paper. We want the city a living document that we continue to see reiterated and every decision that the council makes infection 3M we add in a review of employee complaints for employees fever. This is something that we really wanted to see highlighted from the silence Breakers themselves to said that we'd love to see if there was any concerns in the past. But also we wanted to include if any corrective action has been taken in the nominee has participated in various trainings that would also be important as we know correction incorrect behavior is critical as well and section 5 week in Clute Wissam scuse me in section V. We exclude the appointments and confirmations from a handful of departments for exam Seattle Police Department. Noting that we already have some processes and procedures in place that are outlined in statute and we have a certain procedure around those appointments that this resolution should not Sue Feed thank-yous customer cazalis for reason that I so as you can tell this resolution has been incredibly collaborative drafted and right up to the last minute things to all of you for your diligent work to get US amendments early. I know that we tried to include as many as possible when I think Amelia for your work on it and healthy and Jeff Sims and my staff sigil freak out for their work to get all the amendments in place. I looking forward to concurrence on this customer Beck show. Thank you for listening to everybody on this. I know you've picked up many of our recommendations and also work closely with the mayor's office and I also acknowledge to the mayor of that. She wants to be able to do her work under the charter. We do our work. We got a lot to do here, but you set the I'm saying what it is we're looking for and I want to acknowledge that that you have not at any point been in a position where you're telling the mayor what to do but you're indicating that this is what we're looking at. We want to make sure that as somebody is selected that we have an opportunity to get this information in advance and your focus on racial Equity is terrific. So thank you for all your work. Any other comments before we take take the boat house restaurant? Thank you for the hell. I support this resolution with States expectations for an inclusive candidate search for city of Seattle Department directors in the future. It is obviously a response asked him to move scared of said to the shameful disregard the mayor showed Human Services employees and impacted communities including vulnerable homeless community members themselves when she nominated Jason Johnson to be the permanent director of the human services department and then continue to systematically ignore the overwhelming voices that we were sharing. As a as has been acknowledged as a resolution to this resolution is not about the current issue of the Human Services director appointment and will do nothing to address that issue. And that's why it is important to point out that while this resolution is correct in many respects. It's about next time and it does not provide an excuse for elected officials failing to represent their constituents this time in the case of the current Human Services director appointment at which has been quite controversial this resolution makes many requests that I fully agree with about how the mayor should make appointment in the future. But I the question that comes to mind as does the mayor really need the council to recommend she talked to impacted communities before choosing an important department head and it just seems of Cheers on her part if if that is indeed the case and what will council members do in the future if the mayor doesn't? They can do a count your opinions of the impact communities because at this moment dumping in the views of impacted communities are not being taken into account for bypassing this resolution Bill Thompson number during the future and then go to do in the future then why don't they do it now? I mean I have this entire logical conundrum in in my brain that it is down two numbers are going to vote for this resolution for the future. Then why wouldn't they do it at this moment in other? I really think that this the Community member should watch for this apocracy from thousand numbers will all about the future at the same time prove that. They have no interest in actually following it because they're disregarding all of its principles when it becomes a concrete question such as a human services director appointment and I should congratulate council members O'Brien and mosquito for voting with me on the resolution that I had brought forward, which said the mayor should take the sap of nomination back which has been imposed by A significant proportion of the community and should really go to a search that will include race and social justice questions and include the impact on communities. Vote Yes on this resolution But Ordinary People and city of Seattle employees were watching this and who will be watching this later this week. We'll have to speak up as courageously at the Human Services Workers have spoken up in order to make sure that these resolutions are not simply and in the abstract wall, but are followed through by elected officials. Can any of the comments on the resolution before we take vote? Okay. So those in favor of adopting resolution 31868 as a minute, please vote. I vote. No the resolutions. The insurer will sign. Please read the next agenda item and item 13318 71 endorsing the final report and recommendations of the regional affordable housing task force Johnson final one colleagues this resolution endorses about 18 months with the work that I was your designee for the regional affordable housing task credible statistics and incredible opportunities in there for us to get to contemplate the room for improvement. But given that we're now and I were three I won't belabor you with those statistics and just ask you to take a read-through. I will say it does set an ambitious goal of building 244,000 net new units of affordable housing by 2040 with Cher goal of 8800 units a year over the next 5 years in order to meet our fair share of that goal. I believe that our actions earlier today with mandatory housing affordability is one of the critical ways that we would Continue to me our fair share of that 8800 units per year goal similar resolutions are going to be adopted by the county and Sampson is Association. What started as a sort of small small idea to implement affordable housing Targets in our comprehensive plans worked into something bigger Bolder and better so I encourage your support for resolution 31871. Thank you Katherine Johnson any comments or questions? That I'll move this a customer mosquito. Proud To co-sponsor This Way Comes. Remember Johnson this resolution looks forward to Future collaboration with our regional Partners. We know that it's timely as well given our conversations today on mha we applied on the incredible work at 6 to get to this point, but the boundaries of the city do not Define the housing crisis in this region and as we look for additional Solutions and hopefully additional Revenue as well as well. I'm looking forward to outlining what are local Partners can do through the regional affordable housing task force recommendations to make sure the other cities around this region pursue a policy changes that achieve greater impact by doing so in harmony with the city of Seattle, we are taking some important steps today than in order for us to truly addresses Regional housing crisis. We needed a collaborative approach collaborative approach to work on the solutions that can create the housing the density and the affordability to truly create an inclusive region. Obviously, this is relying on not just funding from the state and federal Partners, which at the federal level will most likely continue to not materialize. But we also need to look at smart land use zoning and housing policies as were outlined in our legislative agenda to ensure local cities are working towards the same solution. So excited to co-sponsor this and look forward to Future collaboration in our region any other comments before we take vote for really good. Okay. I'll have to move this. I move to adopt resolution 31871 A resolution be adopted those in favor of adopting the resolution, please would I suppose vote? No, the motion carries and resolution is adopting chair with sign it. Is there any further business to come before the council council member Bagshaw? It's been moved and seconded that customer back shall be excused on April 1st, and they comments all those in favor. Say aye aye opposed the eyes have a customer and she want. Samudra saving customers want be excused on April 1st. Any questions all those in favor say I would like to wager and I want to thank councilmember War as for your services protem present. We deeply appreciate it. And I heard you have a great rest of the afternoon and we stand adjourned.", "end_time": 10749.3}]}