{"format": "raw", "annotations": [], "confidence": 0.9367390978993393, "data": [{"start_time": 0, "text": "You know, like how did that happen? Good afternoon, everybody. Good afternoon. Good afternoon, everybody. Welcome to the sustainability and transportation committee. Today is Tuesday May 7th 2019. It's about 2:02 p.m. My name is Mike O'Brien chair chair. The committee joined by my colleagues councilmember Pacheco and Swan. Thank you both so much for being here and welcome to this is us together being stalked by Kyrie 4. Thank you for stopping us today Kelly. We have a pact agenda today really quickly. We're going to take the first six items are going to be appointment. Sorry appointments to the Seattle Freight Advisory Board. The next to items are reappointment an appointment to the levy to move Seattle oversight committee, then we'll get a briefing on the Move Seattle Levy oversight report. We will then get a response to a statement of legislative legislative intent about rapidride corridors the molten Little Bus. Then we will have a discussion about accessory dwelling units in a proposal that will hopefully be coming to the committee shortly, but we don't have legislation yet today. We want to highlight a couple areas about what we intend to be in that legislation specifically around floor area ratio requirements in single-family zones, and also a brief discussion about finally will get race and social justice report from the office of sustainability environment. Colleagues a new agenda item is that we supposed to know about adopt the agenda as I just described. So I will go ahead and move to be adopted. Jenda. Has any concerns or amendments that alright, I want a reduction agenda signify by saying I need to sign in sheet folks will have up to two minutes to provide comment. We will get the timer going up there. So you know how much time you have left book signed up calling McAleer will be first followed by a breathing killed and killed. Thank you breathe and then David Haynes. Cycling. Good afternoon City Council Members. Thank you for having us here and a special Welcome to our new council member Abel Pacheco. I'm calling McAleer co-president of Barbers Community Club, and we have followed the adieu and the all the accessory dwelling unit legislation for years and there's been some great successes and probably the most important thing I'll say first and that is if it ain't broke don't fix it. So there's a few things that are bubbling up in the legislation right now. Some of you may only actually accessory dwelling units, but there's some concerns that we have particularly for lack of owner-occupancy and I'll leave the details with you, but I having skin of the game having an owner right there a part of the community is really very helpful and kind of reduces the negative possible negative impacts your garbage things too loud music and just kind of being a good neighbor. So we really do not support removing the owner occupancy. Secondly 12 unrelated people in one dwelling unit. That's an extent size of an accessory dwelling unit just seems very excessive it. There's I can't can't imagine the logic for it and we see which probably could happen in her neighborhood where we have a lot of Institutions nearby that becomes flophouses or student housing with all day and all night people coming and going and again not grounded in owner-occupant right there at the third thing is always a tree canopy. I having to take out so much more land if you have both in a doing a dad do on the same property, that means there's hardly anything left for trees and for Neighbors Gardens, and that's Keith goal for all of us, especially all of you sitting at this table. I know you're very proactive tree preservation. So those are the highlights. I'll leave the rest of the details and thanks for listening. Congratulations on correcting my name. I am breathing help with Seattle neighborhood Greenways and we are part of the mass Coalition and I think most of you know that the only program Waze Works to make our streets safe and comfortable people walking and biking throughout the city. And one thing that makes it possible for people to primarily walk or bike is to have reliable efficient Transit which dramatically increases your towel arrange when you're getting around without a car. We are very lucky in this region not just through lock but through a lot of hard work to have increase ridership and we should be proud of that. But then we should also reward and recognize that commitment to ride with a station for buses over private Vehicles. So I am urging city council to work with the Department of Transportation and Mass to identify some places in our city where we can Implement some pilot projects with some additional designated bus lanes or single privatization that sort of thing and I also like that group to work. Identify how we can use the lands. We currently have more effectively. I've talked with several people who told me that they accidentally end up in the lanes as drivers because their lanes that are sometimes bus lanes and sometimes not and they don't realize their bus lanes and then they can a panic when they're in there and they realize they're blocking things. So I I'd love for you to work with us. And with Advocates to both find ways to increase participation and also improve the efficacy of what we have. David W E followed by Matthew Lange and then we're going to have a group that's Andrew Meyer Alice Lockhart Miranda Kitty. You know the group. The freight Advisory Board should know that we need to shut down the Porter and Game Time Racing out the poor traits and give the players and fans a fresh air reprieve from the horn honking freight trains toxifying an overwhelming Mariners baseball after a train passes by the stadium Bradley in the bullpen in The Dugout a multitude of errors on the baseball field occur. The freight Advisory Board should be invigorated to support first world infrastructure that includes accommodating an NBA team Freight should not capitulate to Offshore industrial is treading on local community while government corrupt rate property taxes to corporate welfare subsidized China shipping. See, I was reading a property taxes to corporate welfare subsidized offshore industrialists playing one port against another port to the detriment of locals Pursuit of Happiness gentrified by free container off-loaded guarantee more freight at the expense of local property taxes financing our own demise by the lies of a port of the party that should have an injunction put on its authority to the Port of Seattle industrial industry choices were always willing to forced it on to locals at the expense of the locals residential community. Thanks, David Matthew. Hi, my name is Matthew laying on the lead organizer the transit Riders Union a member of mass Coalition about a resident in a small business owner. The nature of my small business is something necessitates me to drive a car. I teach after school programs in park or acrobatic stuff like that all over King County. So I have about 500 pounds of gymnastics mats that are sitting in my SUV. So I'm on the road every day is a car driver. And so I see I see how we could really increase Transit access in Transit Mobility and as a positive thing for not only people that ride Transit and utilize that system but for car drivers as well friends off and asked me why I had such a passion about increasing Transit Mobility and access and honestly, I understand that increasing that those Transit options for those who can't take advantage of them will take single occupancy vehicle Riders off of the roads and make a smoother commute for everyone. So I think that we should look The vision for bus Mobility that mass Coalition is presented to the council and find ways to work together so that we can all move Seattle together and develop programs that sort. Thank you. Thanks, man. Group, come on board and we'll go ahead and would you guys like 5 minutes? So that's why. All right, so we'll change the timer and I'm after you be Katie Wilson and then Jesse Simpson and Sarah Shipley. Hi, I'm Alice Lockhart from 3 to 50 Seattle speaking on behalf of our members as well as the thousands of skatalites that would like the city to prioritize climate action quickly Zimbabwe. Love to have him in the mirror. Listen to these public testimony events at Council on a regular basis like three. I also think it's got a Metro for helping to make Seattle the one major city where bus ridership is increasing or leastwise recently and set knows and understands that Justice safe bike lanes are the one thing that's going to get people out of their cars and onto bikes fast quicker and more efficient bus service is the thing that's going to get people out of their cars and onto buses, but we need more from s. And we need it much much faster as an adverb. For future Generations having a livable planet. Oh, yes, we can for them to I must ask S. To do something new. The ipcc report gives us 10 years to drastically reduce emissions, and the 50% of Seattle's greenhouse gas emissions personal transportation is not declining that tells us that as the city's Transportation agency s. Needs measurable climate goals and accountability for meeting them. These goals should include Equitable transportation for those of us who can't afford a car or Uber. It's time for us. To default to prioritizing bus and bike lane signal priority for buses and walkable streets everywhere in s. Funding as well as in every project. Thank you. Yeah, I just want to say how enthusiastic I am about bus Rapid Transit as an answer to so many many of our problems. I know that buses aren't often considered particularly, you know sexy your exciting but can you imagine a city of Seattle where every single walkable neighborhood was connected to every other single walkable neighborhood by bus Rapid Transit. Would you could get anywhere in the city from one place to another with maybe one connection but they were fast and reliable. That's what we need to get out of cars and we desperately need to get out of cars. We are facing the most horrendous crisis in climate change people are leaving Central America now because of the drought they're piling up at our border that is because of climate change that is because of the climate change that the United States. Is more responsible for it than any other people in the world, and now people are piling up at our borders and what are we doing here in Seattle? Well, many of us are continuing to drive cuz we have to we have to give a choice we have to do bus Rapid Transit. We have to do it now. We have to do a much more aggressively than we are doing it. Thank you. I'm not sure what I'm supposed to add on to their I think it was supposed to give the emotional testimony day is like when is a cyclist can't face the truth right of traffic by wants to get around the city. It's what makes the city accessible for me throw my bike on the bus go up Capitol Hill without having to use my running up the hell. I mean it's it's what makes it possible to get around without having a lot of money. I've never had the money necessary to buy a car right at that to make our city accessible and to make our city buses that can get us where we go and evaluating so many things about how we get around right now, right? And this is like a piece of the puzzle that we have to look at and we have to unlock Mass thinks that they have some good ideas about how we might as well. Katie you're next. High Council Members, thanks for getting her testimony today and welcome councilmember Pacheco. So I'm here with the printer Credit Union and also number of the mass Coalition along with a bunch of my colleagues here in the audience and we're looking forward to hearing the discussion today on move Seattle and rapidride implementation. We appreciate all the work that's been done by the council and all the work being done now vs. Realize. He's very important Transportation projects at the same time. We're feeling a great and increasing sense of urgency as we Face a global climate change emergency. We know that now is the time to act Seattle greenhouse gas emissions are rising not falling and half of these emissions come from Passenger transportation. We need to give people better alternative to driving alone now not next year not 10 years. We believe that Seattle can set an example that other cities across the country can follow we can achieve a rapid shifts to a low or no carb and transportation system where very few people need to drive alone to get where they need to Where the vast majority of people are choosing other options because of other options work so well and we know that public transit has to be at the core of the system for this reason, we're deeply concerned by the delays and turn back of rapidride and many other move Seattle projects, even though we understand some of the project the challenges we believe the city needs to place a high priority on doing whatever it takes to make these projects really good and to deliver them quickly, even if this means seeking out substantial new funding, we also believe more can be done in the short-term to improve Transit speed and reliability and that's what we really here to address today during the three three weeks Sr. 99 closure. We saw that biking water taxi and Light Rail ridership all increase hugely, but bus ridership really didn't and it may even have fallen on average that tells us that people don't see riding the bus as a reliable way to get a boy getting stuck in traffic last week, news reported on a study showing that people who drive to work in Seattle spend significantly less time commuting then people who ride public transit. This is a problem. How can we expect people to me? Shift 2 TranZit when they have to lose time with spent with their families let alone risk being late to work because the bus is 30 minutes late. So we think the city can change this by getting more serious about bus priority last December Mass published division for bus priority in Seattle, including 20 stretches where we think that dedicated Lanes or signal priority can speed the trips of many thousands of people will also ease metros and Sound Transit serious capacity constraints. So we're here today to ask you to work with us to figure out what can be done fast, and I've got copies of our map to thank you so much. Jessie I am Jessica Simpson from the Capitol Hill renter initiative and share the cities. We work to advance housing equity in the city of Seattle by advocating for fordable housing or housing of all types and transportation multi-modal Transportation people get around the city, sustainably I think both and bus priority driver to make the more inclusive and sustainable place. I don't need to tell you that we have both a housing crisis in a climate crisis tens of thousands of our neighbors live on the streets hundreds of thousands are rent burdened and the city only has 10 years to cut carbon emissions by 50% to meet our Targets. This will mean creating way more 80 years shifting much more money into affordable housing and providing the sorts bus lines and by claims that will allow people to get around without needing a car in the city. Thank you. You're the last one. I signed up today if there's anyone else who wants to speak today. You can line up behind Sara making you do next. Volunteer with 350 Seattle's Transportation worker but I'm also just speaking on behalf of myself and my family after learning that more than half of Seattle's carbon emissions comes from Transportation my husband and I got rid of our car and we now rely solely on our bikes and public transit to get around live in Columbia City. So are major bus route is the number 7 and to get anywhere from the Rainier Valley area into downtown on the number 7. We had a bottleneck right there. That is one of the areas on masses list of bus priorities. That's that's pointed out and that makes riding the number 7 for us really really impractical. We just almost never do it because it's so difficult actually get anywhere it can take up to an hour to even get down into the International District in downtown on that bus and there's no reason why that shouldn't be a rapidride there. So many people that rely on it. It's constantly packed. So I'm just here today to ask you guys to really think about prioritizing bus lanes, especially in the quarters, but the mass Coalition has pointed out here because it would make it possible for me and so many other people in the city to actually use these bus I just hope that with Seattle becoming more multi-modal I use the app one bus away and it can be really off. Like I wish that there was more real-time measurements of buses and I wish that there was more buses and a lot more strategy infiltrated into the bus system of delivering, you know as many buses as possible on time and the 7 Express would be really awesome because I go down to Mount Baker a lot and I'm just you know in general it would be nice if people who wanted to totally depend on buses to live here could easily do that and know they would be on time and I also wanted to thank you for organizing with people across the country about Where did we can sue that one lawyer shocked me? Because he was against the people that played in front of the ice office. What name? He's a lawyer Year and that they laid in front of the ice office in and he wanted to prosecute him. And then now he wants to file a lawsuit against fossil fuel companies and it's right on the edge of my head. Yeah Pete Holmes. And so it evidently we found people in other places around the country who think we can sue the fossil-fuel industries and then like on the city level make a lot of progress since the federal level isn't doing enough. So these things combined can alleviate carbon emissions cuz it's all over the news on the front cover of the New York Times has a huge sea turtle cuz and on the front cover of the Seattle Times animals more animals are becoming extinct. It's it's a catastrophe and I think it should be Heard on TV like all the time instead of this this thing that's want to Blindside us about this big political drama that I care nothing about. So, thank you. Hi, hi, I'm Karen. I'm a member of the transit Riders Union, but I'm speaking on behalf of myself. Mostly. I just love the buses so much and I want to use them all the time, but I don't even work. I'm on Social Security disability and like I won't take them if I have to go through downtown or way up North I missing doctor's appointments and stuff like that. Even though I'm just like just the experience of riding the bus is fine for me. But if I can't get where I need to go I won't use it. I miss activist meetings that help me organize to get you. Do, you know some of the work that we will you bring to you all and so all of these with the maps with all the faster areas, like let's not get fancy. Let's just do that. Thanks. You can't Anyone else who wants to come in today? Good afternoon. My name is Arthur Bacchus. I am a u-dub grad student and a member of Seattle Subway. I would just like to say thank you for being here. But also I exclusively ride Transit Dial-A-Ride bus Light Rail and maybe occasionally a line by Chris something like that. But you know, there's been times. I've been late to class or I've been late to a doctor's appointment right been late to an internship because sometimes the buses might not be reliable especially peak hours. Then there's other times run sitting on a bus and there are 40-50 people on there and I think about if you were to line up 40 or 50 cars and you think about that amount of space that one bus is saving what shouldn't we have priority? Why should work? We as a collective are making a decision to save space for other people. Why don't we get that priority? So if you think about peak hours 80 people or a hundred people Articulated bus. I just don't see, you know, it makes perfect sense to give them priority. They are making a decision to save to take cars off the road. I move 2000 miles from home to come to grad school here because I heard Seattle was doing great things with Transit expanding our Network investing heavily, and I want to make sure that we keep doing that and I want to be part of the city, so please consider NASA suggestions. Thank you. Thank you. Then what else you wanted to fight Bubba come in today? All right. See none will close public comment and we'll dive into the agenda. Why don't you invite prisoners Ford for all of the appointees to the fridge Advisory Board and I'll ask Kelly to read those agenda and into the record. All right. We're looking at appointment as 01318 through 01323 for the freight, Advisory Board. Guide me the names and dates of Kristal fiser to December 31st, 2019 appointment of Kris debuck May 31st to 2020 Jeanne acutanza 31st, 2020 and Mike Elliott, May 31st, 2020 and John Johan Hellman, May 31st 2020. John persak, May 31 2021 Hello, when we do a quick round of introductions one just say your name as we go down the line and start. My name is Kris debuck John persak, and I'm Chris use to disable give us a quick overview of the role of The Advisory Board of parole / surfboard, like all the motherboard just provide a perspective and information on a specific type of Transportation in this case the freight Advisory Board large vehicle and goods movement is the focus. They've helped us in terms of design information and Communications. Obviously Freight mobility scooter city is a growing an important piece of how are City survives always has been in a girls varsity both Freight that's moving through our city from the port or to the pork butt also delivering the goods and needs. We needs more more often directly for a homes but also to the local businesses that rely on it and other City continues to grow and as we switch the ways in which we live and consume that are roads do not expand. In fact, we're off and talking about dedicating our existing roads to other more efficient modes, like buses. It's critically important because I'm the awesome if right cuz sometimes traveling buses, but for the most part we manage that right away. It's a really important piece what we do. So we have for reappointments today and the one we start with the new appointments. So Christy want to start by telling us a little bit about your background and why you want to serve on this board. I began my career as a Teamster actually at UPS as a package car driver. So most of my experiences downtown Seattle delivery in small Parcels. I move to a combination tractor trailer job doing the basically Hub feed also with ups for UPS employees in the Seattle Redmond that area so I basically him When they have issues the safety or later anything like that, I coordinate with the employer and try to work things out. That's awesome. Great to have you be willing to do this. I appreciate appreciate it. Thank you name is John persak, and I've spent 20 years in the maritime industry and spend a lot of time advocating for you know, our Union for workers and now for the industry in general and I also live in an impacted Community other than the Georgetown neighborhood and were impacted by Freight movement as well in the port. So I feel like I bring a unique perspective to the table for the point of view of the economic piece of the jobs. Peace, but also the peace for impacted communities. I think it's important that you know workers in our industry in the industry in general like really get ahead of the curve as far as addressing that issue cuz I think we have some work to do. I know you heard me ramble the beginning of the politicians tend to about my perspective on what the challenges are. But both of you have a ton more expertise on that and if you want to take a minute and share and views on what some of the challenges we face around Freight and it may be some of the things you'd kind of hope to accomplish in your terms on the freight, Advisory Board. and also if you could also expand on how some of these issues. John the lives of people who live in the impacted neighborhoods and let you know just give it exam concrete examples of What could be corrected? Go first person. I think in terms of the challenges, of course, you know, as you mentioned the city's becoming you no more vibrant more dance, and of course, that means you no more challenges to get good skits to the city. Looking forward to working out the problems with you. All first issue that comes to mind as the alignment with the sound the sound transit the new links with regard to both West Seattle on Ballard, you know, there's only a certain a finite amount of space for bringing Transit through so there has to be a conversation with the Freak video on how both interest can be to be served. Can. Be complementary. The second piece of course is Terminal 5 coming on line over near West Seattle and that's going to have an impact hear. There's going to be as much traffic. If not more container over there then the as currently at as is at Terminal 18 and that brings me to the impacts the impacts of courses, you know trucks trucks and trains trucks in particular very carbon-intensive. They're going near neighborhoods off in low-income neighborhoods tend to be you know about it to the industrial areas of The Fray quarters like South Park on the Delridge Community Georgetown and and some others and so we have to take a look at you know, one making sure that break and move efficiently. So it's not I like in those communities and also looking at you know partnering with other agencies like the ports and Industry to see like what kind of things we can bring to the table as far as up more efficient machines. So there's a piece of it also just to say to component in the noise component. I think there's some some work that can be done around there as well to help struggling communities. It's if a noisy environment for a lot of folks and people sometimes have to live there because of the income disparities and so it's not really a choice in a lot of cases. So when I served on the advising for the freight master plan represents the Georgetown community advocate for a piece that would really address those concerns and so I will not continue to do that work on on this. on this Friday just got on that. I think you covered quite a bit the when I look at the small parcel delivery lot of the issue is is the infrastructure and you see more or less more vehicles on the road that are servicing Condominiums all the houses and I'm sure you pulled up somewhere and seen at UPS track USPS truck Amazon truck and then a FedEx truck and a FedEx ground truck so I can bring that perspective from my experience of being on the ground in that situation and what that might look like as far as a better solution and that just the safety is a huge component to so I've been you talk about pedestrians and bicyclists what what are the things that were keeping in mind of how do you keep that component of safety at mind when you're servicing that so Absolutely. I was just going to say it's really good that you both are willing to sell because you already doing a lot of work and your union in the community. So but your voice their important because who knows better about these issues and the union the workers that are already working on these issues. So I think it would be very important and also in relation to Terminal 5, I think your voices are also important because there's a larger conversation Beyond Freight mobility and the specific issues. We're discussing here. There's a larger question of and it's always looming over us with big developers in Suwanee. You know, we have a working Waterfront versus should you know, I should we just Bell real estate in condo. Is there an absolutely be we want to watch for working with a friend on an ongoing basis? A couple things that are on my radar going for it. I love you or just quick feedback on one is Frisco UPS is piloting electric bike delivery downtown neighborhood is part of the work around that. And so it's great to see if the kind of innovation there. He knows curious to see how it works out, but it's certainly a it's awesome to see someone like u p s has been in the business for a long time trying to find some new ways to be efficient. But one of them is it comes up often is about access to curb space. And so I was just small packages have access challenges a lot of competition with the things like uber and Lyft and taxis and similarly how we manage that curb space to make it more efficient. Like you're saying Johnson Vehicles aren't circling the block multiple times with pollution and congestion and can actually get into their business and move on. And so I don't know if you have any thoughts about that, but that's something that I think will be interested to hear. I'm from as we move forward and managed to try to manage better manager curb space think the one thing to look at is usually most companies offer premium service. So you're looking at kind of like three turnaround time. You have a premium service commit secondary service commit and then pick up commit. So I think kind of one thing to look at is how do you look at how customers are service with the pick up component and not impact their retail service to customers and if there's a moderation or mediation what that might look like, so I think that might be a component too cuz that's also the busiest time opener didn't pick up. So that might be something that's a really big question and I think of other thing is, how do you Talk to the major companies and see what solutions they might offer. So the bicycle thing is anything too cuz it removes a component and it but how do you do that safe safely to because you're also putting that something different than a vehicle that's going to the endpoint consumer. So John one of these you mentioned Terminal 5 and one of the Beautiful Things Early so potentially beautiful things about Terminal 5 is a potential access of container directly to rail on that. I'm curious when your perspective if that's something that you know, what are the things that we can be doing is a c to maximize that so that a lot of those lot of free get directly on real and not and skip over the the the trucks that may be idling and may be causing more pollution in some of the neighborhoods. I think generally speaking in order for that to be economically viable. They need the volumes to really make real pencil out. And I think that's that's a real key thing. There is a little bit of activity there now, but in order for them to really leverage that has a cost piece. I think we really have to promote it as like, you know, you know what Premier turn it on the west coast and having said that I'm really excited about the fact that you know there has been some improvements in terms of in the design and making sure that if there's going to be a quiet song, you know for that intersection. So that residents there are hard hearing though the horns in the middle of the night. My understanding is there's going to be some work done on the noise issues on the Shelf with back up alarms and things like that. And of course the newer equipment is quieter as well. So I think overall the real operation is that has a cleaner operation and it's obviously not perfect. But I think the more we can get on rail to bed at the better and I think I'm you know, the volumes are what's really important that Alexander questions on Christian want to mention the for folks that are for reappointment. There are here today and we don't ask him to be here. But I know if you want to touch on any of their backgrounds at all. Well actually miss acutanza just accepted appointment as chair to the Freeport and all of the members of the board appointments that I'd be sold who is associated with Purina Foods. They've all been actually very helpful as we walk through our understanding of the potential impacts to Goods movement is Pioneer Square has limited vehicle weight lanes and how they're helping us get information out to the Goodman community. So in a great many ways, it's a large group effort and its really honestly no one person stands out because I think they're all quite good. Well, I really appreciate the commitment and you both are stepping up. His customers want mentioned you do a lot of other work in the community Beyond this that I'm really grateful for you to both bring your expertise to this. I know it's major time commitment. I want to commit to a lease in my eight months left on the council to honor that commitment by making sure that as you have policy ideas are feedback for us that we were incorporating that into work for you, too. So thanks for doing that work and we look forward to working together. I'll go ahead and move agenda items number 1 through number 6. The appointments are my appointments to the Seattle Freight Advisory Board. All those in favor signify by saying I know. Thanks your appointment will move to the full Council on Monday. You're obviously welcome to attend. There's no no role for you in that meeting other than to get to work self. Thanks so much for your time. Thank you. Thank you very much. All right, if you don't mind reading agenda item 7 and 8 into the record and then I'll invite the presenters forward for that touching that deleted times three to four reappointment of Hester serebrin for the move Seattle over a move Seattle Levy oversight committee as a term ends, December 31st, 2022 an appointment 01325 appointment of Inga manskopf at to the levy to move Seattle oversight committee at the appointment term December 31st, 2019. Start with introductions Rachel. You can go first move Seattle Levy oversight committee has been around since the start of the Levee in 2016 and they are tasked with overseeing progress of implementation of projects and programs on the Levee. They meet monthly group of about 16 people. And sometimes it be more than monthly just I don't know if you've been told that in your but it does extra work to do like last summer was quite a busy summer. So you wanted to take a few minutes and tell us a little bit about yourself in your background and why you're willing to step up to this committee. Mercy of Washington as the administrator for the division of Adolescent Medicine located at Seattle Children's Hospital. I work with mostly the doctors there and provide administrative and operation support for 4 that I handle the division budgets. I every year we to put together a clinical budget we put together Grandpa Jets. I do a lot of finance-related works are in human resources related work as well anyting that is not clinical and I need to get done to help the doctors do their their work. That's my job is and in the community. I am currently but soon not to be the Ravenna Bryant Community Association president for the last four years, and I've worked mostly on Transportation related issues as arbca president. We've we have different views on the RBC about for a variety of i Transportation issues. But I think I've been able to find common ground and a couple of things so they were able to advocate well for special pedestrian safety in our community. I was one of the people who formed the fix 65th and I'm happy to say I'm happy to see how that has all turned out. I still think are some improvements to be made but I was very happy with how we were able to bring the community around that to improve pedestrians, especially pedestrian safety. But of course by safety as well, I finally personally I I don't live that far from work so I buy can I walk to work mostly if it's really raining or if I'm laying our tastes so I rarely use my car but I haven't once in awhile do on the weekends and my family is a truly multimodal family and my daughter is 21 doesn't drive she takes the bus and she walks every Are my husband he does everything he all Huey p v c walks to bronze. He takes the bus and then everyone gets around differently. So I really see move Seattle Levy if all the promises are brought forward could really have a positive impact not only in my family and me but the wider Community then that's why I'm great. That's a broad-spectrum. Just working on the Ravenna Bryant community group has a broad spectrum in I was certainly here on the stick 65th project lot of vocal advocates in quite a bit. So you're right in the thick of it there and thanks for your four years of service. They have any questions for me. I was just because this game up a lot in the public testimony if you have looked at some of the really good point that I've been brought up by the mass Coalition and what do you think how dad intersects with what you think your work will be in on this body and how we can bring that forward. I agree with everything I said, thank you. I would absolutely thank you for that. Play I can just make some quick comments. I mean, I've been to the Ravenna Brian May red association meeting several times now and does a tremendous fabulous job of just create an inclusive environment for everyone to speak that for the diversity of thought and perspectives in so I appreciate your leadership. Thank you so much for your willingness to serve in that before and I really appreciate the perspectives. You're going to bring in. Are you going to be there this evening? I will see you there tonight. So you jump right in did you want something about Hester? Hester serebrin as a reappointment. She's been serving on the committee sends about last October. So she was finishing a vacant term. She is the policy director at transmission choices Coalition lives in Queen Anne and brings background and planning policies specifically an equitable and sustainable Transportation how far to have another two, I'll go ahead and move agenda items number 7 and 8 for the appointments are my appointments to the levy to move Seattle oversight committee counsel next Monday. Again. Thank you so much for being here today, and I look forward to seeing you tonight. Kelly want to read agenda item number 9 in we are getting a move Seattle Levy oversight report. Hey your back. You can pick your seats will get presentation of. Hey, look at that. Why don't we start with your Motivation Excellence and go 1st and Broadway director of a stop or lie William stuff to do tractor Capital project delivery. Yes. Comments. Let's just jump in the presentations and you can start off let Rachel and Lorelai and then Maria do most of the talking today just very happy to be here to continue our efforts of transparency and accountability in terms of the Levee will make him very similar presentation tonight at the levy oversight committee as well and just excited to be able to share this information with you with the public and be able to answer questions in this format to So before we get rolling, so this is wonderful, cuz it's our first quarter report, but it's not the Levi slides. So I don't know if we can switch out. I can show you guys the report won't even up on my Kindle app is good stuff. Now we're on business. I'll take it from here. I'm so we're mostly here today to talk about our q1 2019 progress report before we jump into that. We're going to briefly talk about the 2018 annual report since we didn't get a chance to come earlier in the year. And then at the end we have a response to the SLI regarding the rapidride quarters. Sue for it last year. So we report was kind of Milestone moment because one of the components of the assessment called attention to the need for more robust and transparent tracking and reporting to this report document as the q1 report follows this new more robust formatting template to put all of the facts on the table. So people have what they need to track progress and see how things are moving or where they might not be. So it was in the 2018 25 of the deliverable categories matter exceeded their planned accomplishments for the year. We spent 156 million, which is the highest spending over the first three years of the levy security almost 30 million and the report came out on a noose. Schedule for reporting to provide some consistency and transparency in what to expect when we provide those progress report. So we published it on March 30th and presented it to the recycle buddy as well. I was 2018. So looking on at this quarter 2019 q1 this slide is mainly just for contextual awareness. We've put out a lot of reports in the last for so much for trying to draw the thread and how they all relate. So the screen on the left is from our work work plan report last November and the example project shown is San Francisco. So in November, we put out the work plan, which is a look at the next six years and what we would get done for the remaining years of the Levee. The middle report is the 2019 plan accomplishments document that we put out this March and that report zoomed in on just this year just 2019 and what we would but we will get done this year. I need it explained in documents any changes or deviations from that work plan. So you can see how are staying accountable for that document and then over on the right is a screenshot of this report? 19 q1 and the progress that we've accomplished so far this year in just the first three months against that planned accomplishment outlined in March. To let me just make sure I can read those numbers across so the 32 is the kind of overall Target for the number of safe routes. We're going to work on looking at the next six years in 2019. We said we'd do 32. What is the range of 25 to 32? How is that distinct from the 32 has been reduced which has to do with funding changes for the program? And in just this one is it's kind of interesting and we won't get too far into the details but 32 projects as well in excess of what the Levee commitments are. And so just to call attention between 25 to 32 is still exceeding what we commit to doing every year overall, but basically when we took a look at this year and what we knew about crew availability in that type of thing, we felt better given a range as we looked at the accomplishments. So that's why we have a ranch but that's the detail services in challenges around the Levi ate that kind of put them in three buckets one was maybe our eyes were a little too big when we were putting the plan together to was the construction environment has tighten up considerably over the past few years and ways that another anyone anticipated how much construction would continue to be going on in that competition is putting pressure on availability and prices and then three Federal funding environment. We're not in Most friendly Pro multimodal Federal agency or even just quick turnaround dollars environment in the anticipated a better environment despite all that. There's still a lot of areas of the Levee where we're at with looks like we're still on track to meet or even exceed. Some of the goals are some high-profile ones that are really important that we'll talk about later but I'm appreciated that the school's it's an area where it looks like we might exceed our original commitment open plastic conversations ultimately around one of the things that's not in this presentation, but I'll just tell you is we are looking at the hold 11 kind of where we are think we might under-deliver versus where we might over deliver and trying to decide if that would lead us towards any shifts and where the funding is. So that's the that's the whole next phase of the conversation. Temp so now I'm going through some of the highlights that we accomplished in q1 first quarter is typically a little slow and quiet due to weather but we were still able to go I want to go to work first three months of this year including about 11 blocks of new sidewalk, which is about half of the work. That was carry forward from 2018 for that program. I'm so chipping away at the work that we had it under way at the end of the year sidewalks includes a project on 30th Ave Northeast up in Lake City, which is a pretty major Community Connection. That's the image on the right and the graph for the math on the far right shows how it's one of many phases to complete sidewalk in Lake City and Little Brook say Francisco. We just talked about that. There were eight schools that we implemented projects and first quarter and first quarter is slow for some of the civil construction, but it's a good time for tree planting. We got in over four hundred trees which Again, the remaining trees last from 2018 that we didn't get in quite an time and all of the accomplishments for 2019. The next that there is construction progress on the remaining sidewalk work by projects Greenways and protected bike lanes and Paving that has been underway since the end of 2018. So trying to continue say how we're continuing to make good progress on those. We don't check any mileage off until it's totally done. So we don't have a lot of it in q1, but it's still under way and making good project progress, which is at a C Moore in the spending breakdown that we have a couple of slides. And of course the bigger projects Lander Fairview Andover Theater also, making good progress slander and construction and Fairview North Gate through key Milestones that will allow them to start construction. That's here. The Pedestrian overpass that are still on schedule to be ready by the time that the first train rolls through that's the plan we but we unfortunately have used our float we bid the project and when we did the project they came back in with just the railing costing instead of approximately a million dollars, which we estimated somewhere between five and eight million dollars in each bed. So we have had to go back. Basically. It was somewhat there were very few suppliers and one that stood out so everybody went to the same supplier. So we are modifying the specification so that it gives a lot more leeway and who supplies the railing and brings the cost back into a reasonable range, which is what we're looking for. So we still had some float in the schedule and weight. A chunk of that now. So we're looking to re-advertise the project tomorrow to essentially redo that the the bid documents and rebuilt it out sometime that could have been used for if there is some construction hiccups. And so now we're down to hope everything goes as planned exactly. I know that's a complex project when your major freeway as well as construction over I-5. So yeah, the fun is just beginning, but it's a great project. All right. So the this is a graph showing our spend progress in 2019 to generally gets a little more exciting as you move through the year in q1. We spent 28.8 million, which is our highest q1 spend the first four years of the Levee and we'll get into more of the details in the next size and I'll pass it over to Lorelei. So this is how we love our pets charts. But this shows the plans spend for the year of 218 million and this is the 28.8 in the first quarter within the color breakdown. You can see where we spent the money. So 2.7 million and arterial roadway maintenance 5.4 million for Lander Street overpass and so on so it just gives you the detail about where is Big capital projects pens vs. Operations and maintenance and an over this year for instance Fairview, which is awarded and we're just waiting executed contract is just a small little point two million dollar amount, but quarter-to-quarter 3/4 for that'll increase And then just head on briefly how we do our spend plans because this first-quarter report is the first time that we published or updated for 2019 and you know this well that we start with our cost estimates for projects and then we load those all into our system and when we load those into our system, we checked against risk and schedule and revalidate suspend play some bait based on everything we know now. So that's what has gone into this first quarter report. Our crew delivered projects are a little more Nimble. So there's a different process that we used to develop this pen plans and then just another note. We also have to account for lags and contractor payments. So you will see things on the ground and then it takes a month before we actually process that payment and so it takes a while before it hits the books even though you've seen it complete in the field. Sidewalks crew delivered contracted Men's Health could be delivered projects and package of them together for efficiencies. But other times they can't be the large dollar projects with our prayers that we have to put on to a contractor. And this is just an example not to you don't have to look at all these details. But this is the detail are cost estimates going to so All Phases of the project broken down by City labor consultant contractor and other costs. So that is the type of information we have for all these projects that are in their Capital delivery face. And then just another full look at our at 2019 spending plan that 218 million and by breaking news down into to where they are at. So we have a 28.9 million that's an r&m projects that we control with our cruise. So those tend to be a lot more predictable as well as the nun contractors Liberty the contractor delivered sections. We broke down into three phases those that are under construction wear. One of the one of the toughest points for us is getting final permits and getting things under contract for construction. So once were in construction, we still have rest weather things like that, but we feel much more confident in that spend also projects and Designs. We have a lot more control and design progress usually and those are the smaller dollars spends too. So they don't have as much impact on this pain plan. So the highest risk as far as meeting are spent. Are the jobs that are in design and aren't yet out to construction because we're counting on those larger construction dollars towards the number. So that is why we provided this breakdown just so that you can actually see what buckets all of that falls into. Are you fixing me a little over the Wonder but nice work we have an opportunity to make it match. So it actually doesn't match cuz we were perfect at matches because we're estimating after the first quarter so we have actual so I wish I could say we're that good but Is it that it's still when we're looking forward for the rest of the year and we get into construction season. Is it still feel like we're going to be on about Target or we see some big hiccups on the horizon get to the slides all bills. Just a little bit more. So at first it just that well this light covers both things. So first the difference between our work plan, cuz we continue to track against work plan. We published last year and what is in our plan and so the work plan have four 2019 257 million and we are now saying 218 million Spencer this year. There's a few different reasons for that some of the biggest reasons and I'm going to flip flop the order here because this is actually an unusual occurrence. But one that I want to call attention to Is Our Land our project is actually estimated to cost less than we planned. So 20 million of that under spend in 2019 is because we don't ever expect to have to spend that money on Lander you actually deliver the project in the cost less money. That's a really good thing. So thank you for that and that I appreciate you highlighting that that is not a problem. And then there's then there's the kind of men are spending. We don't like as much as such as our Fairview bridge. In fact, all three of these projects listed her Fairview Bridge raac package one and our North Gate Bridge. We had to re-advertise all for different reasons. And those are pretty painful moments the Northgate when I explain the other two had to do with the responsibility issues where we had to throw out all bids because we couldn't accept them there certain criteria. They had to meet and they didn't meet them. And so the good news is Fairview contract has since been awarded and we're awaiting execution and then AC package one has been real protest. So we're moving forward but those delays show up in our spend and Ann are deliverables. And how much of that is is the current construction environment. Where were having trouble attracting. Folks how much of it is we need to do, you know better job of practically recruiting contractors to bid on the worker package of bundle in a way that is more attractive to folks. We get some competitive bids that are qualified. Yes. It's it's interesting on the Fairview one. There was actually a clerical error on Arlo bid that we're essentially there was a zero must be important sorrow. So that's just human error happens. Sometimes we also for the AC package one, which is the paving project with a couple years ago added some supplemental bit of responsibility criteria to our projects that on Specialized projects make a lot of sense on arm or typical projects like Paving project actually cause more problems because of confusion. And in this case Arlo better wasn't able to prove they were responsible because none of the jobs they're doing for the They were complete so they can count them as proving they could actually handle that level of work. And then we had a few other 2nd 3rd Bettors had separate issues with her bed. So it's it's a bit of a mixed bag. But what we're looking at is tightening up that supplemental that our responsibility criteria. So that is both a little clearer as well as I'm only to the degree. We think it's necessary and helpful. Tim you are one of the credentials that you brought to this job was Project delivery in so I imagine these are things that were probably under way before you got here. I don't know if there's anything you want to add he write each of these has a slightly different issue and put those are the types of things that we are in some of those are systematic things and some of them are Maybe one-offs. And and so I think Laura line I've been talking about how to solve some of those systemic things then try to prevent the one-off storm happening again as well. So I appreciate the kind of transparency and highlighting these things to everybody and I appreciate that. We're learning lessons as we go so that you know, vaulting changing industry out there really fast in Seattle right now, but I appreciate that you definitely and so then the last thing on this side that I want to call attention to is one lesson that we all have learned is when we give one specific number everybody trash to that one specific number and it's important to do it from reporting standpoint, but we wanted to also reflect as a range because we know we have still risks that could happen or could not happen. And so the spend plan assumption for 2018 is actually 192 to 18 is the range were looking at one instance is we have average-sized my phone. That has a FEMA Grant. We're waiting on that ground before we can advertise. So that's taking a little bit more time as well worth our weight because we get the money exactly and but it is time for a project. So that's a risk we see as you know, you know, our cruise have many different places are getting pulled in their priorities. There was a lot going on with the snow Viaduct closure. They're working to make up from that. But as we want to do more as a city as a whole there's a lot of push pull with the time our cruise have to devote so we just see that as a rest as well as I'm pressing issues in construction. And then just a full picture and this will continue to evolve the the good news is we're on the right track end. So we continue to ramp up some of the big projects are still in the Horizon in 2020 and 2021. You have Delridge and Madison which are big Corridor project that fair amount of construction spend. And so this is I would say with this chart we feel good about where we're going. We're still not going there quite as fast as we'd like to but that's what we're paying attention to is how much of that is the larger projects that just need to keep going as well as maintaining the level of deliver delivery that we need. And this is just a comparison to the work plan report where you see that trend of before it was a very sharp spend in 2020 and now it's flattening out a little bit and I imagine we'll see some of that happen to the rest of the levy, but we're close to the peak of arson. and I now the Wait, wait combine two pieces. So just for the record 4 - a - 1 - 2018 rapidride quarters. jumping the fly requested information about the transit plus multi-modal Corridor project as well as rapidride projects and some more specificity about how they were combined or separate. It was requested at the same time as we're going through a really robust Levy assessment and said there wasn't complete clarity about where things would end up. I would also know it was concurrent with King County Metro Zone process to develop their Capital project Apple program for delivering other rapidride program in countywide. The response that we provided include the number of items a significant portion of the substance was included in the 2018 work plan in terms of the project scope funding plan status on spending budgets and timelines. We also provided King County Metro full rapidride programs summary that was prepared the fall of last year in support of their Council budget process and an updated program map that differentiates. Hopefully more visually Between the rapidride Lions and the trance of pus multi-modal Corridor lines in terms of the substance of the response. Three of the projects will be completely integrated Transit bus multi-modal Corridor and rapidride projects. So that is where design delivering Outreach will be both a thought multimodal and Transit Investments and King County's rapid ride investments in and service all of it concurrent. I know we've been working really high. North Metro this year now that we have Clarity on both agencies Parts about how we're moving forward to really show that to the community as integrated projects each of them a little bit different in terms of the funding commitment from each partner Agency for Madison, Delridge and Roosevelt the world making some good progress, I think and in the Partnerships and Project Specific agreements to continue to move forward for the projects will be what we called Transit plus multi-modal Corridor project. So those are projects to make trains at speed reliability as well as safety and access improvements as funding allowed on four main Transit corridors and I would know that metros budget does include funding for rapidride and Rainier in 2024. We had an interest of clarity and in response to a lot of the feedback in discussion that we had with the transit Advisory board and the levy oversight committee last year. I decided to prioritize our Le'Veon Bell. Men in the Route 7 4 door to deliver improvements more quickly for the community of current Transit Route 7 Riders to allow us to partner with some of our other Levy projects like the vision zero investment to deliver Bose TN Transit investment sooner and to maintain more control over a scope and risk on that that was a corridor that had been originally identified as another one of the potential small starts corridors and a big piece of the input. We had last year as part of the assessment was to deliver improvements sooner and during the Levee time frame to make sure that people benefited from those funds. We are however working very closely with Metro on their rapidride Rainier project which will happen in 2024 and development communication strategies the try not to confuse people and make sure that our investments I've done all of these car work for doors are really forward compatible with rapidride that on Madison. I was part of the Levee assessment we did extend the timeline for that to open in 2022 that was part of taking a closer. Look at what I was taking to deliver and secure the federal small starts in which is a significant portion of the Madison project Metro budget had shown this in 2021 cuz they were ready if we were ready in 2021, but we are the leads that project is taking a little bit longer so that the work plan and the timelines in the work plan. I showed Madison is 2022 and we are moving forward consistent with that timeline. So none of the timelines have changed from November, but hopefully this provides a little bit more information then and I would also note that on June 4th. I will get the levy oversight committee to provide a more detailed presentation project-by-project on our status for these. So just to make sure that I have Clarity and understanding the the three rapidride the three projects that were still calling rapidride or Wednesday that we expect to deliver our improvements and King County. Metro will be able to deliver their rapidride service within the time frame of the Levee which is to 2023. Easter 2024 the schedule right now shows Madison opening in Madison / rapidride G line opening in 2022 of the Delridge way and the rapidride H line, which is beyond Delridge go South Lake Union the Burien opening in 2021. And then the rapidride Roosevelt project opening in 2024. The Rainier is also scheduled for 2024 for we are scheduled to make Transit speed reliability improvements on the Route 7 that will benefit both now and before Word compatible with rapidride by 2022. It's much more of a phase investment sequence with a number Levy projects and Investments on Rainier over the next five years. I assume the investments in who's paying for what probably varies project to project but in general Metro is responsible for buying the new buses and the drivers and having the bass face and installing probably the payment systems in the signage and stuff. We come in and do a series of kind of right away improvements that will help prioritize whether that's cute jumps or her bulbs or whatever type of infrastructure and so what I hear you saying is we are going to do the rapid the the sorry in advance of the rapid ride bus so we can deliver those benefits to current 7 users a couple years in advance and then when Metro has the capacity of the funding or whatever they're constrained is to come along and put the new boxes on in the news stations. They will drop that right on top of our investments from a couple years before. And I'm right near Metro has a significant capital budget for that quarter. Okay, they make additional speed reliability improvements Beyond even what we can make and Beyond stations as well and then the other three haven't mentioned. So there's the wedding. It's the 4244 and sorry. What's the route on 23rd and Q will those are those are all still ultimately we think can be rapid ride or is that beyond the Metro planning horizon or just not sure? They continue to be shown as rapidride lions and Metro connects metros long-range plan as Metro eventually gets through this first phase of their Capital expansion program and I can say is her third phase of rapidride expansion are those corridors are anticipated to be made rapidride at that time. So one of the questions we had last year as we were going to the the rapidride Investments does a big selling feature for a lot of folks of the Levee and also a big cost and an area where we had anticipated significant Federal leverage into got a lot of attention one of the questions that I know we had at the at the oversight committee was do we given the new constraints? We concentrate the investments in a subset of the seven lines or do we continue to invest in all Seven Lions and maybe just, you know paring down some of the Investments and we're still going to make a suite of Investments. I recalled it. If I recall correctly from last fall, the idea was we want to pick the the places we can get the best speed and reliability improvements for the dollars we have and that there are there are those high quality investment that are happening across all seven of these corridors. And so we're going to continue to invest in all seven those there may be some Investments that we thought we might make I don't know if the plan was quite that details when we went out to voters, but there may be some things that we hope to make the Navy Army part of that packet, but we still can deliver significant speed reliability an independent of what we're doing King County Metro has its own challenge of the capacity. And so there you know, what we'd hoped we'd all be rapidride lines before heading to the Levy some of those are going to come a little later because of King County Metro Bus. roughly accurate from a kind of counselor respecting released Thank you. Thank you for humoring me I would only add that going back to lorelei's slides of where where the expenditures get really big like these these rapidride quarters are still really big Investments for us to deliver. And so as we deliver those and and continue to improve our ability to do that that will affect how we think about rapidride going forward as well. So it will be no success we can assess how and where we can do the Madison brt what he said significant Federal investment. Still a fair amount of uncertainty around that or just kind of hard to tell in an armoire. All that would be fairly certain that this isn't normal. I mean, it's it's still rated High and the small Star Trading that just came out in February. So we still think that there's a strong possibility of strong strong likelihood. I think there is there still the need to actually get to a grant agreement and that's recently been a little bit faster for other Transit properties around the country, but that's a place where we still have some uncertainty. Well, thanks a ton for the in-depth stuff excited to see this happen. I appreciate go back to slide number for again. Sorry slide number 5. Myron is correctly that is it for the toll on you by sidewalks that were built 21.5 or is it 10:00? You sidewalks and then 11U size 11 and 1/2 news block the sidewalk and then the other side walk mention lower down 18. I don't know exact number. I think we finished about 34 of 54 targeted blocks. So that's about 20 that were under construction at the new year. So we finished about half of them 11 and continue to make progress in the other half. And then on top of that there's a dish so all of those 20 and Compass Star is Born originally intended to get done 2018 on top of that leather portfolio for 2019. This is more of a philosophical question cuz Flying just in terms of just making it safer for people to bike is 1% enough and slide number 7. Trying to find where I went to bicycle safety. Gosh, I'm trying to think I am well, so what you see they're largely is a chunk of the spend on 65th. It's hard to look at it isolated in a single quarter to say but going back to what we addressed in the work plan. I would say the bike master plan program is the one that is hurting the most in terms of the difference between the deliverables. We originally committed to and the amount of money we have and see how far we can take that. So an individual quarter is hard to show specific reflection. But if you look at the whole program and you look at the work plan, I guess the answer would be no because when projects or understand and or for example, I know last year was it 43.1 million carryforward is just how are those new projects reprioritize or has that money reallocated with regards to what we say, maybe when I spend enough on sidewalks maybe when I spend enough on bicycle Lanes or I'm just curious what we haven't done that yet, but there's different guidelines about what can be just handled by us. What is handled with oversight Committee of what actually has to go to council? And so those are exactly the conversation so that we will start to have internally then with the levy and then with cancel if need be particular there's three different buckets of funding and the Levee and when we move things between the bucket I believe that requires Council approval. That answer your question to answer your question a little bit. Some of the carry forward funding is it is around when projects aren't spending within the same year. It's not necessarily do too understanding. It might be a commitment where the the budget has been allocated but hasn't been expended yet until I have to get carried forward to then get expended in the next year. I also I think you are to one is a is a very slow time for delivery in general of project because of weather temperatures and stuff like that. So this that spending breakout is just for the q1 expenditures and so we'll we'll see some of that like that the composition of the future quarters will change over there overtime. And those are the percentages in that break out of just the percentages of the 13% So the bike spending actually the first quarter was about seven and a half percent of the overall spending but you know the big picture I appreciate your point because it is a mode that we need to be emphasizing its say looking at the overall work plan. The one we published last November is the best way to look at the holistic every program individually in where we're at in the health of it. Freak it down for just a second in public, today. We heard a number of comments about prioritizing bus routes and there's a map that I'm just seeing today, but we'll make sure you get copies of that the mass Coalition put together of different areas where we can prioritize and I want to reiterate the least. I am very in favor of figuring out how we allocate that bus facing people made some local points of Entry of her multiple times before when we have, you know, 68 the words of a hundred people on a bus. We need to honor that commitment with making sure that move swiftly. I've also heard anecdotally through constituents that since the buses are coming out of tunnel certain routes are experiencing some one significant delays, and I appreciate that they're going to give me some And what those numbers are my request would be one if you have any comments or ideas on how we can move forward on this and specifically when it comes to on some delays and we may be seeing a bus coming out of tunnel. I would love to move swiftly if there are opportunities to to add additional bus only Lanes in especially in the downtown core door. But anywhere, you know, if we can dock, you know, two or three minutes out folks commutes would love to move as swiftly as possible on that. I just say so I had a chance to go on a tour of a number of locations around the city with the mass Coalition couple Saturdays ago. And that was that was great to discuss the issues here hear the concerns and I was here for public comment. Downstairs at the service Awards giving out Awards. You got a shout-out. Let's go even if I'm not here in the audience for public comment. I do tend to watch it. On TV. So I think we we share the urgency and making continue to make buses Investments invest Improvement related to the bus is coming out of the tunnel seems like it's a it's a complicated set of factors that there's not just one answer to some of those things are going to continue to work with with Medtronic for summer outfits. It's turning movements where there's a lot of pedestrians Crossing at those turning movements and and we don't starve time away from pedestrians at some of those busy downtown locations either and then for some it seems like there's some places we're coming off of the freeway or different there's different factors for each of the routes that are experiencing some more delays. That's an ongoing discussion between s. End and Metro on exactly where and how to address some of those issues. And I think so if it's all so it's just loading demand and then we've had even issues. We're like building garage entries into where buses are now coming and how to balance your how to keep buses moving through those places where there's congestion related to the garage and exits as we've tried to address as they come and then look at them or systemically as well just on my commute or no yesterday or the day before home on 6th Avenue where we've added northbound bus capacity 5th and 6th combined but on 6th Avenue between Nordstrom's and Pacific Place. There was the police officer that was essentially doing a q jump for buses. There's a big block pedestrian intersection there and I think is a bustling Lane was holding up the general traffic waving the buses through and so that's obviously a cost-effective long-term solution. But if that's the way that Willie did the lights adjusted to put a cue jumping whatever gets through so I'm not sure how that came about but I don't think it just randomly happen to appreciate that kind of nimble. So that's been deployed resources to keep things moving but to save opportunities for more of those and how we fix that long-term to Any other questions? Thank you so much for your ongoing work on this presentation today. Look forward to it. I'll try to channel my colleague about the North Gate Bridge. Let's get that thing done and we all share that objective. So. Alright Kelly couple of times last couple big ones when we jump in. We're probably gonna run a little bit over the for timeline today apologize for that are folks able to stick around a little bit longer. I'll let if it was he has concerns that we were okay. How late are you? Accessory dwelling units Adu proposal update focus on the floor area ratio requirement. Would you like to introduce yourself a lie? Alicante Council Central staff, I'll just quick opening remarks and then I'll hand it over to your presentation been working for a number of years on ways to create more flexibility for backyard cottages and in-law units. I think my involvement depending on when you start measuring 3 and 1/2 + years they were into it. Now. We are still waiting on a decision from hearing examiner based on an appeal by the Queen Anne Community Council to the final environmental impact statement was issued in October of last year my understanding in the world of hearing examiner decisions is not quite certain on the day, but sometime in the next couple weeks more likely to hear that and see what that decision looks like will impact how we want to move forward or how are we can move forward the moment, but desire to be ready for a decision that allows us to move forward. I really wanted to start the conversation is about two items are relatively new in the is released and really shine a spotlight on those to get some to make sure the trucks in the public are paying attention to some of the changes that may come forward on Basin what came out of the is in the big one. There is the idea that we would have a floor area ratio limit on new construction in single-family zones. And the other thing that's more of a tweak. We will talk more about the future future weeks. Is there currently an owner occupancy requirement the is contemplated that an ownership requirement and we can talk about that a little bit today. We don't have any legislation yet. We hope to hear from the hearing examiner. Obviously been working on Concepts and my goal would be that we would introduce some legislation by the end of this month. We're planning to come back to Committee in May 28th. That's assuming that we get a favorable hearing Examiner. Going between now and then so I'm contingent upon that the hope would be would have actual legislation in front of us to consider to start actually debating at the May 28th meeting. So Ali. Didn't mean to steal all of your thunder though want to give you a quick overview of the land use code to make it easier to build accessory dwelling units, but I'll likely refer to a day to use throughout the presentation or flip back and forth. I'll try to minimize the use of a cam in a presentation focuses on two aspects of The Proposal of floor area ratio limit also referred to as Farr and removing the owner occupancy requirement before I jump into those topics. I'll provide a brief background on some of the 80 policy work and Briefly summarize the proposal probably move relatively quickly through those thighs in the interest of time. There's more detail in the memo and we'll have more opportunity for discussion on that at the committee meeting at the end of May. So just as a starting point, I want to make sure we're all using the same terminology. What are accessory dwelling units often referred to as backyard Cottages Carriage Houses. We prefer to them technically in the code is detached accessory dwelling units and then also attached accessory dwelling units Garden Apartments basement Suites those that are incorporated into the main structure. So why encourage accessory dwelling units is one of the many strategies that the city has been working on to address the housing crisis and something tells me bro. Brian has been working on for many years has he stated the main objective of the proposed regulatory changes has to look at removing barriers to make it easier for people to build a to use and increase the number and variety of housing choices in single-family zones. It also has some benefits related to providing more options that may be more affordable than a single family home is also provides an opportunity for homeowners are Property Owners to generate additional income in a depth their household to change. It needs an adapter house to change accounts with me is one of the driving forces that prompted this work is that although attached and detached adus have been allowed Citywide since 1994 and 2010 respectively we've seen only about 2% of properties add an accessory dwelling unit. So it started suggesting that maybe there are some barriers are there in a regulations are in our process that might be preventing people. From pursuing an accessory dwelling unit decide slide outlines the various steps the city has taken to try to move this work forward as comes my bro O'Brien describe. We are currently awaiting a decision from the hearing examiner on the appeal of the adequacy of the final year is depending on the outcome of that appeal will sort of dictate when the council can take final action, but committee deliberations can consider the 10 move forward absent a decision from the hearing examiner and regardless of what that decision is. It just prevents the cancer from taking final action. Do this by just briefly summarizes the suite of proposed changes to the land use code today will focus on the two bolded options, but there are a number of other requirements like alone 280 use on a lot removing the offsite parking requirements and the number of size and location of criteria that will dive into in more detail at the end of May. So I'll start with a focus on the proposal to introduce a floor area ratio requirement. And this was not included in the proposal that was initially published in 2016. And really this idea came out of the scoping process doing during the IRS process for for the regulatory changes. We got a lot of comments about concerns about the size and bulk of new development on single-family Lots as well as looking for strategies to incentivize accessory dwelling unit. So I'll get into a little bit more detail in a few moments on that. But first what is a floor area ratio, it is a term or a strategy used in a lot of zoning and land-use codes to that regulates the size of the building in relationship to the size of the lot. So I'm the examples on the side above show what a 1.0. Farr limit would be in what is 0.5 f a r limit would be so if you have a 5000 square foot lot in your limit is the maximum size of the structure is 5,000. If you have a happy hour limit 0.5 the maximum size of the structures on the lot would be 2500 square feet. In Seattle today about our limits are used pretty regularly and multifamily in commercial zones to regulate the bulk and scale of buildings. But in single-family zones, there are no limit IRA limits instead. The maximum size of structures are effectively controlled by Yarbrough requirements height limits in lot coverage limits. I appreciate the old Lester tifft nature of this. I'm in a single-family zones. Turnley, there's a lot coverage has one of those other requirements that controls basic is it 35% And so so you could not build the example in the top left there because you couldn't cover 100% a lot. You could do more of the one under the three-story building on the right that they get that is cracked, sweetheart. We was talking about allowing detached accessory dwelling units those also count towards the lot coverage limits. It was in this proposal. So it would provide more allowances for you. No more a to use on the lot in that sort of thing, but it doesn't allow more structures to cover the lots of the f a r requirement of has the effect of reducing the overall bulk of new homes and which could it result in freeing up more space for a backyard Cottage. But if you've already if you already have a main house that nothing would look like any of these but this image all the way on the right if you had something like that and you were at your maximum lot coverage you would not be able to add a detached structure. You could incorporate an attachment to that existing footprint of tried to do art cover any more of the lot was about with the detached for the backyard Cottages. There wouldn't be any room for trees. They just want to be clear that 65% of the lot and turn regulation and of the proposed regulation would still have to be open and that's all places the trees could go so not to say that. You may choose to do different things. There should be plenty of room with backyard Cottages still have in single-family don't have plenty of trees for built into the proposal that provide flexibility to allow to design around a tree as well as only allowing sort of single-story slightly larger structures on the rear portion of the lot if it only if it can be accommodated without loss of a trees over a certain size To the proposed Farr limit when applied to all development in single-family zones new single family homes would be subject to an F Ira limit of Point 5 or 2500 sq ft below grade floor area so floor area like under in a basement and floor area and any accessory dwelling unit while weather attached or detached would not count towards bfar limit that would be exempt existing homes that are already built that would exceed the proposed limit would be allowed to get a one-time exception to allow a small addition. So it's still allow for some improvements to existing homes on Cell walkthrough a few examples of existing homes in Seattle that are below at or above the proposed Farr limit. So this first example is a smaller home built in the 1950s approximately 1900 square feet and has a defective Farr .35 because we don't regulate single-family zoning so that they are currently described as effective if they are. So this house could be built today could be enlarged. Imma be permitted. This house built in the 1920s is is about 2,500 square feet. So it would be just at the limit so it could be allowed today in addition, you know, one of the considerations as whether or not Which floor area to exempt from the calculation. So in this example, if that garage is used as parking could count towards the far calculation if it's not fully below-grade, but if it was converted to an attache accessory dwelling unit would be exempt from that calculation. This is an example of a more recently constructed house that exceeds the proposed limited .63 about 2700 square feet. So this house is a single unit wouldn't be able to be constructed under the proposed far limit. This is another example of a home that has effectively maxed out the zoning envelope. So maximize the height yard and all those requirements to build this as big of a structure on the water possible. So I had an affair of about 1.05 and this would not be allowed under the proposed Farr limit. Disconnect structure is another example of a house that would exceed the proposed Fair limit and couldn't be permitted if the proposal moves forward. However, if this house included too attached accessory dwelling units, it would be I'm allowed today and you can almost see sort of how they could be. I mean, I don't really know what the inside looks like, but those little porches look like two separate units potentially. We often think of right up and think of all units are attached units in the basement, but there's no requirement that they be in the basement right there where the entry locations are. So it still appears to look like a single-family home in that sort of thing. But it there's not a requirement that it is actually in the basement. And this table illustrates Parcells by the floor area ratio ratio currently found unlocked in single-family zones, this demonstrates that most homes in single-family zones are below the proposed maximums. Approximately 91% of existing homes would be at or below the proposed maximum about 9% of existing-home. Citywide would exceed the proposed limit. However, under current regulations. It's not uncommon for older small existing houses to be torn down and redevelop with larger more expensive homes are in field development or seeing larger homes that are sort of maximizing maximize that is only envelopes. If you start breaking down by when the home was constructed, you'll find that more homes that are have been have been built recently would exceed the proposed limit about 42% of homes built since 2010 would exceed the proposed the proposed maximum. So that's actually based on our current real estate market it like I understand that and talking to some Builders when they buy what is now expensive single-family land in our city. They want to maximize a return on investment. They to some extent the product they sell is off and price by the square footage of the more square footage they fit in that building the more they can get for it. And so we end up seeing some of these, you know, really large single family homes possible single-family home with the most profitable for the development outcome. I'm going to skip ahead one side for a minute just to sort of further that point where what we've seen the size of the average size of homes going up. We have seen the average household size going down. So between 1970 and 2010. We saw the average household size. Increase by approximately 17% of the average size of single family homes is increased by about 30% I've noted on the slide that recent data from the American Community survey suggests starting to see an increase in household size ever. That's about a 3% increase in it from the last census and is still results in like about a 15% reduction compared to 1970. So well, we may be saying ass marginal increase in household size. It's not to the point that we were saying helpful Pleasant in the 1970s 1980s. Is it national? This is Seattle specific, but my understanding is that Trend plays out living in more square footage in a single-family zones factoring a housing crisis. Where was everyone. So there are a number of policy considerations in terms of implementing an f a r limit one of the policy reasons to consider an FAA alarm half hour limit is at 10 to reduce the size of new houses. That's also reducing the physical changes in neighborhoods by reducing the bulk and scale of new homes, which may be more consistent with historic development patterns. The proposed that they are limited in 10 at least in part to encourage but not mandate smaller principal single-family dwellings and more accessory dwelling units. Another thing to be found in the analysis for the IRS is that the fira limit is one of the factors that contributes to increase a do you protect production but even more it is a major contributor to the finding where we would see I've reduced number of demolitions of existing single-family homes because of the Farr limit. So compared to the no action option which would be leaving the regulations in place as they exist today. The proposal expect is expected over all with all of the Sweet of changes to the land use code to increase ATP production by about 125% over the 10-year. We looked at and decreased are Downs by exist of existing homes by about 22% As I said the proposed that they are limited the main component of the proposal that might decrease the expected number of teardowns. So there are a number of options available to come to members As you move forward with the proposal there would be the no action which would be not to impose an f a r limit you could have got the fira limit as studied in the is a 0.5. I'm you could adopt a higher Farr limit effectively anything between 0.5 and around 1.05 which is effectively what the f are limit would be today when you apply all those other standards, you could also consider expanding or reducing the floor area that would be exempt from that calculation. So if you want to encourage certain things or lemon other things you could either exempt or include that floor area in the calculation and that option could be combined with either option two or three There no questions on floor area ratio move on to the owner occupancy requirement. So the owner occupancy requirement today under current regulations of property owner must occupy either the main house or the 80 you for at least 6 months of the year. The proposed changes would remove that owner occupancy requirement into a property owner that currently owns a single-family home as a rental property could offer that for rent. One thing that is available to ATU property owners are property owners who have an Adu now that meet the owner occupancy requirement. They can apply for a waiver through the department of construction and inspection and under certain circumstances. They may be granted a waiver for up to three years for that owner occupancy requirement. So there are number reasons why one might consider removing the owner occupancy requirement that needs to be weighed against the other concerned. I'm one is equity current regulations Prix owners and renters differently. What if it's a single-family home with an accessory dwelling unit versus any other type of rental property owners. If the property does not have an Adu but has a single-family home that property owner can rent that unit out without occupying that the property if you add an edu you cannot in this is different than how we treat any other housing type in other zones as well as in single-family don't if you have a duplex or you are multiple Townhomes or that sort of thing in a low rise and wealthy families own. There's no requirement that the owner lives on site and so I guess the policy question here is what problem are impacted the owner occupancy requirement trying to solve and is it the right tool to address those concerns? I think we all heard in public comments and concerns about noise and over occupancy in That sort of thing and I'm not sure and in response in with concerned about the removing of the owner occupancy requirement. It's not clear that that tool actually addresses those problems or maybe other rules or regulations in terms of our North noise ordinance or how many people can live in a unit that need to be considered to address those concerns as well as how the property is maintained. I'm really quickly. The one of the puzzles is also the number of unrelated people that can live in my understanding would be that if you were going to do a primary residence into accessory dwelling units, that's what would trigger the increase of unrelated up to 12 unrelated individuals living on the property from 8 to 12 if there were two accessory dwelling units on the lot and that's another example of how Single family properties are sort of treated differently than other housing type. So if you have a four-unit building in a low-rise own, each of those units can have up to eight unrelated people living in them assuming they meet all of their flight health safety safety rules that household maximum household size in single-family zones applies to the entire lot regardless of if there is one house or one-house + + + 80 you I'm in for this would just be increasing that slightly if there are, you know, effectively toot-toot there could be free households living on the lot but I could in total have 12 unrelated people in public, and I think they're coming was if I remember cuz I heard it correctly was concerned about 12 unrelated people living in a detached dwelling unit would only apply if there is three units on the lot. That would be the outcome of 3 units on average out before people per unit in. However, they're distributed. It might be slightly different but interior fireman is flexibility and financing the owner occupancy requirements or limits how homeowners can use their property now and in the future that may deter people from making the substantial investment and whether real or perceived their their people have stated that there is a bear it's a barrier to access in financing and in part because you can't be guaranteed a future rental income so that maybe concerns from lenders about how to sort of account for that additional additional unit when considering a loan and then removing. The owner occupancy is one of the main driving forces in that led to an estimated increase in ADH production over the 10-year period that we studied in the year is removing the owner occupancy requirement expands. The number of eligible lots that could add one or two. Under the proposal by about 20% So those are all the currently I'm single family properties that are renter-occupied that couldn't add an Adu today because of the owner occupancy requirement. So we estimated that removing that requirement would increase the number of ATP is produced somewhere between 20 and 25% for the ads those lots to to be eligible as well as insertive balancing the other choices that homeowners are Property Owners make in terms of making decisions about whether or not to make the investment to add new to you. It's one of the questions or concerns that we here regularly related to removal of the owner occupancy requirement is that the proposed changes to increase ATP production will accelerate Redevelopment generally in single Family Violence increasing speculation and displacement. And so some some of argued that the owner occupancy requirement is one of the strategies to sort of hold that off in the environmental impact study that we conducted for this proposal. We evaluated the potential increase for speculation and displacement by looking at how the proposed changes might impact the underlined development economics and single-family zones and how these changes will impact a TV production. We use that analysis to understand what the effects might be on housing affordability and displacement. So if their proposal were to increase speculation of displacement, we would expect that the number of teardowns and Redevelopment of single-family homes would increase and that renting for units on one single family lot would be the most profitable development outcome analysis. Do not really support. Conclusion. We consider whether the changes would modify land values such but a developer who intends to redevelop the property could afford to pay more for the land and that's outbid other buyers are pressure current homeowners to sell but what we found is that land prices are likely unlikely to change substantially substantially due to the proposed code changes and that's that finding is especially true in areas where we find lower-cost housing and also the areas where the city has identified neighborhoods that are at a higher risk of displacement. So we found that about 4.4% of parcels and higher price neighborhoods will a day to use over the 10-year. Compared to 3.5% and medium price neighborhoods and 2.8% in lower price neighborhoods. So this is not to say that displacement in speculation and housing for affordability is in a concern. It's just not I'm from the analysis. It doesn't suggest that these changes would accelerate that. It's also worth noting that while some cities like Portland don't have an owner occupancy requirement a recent survey that was conducted of 80 U owners and residents found that about 64% of properties with a to use have an owner-occupant on site. So even with removing it that's still a choice that many people are making That's consistent with some of the feedback. I heard a couple years ago when we were out doing community meetings on this for a lot of folks that were owners in occupied and plan to but just the uncertainty of a transfer for a job or move somewhere to take care of a family member with that. You got to leave something. They can't in that uncertainty was a risk. They were willing to bear out of the recent survey work in the Portland area where people sort of a building an Adu initially for a number of reasons. Maybe it's rental income to help them pay their mortgage or to provide housing for a family member or friend or that sort of thing, but that I did actually use of the ATU a sort of changed over time because their needs have changed or the family member who was intending to move in no longer needed housing and so having some of that flexibility with the key to making the decision about when to invest in adding that accessory dwelling unit. So as I noted, however, you know previously with or without changes to a t u r regulations housing affordability and displacement will continue to be a concern ultimately the housing demand generated by saddle strong job market the amenities here and all of the factors contributing to growth will continue to lead to a tight housing inventory that will likely also continue to contribute to high housing costs. So while we recognize that the land use codes changes alone or not enough to address all of those issues. There's additional policy work that has come out of the racial Equity to okay that comes member O'Brien's office LED as well as other work that the office of planning and Community Development has been taking on to try to address some of those other concerns. So as a package of changes, it may have some impact. So in terms of considering the owner occupancy, there are number of options council members consider could consider including not adopting Not eliminating the owner occupancy requirement eliminating it as considered in the preferred alternative. I'm you could also consider. I'm an option that I didn't list here, but that was embedded in their proposal in 2016, which would be to keep the owner occupancy requirement but have it expire after one year or two years or just for an initial. Of time you could eliminate the owner-occupant owner occupancy requirement, but require continuous ownership for a minimum of one year prior prior to allowing a second ATU that's what was contemplated in the preferred alternative in the in the ass and you could also consider adopting an incentive zoning program for the second day to you or for other components of the proposal that could include any incentive zoning approach. That would only allow us a second 80 you have one of the units on the lot is rent and income restricted. I'm out here that there be a requirement in under an incentive zoning seem that that. Of affordability would be a 50 year term and on a lot with only a couple of units that might not be there might not be enough rental income that could generate from the property to support that rent and income restricted units. So it might significantly restrict the number of people who opted to take advantage of the second ATU if there is that running income restriction, but I'm continuing to work with staff to try to identify options that might be workable under that approach. Another approach would be to only allow a second day to you. If it needs certain building certain Green Building requirements that could also be combined with some of the other proposed changes to size or locational criteria for detached accessory dwelling units. Appreciate the fourth option. There was something that I would love to see us as fluorite. Would love the idea of affordability. I realize it's kind of challenging at the scale to make it work. And so but got my fingers crossed we find some creative way. But I also think you know a high standard of Green Building be another anyway to refresh to incent at high-level Green Building something people to explain this time around the affordability piece. If it's not something that works through an incentive zoning scheme. So next steps following the discussion today. Ideally, we'll have a decision from the hearing examiner coming out sometime soon at the end of May. There's a briefing in discussion planned on the entire proposal followed by a public Hearing in June and potential discussion and vote on amendments and the legislation. I will know that the public hearing notice for the June 11th hearing will be published on Thursday of this week and a initial draft of the legislation will be posted for public review and that will represent the proposal as outlined in the preferred alternative. It's likely that the legislation that would that comes number of Brian May sponsor may have some differences and that initial draft that is posted but it will be within the range of options that were considered in the CIS. And I think I have been saying May 28th earlier in the meeting and I appreciate you saying the end of night May 29th is a special committee meeting on May 28th. So thanks for dinner. I hope that is correct Memorial Day is Monday in the schedule. Because I'm happy to answer questions. I have several questions. I can go back to the first one is what impacts on on street parking do you expect to see as a result of removing the off-street parking requirement? So we looked at removing we looked at several options in the is for removing the the parking requirements for accessory dwelling units the first I just want to stay for the for the record that the parking requirement for the existing single-family home would not be a limited eliminated. You just couldn't you wouldn't be required to add additional parking for the accessory dwelling units. What we found is that that there were not be significant impacts it to on-street parking by removal of the parking requirement. We did know that in some areas were parking is constrained. There may be some localized impacts that could be addressed through other strategies or a geography a geographic based parking policy. But in general we found that they were not be significant impacts and where parking is most constrained. It is often in areas that dunster closer to dense Urban villages in that sort of thing that may have access to to better Transit and then one of the things we looked at in terms of ATP production When is that remove up? The parking requirement would have an impact at a positive impact in increasing ATP production? Cuz it would provide property owners more flexibility and choosing sort of where to put a backyard cottage. For example without having to lose their Garden or a tree in order to provide another another parking space on multifamily development last year would requiring bike parking for 80 is be feasible with his legislation to the to the removal of the parking requirement. And so it would be consistent with some of our other policies to promote other modes of transportation. Got any we go to slide eight. Under the owner occupancy requirement the current code what happens to a homeowner who rent out an Adu who's forced to move unexpectedly but does not sell their house and they can apply for a waiver with the Seattle Department of construction and inspections to the owner occupancy requirement for up to three years if they are unaware and unable to qualify for that or if it is other circumstances, they would either have to leave one of the units vacant and in some cases they may actually have to remove some physical elements to make the accessory dwelling unit. No longer considered a a unit so things like for moving the kitchen or removing the separate the sephardim entrance. and if you answer my questions District specific question based on the comment you made earlier it it sounds like in District for at least that it would increase the production of adu's Aflac question are there any other instances we regulate the number of individuals unrelated individuals that live together in the house or in Space? The the household size limits do apply to dwelling units in other zones, but it doesn't apply to the property applies to each unit where in single-family zones is different cuz it applies to the whole whole property. So it's regulated a little bit a little bit differently. So you if you had two units in a low-rise own you could have eight in each unit in the single-family Zone. You could have ate in both units. Thanks. Thank you for those questions customer. Ali really appreciate your ongoing work on this it's been a pleasure working with you for years on this and look forward to ending that relationship for like a decision one way or the other great things together, of course. So for the public will be back here in a few weeks contingent upon what we hear from the hearing examiner. So look forward to that and hopefully look forward to for the conversation around these policies with some specific legislation in front of us in the coming weeks. Thank you to our last but not least important item on the agenda the office of sustainability and environment 2018 race and social justice report. Did you get settled? I want to thank you all for being patient today. Sorry that we went a little long, but I'm really excited to see your report. Settled the director of the office of sustainability and environment. Hi, I'm Robin Kumar and I managed the fresh bucks program NYC. I'm to read a Goodman. I leave Communications and Outreach for fresh box on Sandra Pinto debater. The urban forestry policy advisor mine always see everyone. Rate, so we are very excited to share with you some of the work OST did last year to advance racial equity, and we are also aware that we are running late. So we are going to do both those things together and hold both of those truth as we move forward. We do want to share just a little bit about some of the Learning Community capacity building and then some of our specific programmatic work and I will try to move quickly through the the general overview so that we can hear from my colleagues digging in to the racial Equity tool kits that we did in our office last year. A quick reminder that ose is Guided by the equity and environment agenda. That is the road map to advanced environmental justice that we developed with Community Partners in 2016. I think we released it that agenda has four main goals that you can see here. We try to align all of our work at ose to ensure that everything we do is advancing the goals of the equity and environment agenda. So am I see is committed to being an office with a strong learning culture where we challenge each other to become better advocates for racial Equity some of the work we did last year included all strength training as well as specific trainings just for the managers in our office with several more trainings and in exercise has planned for this year. But the one thing that I will call special attention to was a new partnership last year with the office of arts and culture office of civil rights spu nosc called Turning commitment into action where we brought together citistaff up partner organization City Advisory Board, and we form the a cohort to really build accountability build build plans of how they will work together to advance racial equity and how they can learn together. Okay, so I know that Sandra and Robin were part of that cohort so could talk about a little bit more if you have questions, but now this year they're taking that long And bring it to ose and doing quarterly staff exercises in training with us so that we can all benefit from from what they learned in that cohort. Of course, we're committed to ensuring that reflects the communities we serve in 2014 OST staff was 12% people of color that grew to 31% in 2018. Obviously, that's a positive trend but it's still suggest that we have a lot more work to do to ensure that our office is a place were leaders of color want to work and where they feel like they can Thrive. So we feel like the the internal work we're doing making sure that that we are in office that is driving racial equity and supporting each other and challenge each other in that work is really going to help us be the office we want to be We are we spend a lot of focus on how we can grow Community capacity and Leadership within our community. I'm one of the major ways we do that is with our environmental justice committee that committee last year reviewed several programs and policies and offered in put in too many of them everything from drive clean Seattle to outside Citywide one of the things that's the committee did was established principles for open space and we took those principles with committee members and with a class at the University of Washington and worked with the Ethiopian community in Seattle to do a pilot project. What would it look like to advanced environmental justice using those principles? You can see the pictures here of what that looks like. So we worked with the Ethiopian community in Seattle to have what essentially was a parking lot area before and to turn it into a multi-generational gathering space that folks who use that building can really utilize We got a lot of questions sometimes of what does it look like? What is environmental Equity look like so we were excited to it to be able to show them. We also administer to Grant funds that are both designed to advance the equity and environment agenda. Last year was the first year of the environmental justice fund and we were able to Grant almost $350,000 to nine product project that you can see listed here. We also administer the king Conservation District Grant two years ago. We realign that grant program to ensure that every Grant awarded was advancing the goals of the equity and environment agenda as well. So that provide is an additional $400,000 to advance racial equity and natural resource protection. That's a sizable chunk of money between those two that's great first year. So we don't have any completed projects are the kcd France. We've been able to go out and see some of the deep a projects and see some of the things they've been doing and it's it's really exciting last year. We also we had a communication series called environmental justice in action where we worked with a bunch of Our Community Partners in some of the former Grant recipients to use our Communications channels to really tell their stories and in and get out there the good work that they're doing With our women and minority-owned Business Schools last year, we achieved our goal for purchases are gold with 60% 78% of our purchases were all actually would win but we did not achieve our Consulting goal the main reasons. We didn't achieve those goals first 45% of our offices overall Consulting dollars from spt contracts for fresh box operations. So most of those were from farmers markets and Safeway stores the second reason and that's why we kind of carve out this 12% pizza right now. What year is that OSU really puts a lot of emphasis on working with community-based Partners in community-based organizations as our expert consultants for how we engaged community members. Those organizations are POC lad but they are not eligible to be registered as Wendy's so we call them out separately here to note that we think it's incredibly important that our office continues working. Those organizations, but they're their characterization. It is not a wimpy. Quite sure of the the Wimpy rules for that. I don't know if it's the choice of the CBO is that they choose not to register as at or if there's a characterization different than that. I said thank you. I'm going to cruise through these too quickly because we are very proud of our duwamish dilate or michelly program, but we get to talk to you about it a lot. So I think I won't spend too much time other than to say we released STAAR duwamish Valley action plan really thrilled at the short-term work in your term accomplishments that we've already that we've already completed to reflect that we are committed to delivering on the priorities of the community and we continue that work and we'd be thrilled to get to brief you more on that later. This was more of the specifics of our do Amish Valley work, but we can cruise through that and then move to our racial Equity toolkit so we can ducted for toolkits. One of them was for the electric vehicle Readiness ordinance that we talked about last night. We were here lights here to hear more about this cool kids. Appreciate your your speed with his should we see what I just want to take your time, but look forward to hearing it. So I'm going to talk about fresh box. So I Jessica mention we did to reach Jacalito quits for the Fresh Choice program in 2018 and just to provide a little bit of contacts about what the fresh box program is. It's a program that it provides lorinser have a little bit of a cold. It's a program that provides low-income communities with benefits to purchase more fruits and vegetables provide freshbooks benefits through two main mechanisms fresh box match and fresh box vouchers and fresh box match product provides a dollar-for-dollar matching benefit for customers who Use SNAP benefits on that's a program that had previously been called food stamp and fresh. What's the belchers are fruit vegetable vouchers provided for food-insecure patients to our fresh box RX fruit and vegetable prescription program and also to communities in the food security Gap. Freshbooks benefits can be used to purchase recent vegetables at all 64 fresh box retailers including farmers markets Neighborhood Grocery stores that sell culturally-specific produce items as well as all Seattle Safeway stores in 2018. We significantly expanded fresh box programming as called for in the sweetened beverage tax in for the first time. We were able to provide benefits for people in the food security cap. We also added Safeway as a fresh box retailer to expand access and choice for freshbooks customers, and we develop the Streamline system for customers in the food security Gap to enroll in the fresh box program. Are red team was comprised of Boise staff who know the ins-and-outs of the program myself and Rita and Tiffany other City staff with expertise working within the demographic Refugee community and food access programming and also Community Representatives. The red team was instrumental in identifying communities where we should focus our programming assess gaps in knowledge and develop a community engagement Plan wengage Focus communities and program stakeholders through focus groups, listening sessions interviews and surveys to assess how we could best achieve our targeted racial Equity outcomes. Army nor North Star arrested Rachel Equity outcome is to eliminate racial disparities in access to healthy foods for low income people within our Focus communities are red process Focus specifically on two aspects of the fresh box program how best to enroll Focus communities into the fresh bucks program and how best to structure communication strategies to engage Focus communities for program access and participation. A few thing a few seams emerged after speaking with Community groups and program stakeholders through our red engagement process community members want the opportunity to partner with an offer feedback for fresh box fresh box enrollment at communication strategies need to be multi-pronged and community-based one size does not fit all and racial Equity needs to be integrated into fresh box success measures we've done several things to put these results into practice. The first is that we've expanded our contract and Partnerships with community-based organizations these Partnerships create a system for continuous engagement and feed box or work can be informed by the community. The second thing is that our enrollment strategy for fresh box was designed based on these racial Equity toolkit findings. We contracted with seven community-based organizations to enroll folks in our Estrella priority communities into the program and the street bar chart shows that the strategy worked as intended. This is 2019 but the shows are at the application of of the programming ended into this year. Our communities partners are enrolling a much greater share of focus communities that are open enrollment as you can see public being the Open Enrollment and all the others are community-based organizations that were working with and the final thing that we did as a result of these findings were that we was that we integrated racial Equity success metrics into our freshebuds key performance indicators collecting demographic data and incorporating it into our Key Program success measures allows us to know whether the strategies that we're using our indeed reaching our Focus communities. Do we have every historically collected demographic data? It's like a new base line because you represent all of our program and we have historically collected demographic data on a sort of a subset of customers, but it wasn't across the board. So they can you be fine with targeting clearly works. When you look at the relative number of new customers that are enrolling or they're enrolled for the new or not. I guess what are the percentages across that so this represents the portion of our programming for fresh Box about yours within food security got community is so we're not are open are enrollment. Is actually will conclude at the end. So then we'll have sort of what the denominator is for that equation, but I would say that you know, in terms of all of the the all of the people that were able to enroll through our fresh Box about your program. Truth in our food Security app strategy. This is it. You know, it just shows that the majority of folks that are participating are people of color and that the majority of folks that are being enrolled to our communities organization partners are within the priority Focus Community Partnerships are working. Thank you Robin. So Seattle recognizes that are driving around for is this important not only for public health and environmental sustainability. But also they leave ability of our city as we continue to grow a deodorant Forest management plan is the policy framework that helps us make decisions around to putting a ribbon trees and we began work on updating that plan last year as we started the planning process to do that the update we identified several key expectations the team had for these work one would be that it would be data-driven. We wanted to incorporate the findings of the 2017 canopy cover assessment as well as ongoing and data being produced by a Statz Street tree inventory work. We need to undertake a robust inclusive engagement process emphasizes the impacts of climate change and also set measurable actions that would increase accountability in terms of her. Put these on Equity that we have been working to build upon a previous racial Equity work. We dedicated most of our resources to engaging on the represented communities in what we're trying to do is get their input and their boys hurt before we start drafting any content in our plan and do so in a very transparent way. So we created an interdepartmental team to work on the racial Equity tool kit with representatives from spu City Light is DCI. Obesity in NYC in actually spu's environmental justice and service Equity team. They can of facilitated the conversation and supported the process of along the way. So as we were working on these two kids the team a task. We asked herself several questions including what is it is is I will bring an implicit bias to this process and how is it affecting the way we are taking the plan we looked at racial disparities that an iniquitous that inequities that may have occurred as a result of past urban forestry work. We also added a stakeholder analysis in pondered whether there was a certain groups that might have more influence in in the way we provide our urban forestry services. And also we asked ourselves. How are we going to ensure that? Underrepresented communities have a more Equitable a participation and influencing the process that we developed a partnership with sbus Community connections and Seattle Department of neighborhoods a community liaison and they contracted with community-based organizations to help us conducting to sell engagement. It took it. We look closely at the equator and environment initiative and produce four outcomes for the for these two kids. We wanted to make sure that around forestry policies and programs leverage Community assets address cumulative impacts and burdens related to Oregon forestry prepare communities to adapt to climate change and also support connections between residents people that work in the city government agencies businesses in the Stream. Also, we wanted communities of color to inform urban forestry policies programs and services and we want the plan to explore Partnerships and policies and programs to increase participation of communities of color in urban forestry careers, and also they City 7.15 partners with communities to leverage their creativity in finding a solution. Spread of our efforts we engage more than a hundred and fifty people of color including members of more than 15 tribes. We gave the freedom to these community-based organizations to produce their own a Outreach and engagement plans because they know how to best engage community in I have a I want to share with a couple of examples it Horn of Africa Services decided to actually do not door to door, have the door to their conversations and some of the findings. Is that a people of the East African Community really be that tree so important and they love them but they are concerned about getting in trouble around trees and example, they gave us his you know, in in some of their countries somebody might crash their car is on a tree in Rome. They just take their car limp along and in and take care of it as a private matter, but one point one of their community members crashed into a tree Later, he received a bill from the Seattle Department of Transportation and they were really surprised about it. So we need to work on building trust and sharing more more information so that they feel empowered the Chinese information service center had Community meetings in people believe that treats are very good for the environment, but they have concerns around safety and allergies we found from the African American and latinx Liaisons a community meeting that people want more trees are to help clean the air in their communities and they also are wanting more interaction with city government to build trust and then lastly night Native American they decided to have a talking Circle which was a very powerful way to share information with the community and to allow them the opportunity to talk about trees and how with the receipt us are sacred to them. They'll be kind of the spiritual connection. They have two trees in the concerns. They have around climate change impacts. And with that I'm headed back to well, I will close this out thinking this team and just saying that I'm really proud of the work that they've all done looking forward to 2019 something that osu's really excited to dig into is really this idea around Contracting and granting to community-based organizations. We've heard several times from the partners we work with that. They find it prohibitively complex and time-consuming. And so we really would like to dig into try some new models to say are there ways that the city could be a better partner to open eBay store organization by by figuring out a way to make that smooth ER. So that's one specific thing that we really want to dig into in the coming year. It's great. You know, I tend to believe that all those requirements we put on Contracting probably generally came from a reaction to something. We wanted to fix that the cumulative impact and when folks look at this in the human impact and see what that means is a certain organizations have the capacity to provide that isn't certain folks just get excluded because it's now not even worth it and I are least we the council may be responsible for putting some of those requirements on so if there's if if in your analysis of that there are changes that we need to make from the legislative branch to support that flexibility, whether it's piloting or just a pride thing. We think that there will be a better outcome pitchengine invite that the feedback and would love to work with you. I would love to do that in the next 10 full of months while I'm here, but the hopefully the council will do that in an ongoing basis to How you know the racial Equity tool kit has requires a lot of Engagement with community and that I appreciate the specific feedback. We've heard mention of concerns about getting in trouble and you mentioned example of someone running into a tree in the trees are just going to become an expensive thing to do was there a sense of also assure about concerned especially with heightened immigration awareness that just anyone from the government could be a threat to the people are Community seize the city of Seattle is the nervous about us too or did they get the distinction? I think in our case what happened is that they really are not aware of the efforts that we are putting forward in terms of urban forestry specifically and they were really excited to details and Power by being included. They wanted to build trust by just being in touch ongoingly. Not just when we're updating a plan they they were saying you know, we re You want to learn about it? We want to understand what it is our role and responsibilities. I think in this case, it was more around just that I kind of like a nebulous worried. Maybe I'm doing something wrong because I don't really know and I think that's just what we need to work with Community to just be to have them be real true Partners & Beyond going in touch so that they can provide their input again all the time. Not just when we were having a specific project and we need their input. So I think that was that was kind of like a Common Thread a lot of a communities that we engaged and of course, we're going to reflect that in our in our actions we want to find ways to do as far as they're concerned sent to just make sure that they feel empowered with knowledge and understanding of how we work in that they know who to reach out to For the process what we heard loud and clear as a sort of consistency mean that came through was that there's this even if people get information, you know a flyer in the mail or they pick something up or they see a poster about the fresh bucks program. For example, you're still going to take that information to a trusted community resource and to community leaders that they have you heard about this thing. You know, what is this thing at? Do you think it's a good thing? And so one of the reasons why we thought it would be a really good idea to really just contract and partner directly with those communities organizations and the communities liters is because you know, we don't necessarily feel like we wanted like there's so much work and expertise and knowledge and Power in that Community leadership that we can't really take the role of that and so being able to support that and work in partnership with those Community leaders and those organizations so that they can feel empowered to sort of delivery. Add message and that. Messages would have coordinated across all of these organizations at 8, you know, that the same message that we would be giving I think that has been something that's been really powerful and I think it's it's already showing and in some of the initial results that were saying seems like the more capacity and the ability to support those Assateague so we can have more Partnerships sometimes and I can't take any programs. You know, where is heavily subsidized and it should be easy to do and we can and then we start partying with organizations. All sin Boom. The program's take off when they when they find that right now and there's a building that relationship over time with your organization's so Contracting with this same organizations year-over-year again to sort of have that trust with those organizations in the city. And then making it beneficial to those organizations the real partnership. So I just appreciate appreciate the work. You're all doing just really quickly the do the boards and commissions such as the urban forestry commission today also take the rsji training commission has taken over the past several years a trainings and we've done in its doors to exhibits and also one of the Commissioners worst part of the Rat taking commitment to action cohort. Yeah. Yeah is to have all of our partners kind of speaking the same language and we also last year created and a new position in your grandpa's Reclamation specifically to address Equity. So we're bringing that is at a highly technical commission and we are bringing other positions to actually provide important related. And knowledge and understanding like a environmental Equity public health and also a community representative. Thank you. And if you ever need any volunteers and turns of doing Outreach internet to communicate civilly can use a color. Feel free to ping me. I'm always happy to to do what I can to be supportive and helping her role in increasing the number of services that are available to communities in need. My apologies for keeping you so late in the day. I apologize if I screwed up any of your end of day plans, but I'm really grateful for your ongoing work and appreciate ya. Thank you. Keep it up. Break down. Anything else for the committee with that we will be adjourned to pick you all.", "end_time": 9040.0}]}