{"format": "raw", "annotations": [], "confidence": 0.9464635868648906, "data": [{"start_time": 0, "text": "The big transition. All right. Good morning. Today is Wednesday, July 31st 2019. It is 9:32 a.m. This is a special meeting of the gender Equity safe communities new American Education committee. I'm council member login. Gonzales. And I know that my two colleagues will be training at the table a little bit later. So why don't we go ahead and get started a little awkward cuz I have to approve the agenda and there's nobody at the table. Was the first we'll discuss and vote on Council bill 11958 which is an ordinance known as a DNA will conform to tell me to spell code to state law for crimes that require the submission of biological samples II the community police commission and the office of Inspector General represent the ordinance in intelligence report also as required by ordinance, then we'll be having a discussion and taking a possible vote on retiring a couple of clerk files relating it to the Seattle police chief 2018 annual reports and the chief of police audit report as required by city ordinances and present their 2018 annual report. Also once again as required by the 2017 police accountability ordinance. So before we continue through the very full agenda What we always do witches hold our regular. Of public comment. We have no one signed up for public comment. So unless there's somebody in the audience who wishes to give public comment and didn't get a chance to sign up Brianna Thomas. You do not count. Any others who wish to give public testimony before I close up OKC no one comes forward. We're going to go ahead and close out the. Of public comments and we'll go ahead and begin the process of getting into business for the day. So I'm going to have Roxanna Reid agenda item one, which is the DNA bill and I would invite those folks are here to present on the DNA building. Please make your way up to the committee table q1 Council Bill 11958 9 and organs relating to the submission of biological samples for briefing discussion impossible mode. Thank you Roxana. Hi, good morning. Good morning. We have a PowerPoint presentation for this this will just be an oral presentation. So why don't you go ahead and start with introductions Greg will start with you and then we can go and I will go ahead and hand it off to Great. Are you going to do an introduction and then we'll hand it off to the other prisoners? Thank you, Greg. Cancel Central staff John shot Deputy City attorney Kelly Harris chief of Crim division City Attorney's Office in the making and I'm really excited that we have an opportunity to have a discussion today and possibly voted out of committee. So Greg, I'm going to hand it over to you to walk us through your cancel essential staff analysis and report and then we will head down the line to hear, great. Thank you madam chair. So Council bill 119-5890 would conform the Seattle municipal code to state law for 10 serious or sex-related crimes that require submission of DNA. The Washington State Patrol crime lab, there's a list of these crimes in your staff report by way of background the wsp crime lab processes process and entered into the federal combined DNA database all DNA from Seattle misdemeanor offenders in till 2014 and 2014 the crime lab inform the city attorney's office that it would no longer accept DNA samples from Seattle because Seattle misdemeanants are convicted under the SMC code instead of the RCW the city however continue to collect DNA samples and now has six hundred and fifty of them stored in the Seattle Police Department's evidence unit in a moment. The law department will talk about the legal developments that now require the state patrol to accept that DNA evidence and they'll provide some history of the issue and why the bill is before you here today before before I turn it over though. I should mention that I contacted the Washington State Patrol about processing of the 650 samples. What they had told me is that they have a Statewide bottom-up backlog so they will not be able to get to all of those samples until next year as the interim nightly and FBI algorithm runs to see if there's any match with any other DNA in the system if there's a match law enforcement is immediately identified. But as I said that would happen on a piecemeal basis sometime over the next year and without a turnover the Law Department lets you have any questions before we get to the LA Department. Can I ask Rebecca can ask you to just give a quick report on or you know how to give us an update on some of the work that you prioritize off half of the city and other stakeholders in Olympia this year that is sort of laying the foundation for on why we're taking this action today. Yeah, absolutely. Thank you. So this is a conversation that we've been having an Olympia since the state patrol made their decision in 2014. 2015 that they would not be processing DNA collected under Municipal ordinance on convictions. It's an issue that we worked with the Coalition of sexual assault programs on state patrol. The Attorney General's office that has a number of other cities and the question the big question that had been happening in Olympia for several years was whether or not this was an issue that could be resolved by City's taking actions such as the one we're going. Hopefully we're going to take today or if it needed to be stayed action last summer representative or wall has been a huge champion of this issue for many years. I submitted a request for an attorney general opinion asking the question of is this an issue that cities can solve by incorporating the RCW or must have state take action. We actually got an answer back in the middle of the legislative session this year which is late for action, but we had several champ. Including representative Orwell representative Goodman, Senator Peterson representative. Jenkins many folks came together to put into state law a recognition that we do have 650 on Sample sitting on ourselves. And so with those State legislation does is say we and other cities were similarly situated have until I believe January to change our laws to incorporate the RCW and the state patrol now has the authority to test those samples that we currently have so many years of conversation. I'm so excited to be I have the solution on the horizon and they're really are a number of really great organizations. I'm sure I didn't lose all of them are awesome organizations in a part of these discussions and problem-solving in Olympia and hear great. Thank you. Any questions for Rebecca council members get it before I move on. Okay, great 100 / 2 hour city attorney's office. As Rebecca mentioned this is part of this process that we've been working through in Olympia for a number of years since the crime lab stop accepting our DNA in 2014. We got the Attorney General's opinion, which was really necessary to clarify for us whether this could be addressed at the city level or at the state level the legislature did exactly what we needed and now we have the opportunity to fix our portion of the issue. So the nuts and bolts of what this bill actually dies is it incorporates certain State crimes into our city code by reference there every city in Washington is required to have a son criminal code up. There are several hundred cities in the state and they all right there code slightly differently Seattle has traditionally had a separately written code that doesn't do any incorporation by reference. But since the Attorney General's office clarified that incorporation by reference is necessary for municipal DNA samples to be accepted by the crime lab. We need to take this step of incorporating UPS. Importance of state law into our code by reference in order to have the DNA samples accepted by the crime lab substance changes to any current City crime games and it would make these crimes identical from in terms of a legal elements in the city of Seattle and elsewhere in the state times in Burleson. Creating any new categories of crimes that currently exists within Municipal Code promo code the process for how we worked with the courts and the crime lab for submission of DNA and what this will actually look like in the Criminal Division. Thank you for allowing me to explain a little bit about how he's going to change things for the rank-and-file assistants who are taking these samples currently like you discuss there's no sudden of chain. Is there anything to see how cold is no change in how we know what we need to prove? It's not adding any additional crime categories are or fences. I just provide the mechanism for the Washington State Patrol to be able to accept the samples. We've been working with the state patrol with the jail King County jail and Seattle Municipal Court to refine the procedures for how this is done since this burn will now largely fall on the King County jail for collection of in custody samples and Perez pd4 out of custody sample, and we've been working on that since the last couple of months since this state law came into effect as we knew what changes were coming down the road, but without this change it would only last but to the end of the year, we wouldn't have a Way Forward after this. So this helps us move forward with one procedure that won't change for the future. And when you say that, we wouldn't have a way to move forward. My understanding is it that means that if if we don't make these changes then by the end of the year, we wouldn't we would no longer have a reason to collect DNA samples because we would just be creating a backlog at that point because we would be able to talk to them. So that means sexual assault kids. Give me a flavor of the types of DNA things that were that were collecting that we would no longer be able to collect directions on any of the sexual misconduct crime. So I'm patronizing a prostitute on sexual exploitation stalking indecent exposure a lot of the crimes that we do now that we are able to collect samples on at the end of the year. This won't pass. Will there be no way to her to have them State Patrol except those into the system and so. That would just go away for us. As a public safety matter we can not have happened and remind me why we can just text them ourselves while they're entered into the state patrol database the code. That is the system that My samples are collected. It goes into that for for the comparison that we could not do without State Patrol because they hold that information. The city does not hold that information itself so we could test but it wouldn't get us very far because we don't have markers by which to compare the results you so we could have DNA DNA testing results, but without sort of that in terms of the database it would just be information without a match right into the system for comparison. So there is a mole to compare it to which the state patrol has control of collecting them would mean nothing. Any other questions or comments? Thank you for your work in Olympia. I know this has been something that you guys been working on for a long time. I'm just overall privacy protections and any conversations come up there in a little Beyond misuse of DNA. How is may be used in the future any other protection sideboards that you guys had conversations about that's a great question. So because we're not adding any new crimes and this is actually just found lining the practice of testing DNA upon conviction. This really is alignment and like putting this and these are samples into the same category and treated the same time as all other DNA that's collected under state law or under other Municipal convictions that do the same thing that we do here and it is an important distinction and I appreciate the question is that the DNA collection that occurs in is context is all post-conviction. So it's not like I would have Pretty significant concerns about both the state Bill and this bill if it was a pre-conviction DNA collection and comparison mode that could use her to be used in multiple ways. And we have seen many examples of how those abuses have come to the play and it didn't really resulted in just really broad reach out of people's privacy and we certainly don't want to play into that kind of a system or have that kind of a system but I think for me the fact that this is post-conviction is is a critical piece of it and we did have an opportunity to circulate the bill and with John's help. He created a really handy page-and-a-half executive summary of the bill that we were able to circulate to some key stakeholders including the ACLU Washington and case Ark and others and all of them came back saying that they have no substitute comments on it. Tell her I feel I feel confident that we've been able to sort of structure the city's version of the bill in a way that doesn't modify the standards that were adopted at the state level which is where the conversations and the struggle really occurring around some of the privacy issues and other aspects related to the criminal justice system. Did I overstayed anything that you wanted people have been wrongly convicted of crimes that these are in the in the state database? So it serves a dual purpose Nationwide it show that someone was wrongly convicted. So I think it's important for both of those reasons that we have the samples in the system. Any other questions and then joining us just now the table is cancel Amber Pacheco. So we'll give him a minute to catch up here, but I'm not sure if you have any substitute of questions on this Council Belleville, what's on the agenda item one? All right, so we don't I don't have any other questions. I wanted to actually think Rebecca and a lot of the sexual assault Advocates and Advocates of privacy interest for all of the work that you all have been doing over the last 5 years or so five to six years on really taking this issue. Seriously. I know it took a long time and there are many victims and survivors who I've had an opportunity to speak to directly about why they believe this is an important step for the city of take for it instantly thought that it was an important step at the state level and and I know that many of those individuals that I've talked to gave some very powerful testimony during this last legislative session that really changed minds and hearts around why this was this bill was necessary really wanted to also express my gratitude to representative or while who's been a true champion on the Issues and I thought her foresight and requesting it in an opinion from the Attorney. General's office was was brilliant and and was you know, I know that last year we had a conversation about potentially passing this bill through and I had concerns about whether that was necessary or not. So I appreciated having the benefit of the Attorney General office has an opinion on that issue that this is actually necessary in order to move this this practice forward at the city level. So really appreciate all of that and appreciate the city attorney's office work on this issue John. Thank you so much for spending so much time with us walking us through our initial concerns and ultimately drafting the bill and making sure that we had that executive summary so we can distill a somewhat dense on yet not substantive bill with our stakeholders who have really been following this issue. Thank you so much all for your work. Go ahead and call this one for a vote since it was listed as something that there could be a potential though when it feels to me as though it is ready to be considered by the full Council. So I'm going to recommend that the city council passed at 9. Any additional comments pay all those in favor say aye and you knows no no abstentions. The motion carries on the committee will recommend to the full city council that it past tense of 01019589. Thank you so much for being with us this morning. Really appreciate it. All right. So we're going to move to agenda item to which will be hearing from the CPC and the oig on their mid-year reports. I'm going to invite those prisoners to make their way to the table and I will have Roxana read agenda item to into the record. Agenda item to community police commission and office of Inspector General midi report for briefing and discussion. All right. Good morning. Thank you all for being with us. So we have a full set of percenters today. So I will go ahead and I asked you all to introduce yourselves and then I'm going to have culinary comments on this one. Okay, and then we're just going to hand it over to you all to take us to the presentation. So just a quick round of introductions will start with you Greg Greg. Community police commission commissioner Hotel. Good morning. Lisa judge Inspector General for public safety building grateful. Thank you so much for being with us. That's how you going to take us off. And yes, thank you so much Madam chair and thank U council members for having us this morning. Thank you for letting us present and the opportunity to work in Partnership. We're here today because of the power of community Through the tireless work of community and many of you The Landmark police accountability ordinance was passed just over two years ago. The police accountability ordinance uses the power of transparency to Foster accountability through subchapter four mechanisms to support accountability at section, 3.29 Point 400 of reporting of potential misconduct in police account ability issues. It does this by directing the CPC and office of Inspector General 2% midrib report to this committee about the status of our organizations recommendation. The SPD and the timeliness and effectiveness of the Seattle Police Department's response. We're here to do that today. And we like to take a moment to recognize the progress. We've made an accountability today for the first time. We have all four agencies, including three civilian that accountability partner sitting here together the CPC the office of Inspector General and the office of police accountability as well as the Seattle Police Department this media report highlights major projects by the accountability oversight entity's recommendations and implementation satisfy SPD. We look forward to continuing to work in this partnership. I'm going to turn it over to CPC culture. Great think of a good morning. So I will start an introduction of the four prongs of our accountability system. The CPC is the community voice in the police report process. Oig is a civilian and provide systemic review of SPD and their policies the OPA some mix-up civilian-led and has sworn officer handling investigation of possible policy violation by Speedy employees SPD is on the front line of accountability and provide Public Safety PowerPoint presentation will be the lovely assistant for this. Thank you. Okay, so I'm very good at it though. I apologize. That's alright. Okay, if there's a team so far in 2019. It's collaboration the four prongs of the accountability system have worked together and many issues with convened. Welcome in quarterly meetings with s p d c p c o i g n o p a to discuss Arcana on Airport. The cpc's major projects has mostly involved creating cross-agency panes y g c p c o p a n s p d are all working together and improving police police enter interviewing techniques LPNs work together to create new system to better address Opa management action recommendation that are proposed balance changes initiated by opa. So the collaboration includes a lot of work implementing initiative I 940 i940 pass with 60% of the vote in November. It includes mandate for more training independent investigation of Police use of serious. And then the forest and created a good faith standard in Washington one big Ray. We're leading in the airport to implement. I 940 is the sad fate. Sorry, I'm so in the companion 3 solution to the accountability legislation Council as the CPC explore ways of conducting independent investigation too serious and then they use of force pulling outside of SPD. We can bend the serious and then the use of force task force in May 2018. It is his staff and funded through the CPC. The task force is made up of community and law enforcement leaders c p c o i g o p a s p d and other system partner The password is expected to have its last meeting on August 16th. They're already agreed this statement about the volume is an expectation for independent investigation post i940 data recommendation. They'll be considering in boring in August include but are not limited to improving support to families impacted by police use-of-force proposal or how to conduct independent investigation without relying on other police department and ways the police and civilian oversight agency is going to come together and the aftermath of serious and that Lee uses of course, this is what happened and see if there are policy or training changes that needs to be put in place that could have avoided that again this recommendation are in the drop space. We expect them to be voted on the August 16th. and Bessie jump in if anything I miss to the CPC has also participated in the Statewide airport in current training practices with increase training requirements of I 940 Washington criminal justice training commission organize those efforts the CPC participated in other community in Port so during the process we help suggest line-by-line relation to the rules under consideration help create an outline for the 200 or so hours of training required by i-940. We help direct people to get their input to the training commission online public domain commencing portal. We also help people with mental illness who are currently incarcerated give their input by collecting their comments and bringing them to the training commission the first-hand experience with arrest in the system gave valuable inside. We also have informed Community groups with our experience participating in Crisis Intervention training. The new world were approved by the training commission last June. We're now participating in a similar training commission lead process about how independent investigation should work in the Washington. The CPC is participating with community group s p d o p a n o i d in this process so far. There's been three meetings between case stakeholders. We hopes that fits recommendation will play a critical role in the Statewide the training commission plan to host public meeting in the next month or so. They expected to release the role sometimes in September. K consent decree compliance has been a lot of pork and put a lot of pressure sources to our consent decree compliance that's largely been centered around protecting police accountability reforms after this recent police contracts were approved in February. We submitted to the court with our concerns about how contract could impact police accountability and may the Court held status conference while it did find some SPD in compliance with 10 areas of the consent decree the court found Seattle out of compliance in the area of police accountability the court order the city to work with the doj Monitor and trim and CPC play identify the gaps and witnesses that have been created in the circulatory system. Since then the mayor's office has gotten an extension from the court and hired a group of out-of-state consultant Community groups how many of which were instrumental in the consent decree being enacted have expressed concern with the mayor's decision? The mayor's consultant plan to file their trap metal methodology for their work with the card this coming August 15th. K klansman thought called Hotel caught this party review part 1 independent evaluated speed is metal made $2 for this review. Think that's report phones people of color were more likely to be prayers by Seattle Police than white people. That's despite. The fact subjects of color were less likely to be fun with weapon when pressed by white people. People of color were also more likely to have firearms pointed at them during police stops than white people SPD bias-free policing policy required apartment consults CPC in oid to explore ways to reduce disproportionate impact like this. So the CBC also went on to make recommendation to the chip Ackerman best after the report was published those recommendations include better. They celebrate this segregating the beta in pewter disparity reviews be encouraged SPD to find ways to utilize their soon-to-be Heart Community Service officers to help reduce disparity. We ask a speedy thing gets impacted communities about this party. Finally. We recommended SPD leadership create a plan to address disparity since then the CPC and SPD have partnered to pray the plan to hold convening which will engage impacted communities in this process before September. We're working together to create focus group to review interactions between SVT and the community and gain insights from community members about how interaction could have been better. As far as creating a plan to address disparity as found in the report SPD has said it's premature to discuss changes to practices. They want to see the result from part 2 of this report which day will have more data and he shall resorts results from part 2 of the schedule to be available in late, October. Okay, we have a new one officer Wellness. The CPC is also focus in the ways to increase officer Wellness Recruitment and Retention. The CPC has been doing ask pick up this work for a while and recently quit read committed to exploring this intentionally intentionally intentionally with the creation of an officer Wellness wardrobe. There are two parts to this word. The things the CPC will be doing in Partnership and the things will be looking at independently as far as partnership cpcs video IG and opa have all began conversation about how we should approach this work. Jointly the CPC and speed speed leadership have also been in contact, but then the needs to be identified in regards to mental health and Recruitment and Retention. The CPC has a sign. The scope and guide this work. Other CPC priorities, why were giving you some highlights? We're working on much more that includes Community engagement with a sign Commissioners. Don't seven Council District to The Lazy Song for the CPC in those communities with vinyl ICPC 101 a presentation. When we began given Community to educate people about Seattle's accountability system. We've also focus on youth engagement by partnering with o p a and a speedy to go to Cleveland High School work with young people to help them become familiar with police accountability oversight the police surveillance and Community Service Officer program. And CPC is also looking at ways we can I quit of me. Address the spike of hate crimes. Our area is seeing we're working with Speedy SPD to improve their public disclosure process and gain more insights about 911 the spots were also sending some Commissioners and stabbed The spd's Crisis Intervention training. Collaboration we're working with our accountability Partners II operation trainings and Pagan trauma-informed approach approach to this work. We're in the final stage of implementing rc7yc policy recommendations hacking database. We're also working the parade in service training for SPD officer to give them more insight into a Seattle's accountability system and see if he's at 7 CST PC internal business has this is all on top of some big changes happening within the CPC the CPC will soon be making plans to how to choose a permanent executive director 8 new commissioner. We're also disappointed to the CPC. So we're so we have been focusing and boarding them and helping them to get to respect to our work. And so I'm going to hand it out to that Whitey. Now we have been doing work in Partnership specially around places police interviewing techniques, and we look forward to continuing our collaboration going for a ride so we wouldn't be so before you kick off. I wanted this seems like a good point for us to pause. And in the event that any of us colleagues have any questions or follow-up comments for the representatives of the community police commission her at the table. We got a quiet quiet. I am usually I'll get a hot bench but not today, I just want to thank you all for your work before you move on. It's been there's been a lot of transition happening over the community police commission and there are a lot of Demands on your time. And and I really appreciate you taking the time to come here and chill with us a little bit more by your work. I don't have any follow-up questions on this because I have an opportunity to meet with members of the CPC and and staff of the CBC on that very regular basis and familiar with all the things that you are doing and I'm grateful for that ongoing partnership. It's very meaningful to me and the work that I continue the do on the city council. So thank you. Thank you very much, So Lori, I'm going out. Brought over at Lisa. Thank you. Thank you Emma and good morning Madam chair and council members. I appreciate the opportunity to come and speak to you today about the work that the office of Inspector General is doing before I get rolling on the substantiv part of my presentation. I just wanted acknowledge and really express my gratitude for the partnership that I've experienced in building the office of Inspector General. We've been open for business a little over a year now and the collaboration and relationships that we've established with Opa CPC in Seattle Police Department have just been invaluable in setting up our office and getting our operations running. Also, I would like to acknowledge the communication that's mandated in the ordinance that's built in for a quarterly partner meetings and these meetings I think it's a great way to have structured conversations about the work that we do together. And we've been able to as partners in between those moments establish relationships that are really good to build our operations so that we're working in concert not duplicating working and complementing the work that that we're all doing. So I just wanted to preface my remarks with that a little bit. So my office has really three main functions, there's a policy and best practices function an audit function, which is the meat and potatoes of our office and then a couple of folks that engagement Opa oversight. They do conflict investigations for allegations of misconduct involving Opa members, and they provide input on classifications of complaints and certification of opa investigation. So I'll talk a little bit more about those in a few moments, but I want to start by highlighting a joint project that we have ongoing with CPC Seattle Police Department and opa in terms of working to innovate. In the interview practices with the Seattle Police Department, I think my office because we do some investigations in the office of police accountability are also partnering in the actual process itself to use what comes out of this but we've engaged Annex a subject matter expert in interviewing and interrogation practices from the UK who uses science based on sorry. I'm not advancing my own slides properly now, but I was really hitting my stride and evidence based research has been done in the area of of human communication and memory and an interviewing to use that information to build a program that's internal to Seattle so that they could Create their own policies and create their own training program to provide ongoing training from officers coming out of the academy to get some foundational knowledge and how to effectively communicate with residents and end folks involved in criminal investigations all the way up to specialized investigators, like homicide and sexual assault detective to need special techniques an in knowledge. So it's pretty exciting project. I think it's been very collaborative thus far so I'm really appreciative of everybody has been involved in that and happy to answer any questions about any of these projects as we're talking. So I want to start a little bit about talking about some of the work that our policy analyst have done just in terms of making sure that we as as the office of Inspector General engaged in. Our own education so that when we do an analysis of a process, we're coming at it from a place of solid foundational knowledge. So one of the projects that we just completed and that we hope his is assistive to our partners into community and external stakeholders is a complete mapping of the entire SPD disciplinary process from the initiation of a complaint all the way through to any other final arbitration procedures that go on and I'd like to acknowledge the collaboration that we've received from so many of the partners who play a role in this complaint process in one way or another Opa SPD including many aspects of their operations that helped us out. The Seattle police officers Guild the Seattle police management association, the city attorney's Labor Relations folks and city attorney's office and the King County prosecutor. So we had a lot of collaboration to make sure that this mapping process was accurate and then it had the buy-in of All those who were involved in the SPD complaint process. So this graphic here, that's up on the board is a very general subway map overview of the process each. One of those processes is broken down and comes with its own individual very detailed graphic analysis of the process itself. And hopefully they've all been made available to you. They will be made available to anybody who would find that assistive in their work. So I think this is I really want to Express gratitude or staffs work on this particular aspect had an opportunity to be briefed on the work products, and I was also really grateful for your receptiveness to doing the work in the first place when the news came out around the officer a Shepherd badly badly. Purple seen it as it was listed on a file results came back in terms of that arbitration process. I had serious and ongoing concerns about how our system was set up in a manner that might have contributed to both the delay in the public release of the results of that arbitration, but also just underline concerns about the substance of the arbitration and how we ended up in that particular with that particular results and had reached out to your office about digging into this body of work to give us a better sense of what they over all this plenary process is in all aspects that are currently there and your office really dug into this work did a tremendous amount of work and produced something that I think is easily digestible. That that is going to be helpful to us as policymakers in identifying additional refinements to this particular process that is incredibly important to us and Incredibly important to the public to make sure we're getting it right and and not promoting A system that is going to a road public trust in our discipline and appeals process when a chief of police does actually in fact find that discipline is merited and that's what this is going to be really helpful particular to those of us who sit on the labor relations policy mejor going to be asked to consider once again had to modify and negotiate with her police unions on these precise tissues. So thank you for the working for colleagues for you all if you're having if you haven't had a chance to have the briefing or see the mapping of the SPD disciplinary process really encourage you to get your hands on those documents, and I'm A couple of hours for y'all to pray these infographics out for us but really strongly encourage you to dig into this information. It's it's very important and the most brilliant part. Was it a i g got a certification from all of the different entities who are involved in this marriage process saying that this was an accurate representation of their pieces of the process. So I have a high level of confidence that this is accurate and inaccurate in Fair depiction of what the system is. So thank you. Thank you very much. I appreciate those remarks and I appreciate the acknowledgement of the hard work of of my office of the the staff really did go I think above and beyond to produce something that's both detail that a granular level and accessible to most folks. For those of you who are more like me who aren't process-driven people. My office is very happy to come and do a briefing. Are you in and walk you through all or any of the aspects of it that you would like in and we will provide any training or explanation that that would be helpful to anybody. So thank you and I would like to say that all of the materials that we produce are available on our website these materials and in the reports that I'm about to talk about are available there as well. Okay, so let's go Into Audits and assessments and I want to talk about a few of them that are in progress right now. The purpose of this meeting today is to advise you on recommendations that we've made in the status of those recommendations as these are in progress. There won't be that portion of the show, but it will highlight the at work that we've got on going and then I'll talk about some of the reports that we have completed for you. So as you know audits are really the backbone of YG's accountability work the way we decide on projects to audit is we take we prioritize the areas of public interest and that we do a space analysis to to really try to dig into the potential for harm that might result if these areas are going Without attention and the likelihood of that harm. So we've got a matrix that we used to to line up the projects in priority order when we take them the ones that we have ongoing right now and one of them is finishing today and will be filed with the court later this afternoon. That is an assessment of spd's Force review board that came as part of the sustainment effort and the previous audit was done by a speedy. But since there has been some acknowledgement that oig will largely fold into the function that has been Been done by the Department of Justice in the federal monitor in terms of ongoing systemic oversight will fall to oig we've begun folding ourselves into some of these processes and one of those was conducting it's called an audit in the court paperwork, but it's really not an audit in terms of gagis standard. So we are calling and assessment in these materials. It will be called an audit in the court findings. So that is it was fairly comprehensive. Look at not only Force review board meetings that were attended this spring up. There was a sub a subset of them that were identified by the Monitor and doj but also a look back at the training for three board members of had interviews with Force review board members and other things to provide some foundation and context to the makeup of the board to how its own members leave it to operating. So I think that'll be of interest to folks. We're also beginning a mutual-aid audit and that has in some ways taken. little bit of a life of its own because there will be some look at how immigration policy is followed by spdate SPD officers when they're not operating within a formal SPD chain of command into the overall goal of this and the objective of this audit at this point is to look at how SPD officers operate how they engage when they're working with a task force or working under a mutual Aid situation where there may or may not be a formal SPD chain of command that gets ordinary review like the work that has been really concentrated on by the Department of Justice in the federal monitors are going to look at those operations outside of typical SPD change-of-command. We're going to concentrate our efforts with this go around on this process on topics that really impact constitutional policing. So we're going to look at use-of-force how forces reported and investigated in outside chance of command how persons in Mental Health crisis are dealt with where to look at adherence to SPD immigration policy and how operations involving First Amendment expression are handled out there. So those are some of the topic areas that we have on tap at this point and we're still in the beginning phases of that. Audit meeting with external and internal stakeholders to really Define our objectives with that one the other one that's about to get underway as an audit of the canine operations and we are in the survey face at this point. So that involves meeting with stakeholders and trying to refine our objective. So when we have more information available about that, I'm happy to meet with you and give you a brief 9 audit. Do you have a sense of how many I don't know what the title is Chief coroner for the canines. Is it like what highway we refer to them other than just canines? I didn't like a title or something. Okay for 5, I think the temperature of a Sniff Dog. You better friends with the inventory was of of canines on the in the police department's if it's a limited amount of focus on the patrol K-9 function, not the detection function, okay. Okay. I'm also if any of my colleagues have anything to add to anything I'm saying. I know that I'm running through this little bit quickly training that will be doing so a limited number of detectives went through a related training and peace model. And so we've already begun efforts on and I think that the other training is coming going to be coming in that you referenced will really build on those efforts and speak to something Department Wyatt, even you know, and I will roll this out slowly, but I think it's going to be a good thing. And I would just chimed in 4 for the canine worked at Lisa's office is doing really appreciate it. That's one of the things that we had discussed and flagged for both the department and for do I G we've issued from okay, I think three or four management actions now policy recommendations that flowed from some canine cases that we saw and looking at you know, how we can revamp the policy. I make sure the manuals cancel my policy and then make sure that we're training to the policy and training accurately and hopefully that stuff that you'll cover but there's a new policy that's coming out has been totally Rewritten and that will actually be filed with the court today with Rusty. So Force policy and then be issued when we hear back from the court great. And Lisa your eyes taking all of those modifications into account. It is looking back. And only looking back that is an excellent question Madam chair and always good at those that'll be something that we determine in the the scope in the objectives of our audit, but it will certainly be a look back at operations. I don't making any recommendations or looking at what STD is already done to remedy any sort of concerns that we might uncover that will certainly be part of it. So it'll be folded into the report and the discussion. Thank you. Yeah, I just like to mention that with any of our formal audits the subject of the audit which is generally SPD will have an opportunity to file a report about how they intend to act on our recommendations if they intend to implement them are not so that'll be part of that are final reports SNES a speedy response. Turn living on to Audits and assessments that we've completed. The first project that we had was a Firearms inventory review that came as a result of a complaint from someone who made allegations that SPD had a number of missing firearms and other inventory. So folks did a little investigation and they were able to determine that in fact over the course of a a. Of a couple of decades. There were in fact 8 firearms that were unaccounted for in spd's inventory and we identified a couple of processes that were largely responsible for that one is firearms that had been converted for SPD use through perhaps they were in their property or they were evidence that we're not claimed by someone were turned over made part of SPD property were kept on a separate list than the regular Firearms inventory list and so they hadn't married those lists up yet and some of these things SPD had uncovered just as we were embarking on our audit Assessment so we made 3 recommendations and SPD agreed to take steps to respond to all three of those suggestions that we made and I'm not sure if you want details about what those were or cuz all of this is available. I think in the reports themselves, do you want me to go into any detail on that? Or I don't think so right now since we're trying to keep it general for today, and I know that we some on some of these we may need to make space for you later date and time to come back and do a report out on some of these perfect. Okay. So the next project was our first formal audit and that was an audit that's required by the code. It was spd's compliance with chapter 14 12 collection information for law enforcement purposes, otherwise known as the intelligence audit and I'm not going to really talk about this at all because we've got time set aside and if there's extra time I'd like to reserve that for my lead auditor on this project to come and go into some detail on this with you unless you've got any particular questions now just move on I don't have any questions. So little bit more about our best practices research. This is another recommendation that was made to Chief best in SPD last fall that SPD Implement some sort of peer Intervention Program which would use social science and evidence-based research on by the bystander effect and create a program to to teach and give officers tools to become active bystander with each other to essentially created escalation program for officers to help Piers sort of step in and take over when when perhaps they're having a moment where conduct could be there in two unprofessionalism or misconduct and help each other out to be each other's keeper and that program my office and some members of SPD attended a training on New Orleans epic program, which is one of the main models for this kind of program and we've agreed with SPD that they will develop in. Atlanta program we think the most effective program would be one that's built by the line officers in line supervisors because they're really the beneficiaries of this kind of program in the end. It's like more meaningful and more impactful if it comes from them deciding ways that they can help each other out in those circumstances with full support of the chief in Command Staff. So we're going to be working in providing some technical assistance to SPD as they develop that program and just want to interrupt for a second. So I really think this also fits in with our early intervention system with our officer wellness program is expanding its all part of the Health and Welfare of the officers in the service that they give you and then the public so yeah, we are really viewing this as an officer wellness program. It's only effective if it is non-punitive so that that's one of the main facets of it. It's great any questions or comments great. My policy on best practices folks have also done some work with spd's audit and policy research section to try to improve their processes. They worked on a process flow improvement with how policies flow through their section in terms of revising SP policies rewriting them generating new ones. We discovered that there were some some choke points in areas where a policy might move along in the the revision or adoption and then get get jammed up somewhere and so our folks have worked with SPD to map out who's responsible for what part of policy development may be some time frames that are acceptable involved in those in a way to manage policies as they flow through the system. So it's more effective the work that we're doing with spd's internal audit and policy section is intended to help them become more effective and efficient and act as a force multiplier for IG were very small office with not much not Resources are our staff is fairly small. So to the extent we can have SPD providing internal looks that give us additional information that's assistive I think both to SPD and to oig As I mentioned we have three areas of operation in the last in a minute to talk about is our Opa audit function. So in addition to auditing policy work, we have an oversight role regarding how complaints are are taken in and handled by the office of police accountability. Largely we Determine if Opa has appropriately classified something for investigation and if they have thoroughly objectively an IND accurately done an investigation of that. So I just want to at this point really compliment Andrew and his staff for helping us along in this process and helping us to refine the ways that we work together. I think you're going to talk a little bit about management actions and stuff. But I just want to say that the collaboration that you've you've extended to us has been invaluable for us. And I really appreciate it. So are our purpose there is to improve the transparency of opk's operations and to make sure that what they're doing in terms of investigation and review of misconduct allegations is appropriate for Community Trust and in effect of operation, so one of the things that we asked the former Opa auditor who is a contract employee before my office was an operation was to provide a final report about his observations of opa in their operations. And that is also available on our website. But what the previous OK auditor noted was a marked improvement in processes and operation of the office of opa with Director myerberg taking over the helm and so we used the observations that mr. Francisco Rodriguez had both in terms of what what seems to be moving in the right direction and working well with Opa and areas that perhaps you know, still need continued attention. And so we really built those into our approach to how we we provide oversight. So, okay and I'm happy to entertain any questions about this processor. Oh what you comment Andrew or all the work that he did when he was the auditor Man Dan Levinson before him many of the suggestion said that Tito has made to be started to implement. So and we're looking forward to seeing more collaboration, you know where I was trying to prove what we do and get better. Quick fix screen and that is really what I've got. I'm going to turn it over to director myerberg so that he can talk about his OK management action efforts with SPD. So I buy think it me at the the same group at our last Opa presentation. One thing that we ability that okay has is the issue is called a management action, which is basically a policy recommendation that flows from an investigation so it can arise in a case where maybe there was something that went wrong, but it's due to a faulty policy or faulty training for these OK as perception of faulty policies in training. So what I can do is I can make a recommendation to the department to change policy to create a policy to amplify training in the department. Would then consider that recommendation to cheap Corners great pleasure. I've issued probably 60 of them in the last two years. It was a pretty yeah. You're welcome for my It was a pretty non streamline processes Inc. When we first started. What would happen is that I would write up my case. My name's I would write out the BCM in a letter between send it to the Chief and say could you please address this but we had no database there was really no records going back and forth. So in the last year, I would say Monique who's going to keep repeating this with Kathy winter off in Jeep corner from SPD and working to create not just a database of working database of these recommendations, but also a process of sharing them. So it's not this paper process going back and forth now, it's all done through our database. So it's it's great. It's a streamline everything. I think it's made it much simpler to receive a response recommendations. Let me think the great thing about it is when it gets assigned within the database one person owns it at any one time as they can track it really easily and then all the information that happened within at this in there. And in the other thing animal that Monique discussed it briefly, but the other thing I think is again being that it's in a database. It's sort of old extractable. It doesn't disappear. You know, it doesn't give cheap Corner left tomorrow. If I let tomorrow they're still This Record what was recommended what was done and again for accountability transparency continuity purposes, that's incredibly important to Monique. You want to stress my point to this think will be invaluable to all of you. I'm include the fact that we have a tracking table on our website to find the data submission the letter that we submit to SPD with our recommendation about the formal response format PDF on completion. We also are working on as they mentioned our communication feedback loop so that that's more easy to track. We have a timeline that we've established work completion. So we're giving a hundred and eighty days which just lets people know the expectation around and I'm windamar. Maybe completed. We've also worked on clarifying the status definitions for the stages leading to a Mars resolution so that we can just keep them up-to-date and more informed and then we have created a written document that outlines the processes and procedures for both o p a n s p d It's it's it's Twonky and Technical but it's really big step forward. I think for our clever two purposes. I mean, the one thing I think the next step for us will be in and we would welcome advice or thoughts on the council. Is that how do we disseminate the information more? Right? How do we make it available to the public to the public and say okay. It's not just you know, this universe of police accountability folks and it was going on with a large Republic and say, you know, what? Here's the work that's going on. These are the issues that are being identified. I'm in the policies are being changed. So that's a work in progress. But like with all we do, you know if we can push it out. That's great. So any thoughts you have of the appreciate it? So I would just say that in this this is one of those things that worked its way into the police accountability ordinance that I was very skeptical about because it feels weird to legislate the existence of a database and so admittedly I had you know, there's a lot of debate amongst me and others who were working on that issue at the time sort of wondering whether it was really going to work and it sounds like I'm pleased to hear that I was wrong and I like to admit when I'm wrong and I'm I'm flat. I'm pleasantly surprised that that it is been a helpful tool to just have in your documented and institutionalized in an ordinance that is really resulting in a better process and and system that will really sort of allow us to at a minimum as a first step be able to acknowledge and daylight the information I do. The next step is how do you make that relevant to people who are impacted by this work? And I don't have the magic answer for that. But I do think that there's an opportunity to once we have a better set of data and a better understanding of what it's telling us to create more of a narrative around why it matters right? So this isn't just about orbi wonky or you know are people following up with recommendations you how is it actually going to impact the day-to-day lives of people who may be may come into contact with a system and I think that's sort of an opportunity to get creative around how we communicate that information in a way that is collaborative and also really relevant to people who are impacted by the system. Okay, that is a report. Thank you very much. It will if there are there any questions or comments colleagues Co police foundation specifically for the K-9 unit in those dogs are about $10,000 a very expensive dogs, and their training is also very expensive. But so did you say eight or nine Firearms seems to imply that they're out there in the universe somewhere. They could be in a desk drawer, but we know we were not able to determine their location so they may still be within the custody of SPD somewhere or not. We we did run checks on serial numbers. So they are they are not out there. They have not been identified in any federal databases are databases that would indicate they've been used by anybody. So we we And try to take some measures to figure out if we could see if they had left spd's custody and we could not determine that to your memo. Sorry. I didn't come back in here quickly page 4 So this is regarding the disparity review in the report. You say subjects of color were more life more likely to be frisked than white subjects. I'm just going to change it to individuals and found in subjects individuals or less likely to be found with a weapon when fresh except individuals of color were more likely to have a firearm pointed at them than white subject. Then you go on to say that there are alternative enforcement practices that which may include dressing the targeted behaviors in a different way to emphasize in the practice in question or other measures are there other measures that other cities use as best practices that as these discussions continue that SPD is looking to implement or say. Hey, this is a good idea coming from cuz he's a New Orleans is reference in your report. Are there other ideas and best practices is a conversation that you're looking to implement here most of the time. To Seattle Police Department the the efforts and oig put into this was to talk about whether propensity score matching was a good methodology for trying to assess the impact of any disparity on on their operation. So if you want to talk more broadly about and then I'm happy to try many phase one was indeed validating the methodology the phase one before it got to make sure that we were the methodology would get to the date of the we want to get 2 and Phase 2 world. We will dig deeper into the data and not the methodology has been validated and to see okay, where are the disparities and where are the unwarranted disparities and then really look at those and like okay, what do we need to do differently in our operations? You know that certainly it we can't answer that question yet, you know and so we will likely will need to look at Best Practices Nationwide work with a CPC on it on all ideas on the table. Sneezing CPC would like to forward to working with Chris Fischer. I'm taking me to meetings and his plan for Community engagement in terms of convening the community looking at videos that are some things that we're doing that will get to Mundelein root cause issues and will be cross reference. I'm sure with best practices. I think this is so first of all that this report was actually it was done by the sound of Police Department is supposed to be Inspector. General is part of the assessments required by the just wanted to clarify that and then secondly clock at least her city council has a hole cuz our budget process starts in September in and we're running out of opportunities to actually have more substantive policy-related committee meetings. But this is one of those reports that came out was it a couple months ago, maybe three months ago. I'm forgetting the timing of when it came out. I got maybe a month ago a month ago. So do you think it would be if we have not had a hearing on this particular issue and I can't commit to giving you a hearing before it starts. But I do think I do think it would be worth figuring out if maybe there's an opportunity to have you with the police department in particular present to a full council at a council briefing for example, or at some other time where we can daylight these issues and the findings in that initial report and give it some some of its own time. And I do think it's it. It's an important body of works and it's one that continues to come up not only in SPD Zone review but has also been brought up at pretty consistently by the Monitor and terms of his assessments as well. So do you think it's in a it's a important little Nuance niche of the body of work that we need to pay important attention to and continue to work collaboratively on those Solutions including identifying best practices on how to really The needle on this one, what are the things that we did as a full is a council was passed them biased policing ordinance to to take what existing policy and make it a law so that we know and we have confidence both as policymakers and as members of the public that those two will be aligned in the future moving forward and we worked closely with a lot of people at this table including the police department on making sure that we got that alignment just right in terms of the code and what existing policies so I think we have some history and working together on this issue and would welcome the opportunity to continue to have those conversations into really ground it in some of the data-driven work that you all have done. Thank you, and I would be happy to come and present to the council. I think it's really important just us as this wherever this Phase 2 weeks and then to focus on it. Perfect. Everything else colleagues will thank you all for being with us. Some of you I know we're going to stay at the table, but I think some of you were going to go back into the audience and then come back. So we will go ahead and close out agenda item to and I will have Roxanna Reid agenda item three into the record. And if you are here to present on the oajs intelligence report a tasket either stay at the table or make your way up to the table agenda item three Seattle office of Inspector General intelligence report for briefing a discussion. Annalise is it just you? I have my hair go fish come. upside down alrighty Did you read this into the record? Okay. Thank you card office Council Central staff for Public Safety compare today to give a brief overview of oig audit of SPD compliance of chapter 14 12 of Seattle Municipal Code collection of information for law enforcement purposes. And as Inspector judge said you may often referred to as the intelligence out at 12 o clock every 180 days of SPD activity relating to the chapter the most recent Empire Auto was completed in 2015. And I was prior to ID being assigned to function by the city council. Chapter 14 the purpose of chapter 14 12 is to protect certain categories of information before that information is collected by police. It does this by setting specific criteria that has to be met before the information can be collected two general categories of information are protected by the chapter private sexual information includes information about an individual sexual practices are orientation. And this information can be collected by an officer so long it is reasonably relevant to the incident at hand the second category of information protected by the chapter is referred to as restricted information exact definition is quite lengthy, but it can be generally summarizes referring to information about the religious or political affiliations of individuals or organizations. In addition to meeting key criteria including reasonable suspicion that a crime has been or is being committed and relevancy to the crime at hand officers who went to collect restricted information to obtain a written authorization for my unit Commander or higher before that information can be collected by the apartment. Sarah Briefly summarize our findings that we did not detect any violations of the chapter. However outdated language of the chapter of preclude assessment that SPD is in full compliance and I'm going to talk a little bit more about that in the next slide essentially on the outdated language create some gray areas in which we cannot interpret whether certain activities are in compliance are not in compliance with the chapter, but to be clear we did not detect any violations other findings include some training I get cats identified and issues with records retention. The finding one it's the one that I'm going to go into the most detail about because it must directly informs our thoughts about chapters 1412 revisions. Especially the chapter is outdated in terms of its language It Was Written in 1979 and has not been substantially updated since then so it is written in a time when when thinking about how pleased we collect this type of protected information. I was thinking about things like infiltrators and do more direct means of obtaining the information. It does not address the concept of the internet. So website social media other sort of public sources of information or not addressed by the chapter without clear guidance from the chapter. We observe inconsistent approaches with an STD. So the intelligence section does obtain written authorizations every time they think they are touching information that made you can possibly be covered by the chapter other entities within SPD such as a bias crimes coordinator discuss situations in which she felt uncomfortable collecting the information at all because she believed that it wasn't allowed by the chapter or by the department. And then finally we observe some incidents only about 2% of the sample of 295 cases that we looked at it some cases in which We sought information that might possibly be protected by the chapter collected without authorization. But because of the outdated wording, we could not determine whether a violation had a card and a simple example of such as collecting protected information from public sources such as the religious mission of an organization has published on their own website or collecting protected information about an unknown suspect from a third-party such as a witness or a victim of a crime chapter is not clear enough on that point and we did discuss with the city attorney's office as to whether they could provide insight into the wedding of the chapter and they agreed that it was difficult to interpret I think it has a question. But I think this finding number one is a symptom of the fact that we need to update our intelligence ordinance. And we we knew that and recognize that when we were going through the legislative process in 2017 for the police accountability ordinance. And so one of the things that we did functionally he is move that body of work over to the office of Inspector General with with the idea that we would have at least a baseline opportunity to evaluate exactly how outdated was and is but I think the next phase of work here will include making some updates to the intelligence ordinance dead that sort of takes into account the fact that we also have the surveillance technology ordinance. So so I just wanted to acknowledge that I think we're all aware. You know an ancient law at this point relative to how surveillance and intelligence information is gathered. I'm sure I think you just answered my question which was do we have any I work in progress to identify language. Fete the 1979 ordinance and given that attorney has already knowledge that. This is not satisfactory. Is there a timeline or a process that the council has engaged in or the others are already influencing now responsible for the enforcement of this and empowered to to do policy work should contemplate which will get to us at the end of this is on the to-do list. It is definitely on the to-do list and she's going to talk about the recommendations that were issued to SPD in one of those is that SPD work with the city attorney on revisions and at the end of this I will talk about because we're in this as I learned because I was not an auditor as you know, when I took this job and that there are ways that we have to operate to maintain our independence in order to audit a function so we can provide a preferred verbage or you know, we can't assist in the in the actual wording of an ordinance but we have identified questions that need to be addressed and and considerations in moving forward in amending the ordinance. So we we hope we've identified the key issues that need to be addressed and we can provide technical assistance with that. So and I think I answered that question directly. I think this will probably this will be a body of work for 20/20 and whoever the public safety chair is done. But I know that it's so before I move on to the other finding they did want to reiterate again in a small percentage of cases that we saw the play a collection of protected information. It was always directly relevant to the incident being investigated. We didn't see any signs that officers restorative completely off base with this information. So are other findings of which there are three more I'll Briefly summarize when finding to is the intelligence section is the only reason SPD that was routinely issuing these written authorization to collect the information. However, they were also following a part of the chapter that requires them to purge that information once it is no longer relevant. And so given that the past most recent audit prior to this was done in 2015. They had a record that they had issued authorizations that the authorizations were not there for us to go back and look at and so the intelligence section seem very well informed on the ordinance. We saw no signs that they were complying with it. However, we just did not have the records to verify and so we were it was impossible for us to confirm compliance. In finding three, we found that although SPD policy does address the circumstances under which officers might collect be allowed to collect the type of information. It does not include the requirement to obtain a written authorization. It seems clear that other than the intelligence section many officers were unaware that requirement weakened friends who was not a policy and there is also not training with an STD that address requirement on the written authorization and then in finding for we found that chapter 14 12 records retention requirements again, not substantially updated since 1979 appeared to come set the stage for example state law requires body-worn video to be retained for at least 6 months chapter 14 12 says that if you click with information without an authorization, it has a variety of schedule is but I might need to be praised within five to seven days. So so those are in conflict of chapter 14 12 requirements were followed for guys to records retention. It's reasonable to assume that might affect a species ability to investigate before misconduct a crime WSU V recommendations to address the findings of the paraphrase Tiara they are obviously in the report as well. But our recommendations can be summarized as having SPD providing. Please increase Clarity and guidance to SPD Personnel under regarding the circumstances under which a written authorization is required ensuring records are available for a y g review and to address their parents complex in record retention requirements. And so for recommendations one in five or speak to the ordinance most directly and we directed SPD to work in coordination with the city attorney to make sure that everything is okay from that perspective STD, you can turn it to encourage with all of our recommendations and they committed to implementing the recommendations by quarter to three and quarter 4th 2019. And then in the full report on you'll see the plan for the recommendations as well as our wedding memo explaining their approach in a little bit more detail. Thank you, but I'm sure and I apologize. I feel like I should know this and feel free to give me the 101 afterwards. But who does who carries out these recommendations and I'm so in this case. We were auditing Seattle Police Department. And so we issue the recommendations to the chief of police and she can delegate from there. And so the chief of police will delegate and then we have the Council on Foreign Language that may come forward or I think that's part of the auditing functions. So there would be a follow-up is part of this audit by the oig office as to whether or what the status of the implementation of the recommendations are. There will always be a follow-up process for implementation of recommendations. We're currently in the process of figuring out what that looks like with spd's legal Affairs director. So we hope to have a formal process so that anybody can see the recommendation the response to the recommendation and the status of any implementation or disagreement with the recommendation and And other course that they've chosen to take so we will be updating you when that processes is been formalized. And Lisa is that system that is separate and apart from the overarching tracking a recommendation database or is it part of the two houses are recommendations with CPC and take to keep a status there. So it will be part of that database internally will probably have a more robust instead of information about it, but they will dovetail with each other in and be largely the same great. So the accountability ordinance that we passed in 2017 included the component around a database that was specifically designed to recommendations made to SPD around policy changes and practice changes to allow us a more comprehensive way of understanding who is making recommendations to whom and what the status of those recommendations were one of the things that existed before that. Of time was a lot of reports going every which way with very little understanding of who was responsible for actually tracking the implementation of some of those recommendations in the status of those recommendations a lot. A lot of what we were seeing were there were a lot of great recommendations that were flying from an amazing body of intense report work-related report related work that we're just I'm sitting on a shelf somewhere without any follow-up or 8, or maybe there was follow up, but there was a pic of your sense of to what degrees so so that's the tracking database that I'm referring to sherbet. And that's one of those mechanisms. It was built into the ordinance that has turned out to be very effective for all of us in coordinating our efforts. A lot of the work that we do on that is done in the at the quarterly Partners meetings that we have and I think that interim director Scott will probably talk about development of that database in and what it looks like how how we're all contributing to it. He'll be maintained in her report don't want to assign work to you from the table, but I'm confident you're going to dress that great in a few minutes great, but that's a great question. And we really are precluded from drafting the ordinance or providing specific draft language. But these are the issues that we think are key to consider it any sort of revisions of 1412. So are there still categories of information that should be protected by a separate ordinance like 14 12 or is this ordinance perhaps obviated by the other organs does the regulations of the city of Seattle has implemented with regard to intelligence and surveillance and and the Gathering of that kind of information. So is it necessary? How should a dress modern technology in the ready existence of public information available on social media? How does it intersect with chapter 1418 acquisition and use of surveillance Technologies what types and levels of authorization should exist and how can the ability to audit the author authorization to be best preserved and how can the city retain information for oversight purposes while being sensitive to issues such as aggregating sense of information that is potentially subject to public disclosure I or information requests from external agencies. So those are some of the interest that we think need to be considered and balanced in any sort of revision of the ordinance great until just provide a minor point of clarification that I didn't explicitly talk about in my presentation. The reason why we keep referencing public information such as social media is that there is a current exception in chapter 14 if information is directly disclosed to the police officer by the subject of that information, they don't need an authorization they can collect it and it's unclear according to the wording of the, Oregon. Send to open my versus yeah. Yeah, and as Mary mentioned at the beginning of her presentation were required to conduct some form of review every 6 months. And so we're trying to decide how to do that in a most effective way. Whether it's some sort of real-time reporting from SPD of authorization so that we can just keep a record, you know track of them ensure compliance and then issue with in an annual report or or how we we best provide the transparency that's necessary comply with the ordinance and then balance that with our our other on a priority. So we'll be updating you on that process as we move forward and next year they can kill you any questions or comments. Alright, well, thank you for the work that you did on this. I know it is is very technical and body of work. So I appreciate your office's work on on this issue and mom being here today to provide this report. Thank you. Thank you very much. Then. We're going to move now to addenda items 4 and 5 and I'm actually I've actually asks Roxana to read both of these items into the record. So Greg you can address just both of them at the same time sister kind of sore related and you can do the short titles agenda item for clerk file 14417 Seattle police chief 2018 annual report for briefing and discussion possible. Vote an agenda item 50314 423 chief of police audit report for briefing discussion impossible voat. Great. Thank you. All right. 4423 these Clark files were issued in response to the CDs intelligence ordinance that she just heard the inspector-general talk about along with all the challenges and problems that go along with that intelligence ordinance. And the fact that it is so out of date. There are some files that are exempt from the inspector General's analysis that she just told you about and those files have to do with information that is collected around organized criminal activity or narcotics activity or information that is collected from law enforcement networks. This kind of information is not disclose believe into the inspector-general. This is information that is sent directly to the council into the mayor. This is information that is summarized in these two clerk files that we're discussing right now in the case of clerk file 3 14417 TD has reported that it at two times provided authorizations for collections of information rule related to a person's political affiliations clerk file 31438 6 that department reports that it has obtained from the law enforcement intelligence unit and western states Infernape Information Network 30 items of + 100 + 676 items from the western state Information Network. The report I'm giving is vague because these are confidential files that are reviewed by the chief and forward it to you all. I did have a chance to brief the chair staff would ask if you have any questions about process or the overview I've given Free likes, is that it? Ok, any questions or comments? Okay. Thank you Greg for your work on this in for your staff report in for the briefings that I know you've given my staff. So I will go ahead and move both of these items. So I'm going to go with a first item. So I move the committee recommended City recommends that city council file clerk file 3 14417 Des recommendation vote. I know opposition in a sentence of the motion carries and a committee will recommend to the full city council that we file clerk file 31441. OK Google Now move to agenda item 5 and I will move that the committee recommended the city council file the clerk file 3 1 4 4 2 3 4 say aye aye no opposition and no abstentions and so likewise we will recommend that the full Council file clerk about three one, four, four, two three. Thanks, Greg All rights, we are not going to move to our final agenda item and we'll have Roxana read this one into a records. This is a report an annual report presentation from the CPC. Agenda item 6 Community police commission 2018 annual report. Thank you Roxana and AC are prisoners making their way up and read Santa's going to queue up the presentation one that's happening. Welcome back. Alright, thank you so much. You're welcome. So this is our last agenda item and we have until 11:30 and it is 11:07 right now. Okay, we'll make it. I have copies of our annual report that just great surprise for you all. Alright, alright, so let some start with introductions and then I'll hand it over to you folks Greg Doss Council Central staff Seattle Community Police took Santa Barbara Garcia the communications director of the CDC. I read more than co-chairs Community police commission. Welcome. Thank you for coming back to the table and really excited about hearing your report. We talked about some of the word that the CPC is doing this year. Now. He wanted throw it back and talk about what we did in 2018 that let us hear. This is the first of cbc's and Report since becoming permanent and accountability legislation or in a walk you through it through the slideshow. Yes, this is my first chance to see you at this table. So I just want to say thank you for all your work and looking forward to working with you. We were just marveling at the very nice format of the report. Thank you. Thank you so much beautiful beautiful publication you. All right. I want to thank you for inviting us in for us being here council member. I'm here in Muscat a thank you so much. Wow. So this is a long time coming here. And thank you again. I add you see up here are those are the Commissioners that was there and I 2018 and 6 of those Commissioners are I were appointed by in 2013. That was at least I could do gardai Claudia de outubro Jay Hollingsworth ice Kevin eyes a stuck at who is a chair who is the president of spark and also Joe Kessler who was representing is PMA and myself so many things that is that it shows that we've had police involvement at the beginning with T. Come up with the commission and we can't I hope to do so and I rev II Aaron Williams also has a picture is not there. But he was one of the original ones and he's still there. So the new ones now, I will sit there is Colleen echo-hawk Emma who was here earlier did a fine report their Melinda and it's also she wasn't she's her picture is not there a Ben Goldsmith Bob and Helen, I'm not sure I haven't heard the last name. Can you help me with that? Okay and Joseph Sia, I still think and I and I will just started and I reset a diamond coach here and I am as a coach and Isaac who's always hear Isaac could not be here today, but that we we miss him to think it will it will give him an excused absence today. All righty. So the next flight is at we going to talk about our work groups that we have here where I manned up while we just I mean we've done a lot of work and I we have the strategy work group and I and the strategy work group. I'm with the three chairs and the head of all the other work groups. And at that time it was Enrique. Isaac myself, Claudia Lisa and Emma. I and also the police practice I work group was led by Lisa. She was a chair that Ben Goldsmith is an attorney Jay Hollingsworth Isaac Perez and Revan Walden and a community engagement on Williams and Malinda a behavioral health group. I work group was led by Claudia Helen. I can hellenized the chair of that and also Melinda, and now we have bug species of mine that was working in 2018 and did a lot of work. And then our next flight isn't can I add that the community engagement workgroup as well as Behavioral Health were created in started in 2018. The police practices looks at policing techniques and policies and Behavioral Health worker books at the intersection of policing and mental health as well as other social determinants of Health that impact individuals interactions with Public Safety in policing. Thank you for that. All right eye next fight. It's about the route. We've had 31 a public meeting each running about 3 hours each eye on top of that's on top of the meetings of each of the four committees that were happening in the biweekly or monthly basis. We did all of this with Jess 1414 of our commission about 21 commission has been appointed at that time. A lot of meetings went on. Lara meeting I'm to reiterate the strategy committee is the concentration of all the Committees leads and it meets right before the CPC meetings to determine the agenda as well as the items and sets the direction for strategy in the policy of the CBC 2018. And we're looking back here. Yeah. Yeah. Yeah. I so now we're going on to community engagement and that's my room. But first I actually wanted to acknowledge that I'm sitting at the table with another book center. That is very very rare with the same spelling as well. So I just wanted to make sure that you know, this is a historic moment for multiple reasons of one who was Dorian Ford people's jobs to a staff of for the biggest Focus was implementing the accountability ordinance building capacity. So we could engage community on a larger scale as our work was really focusing on the consent decree creating processes to track engagement and inform our strategies moving forward and there's a newly permanent entity building relationships with community members organization is the stakeholders and system partners. The we had over so I'll clarify what we mean by one on ones. We had over 200 meetings with committee members in system Partners what that means is that one-on-one conversation. So one-on-one meetings where we went to stakeholders or we might with Opa oig SPD so on and so forth attended and 25 event sandwich the CPC either attended or presented. Once again the growth of our team as three new staff members working on engagement and Communications. So the portfolios under the command engagement team grew one of the assigned a staff member to be rsped liaison the other staff member to work on using gagement and specifically interdepartmental. He's on to connect us better to the city, of course the supervisor in that realm in our communication advisor. What are the biggest engagement that happened in 2018 was the chief of police search because of the added capacity. We were able to better help represent the voice of community on the chief of police search. I shall remember mayor durkan created a community panel to help with the search that included to CPC Commissioners upon learning of alternative methods being used to assess candidates by the mayor's office to CPC called for transparency and ask for some documents from the mayor's office before responding to this request. The mayor's office announced that there were three just three finalists and interim Chief coming back has been eliminated with our expanded Community engagement staff. We were able to conduct out of sight out of state site visits to police departments of each of those three finalists and betham through a community lens cheapest ended up being reinstated as a candidate and eventually was named as Seattle police chief. All right, we're going to talk about organs implementation. I'm going to run through this kind of quickly. One of the things that we've been most focused on is implementing the accountability ordinance. The ordinance was adopted unanimously by Council in 2017. It was a result of years of work between Community groups to CPC and elected leaders me a jerk and supported on her campaign Trail. It includes reforms to Seattle Police accountability system and increase civilian oversight of the Seattle Police Department and may the CBC permanent and increases Staffing scope of work in the number of Commissioners from 15 to 21. They're also 21 different call outs for the CPC in the legislation to help guide its work. All right. In 2018, the CPC identify dozens of ways that the new police contacts would undermine the reforms called for in the Ordnance the CPC urgency to reject the contract on the CBC made it clear the time that were in support of fair pay and collective bargaining rights and that the contract undermined accountability dozens of community groups join the CPC asking City to reject the contract. The contract was approved in late 2018 federal judge James robart issued an order to show cause why he should not find a city out of compliance with the consent decree in that order. The CPC was invited by the court to file a brief and did so I'm in 2019. So besides protecting the accountability ordinance itself, we've been working to fulfill our parts of the organ. Here's a list of some of those parts. It's a lot but we've made significant progress. One of the areas were especially proud of is the last when looking at ways Seattle should be conducting external investigations of serious and deadly sins of force and you heard about that earlier one of the things I want to go back to that Inspector. General judge mentioned was the database of recommendation I think for us, although very technical. It's very important. It's one of the biggest and most important. We have created and built our senior policy advisor built the database with the city of department on CC attles it Department one of the things about his that has to be shareable on as long as confidential as we don't want people outside of that accountability system being able to get into it. But we also do eventually want an external facing summary for transparent. So we meet about the database during the quarterly accountability Partners meetings to line our recommendations and to go through the summary and the recommendations in the status of those recommendations. So we're just getting started but in between those meetings at the court portal accountability Partners, we do check in with individual offices and we have noticed the increase in terms of like just walking across the street SPD or walking down the hall to oig and talking to them about the status of some of the recommendations since we're all kind of making dinner recommendations. The policy database was pretty brilliant in terms of putting all of those in one portal, We've noticed that it's made our jobs easier to figure out the status we can just pull status and Creed Reports. Look at Trends and will be also filling meals with the management action recommendations as well. I'm so we're pretty proud of that and it's a collab. amongst accountability system partners What are the biggest projects that we've been that came out of us has come out of the CDC is a serious and deadly use of force investigation task force. It's a legislative mandate. This task force looks at the visibility of establishing an investigation process external to the SPD for cases involving serious until the use of force. This task force is stopped by the CBC Caren Turner upon a policy analyst is there lead Stafford and includes Community leaders law enforcement c p c o i g o p a s p d and other system Partners in this task force that held the six meetings in 2018. Alright, so here's again a quick look at the status of the 21 projects for the CBC called out and accountability legislation. There's more details in the actual and your part. Obviously we can put them all on that site 14 of the products are being fulfilled and our ongoing work and responsibilities of the CPC. These are things like oversight that we will continue to be induced and five projects were in process in 2018 and moving towards completion. Just two of the products were on hold at the end of 2018. The first was a 60 PCS District liaison program, which assigns Commissioners to all seven Council District to act as liaison between the CPC and the community.. Underway actually in 2019. When more Commissioners were appointed to the CPC. We added those eight new Commissioners and their first CPC meeting was May 1st of 2019. The second is assessing the need for a complaint and appeal process. We're working toward getting the work underway. The capacity issues have kept us from doing it so far. It turns out that we can only do one task force the year. So in 2018 and until sad fit wraps up that is a task force that we will be concentrating on and then we will start a task force on the complaint and appeal process in 2020. That's very smart. You know you all are volunteers on this commission. I need some of you all who have some of the Commissioners who have needs-based issues receive a stipend a very modest nature, but I I do think that in order to take on a meaningful chunk of some of these really serious body's ability works it can it can get tricky to have that quality continue to follow through if you're taking on too many of those efforts and certainly the sad fit work and this implementation of i940 is a massive policy shift and major culture shift in mm does require a lot of time and attention. So I appreciate the thoughtfulness around acknowledging capacity and bandwidth and really just prioritizing a massive project that requires a lot of time. Make sure you get a right. Thank you. Looking forward to next week. We are at now. I will looking forward to be excellent to be in 2019 and I like to just have a statement to say before I say I say this piece is that. We're so absolutely I are glad to have our own interim director. Here. She is. She's doing a tremendous job all over the city everywhere. I go. I hear people talking about her and I she's just such as soon as a tremendous job in the office and just wanted to say thank you to Bessie Scott and all that she's doing and that and I'm making us side making us look good. Thank you so much. Thank you. Yeah and looking forward looked at. That was that's whenever I are on our side of our meeting I we have now are increased I very much so and I are those water that's a picture of all the venue Commissioners that we have on board. I think we only just have one more Town board. And so and so we have a very quiet room. And so you might I made a very full room. So we might need at like a space after a while for all of our meetings and a Commissioners and increase staff icrease responsibilities. I think that we've done a great job in 2018 and however, we're looking forward to keep the commitment up and then some of the guiding principles in 2019. We're here to some of the work in the voice of the community continue to fulfill the Mandate of the accountability ordinance and consent decree and to conduct a How long is a long-range planning for the eye for the commission and to further guide us as we grow and I it's been a pleasure to work for me to sit here beside 29 years in the making that we've been working on police reform and I miss is very auspicious that we've come this far in order to be able to have a body by A vibe civilians to be able to work for transparency and for police oversight and I think the real Great model and I think if we look across the nation, it's no one else did that actually has reached this level bye-bye off of work that I would community at the table and I'm Community people who've been doing this work for a long long time. So I want to thank you. I I council members I and all of you all for your work on on the on the Poor Side of being able to work on the legislation in 2017 that made this day possible. We really want to thank you for that. Alright anything else from you all I think that's it. I think as we look forward, we're really excited to begin our long-range planning weather that whether or not that includes a life after the convincing and the long-range planning will also include succession planning. I'm so excited to get our Theory change which includes a community centered approach as well as longevity within our strategic plan. Well, I want to Echo accolades of you. I think it's been a real pleasure to get to know you and to see you in action and to really see you at taking very seriously the role of that you have right now and not behaving like an interim you're making use of every minute and moment. You have to improve the community police commission and leave it on Solid Ground and to make sure that it's improved. With every moment that you're there and I really appreciate that and I appreciate the continued to work and collaboration that exists between my office and the community police commission. I think you know, we we don't always have an opportunity to agree 100% of the time on the ways to get to a place but I think we are in agreement on the destination and I really value the relationship that I've been able to develop with with so many of you on the commission and really respect each of you individually and respect the work that you do collectively and I think it's a really important entity and will continue to to be a champion of the work that you all that you will do even when we disagree on the mechanism of getting to the destination in the car and you're with your friends or your partner's in your light bill this way and I want to go that way. Committed to getting there and I'm excited about about figuring out how to continue to work together to accomplish a cuz it's really important for us to get there together and I acknowledge that so really want to thank you all for your support of me personally and professionally and and really appreciate the voice that you all feel cuz I think it's really important. Thank you so much. And how often do you all get to meet with the mayor's office directly and the chief of police directly and share recommendations to the executive? Not as often as we would like but are planning on more often. We have some meeting set up with I'm the chief of police that are ongoing which started last month. We do not have a regular standing with the mayor's office. I would do have regular standing meetings with council member Gonzalez as well as the o i g n o p a part of the accountability ordinance and Cedar Point around this question cuz room as good as like we acknowledge that in that unless there was something in writing that required a minimal amount it would be difficult to make that happen as a little bit of a built-in accountability system. So you've heard Bessie and others reference the quarterly meetings and mostly accountability partners that was part of our attempts collectively to make sure that we had some at least some minimal requirement for interaction between the accountability agencies and Who is Provisions don't message weren't necessarily included for whomever was the chair of this committee or whoever is in the mayor's office, but I think I think it's in my mind a good practice to have those regular check-ins as policymakers with with you all in with other members of the accountability system, and I certainly have prioritized that on my calendar with various entities related to this working. It's been very helpful. Alright anything else? I think that's it. So thank you so much for the report really excited to see the 2019 report and this is our last item on the agenda. So we are now a very so much for having us. Thank you.", "end_time": 7038.6}]}