{"format": "raw", "annotations": [], "confidence": 0.9274103758525263, "data": [{"start_time": 0, "text": "Good morning, the June 19th, 2019. Meaning of the Seattle planning land-use and zoning committee will come to order. It is 9:34 a.m. I'm able to check out a chair the committee. We have three items on the agenda today discussion and possible vote on clerk file 31441 3 and application for a temporary expansion in North Seattle Precinct a discussion and possible vote on Council Bill 11947. 1 clarifying the definition of a vessel and a briefing discussion and possible vote on Council Bill one 19546 which updates the rental registration inspection Orleans to conform with state law. The next regularly-scheduled plus meeting is on Wednesday, July 3rd. So you're 9:30 a.m. Here in council chambers. If there is no objection. I will. Today's agenda hearing none agendas adopted. At this time, we will take public comment on items that appear on today's agenda. We have 20 minutes today for public comment. Each speaker is limited to one minute for public comment and the speakers, exceeds the one-minute. The microphone will be turned off speakers are asked to be in their comments by identifying themselves and the agenda item if they wish to address as a reminder public, is limited to the items that are on the agenda or within the purview of the committee. So first we have Sarah Weaver. And then we will be followed by Dan Ober. Hey is the backyard Cottages not on this agenda today over yesterday? Okay. Thank you. Dan Bern that is currently it is voted out of committee and the sustainable and transportation and councilmember O'Brien who's chairing a committee has the intention to bring that before the full Council on July 1st. Thank you. Irene it is a hatchet. Hectic, sorry. Are you the only one present today for me to comment? I would rather that you spend your minute providing for the comment police precinct matter. I was here last time I submitted a letter to the account to the committee that I asked him to review. I trust that you have reviewed it given that the other members of the committee that are not here. I don't know if you've actually reviewed it or not. One of our primary concerns is Preservation of the green space. This proposal is temporary in nature. We would like the council to commit to restoring the Green Space to Green Space. Once they no longer need this parking lot because this is a temporary project and the neighborhood was promised that green space as Green Space when the police station was originally built. I do believe that a letter was responded to it. So I did have follow-up. Elise Bauman Fall by Judy Carroll Good morning. I'm Elsa Bowman. I'm a resident who lives exactly behind the police precinct station. My concern actually is not the plan. I think that we have agreed that that will go forward. My concern is the increased traffic traffic and parking problems that are not addressed when we double the size of the precinct personnel and their parking needs onto the streets surrounding us. We desperately need a coherent plan that will include restricted street parking as there is now on south south of north 100th + construction of sidewalks on North 103rd between Wallingford and Aurora. I would be happy for the police to have preferential treatment for parking if these improvements could be made things will only get worse when the right Light Rail station opens and the projected bridge on North 100th over I-5 is built now is the time to address these safety issues. I'm asking you council members at least. Mr. Pacheco to direct me to the proper Department. For this traffic and safety problem. Thank you. exes Cheryl Falmer my apologies home owner across the street from the police station. I've been there 26 years and we as a community of 16 home. So spent a lot of our budget on Landscaping our area and we would hope that the police precinct what address their Landscaping with the inclusion of irrigation. We have seen plants die over the years are they put them in they die because there is no irrigation. So we really want you to address the issue. And then if this expansion occurs, we hope that you would put the land back to its restored it to its natural state. We have been good neighbors to the police precinct and they have been to us, but we'd like this can to put screening and so we don't have to look at those buildings. And cars. Thank you. Nexus Cheryl from Palmyra followed by Jess Wallach Thank you for the opportunity to speak. My name is Cheryl Feldman. I'm with 350 Seattle, which is a Grassroots Civic climate action organization. And as I listened this morning, I can see that the committee has issues detail that consume its interest and I just like to make a more General comment that asked the committee to keep in mind that Urban density is one of the major solutions to climate change in in Seattle, and I ordered you to look toward Solutions which are more intense. Thank you. Good morning, councilmember Pacheco wedding staff. My name is Jeff Wallach. I'm also here with 350 Seattle. And yesterday I was a part of a hundred and fifty folks who came here to the city council to deliver a marriage letter game calling for a green New Deal that eliminates the city of Seattle is climate pollution by 2030 addresses historic Injustice has thousands of good green union jobs. I miss committee has a key part to play in the realization of that transformative Green New Deal. We see Urban density and also stricter regulations on Energy Efficiency to create buildings that reduce our carbon pollution, but also lower our energy bills as a key piece of House Seattle can move forward and leave the way on heimat. So in coming here today, I want to listen up the city council members who have already signed our community endorsement letter in addition to about a hundred Community organizations and businesses council members O'Brien's to want a mosquito have signed on invite the rest of council to join us and I Thank this committee for passing yesterday's any legislation. I'm continuing to help the city Lyon climate. Thank you. Next we have Scott Maclay. Good morning. Thank you Scott McLamb also with 350 Seattle and I'm here because climate chaos is impacting us now and it's getting worse 2 days ago paper said permafrost is melting 70 years ahead of schedule the prediction. So we're in deep trouble and I'm scared to death and we have to act. So we called for ending fossil fuel emissions. That means that we have to end natural gas hookups. We called fact gas cuz most of it's coming from fracking. All gas use must be phased out by 2030. We also need increased densities. So the ATU and daughters are a great first step but single-family zoning is a relic of racism and must be abolished. Today's New York Times has an article that Oregon has a bill in process the state legislature to abolish single-family zoning your where Minneapolis is already done that we have to also jump on board plexus triplex in fourplexes will increase density and increase Energy Efficiency and material use efficiency. So the real goal is net zero building codes. Thank you. Thank you and I am enjoying my counselors O'Brien and Ken Summers Harrell, but horrible. Sorry my coffee stuff I next on our list is Maury more sugar. Thank you chairman. Thank you council members for having us here today and thank you for your recent attention to our issue over the vessel definition. We are on the president liking a Board Association assure and we are here to ask for delay in this until you can include this as part of the overall rewrite an update of the shoreline management plan because there are places in the code that this particular measure my conflict within the future. I do want to thank councilmember her bowl for her Amendment. It's a real step in the right direction. Thank you very very much. We really appreciate it. But I would like you to reconsider voting on this today because I think it needs to be scrubbed with the rest of parts of the code. And also I would like you to think about if you do postpone this today, if you do nothing and you put it off you make it more applications from boats that don't have Motors to become flowers. And then you can regulate them. You can actually verify them as flowers and regulate them. The alternative is to have them still on the water as I working boats that you have. No regulatory power over. So to me it seems to make sense that you go ahead and let them apply and become flowers. Thank you. Nexus John Chaney My name is John Chaney. I want to thank you for past opportunity to speak to you about this. I would like to introduce two records in two pieces of information into the record and I have copies for all of you. The first one is a vessel survey that was done by the city itself in 2015. It identified that there were potentially 222 potential flower opportunities for verification. We're at 230 something right now. I don't see that as being some huge overwhelming change in the last five years. This is proposing to somehow close the door to that and this to close the door not for the issue of whether or not these are vessels but rather that a right that we have is flowers is replacement. Just like every other the other thing I'd like to introduce our the other vessel definitions from across the federal government the state government and the city of Seattle the definition is it already stands in the shoreline Management program is an outlier and would only become worse as an outlier with this change. Nexus Steve, rossello followed by Glenn Bollinger probably didn't throw you to the Wolves. So you're not here alone again, but what you should take a look at how selectively green this console seems to be you talk about carbon, but you also don't want to save Legacy and Heritage trees because anything that goes against the developers is something that you do not seem to want to do you don't want to talk about how many times the population of Seattle we were already zone for. So what we seem to be is a cycle where we're going to make development mandatory and very very profitable. If you are really looking at Green you might want to save some trees you also if you were concerned about the population, you might also think about family unit. You're destroying more family units what we're building are not family units. So if we keep going this way, we're going to make Seattle of far different places. It appears you don't want to discuss that with the citizens and long-term plans for the precinct are there any thank you. Glen Next we have Rosa Marie Bollinger. Suzanne Whitehead Hi, I'm speaking about the redefinition of a vessel. I've never done this before. I'm nervous and quite frankly. I don't really I'm really puzzle even after trying to read about all of this about what the implications of redefining vessel is. But I do think that some flawed data has been given to you guys and I think that maybe you're trying to make decisions based on information is not correct. And I do also agree with Lula that I would urge that this folk be postponed until the SNP is reviewed and I bet I do is think councilmember herbold for the amendment that that is giving exception an exemption for existing flowers should not be affected by this. So I'm thankful for that. Okay, that's about it. Thank you. Next on our list is Barbara Ingram? I am also speaking to the issue about the definition of a vessel and what I would really like to do it. First of all, I would like to thank councilmember herbo for the amendment which I think is helpful and agree is a step in the right direction. I would also like the city council to consider the process that is going on right now and trying to to take care of the situation and that is that one small piece has been plucked out of great large set of regulations. We're focusing on that and that's a very poor process because when you do you run the risk of creating a patchwork set of rules, and it doesn't number of things it makes the rules much more confusing for people so that compliance is harder. Is it confuses things that creates it runs the risk of creating and consistencies and it also runs the risk of creating loopholes that you don't want your in the more your Patchwork this the worst that process is going to get so I really urge you to step back and think about the processes going on and to consider that the wisest course might really and truly be to look at this in the context of review of the entire shoreline management plan, since you can try to write regulations next on our list is Michelle wetland. Thank you. I'm speaking also for the vessel definition and I would respectfully request our council members to listen to their constituents instead of DCI regarding this. I want to thank both of council members O'Brien and her before being here today and councilmember herbo for 4 amendments that would Safeguard my home. So that's all I have to say. Thank you. Is anyone who did not sign up to speak they would like to speak? Can you please be sure to sign in? Good morning. I'm glad to see at least three of you there. I'd like to see all of you here like to thank Lisa for her help and perhaps getting this delayed. I think it's very important that we get it delayed and that's what I'm asking you for today is to delay this decision on the vessel definition. I work in the industry. I live on a houseboat are there on a flower and I'm on the water every day working on other people's boats in the definition and the statement that John Chaney issued based on that study. A lot of misnomers are in there. One of the things I noticed is that they describe boats house Bose is having bedrooms and bathrooms and kitchens just like shoreside homes, and that's why they should be considered. Like that, but I are both said are big enough for people to live on our Yachts are super Yachts all have those things. They simply called them different things are living rooms. They're still on their kitchens there Galley there bathrooms ahead and their bedrooms are staterooms, but they're serve the same function houseboats have been a definition for many many years there has Donna said all of the United States all over the world. There houses that were there boats that work out for people to live on specifically but people live on other boats in the big difference is this and it's an environmental issue. The boats that we live on the houseboats contain their sewage and they contain their water and they reduce the water we put overboard by using less water. We use environmental to Friendly's soaps. So I'd like you to defer this decision, please. But thank you for having me Wednesday. I'm off to remind me professionally and this affects me as well as a community relation. Not more. We're right now. I can rebuild a power into a houseboat that's regulated. If I can now build a vessel with no regulation know if you need to find these people that live on these boats and vessels. There's nothing stopping me from just over the house but not because it's not a vessel. There are also an antenna questions consequences of redefine The Vessel where Marina's have to have 75% vessels in a marina. How is the city going to address this now that these are no longer vessels. Do they have to kick him out now or I'll send person that may have a flower and have certain regulations there no longer has this because they are defined something different the one they lived on their entire life. Can I ask them to delay the spokes and consider? What is actually going on by me to find? What a vessel is. I can thank you. Is there anyone else who did not sign up to speak to be like this week seeing then? We will now move on to the next agenda item for first item of business. Today's discussion possible. Go town clerk file 3 1 4 4 1-3, which is a council land use action to allow for the temporary expansion of the north Seattle police precinct know it. Would you please read this item into the record for 413 Council land use action to approve a temporary expansion of the north Seattle Precinct located at 10049 College Way North Welcome back. I will the folks in the table, please introduce themselves keto Raymond Council Central staff. Seattle Department of construction and inspections And you Stucky finance and administrative services. Mark Baird Chief Operating Officer SPD Eric Santo Captain North Precinct Commander So fortunate last time we did not have the chance to conclude this action item. And so we're back here today to address this include this weekend so we can send it to the full Council before we do that. Could you please provide us with a brief refresher the decision before us share it so I'll just a recap where we ban in Orient you to some of the materials that are attached to this agenda item that we have SPD here that may be able to respond to some questions that you have about the product. I'm so just by way of of a reminder on the 5th of May would have briefed on the proposed expansion and waiver of development standards. And there's a public hearing as well on this type of action is a somewhat infrequent action that the council takes which is Council approval land use approval of a project City facility project in this case. So it's something that happens occasionally but not too often. There is a decision document that is attached to This is attached to the memo from last week. And that document would a conditionally elect a certain document conditionally on Grant approval of the expansion and wave a developing standard related to the location of parking. The conditions are road conditions recommended by a c c i current song you want me to have specific questions based on the testimony that you heard today and the briefing that occurred last weekend FAS and SPG are here to respond to some of those questions. Well, I have one question and then this was answered as last time but we've heard concerns about your gation just in terms of what the plan for the the expansion. So I can speak to that so the phone's landscape along the extended parking lot. I believe the plan is and correct me if I'm wrong Duncan is that we would have a temporary irrigation installed to help establish the plants so that the native native plants that are planted are have time to fully established themselves. There is a. In which the contractors also under obligation to ensure that those plants are well established its certificates pretty typical that there's a one year warranty included with the with the landscape. So after that the you'll be up to our facility operations group maintenance group 2 to believe vendors. to help maintain landscape after that. And without approval of this plan will we will we not be able to add new officers? Yes, so I'm looking despatie here. But the precinct is at its Max. There's physically no more space to add Patrol officers that it's a function of a locker room. I do really does come down to that as mentioned previously. The community room was already converted into divided lockers for officers and therefore there's no community room and I think we've we've explored every nook and cranny of the precinct. And again, there's simply no more space. Council marble so rather than just do a kind of back-and-forth Q&A the folks who came and spoke to us last time. They submitted the letter r nine questions and I think I'm screaming asked for your response. Could you just quickly go through the answers to the to the nine questions? I think the first one was related to the not pay them over more than what is necessary for the parking lot and a request for a commitment to restore green space after the temperature the needs the temporary use up and I think they're so what about security fencing one about officer where officer should be able to access but maybe you could just quickly go through them. So I think this will be a team effort on our part that is so if I don't know if everybody has the questions and comments in front of them, but I think the first question related to parking. I would defer to Lindsay Pharmacy. The traffic report in the sky that was done regarding parking in the requirements for parking Menendez art of the channel of the the the question is are the request is don't pay them any more of the current Green Space that is needed for I secure parking for the next six to seven years and agree to remove the temporary additional parking restore the Green Space when the new Precinct is built elsewhere. So what I will say is that their projects middle that was submitted to SJC I established fleet vehicle parking that those needs were established by SPD and submitted through FAS the study then went on to establish a patrol at the fleet vehicle the patrol cars and then the parking for the officers and the public but we started through sdci is with the parking that was provided on the side. What additional over I would occur from that onto the streets. I think the balance is it they were trying to achieve enough parking on site that they were not going to create an impact on the streets around It ultimately you at they're able to demonstrate is that the parking provided on-site did result and overflow on the street? But kept it at a level that was less than the parking utilization. That is the balance for us that 85% utilization rate. So as far as why that parking was proposed are returning it to Green Space SDC. I would prefer to fasn SPD. number one, the Police parking is complicated. But analyzing the police Fleet Snead's we'd be determined that they would likely need 80 spaces for their Fleet during the time that we have. Now, they're sleep reject to be larger than a part of the reason 88 became the correct numbers. Some of that Fleet is always in circulation some of its for repairs and some of it is out with officers on training sdci required us to have an 18 spaces to serve the needs of the building is part of the zoning code review that totals 98 spaces, which is exactly the volume we have in the secured parking area in addition to that. There are five spaces for public in front of the building. So I will comment that through the design we tried to balance the need to prepare singing. I believe we provided the minimum parking at we could while maintaining as much green space and Landscape in that southern areas possible. Yeah, I was just hoping to get the second part of that question related to what happens after the after we move towards the permanent. Is there a commitment to return that area to Green Space or order? Is that off the table? I can't come I can't come and definitely about that. I mean it is city-owned property. There is nothing written as far as encumbering the site to remove I would have developed and then I'll have to say I think part of that. Just maybe helping if they ass out here a little bit is that one thing the purpose for the internet expansion here is because the city has ongoing planning related to whether not how to replace the North Precinct 4 there should be one or two locations. It's this is I think the property is not in Parks jurisdiction Fass jurisdiction. I feel like I'm not sure that the city of this point game commits to retaining that as open space until future decisions are made about the about the number and I'll lay out of of the precinct or precincts in North Seattle at the property would be maintained as green space is a reference to Commitment with that was made under the earlier plans to to build a new North Precinct. I think their commitment was made when the original Precinct was developed way back when I'm not exactly sure when it was developed, but it's in this is often the case that of course a commitment to they can't find a future Council and while it may be the case that the open space can be returned at some point in the future that'll depend on contingent decisions about I'm planning for the North Precinct. Just a question. Head on the parking. So the the 80 spots plus the 18 is a tight butt projection of what we'll need and that will be provided with this additional with these changes proposed that there's an additional eighty outside of a Terra Blues are all included Sakura spots there plus the 80s. Give me the questions exchange with Central staff asking folks to Respond to the the the questions and I thought that's sort of where we left things. Black me to me. I can always follow up with my question. Are we in birthday? I circulated of an exhaustive response from FACS. And I think it was they were transmitting information from SPD to them and they just some of the concerns and we can hear from the now about that if the committee wants to somebody operational needs for both of the parking which I think Duncan is just described as a little bit but also for the height of the fan switches are concerned of I'm some of your neighbors to the project. I'm sorry. I am I looking at the wrong person. You're a fast. Sorry, are we talking about the height of the fence dance? We are so I can come in a little bit about that. We've had some vandalism issues in the past and we are utilizing the same height fence. It's not a chain link fence with a different type of fence which prohibits people from being able to scale it and climb over it. It's the same type of fencing that we use at other City Seattle facilities, whether it's the Seattle City Light. It's not specific to the police department. It is that's used at the CLC light spusd and FAS and it's the use of a similar 8 to 10 ft fence with some Can't what they call it on top of I don't think we're going to be putting in on top and if I'm correct, so that's why we're going with the 8-foot fence at this point. We are looking is primarily for security and for obstructive use of the precinct. We also have on the north side of the precinct against 103rd Street. The roof of the precinct is almost next to the level parking lot. So it'd be way to prevent people from accessing our roof. And as far as number three restricting officers from using Wallingford Avenue. I go out there quite a bit and I don't see a whole bunch of sores using that street. We primarily use College Way and 103rd to access the precinct because the gate to act to allow Vehicles into the precinct that is off of college way and 103rd. Yes Wallingford is a very narrow residential street with cars on either side, but there's very minimal traffic police traffic on there, and there's nothing about this particular project is going to increase those number. I'm not one, you know, if you know this better than I do. I don't propose we change anything legislatively, but just making sure that you guys keep away on a good neighbors and I think you and I'm willing to sit down with miss her and talk to her also about parking issues. And I think you handled a lot the screening issues. So hearing that there are no additional questions. I move to Grant clerk file 314-4138 condition those in favor, but I outside. those in favor, please vote I As motion passes. Thank you that I will be back before the full Council before final decision on Monday, June 24th. Thank you. Our next item is a discussion impossible vote on Council Bill 11947 one which clarifies a definition of a vessel know it would you please read the abbreviated title into the record. 11947 1 in ordinance relating to land use and Zoning clarifying the definition of vessel and consistently using the term vessel in the shoreline master program and amending sections of the Seattle municipal code. Will you please introduce yourself lucky Seattle Department of construction and inspections going to change and it threw me off a little bit. Would you please give us a refresher? We've been having this before a committee counsel how it had a public hearing on this bill Council to 11947 one and Mae Anne. Seuss on the agenda last Friday, but due to time constraints are the committee didn't get to it. I'll talk a little bit about sort of what's in the bill options for today and then open it up to discussion last time. So the council members no cancel that one 19471 would have been the definition of vessel in the S&P to respond to a December 2016 hearing examiner decision that an inoperable trailer was not a vessel and could seek verification as an f o w r f our I think you are familiar with this but for the benefit of those folks who may be watching at home to City regulates floating residence is under the shoreline master program. I walk through sort of how the city does that I'm at least her house barges flowers and vessels other vessels used as I can provide some information about the problem with this legislation seeks to address and you may have some questions about that and then cast member herbold has an amendment that would confirm the status of powers that have already received verification from the city because I'm concerned okay. All right. So, how does the city regulate Maggie is going to help me out here because there's a level of detail that she has more expertise on than I but there's this table which is attached the agenda and I think you're all pretty familiar with us. But the the city recognizes four different ways that somebody can have a floating residential use floating homes what you're not addressed to your house barges floating on water residences and vesicles containing dwelling units house barges are a type of water residential use that dates back to the 1990s there a grandfather is part of the shoreline master program update at the at that time and I was part is about all that is designed or used is the current definition would be changed by the code Changed by the proposed Bill the best all that is designed for use as a place of residence without a means of self propulsion and staying equipment or a capacity. In order to be a legally established as a house barge under the shoreline master program to use must have been established by July of 1990. So this again, this is a grandfathering from a prior SNP update. So as with many of these House parties are regulated as conforming uses and owners, May maintain repair remodel expand and replace them if they are the structure within a similar frog pond and City verification required for these and verifications are sort of the charm that used in the code for for lack of a better term establishing to use it is the permission that establishes that something is a residential use for the purpose of the S&P and it's essentially a transferable property right related to the residential use for the purposes of this Romance of the Cities SMP. I'm in and when the city updated the SMP several years ago the city provided the opportunity for house purchase to be verified as flowers if that was something that I'm that are no longer wanted to do. I'm sorry. Can I just put you that one a little bit I should remember but I'm apologize. I don't so house barges the the handful of house barges that were established a finite number of 30 something ready for 4 have an option of remaining under the house barge code or converting to the floating on water residence code. Yes and the distinction between those two I don't need to get to part of the details. But is there is there a Advantage one way or the other two being regulated as one or the other you speak to that I think one potential Advantage as they get off. Our is is a is a new definition that was established in 2014 under state law. And so somebody May perceive that there is a greater level of protection under the essenay by being verified as a follower as opposed to being verified as a hotspot. Team in the city updated the shoreline master program. What we did is we left both categories and we made the regulations identical and as keto said if someone were a House Bar that was verified, you know that was came into existence prior to 1990. They had the choice to either become an f o w r or remain house parts. So we so within the master program there wasn't a difference but I think he stated that at the state level f o w ours are acknowledged her and then the city verification for house barges and floating on water residence. Is that a one-time deal you get a verification and that's your University your permit or is it something that is done on the right on going basis like a vehicle registration at the one time when the 34 house barges identify. This is on page two of the the 24 have been verified as house barges and then there's 10 more that we believe exist, but haven't 3424 are now barges and tenant moved over defra wrs. I guess they're all left left-handed moved to addition to all total of 208 as of. Today, and this line of questioning I think. DuckTales into a little bit more granularity around flowers. So there was a study done is that right that came up with these estimated numbers for 2015. I would agree with John Chaney what I sent around the the report yesterday to you all is well, but there is the memo and his brother lies on a number that was that was put forward by little actually in 2013. I'll need some tips for the estimate at the time of the number of house barges, which is better for pre f o w r term there is more recent information is the 2015 study which indicates that there are probably about 222 at least at the time. I'm Not Just Flowers, but flowers house party and then this other category of other vessels that could be verified as dwelling units. So again, this estimated number in 2015 is a is a number that is not an STI number. It was a study that lose my number. So the reason why I think it's relevant is that I think part of the narrative around the necessity on moving this forward quickly and with expediency has been that there's been a lot more off hours seeking verification than anticipated and it looks like there's two there's been to 208 but the city study in 2015 show that there's 222 so I didn't seem to me that there are a lot more than we're necessarily anticipated. So the earlier number was from an earlier time. So there has been an increase, you know, so if the if there was an estimate of 113 and then that estimate went up a couple years later. Put to these are just estimates. We just have the numbers that have been verified. So the number right now is 208, you know, if you add in the house pardon best way to 2015 s e I was estimating 222 what does not like in the last I mean for it's been 4 years. So it's not a surprise that the number is double then what was estimated in the in the study average woman's can disagree about is whether or not I'm just by the fact that the total number is not that different than the 2015 estimate. Is there evidence that suggests that there are more and more inoperable vessels that are verifying its powers. And is that a problem? So that's one of the questions to other dressing keto can you get into the hearing examiner decision and specifically more about the ambiguity that was Yeah, I think we can we can schedule to write to maybe what what what problem is this legislation so you can do it come from the vessels descriptions to okay? 2014 there was a change in state law through engrossed second substitute bill or engrossed second substitute Bella 6450, which is codified RCW 90-58 270 and that established a new category of a floating residence is called flowers and the definition that the city uses for Fowler's on comes almost directly from from state law and I'll just go ahead and it sits on that accept up there on the spreadsheet the table and a half hour is up a floating structure other than a floating home that is designed are used primarily as a residence has detachable utilities and is the subject of a lease or sublease at a marina or whose owner or predecessor in interest had an ownership interest in Arena as of July for a 2014. So that's the date by which that residential use must have been established. And then it says for the purposes of this definition of structure will be considered Designed primarily as a residence if it contains a dwelling unit. So powers are regulated. Similarly to house barges is Maggie mentioned they can they can be maintained or not. Non-conforming uses. They could be maintained repair to model replaced and expanded subject to the standards about how tall they can get and they can and they can even be modified within a foot brand above water coverage requirements. Do you have navigable that they can navigate the day of propulsion steering any of that stuff? They have just residents grandfathering date. It's a lie, 2014 exactly it so that that is like that is the next grandfathering date for 1990. There's this new grandfather day of July 2014 have in order to be verified by the city to have that transferable property right that permission the the power I must have been a resident with use prior to that date. That's a state law that Isom isn't did the city adopted tours at essentially just a state law. It's because of the change to state law. And so what does that mean for the floating on water residence exist before July 2014 in Bremerton and then come to Seattle and maintain its flowers and flower status here or is it have to have existed in Seattle to ask Megan answer that question. I think that this is this is an area that is sort of unclear. I think under state law whether or not a verification provided by one jurisdiction are transferable to another so we interpret that it and that the FLW are needed to exist in the city of Seattle at a marina meeting the requirement by the state legislature. So so so so in theory, at least there should be a finite number of floating on water residence as of July 4th, 2014 and Have an estimate actually 2 different estimates from two different times, but one was 113 when's 222 it is just shy of the 222 208 have registered but would also seems clear is there things that and we'll get to the specials next they were clearly not counted as flowers because his vessels and there's a a couple dozen of those that have now been certified as flowers in the last couple years. So we know that the population of floating presents will may not grow some things that they at least in our mind. We're not beforehand have been certified as now so maybe we can talk about what vessel is the final category of ways that a residential an over-watered resume cheese can be stablished through is as a vessel and there are essentially two categories. Conventional recreational vessels used as drawing in attendance as I think what people mostly think of as little bored. So if you're living on a sailboat or something like that, uke that's that is not allowed that's allowed under the S&P and no verification is required for that. And then there was this other category other vessels used as dwelling units in the sweat cause I think was intended and Maggie you should come correct me if I'm wrong here to create kind of an opportunity for structures that may not have been conventional vessels and may not have been f o w ours to get a verification from the city in an interim period before they SMP became effective in June of 2015. And so the window for this one for this category has essentially closed, but for those used to have been established they would have needed to have been the residential use would have needed to have been established that by June of 2015. And what can you describe a couple of the VD use or is it it looks like there's seven that have been established and is at 7 just unique things other than just kind of structures. They don't fit the categories are used for navigation category. So they would have to have supper posing as well as steering equipment. Back to the vessels. We don't regulate that or folks don't need a license to live aboard a sailboat for instance and people can buy new sailboats and bring them in here and live on them. But there are other constraints that exist at least in Seattle. I mean that you kept being a marine only certain rain is allow it and part of this whole idea is is what do we use our I mean the whole part of the management is how do we manage and happy planner at a certain uses over other uses? And how do we restrict through going to things and I know that's a touchy subject for various uses good people have different views on what you prioritize but are not restricted at all. But there are just some space constraints or Marina constraints, sir. Are there any limits on the number of liveaboards that can exist in Seattle or is it really just have to help how many marinas build outs in? The city Shoreline master program does not regulate the number of liveaboards on the you know, what you described as sailboats or other conventional recreational vessels. So I'm moving on to what problem does this legislation seek to address is coming over Pacheco mentioned and in 2016. There was a decision from the city hearing examiner that essentially said that an inoperable trailer did not meet the definition of a vessel and butt and could therefore seek verification as a f o w r I'm in so that's essentially the and so the the proposed changes to the code would clarify that even if there is a vessel out there that is not used for navigation. I more is inoperable. It's still as a vessel what essentially that would mean is that those if somebody were to live on those vessels they would they would be able to do so not necessarily as an f o w r but as a conventional recreational vessel used as a drawing in it. So it would make it. I'm harder to establish Fowler status. And so here's an example. We have some permit examples of sort of illustrate a business model that this legislation seeks to make more difficult. This is an application by Jeremy Fuller and then we have a couple of these but he applied and received verification of this sailboat as an f o w r and the to do that that the burden of proof is relatively low a couple of affidavits here one from the owner of the soldado one from the marina operator that verify that that structure has been in residential use and has not been used for navigation. So this is what this does is it creates an opportunity for somebody to have this have the sailboat verified as a follower and then potentially to replace it with something else and that's what this legislation seeks your trash department seeks to address. Okay, so you got somebody with repeat that back to me. So I understand if this were navigable sailboat they were they could just keep operating as a vessel and there's really no restrictions on that are really no inspections. But once it becomes no longer navigable than theirs is? Of what it is, even if it's not used for navigation set to the doctor since 2014 that it could potentially be verified as and so and so one of my questions why would someone want to recertify as a floating on water residence as opposed to just keep it as a vessel since the vessels are regulated Macon and there's no restriction on that. But one of the ideas they could do if it if it was a folding I want to Residence Inn. Something happened to it was destroyed they could rebuild it it wouldn't have so I have to look like that it would just have to meet similar criteria, but it may look a lot more like a house barge. And would basically be a way to convert a sailboat into a house party or something of the light. So there is a council member herbold find out now there's not been you know, the number of verified House Bar to his powers in BTUs is since 2015 is more or less within the range of always anticipated through that 2015 survey. There has been screened sdci up check and verification For What appears to be inoperable vessels soon in 2019. There have been 7-Eleven verifications this far for similar 12 verifications for inoperable Vehicles includes the seven in 2019 in Lake evidence that it says that it is a business model for instance. The number dramatically increased so it's hard for me to answer that. I think that the person at DCI who does the verification understands that it is a business model in that there is somebody that is is buying the inoperable vessels and replacing them with floating on water. And this is this is a practice. Yes. So there are a couple of her both has an amendment to the proposed bill that there is of course always a do-nothing option and I think that it is the trade-offs there. I can't really be Quantified necessarily, but I think you are familiar with what they maybe you could be the case that more unused or inoperable vessels are converted to f o w ours and 1/2 a trade-off and the SMA and rsnp that implements. The shoreline management act his competition for space in the shoreline dump or structures that need to be there that are water dependent and water-related and Teresa... Don't necessarily need to be there. Hence the grandfather from certain dates comment from the public that suggested that removing. The Fowler verification process is would be limiting your Buddy to regulate this activity. So is there still an ability to to stop people from taking inoperable vehicles in inoperable and and living on them assuming that without the power verification you would then have some enforcement power to say this is not an allowed you to sin. So so so it so it would be allowed to use as a conventional Recreation racing a recreational vessel a different issue Authority on people living in inoperable. Just like I think it's more than inoperable. I think it's the inoperable part of the vessel and whether the department would I'm either has the capacity it it's a different issue essentially. So that's something that we can look at as we move forward because it isn't something that's been brought to our attention in a great degree. May I know that Marina's I'm look and may have standards as far as what is operational night. And so and I have heard that the Port of Seattle made look at their marinas and require standards for operation of the tenants in their own marinas, so that that's that's what I do. The issue before us is not really trying to address the question of whether a recreational vehicles vehicle. That's all so is operation or not. That's that's that may be regulated into floating on water residence through this but what we would call this I might disagree in the audience of a loophole. It was created by the hearing examiner wear when they were no longer if they're certified is no longer navigable and residents than they meet the definition of a floating on water residence, which degrees at that place in my mind was not never the intent that these recreational vessels would also be treated is have the option of that has an amendment that really makes us adhere to that commitment that we've had with prior to the hearing examiner decision. Oh, I just had his recommit back to that decision. I think that's a good side by hip herbold labeled amendment number one. And this is what I would do without a section for to the bell and section for would say this nothing in this world. That's Alters the status of floating on what presidents has the receipt verification from the city prior to the effective date of this ordinance pursuant to the requirements of subsection 2368, 203b and the definition of floating on water residence in 20 section 23 6289126003638203 B is the processing and development standards of seat requirements to substitute requirements for verification of an f o w r Okay, so this language helps it doesn't happen is just clarifying because I know part of what we're going back and forth your on with community members is his question about what's intended was says so this what this basically says is anyone who's a certified is floating on water residence prior to this date can retain that regardless of of what they are any development standards or the definition of the definition of floating on water residence. I think you probably have heard from the licking a little bar association and other Advocates that they would like. I'm some sort of clarification about the status of apple wrs as potentially being vessels as well on this legislation doesn't report to do that. That's maybe that's why I was so glad it's a related but separate issue that can be Dressed at some future point, but it doesn't necessarily see it wouldn't solve the problem that has been created by the hearing examiner is a 2016 decision. I wanted a point of reference. I just said I think you're all aware of this but there is a periodic updates of the S&P that'll be coming at some point in the future probably a couple of years from now until they'll be an opportunity to look at that issue. Potentially then thank you for putting together antennas you say is to affirm the status of flowers that have already received verification and to clarify that there's nothing in the ordinance that alters the status and I also appreciate that you met with scci and members of a couple weeks ago and my staff I was not able to participate One of the issues that is a still for me a question and maybe it came up in that meeting is the concern that powers might be counted towards overwater coverage when Marina owners apply for expansions did be in the last 2 weeks get an answer on that from STI. I'll turn the Maggie. So this was brought to our attention as an issue and during the periodic review will review that but again this legislation doesn't change anything that's in the current regulations regarding that. So we'll we'll review that issue during our Pier a periodic review and update of the shoreline master program. I'm just I'm asking for a question of whether or not regardless of if the legislation changes it do flowers count towards over water coverage when Marina owners the question is if they were using the death the word structure rightfully, so you're saying that this doesn't change anything structure is currently in the definition for flowers that does not change. What it does change is this is largely just for consistency changes. You remove the term vessel in changes its structure for house barges so that 1990 category of a floating residence as I could convert to enough Out of You Are so if passed this legislation We Believe would prevent former recreational vessels that are no longer operational from obtaining voting on what resident status anyone that already has verification is floating on water residence retain it and there's still a path for other residents to be certified as floating on Moana residence. We were not closing that path but we believe based on our survey data and closing the former recreational vessel loophole that there aren't there are only a handful more out there that would likely do that. There are 24 house barges that are certified as house barges as opposed to floating on water residence if those 24 decided it's whatever reason that they would rather be a floating on water residence. Does anything in here prevent that conversion from happening now, you're just switching the verification. I'm 2 and f o w w r f that's what I wanted to do. A similar and Doug but one does have one isn't State legislation in one's only in cities. So there may be a reason why folks would want to do that or not. I don't know. So because this is a joint process of the Department of ecology what happens after today's vote with the legislation but doesn't go to phone Council on Monday. So I guess I was assuming that the committee made a recommendation today. I'm at couldn't go to full Council on Monday. And that's because we're the this is legislation is the cities using a joint review process with the Department of ecology. And so I'm after Committee Action the city would seek a consistency determination from the Department of ecology how much that consistency determination is in hand. Then it would be right for 4 cups of milk. And I think I have not talked to Misty from the Department of ecology, but I'm calling that she was imagining that it probably be about a month or so for consistency termination to come from Joey. I'm going to call each other any further questions. No, I really appreciate your work or shut the folks that have pushed on us here. And this is a complicated technical issue for me. This is your homes and I realize that that's very important. Also trying to figure out how to do our best to manage and prioritize the use of Automotive space. I do, you know the significant up take while the numbers are still relatively small the pace at which folks are converting. These former recreational vessels does caused me some concern and I would much rather move to prevent that from happening as opposed to getting dozens more done if we wait another year or two and then having to be in a place where we can do that and if it turns out that it wasn't a business model and there are other compelling reasons and we wanted to loosen up those again we could do that in the future, obviously within the bounds of Play long within the bounds of ecology review of things I've ever heard from you from an AR-10. So if there are no further questions on the amendment, I would like to take a little the amendment comparable II those in favor of the man, please go die. I live in the passes. I move to a. Council Bill one 19471 as amended. Is there second guy? Ocean passes. Thank you. Our final item of the business. Today's briefing discussion possible vote on Council Bill 1 19546, which makes updates to the rental registration and inspection Orleans to conform with state laws. Noah. Would you please read the abbreviated title into the record agenda item three Council 11195 for 6in ordinance relating to conforming city code to match provisions of state law for rental housing inspections and amending the Seattle municipal code. Welcome Halle. Ali can you walk us through with the bill does uncountable one 19546 the rental registration and inspection ordinance was child referred to as Rio moving forward to match provisions and state law purple by providing an additional option for property owners when they are combined with the required inspection of their rental property. I'll provide a brief background on the real program and then quickly describe the legislation the Rio program helps ensure that all rental housing in Seattle is safe and meets basic housing maintenance requirements by requiring that all properties register with the city and have periodic inspections the city adopted Rio in 2012 began registering properties in 2014 and inspections began in 2015. All registered rental properties must be inspected at least once every 10 years. When completing the required inspection the owner must hired a qualified rental housing inspector conducted to conduct that inspection. This can either be a city inspector or they can hire a private inspector that has been approved by the city for multi-family buildings. Only a sampling of the units are required to be inspected. If one of the units selected for inspection fails that inspection the department may require up to 100% of the units in the building are inspected. So if an inspector finds that there are Check real failures or housing maintenance code violations when conducting the inspection that might indicate more systemic issues in the building then they select additional or that all units are inspected to ensure that they are not problems that are sort of persisting in multiple units in the building prior to 2017. If a property owner chose to hire a private inspector to complete this required inspection the city only received a server certificate of compliance issued by the private inspector and did not receive any information about aspects of the real requirements the unit may have failed. So how this works practically is the private inspector would go out conduct the first inspection if they found failures that meant they wouldn't pass the real inspection. They would notify the property owner in the property or they would have to correct those failures there inspector would come back out if they were corrected then they would issue a certificate of compliance in the city would be unaware of any failures that were Sound and surf a again where I'm issues that could indicate larger issues in the building. The city wasn't aware that couldn't require additional inspections and other units could go on with those same failures. In 2017, the council adopted changes the real program that added a requirement that if any failures found by a private inspector during those inspections both the results of the initial inspections, and the certificate of compliance must be submitted to a CCI with that information STC. I can determine if inspection of additional units is needed. The proposed changes in Council Bell 11944 1 19546 adds an option for property owners who do not want to provide the results of those initial inspections property owners who select this option would only be required to submit a certificate of compliance and no additional information, but they would be required to have all units in their buildings and their in their building inspected. This will allow the private inspector to identify any broader issues ensure that those issues are corrected prior to issuing a certificate of compliance. So it still needs the intent of what council initially adopted in 2017 to ensure that we weren't issuing a certificate of compliance and buildings. Are there problems were still persisting or provides Property Owners a different additional options when considering how to complete their requirements Adorable so the legislative the authorizing legislation and state law was passed back in 2010. And that is the legislation that created this framework that required the city in enacting a local inspection program to offer Choice correct in 2012. The council pass the the rental housing inspection program allowed to that choice consistent with the 2010 state law. It is the actions in 2017 that we are trying to address today and we took those actions in 2017 because we wanted greater transparency around units that were not initially. They out. They eventually pass at work work their initial inspections weren't coming back clean. And so we wanted to get more information about that. So we made these changes in 2017 it but in doing so there's this question about whether or not we are still providing the landlord the choice. It was a 2010 law, right? That's correct. So that changes in 2017 were frankly and direct response to some concerns that were raised real problems buildings that had passed through inspection and it turned out that there were none some serious housing maintenance issues in those building is in other in other units in so the council will work with the Department to modify the legislation and the state authorizing statutes does allow for when there are failures to for that information to be submitted but Didn't provide the option of if a if a property owner prefers not to share that information with the city to give them the choice of just having all units inspected. So this just adds another option. It doesn't take anything out of what was I'm adopted in 2017 and still continues to follow up fulfill the policy objective in 2017 Chrysler. LeBron appreciate that. So seeing that there is no discussion a further discussion. I move to adopt Council Bill one 19546. Is there second all those in favor? Please go die motion passes on Monday, June 24th. It is 10:50 in this concludes the June 19th, 2019, meaning of the plus company as a reminder next regular committee. It will be on July 3rd 2019 at 9:30 here in council chambers. Thank you all and we are adjourned.", "end_time": 4594.9}]}