{"format": "raw", "annotations": [], "confidence": 0.9140404799710149, "data": [{"start_time": 0, "text": "Everybody let's begin called order here. So. Thank you, so call to order. So we'll do the Roll Call. SWAT bake shop Gonzales herbal Johnson O'Brien present today is March 11th city council meeting of the city Seattle city of Seattle Council come to order. It is 2:03 p.m. I'm Deborah Warriors council president pro tempore the council who did the Royal so now we'll move to adoption of introduction referral calendar if there are no objections. The introduction referral County will be adopted hearing no objection. The introduction referral calendar is adopted. Boone to approval of the agenda if there is no objection the agenda will be adopted here. No objection. The agenda is adopted. Let's move to approval of the minutes or the journal minutes of March 4th. 2019 City Council meetings have been review. There's if there's no objection, the minutes will be signed hearing ejections 2 minutes. Are being signed? How do you spell my name wrong? nobody no age. More than one presentations there. No presentations today will move to public comments at this time will take public comment on the items that appear on today's agenda the introduction referral calendar and the 2019 City council's work program my understanding that there are nine items on today's agenda which also includes 5 appointments and I we can we go ahead and call for names to both microphones. All right. Number one is Alec Zimmerman. Number two is Richard Schwartz. Number three is Michael Fuller and number four is David zeitz F. Thank you honorable. If I let the record reflect the honorable, mr. Fuller. Thank you. Let's go speak about appointment of directors report to see people you are an employee if you're paying $200,000 per year and I talked about as possible. So no wonder you repeat again and again because you are employee. You posed to be report to people because you work for me before people. So every did actor now to Mitten Waters represent City alight and directors should meet, you know what this mean present so I can speak it's better than see you at the lights are number one position America from Atlantic to the stranger for 300 million people from his 2 cost right now everybody understands. One Party City in America this not surprise me what this happened. It's happening right now. What happened before in human history supposed to be moved out. So I'm going to stop by right now since the Mike mister mister that you will not miss Gonzalez shut off. The bike is done. Mr. Zimmerman. Mr. Zimmerman leave now, or have you removed I would like him removed now. Do you remove now? Mr. Zimmerman? You're no longer on TV you are removed. Again, I'd ask that people just have decency and not impugn the members of Seattle City council were free to hear your opinion in your concerns will not allow that type of behavior. Let's call the next names are the individuals are there next Richard Swartz? Yes, sir. She did you want did you want to wait? Can we just skip to the next so he wants customer badshah here. Alright, The Honorable Michael Fuller Funeral Michael Fuller. I like what's going on, you know, and I've been in this business over two and a half decades and what I'm seeing here is Organized Crime Control Act October 15-19 7 That was signed by President Richard Nixon u.s. Code and 2441 or crime be mindful September 11th, July 7th, 96 death 2977 victim 343 firefighter. $3 on unauthorized my daddy's contract when he served his country. Well, I know you're on a mission or gw24 020086080600 Rasmus. Thank you, sir. Next. Nexus Richard Schwartz Good afternoon. Restart the clock. Could you stop at 4 second? It's discouraging to come up here and see all the heads down. It's like you're on a 2-minute timer here. So let's go. I'm not I don't following you. You're on a 2 minute timer starting now. We're not going to just go ahead. So it was Unreal off your acid people look up and give me their attention there yet 2 minutes. We're all looking at you have 2 minutes. Now. You have a minute and 30 seconds. Last week you limited time is going to go to the heart of I was going to talk about which was the state of our democracy. Last week you limited speakers cuz his number speakers to 1 minute each, but you allowed another jayapal to speak as long as she wanted to do was for 5 minutes and it reminded me of George Orwell's famous scene from Animal Farm about towel. All animals are equal but some animals are more equal than others and that's how I feel. Like I'm being was kind of asking for your attention. Like I noticed you all last week and I just wanted to ask for your attention before I started and I immediately got a hostile response back from you. I don't understand that. So you don't ever respond to Citizens or what's he have 2 minutes for public comment to the agenda items. Ella tall and tape and I think it took two pretty sad commentary that do you think that asking for you guys to look up off of your computers and give attention during the short. Of time was Henry simple thing? I really feel bad about that. Thank you. Greetings, this is David zaitzeff and made a comment that doesn't relation agenda item, but hopefully may be useful obviously in Seattle. Some people are concerned on the topic of gun safety. You're probably aware that a few months ago and New Year's Eve. There was a shooting is currently under investigation. We don't necessarily know who was at fault at least investigation of seem to be complete yet actually tried to follow the investigation a little bit from the news and watch the video several times. I've had in the negative interaction with the particular officer several months prior. And so I thought about it and I thought of two things that the council might wish to be aware of and think about for the general situation when is a mistake and I think that should have police officers tend to use Glocks as their primary sidearm, which have no safety has a pull weight of about 5 and 1/2 lb pull weight is what it requires to pull the trigger. And in New York City a few years ago, what they decided to do is to create a device to increase the pull weight of the trigger. to reduce accidental discharges We normally wouldn't think that accidental discharges what happened with police officers. We would normally think they've been well trained, but they actually do in 2002 Seattle Police released a report about their use of force in their own report. They said law within the past few years we've had for accidental discharges for excellence is discharges of police officers some of the range and Summit outside the range. In Los Angeles County few years ago, the sheriff's deputies switched over from one kind of handgun to a different kind of handgun similar to the Glock and they found that their accidental discharge has increased basically doubled. And so one thing that some of you should check on your the pull weight of our clocks cuz they can be modified and it may make our police officers safer. Thank you, sir. Thank you. The last speaker is Paul Nova Suk Kim Son egg. Good afternoon. My name is Paul and communism call me was not allowed and employees are in the corporation, which is your corporation. I just want to really forfeit because she's not she should really look at it, and I'm putting into the FBI and also yes treasury, my best friend is in the US Treasury and also the NSA for data collection getting so I just didn't your sister wrecking. All I can call. It is true. You have to really think about getting your thank you and I think I was mine. And yeah, the free Metro passes Corporation, so if you may have to think about things we have to take but one thing I'm going running against you in IHOP International. I have the monarchy, and I also have everything so I am running against you. I don't need no money. But thank you. Thank you. You two, are we done with all the comet? All right. So with that we will close public comment. So follow me down the agenda. We will go to payment of the bills. Please read the title. Cancel 94704 F to pay certain claims in origin payment thereof. I move the time of Japan's Council bill 11947 for your comments. Please call the roll on the passage of the bill. So Juan Gonzalez herbold Johnson O'Brien bill passes in the channel. Sign it. All right. Okay, so we'll move on to committee reports. I think the first seven or mine. So go ahead clerk. Please read the report of the Civic development public assets and Native communities committee and Native communities committee agenda item one appointment 1260 reappointment of Robert L nellams as director Seattle Center for term to January 4th, 2023. The committee recommends that they pointed be confirmed. Thank you. So mr. Nellams is here and I'd like to make some comments. I'm sure my colleagues do as well. Mr. Nellams as we are in committee and he has been in Seattle Center for over 20 years. He worked closely with this Council and many other councils with most recently in the revision eating and they remodeling the Redevelopment of Seattle Center and we appreciate his wisdom his leadership and his intellect and more importantly and the two decades that you've been at Seattle Center you have proven and demonstrated Excellence proven results, and I want to thank you for your leadership and all the work that we've been doing its Health Center and so is that I think my colleagues probably have a few comments to make and then we'd like you to make a few comments. She told me I had 20 seconds. So I want to say thanks. Robert has been a pleasure working with you for these ten years. We started off in a parts and Seattle Center committee together and we just look at the things that has been accomplished in this last decade and the Chihuly started off and it was people were angry about it. We got public benefits the artist of play went up and I'm really grateful for the work you've done around the Arts two weathers Opera Center for the playhouse that great things are happening. And I know the Seattle Science Center is going to have a facelift and be working on some great things there and then of course all the work that you did around the arena you and councilmember Juarez and the other people who are leading in this it's going to really make Seattle Center once again the center of Seattle and I think that nothing but fabulous news is going to come from there over the next few years. So you certainly have my vote my support and I appreciate you very much. Any of my calls cops and purple. Thank you. I just want to sing your Praises about an issue. I just learned about last week. Maybe something that hasn't gotten a lot of attention that I really think should in our efforts to make sure that this city is a place that is all public facilities particularly are some cultural facilities are welcoming and provide access for all I was visited by a disabilities rights Advocate who is reached out to me about whether or not we should consider passing legislation that requires caregivers to receive a free entrance ticket to to a venue in those instances where the person with the disability needs a caregiver in arguing that that is a required public accommodation, and he told me that you took a lot of leadership on that issue as it relates specifically to the bend venues at Seattle Center, so I want to thank you. Thank you, cuz we're horrible. Any whales. Okay with that, Mr. Nellams you want to come up and say a few words? Oh, you're right. I'm sorry. Wasn't it back down the confirmation those in favor of confirming the appointment voice? I I suppose don't know the appointment is confirmed. brief remarks just kidding I always Thank you Bebe clear be brief be seated thank you all for your continued confidence and support you all know that I love this job and I love the fact that we have a place in that reflects the values of our community where anyone can come that it's accessible and includes an inclusive of everyone and that I work with people that try to their darnedest to make it welcomes everyone knows that shows up at our on our campus so I would love to say that I'm I look forward to the next couple years or be a lot of change coming to Seattle Center with the arena project and other things that are going to happen and I look forward to working with you to make sure that we do what you want us the Stewart's up this public assets to do on and I hope that we not only meet but exceed your expectations while we do that. So thank you for your continued support. Thank you. Congratulations. The Coast Boat buddy. Just thought I'd let you know that. So we will move to item number to record to parks and green spaces Levi, the committee recommends the bill pass. This comes out of our committee. And so let me give a little background information there for funding categories include the Acquisitions environment and the opportunity Fund in development for the 2008 Park and green spaces Levy and the levy provided inflation contingencies for projects in the acquisition environment and development categories, but not the opportunity fund inflation categories and acquisition and environment categories are fully spent, but they remain for project and the development category of the total. 14 million inflation contingency for the development category 11.6 million has been spent this legislation appropriates 2.4 million in remaining contingency for the remaining after project and the development category example projects include Gas Works Park to Gas Works Park play area tomorrow. It is more Des Moines Park development and the Magnuson park building of the 406 park building 406. I'm sorry the roof. So if that are there any comments? All right. Please call the roll on the passage of the bill Salon Gonzales herbold Johnson O'Brien president Juarez 7 in favor and opposed. Thank you the bill passes in the Channelside. Please read the second. I thought I went to the record for 66 million to the Department of parks recreation authorizing the acceptance of a gift of a Timber Pavilion structure for the Seattle Parks Foundation to be installed in Occidental Square Park for public use a pass. Thank you. So as you heard cancel bill when 19466 authorizes the acceptance of a gift of the Timber Pavilion structure from Seattle Parks Foundation to be installed in Occidental Square Park for public use sale Parks foundation will be making the timber Pavilion are making the temperature in a gift at 2 million dollar value to the city of Seattle and the Seattle Department of parks and rec. The timber Pavilion will replace the current kiosk building and function as an information and concierge station for Park in Pioneer Square visitors a large grass growth. Well, I love this. Is it gracefully above structure and extended to the park providing opportunities for play performance and classes and a beautiful covered space. The new Pavilion will provide for enhance Park activation the sale. Best foundation is working in partnership with the alliance for Pioneer Square and I believe Friends of the waterfront. So if that are there any comments? Please call roll on the passage of the bill Salon Gonzalez herbold O'Brien 7 in favor and opposed the bill passes in the chair will sign. So let's please we have for appointments. You want to read items for through 7 to the record? Ancient times four three seven appointments 12:40 three 12:43 appointment of Jana lamon as member Seattle Center advisory commission for turn to September 20th, 2018 and appointment of Daniel tam-claiborne game for Della and Racquel Russell as member Seattle Center advisory commission for turn to September 20th. 2023 be confirmed. Thank you. I'm going to briefly go through these four appointments with an opportunity to meet with all four individuals and it's a wonderful group for the sales advisor to me. Oh, mr. Nellams already left. I was going to say he really teed up some great candidates. Let's see some is going to be briefly with Daniel tam-claiborne as the International Development professional with a background and working in microfinance for social justice issues, including Africa and China Daniel published a book called would never leaves in 2012. Jana lamon is a t-shirt Adams Elementary in a program operations specialist in the Robinson Center for Young Scholars at the University of Washington Elena. Figueroa. Fardella is recently retired former position. President and CEO of the Seattle Times after 22 years of service there is currently a Queen Anne resident and we have Racquel Russell. She is EVP of governmental relations and public affairs at Zillow group. And in that capacity overseas Villas community and Civic engagement housing and economic policy. She previously led the White House Office of urban Affairs and economic Mobility serving as senior advisor to President Obama and issues, including neighborhood revitalization affordable housing Economic Opportunity nutrition policy and Women's Health. So are there any questions or comments? Okay, so we'll move forward all those in favor of confirming the appointment but I suppose what no, thank you. Let's read item number 8 into the record sustainability and transportation committee agenda item eight cancel 1194 34th Lane to probation to the Delridge multi-model modulus is a corridor project committee recommends passes amended on their continued design work Beyond this 30% threshold until we heard back and we wanted to ensure that they were doing good work in the community engagement had a great report and committee also heard and public come in from community members that they really appreciate the engagement and some of the design changes. We still have a ways to go and design to listen to provide as well. Collins Key to the next phase before we proceed to vote and know my calling councilmember herbold has an amendment to propose which I support So hand it over. Council Bill 1194 34 section 2 is presented on version 2 of the one which was distributed at this meeting. Moved and seconded to amend Council bill 11943 for by amending section to just action to correct. Are there any comments I'll let you go ahead and said the public has been very complimentary of s. Efforts to do Civic engagement and to address the issues of the multimodal issues surrounding this project this amendment adds that the council and anticipates that s start will continue to evaluate issues identified by the community and notes in F. Presentation to the sustainability and transportation committee last week as work as. Is evaluating plus specifically Improvement to the 26th Avenue Greenway. It also references at work that needs to be done with Seattle Public Utilities to ensure that the design complies with a stormwater code and finally it references the need for a funding agreement with King County Metro in advance of seeking appropriate. Stations for project construction. That's the final piece of legislation needed that will be coming to US during the budget process this year by the eyes have it the motion carries and the bill is amended and then I will move to pass cancel Bill one 19434 as amended second. They moved and seconded to pass Council bill 11943 for as amended customer behind you wanna Let It Go, thank you I was looking at the wrong I was looking at the wrong note here Write all those in favor. Thank you. Bagshaw Gonzalez herbal Johnson Brian president Juarez 7 and favor and unopposed Let's read item 9 into the record for 73 granting the University of Washington permission to maintain and operate a pedestrian tunnel under and across Northeast Pacific Street West of montlake Boulevard Northeast committee recommends a bill pass. To this is legislation that will allow the city to renew a permit for University of Washington to operate a tunnel connect in the parking garage under the triangle between Malik and Pacific threw me across from University Hospital to the hospital. The tunnel has been around over 30 years and the previous permit has expired. So this would give Authority for a 10-year permit dating back starting to 2015 and then two more 10-year extensions that could be approved without Council approval permit fee for this is 16 $1,680 for 2015 you get suggested based on property values going for Any more comments? All right, please play the role in the passage of the bill. So on bike shop herbold Johnson O'Brien 7 and favor and unopposed. Thank you. Counselor O'Brien. You're welcome. Alright, just make sure council member Johnson catch his bus. There any other business and as far as business before the council? All right with that we aren't your own. No further business.", "end_time": 1741.2}]}