{"format": "raw", "annotations": [], "confidence": 0.9527552944642527, "data": [{"start_time": 0, "text": "Good morning, everybody. Thank you for being here at regular scheduled Council briefing accounts members Bagshaw income and sawant and Juarez will be absent from this brief. This morning's briefing in this afternoon. So I just wanted the public to know that we are going to I'm going to give a short we're going to do a preview of today's forecast elections first, and then we'll move into an executive session. We had two and you should have our State Legislative update on our legislative agenda and Olympia for you. We've suspended a presentation this morning and I think our plan is to have them back next week. The good morning everybody. Okay. So let me start off by the two days full Council actions by just announcing a few things this afternoon. We're doing our sure perfunctory legislation where we do retire all legislation that have been pretty dormant for the last year is consistent with our rules. It's whether to resolution of Bill that file or an appointment and so that'll be at the rink at the top of our dinner, which is our Annual retirement Bill. We also have on the governor second and Technology committee meeting a regular schedule meeting tomorrow at 9:30 and we have the beginning of the confirmation process for Ryan vancil the hearing examining mini Veuve got an email that if you've had experiences with him or his work product or his office now that you wanted to play a role in in in in the evaluation or we just want to make sure you had the opportunity and we've gotten several responses. And so we look forward to kicking off that process you may recall that he was actually confirm for 1 year. And so he's only been in this his position was carrying salmon for your although he was a deputy prior to that. So and then we also have a presentation about the organization or at least a technology known as The Samaritan app and many of you might have seen a gentle gentleman. Jonathan has his first name, I believe but Effective of the personal outstanding young man. I'm personally he's been coming down a few times during full Council and a committee. He does work in the helping. I'm sheltered individuals on this really setting sort of a kuelap innocent medallion. That allows the unsheltered person and allows another person to contact this person know their personal story and you've heard you may recall that one hearing a few gentlemen talking about they're experiencing homelessness. One person was actually sleeping down here and they in the city hall and how this application allowed them to be to receive mentorship financial assistance structure around their life. And so I thought it very wise at first understand how the technology works and then have representatives from both technology and hsd2 soreness and any policy implications. But before we even Explore this technology less understand at first from what I know of it and what I've researched on it, it looks like it is one of many tools that may help out tremendously and certainly some of these individuals that have used it successfully will comments. And talk to our committee. So that's tomorrow at 9:30. So we welcome anyone to go to see if this could be another part of my toolbox. and Let me explain. Let me out Channel and council member of the war is his energy if I may and her staff prepared some notes for me to read in her absence and I want my staff to know that. Her staff is on her a game. So you take notes on this even color coded here. So from council member wear as a few words the Civic development public assets and Native communities committee will meet this Wednesday April 3rd at 2. And there's two appointments for the board of Park Commissioners up for consideration and the next Civic development Public Access in Native Community communities, We will also meet Wednesday April 17th at 2. And there they are planning a shirt or agenda to accommodate the library's meeting that follows that same day and speaking of the library's meeting the select committee on the library Levy. They held their first committee meeting last Thursday was great meeting with our chief librarian Marcellus Turner and his team are the mayor's office in the library Board of Trustees provided a comprehensive presentation on the 2019 proposed Library Levy. That's more where is is excited about the work libraries have produced and this proposed Levy continues a baseline services and expands on the needs of a growing City Seattle Public Library has a strong Mission and plan to increase access to low-income families and communities of color. This is the heart of wood Library should be the people's University a lots of people are excited about this and I encourage the public to share their thoughts and their suggestions in a contact any of us here at the table and are saps how you can do this in person at the scheduled committee public hearing for Thursday, April 11th at 5:30, or course email your council member. She wants to think that's why I'm Gonzalez and council member Harrow for attending and are meeting our next meeting on that again will be Monday. April 8th following accounts are briefing and that'll be an issue identification meeting and customer back show with chair that meeting and Asha venkat aromin the council Central staff or will be available if you have any questions And on a much heavier note last week Lake City is I think everyone in the city knows experienced a tragedy that I know Community should ever have to experience and they were four victims to a senseless act of gun violence to a which did not survive in District 5 and Inn in Archdale Community. They came together on Saturday afternoon in response to the shooting to heal and show love and support one another and honor the families impacted by this tragedy in customers like to thank Chris leverson and Annette. Hi, jessen for organizing such a beautiful event in honor of the individuals and families impacted by last week's event. A lot of people were there including our own Seattle police chief best. Thank you Chief bass and King County exec of Dow Constantine our mayor durkan and course council member Wars was there in at the event there was an oversized cars for people to sign that would go to the two people in the hospital in the families who lost loved ones. And so just remember where I just want to really let folks know where heart goes out to the families who were impacted by this the senseless tragedy. Okay, thank you Deborah. Where s comes remember where I saw the floor the items that my committee has on the full Council agenda today. We have two appointments one the museum Development Authority appointment on this is an appointment brought forward by the governing Council and the other is an lgbtq commission appointment in that is an appointment for whom the council is the appointing authority the no Regional case this week. I had office hours last Friday at the Southwest Community Center and last week. I had the pleasure of participating in the National Main Street conference, which was here in Seattle and presented on my efforts to create a legacy business program here in Seattle was Will have a chance to present with a representative from San Francisco who has successfully proposed and implemented a legacy this program in San Francisco. So on Wednesday evening attended the League of Women Voters voice of democracy and number of folks in our community received Awards. I just want to give a shout out to tandi Williams 37th District activist who received a voices of democracy award as well as the organization simple syrup survival, which many of you may be aware of who does a lot of work with the formerly incarcerated community and Justice involved individuals. They also received an award recognizing their great work this week. Also just went to flag that occurs going away party is this week and Kate is somebody who has led the office of film and music abele for a number of years. Our losses can count gain. They're going to be starting a new Arts office over there in the in the office of the King County Executive. Very good and 4 councilmember. Brian goes ice would let I will let everyone know that this is councilmember Johnson's last briefing so we may have to take full advantage of that cast member behind me that you're retiring legislation. Am I just added to the list of retired legislation is Rob. Thank you counsel president the sustainable and transportation committee has our regular meeting tomorrow afternoon at 2 p.m. Here in council chambers for items on the agenda. First. We're going to hear from Seattle Department of Transportation on an update to the bike master plan implementation plan. We traditionally get are modal implementation plans in the fall of the bike master plan wanted to go to some more process with community members. And so that was a delayed until March and so we got that late on the day on Friday. And so it'll be attached to the agenda hopefully today and I have a good discussion on that. We will then have our first discussion on a new piece of legislation. Sometimes referred to as the EV Readiness ordinance CV being electric vehicles. This is a bill that the office of sustainability environment worked on in conjunction with sdci and it's if if it goes forward in the shape it's in and it would be a requirement on new construction for making the buildings ready to accommodate what we anticipate to be an increase in electric vehicles. And so I'm some of that will be around requiring a certain number of charging station. Some of it will be around having the electricity and place that you can future-proof that and accommodate future growth. And then so we won't be voting on Tuesday to watch our first meeting and discussion to get an overview of what's being proposed that legislation and then we have two points to the movie Seattle Levy oversight committee on this afternoon's agenda. There's a c Item from the sustainability Transportation committee. And that's a resolution adopting the University District Mobility plan and all the council member Johnson speak to that. Good morning. Today marks the 1-year mark from the are 2020 Census count were circulating a proclamation for our Council to send over to our Community Partners to our state Partners International Partners who today will be engaging in a series of events on April 1st to mark that one year from now. We are going to be meeting our expectations and our goals and working with Community to ensure that not only we have a full sense of count, but that we build trust with the communities of people feel like they have the information they need to fill out as much of the senses that they can today in full Council. And with your I'd like to present the proclamation calling for senses awareness day as you and I and all of our community members and them are included with the executive will be having a press conference at 11 today to really call attention to the fact that we have here. Are the community to make sure that we're well-equipped to build the trust within our state with all residents to ensure. We have a robust account of everyone in our region, especially building trust with those who are the hardest account communities who often get left behind a very excited to work with him and it writes Community groups unions with work organization small businesses with the county and philanthropic organizations who are ready to the do the work of combating bigotry and fear to ensure that every resident is counted and that no one feels that they're forced to fill out any information that is confusing to them given this Administration in our distrust of them as well in terms of how they met you and same formation. We want to make sure folks feel comfortable with filling out all the questions that they do feel comfortable with and we are not holding our breath for information or good results to come from the court regarding the citizenship question. We are going to charge the path forward and I look forward to doing that with all of you the next committee that we have off of the housing health. Workers rights committee is April 4th at 9:30. There's two items on the agenda. When is a briefing on initiative 124 we're going to do additional issue identification. We are going to review the essential staff memo and we're going to hear stories to read directly from the workers many of those stories. We heard actually at the Friday event that council member herbold cast member O'Brien Council and I have the chance to listen to various stories from community members and they're going to come and talk about their experiences working in the industry as council member. Where is acid a previous meeting. We will also have the chance to hear from industry Folks at a future meeting agenda is to consider legislation or consider the topic of sick leave be extended to School District employees will not have legislation at the time for discussion, but we want to hear a briefing from our partners at the iuoe local 609 Which is the operator 609 and decorative wolf board member for the Seattle school board will be talking about the need for making sure that our folks who are serving food, and schools were cleaning. The grounds schools also have the opportunity to take a sick leave because those individuals are around our kiddos, and we want them to be healthy and safe as well. There will be an opportunity for us later this week to have a conversation at the Cambria Grove policy-making Healthcare panel that I'll be speaking at on Thursday. I'll be meeting with members of the domestic workers task force to talk to them about rest and meal breaks and how the current process is working as we gear up for implementation this summer of our domestic workers Bill of Rights on Friday. I'm going to be in District for and then we'll have office hours from 2:12 to 2:30 at Cafe javasti Maple Leaf. And then we are going to do a tour of the picardo Farm Patch and I'll also be attending very celebration. I'm in the evening with some of our Community Partners. I do want to know that as well for the full Council that's on let's see Tuesday last week and councilmember sawant's committee. There was a chance to have those individuals who would like to have a seat on the phpda that public Hospital District preservation authority to come and present on their vision of what they like to do with board members council member has did ask some questions on my behalf as I could not be there but one of the biggest issue with that you heard councilmember Gonzalez and I talked about in the last budget with our desire to make sure that we move forward with the plans home home and hope projects throughout the city on the North lot of the phpda some of the questions the three questions that I asked of the two individuals that were to be considered or do you have any concerns about the North Lot creation not just affordable. Mixed-income housing with childcare centers with the senior center with a plaza basically from greater social cohesion in interaction for The Residence at what it was if anyting a concern that you like to bring forward and one of the respondents on Bob Hope who has who is in the running to get on this board said that he hopes that they will have an agreement that he can support when they get to that point. So I've asked for additional clarification on what this means. I am hoping that we will get that information before the 2 p.m. Meeting. I've asked for that information actually on Friday in over the weekend didn't receive anything. So we're reaching out again flag for folks. This is a really big decision point that the phpda has to make and I think it was an alignment with our priorities. So if I get information back, I'll make sure to pass that on but it's critical that we have folks were on that board who want to work in partnership with the city of Seattle and our state Partners as we advance. How's the weather to call out to more important items I want to recognize that. Dr. Amara is the new exact. Sorry the new director of The Office of the employee on but she is the Amba that will be sitting in that position starting the spring were very excited because really this process of selecting the on blood came through a robust discussion with silence Breakers with change team members with directors on from departments that were part of the interdepartmental task force and Doctor concert currently serves as a director of equity and inclusion inclusive practices at the Renton School District prior to that she serves as the associate director for Global diversity initiatives at the Oregon State University and she's worked to Advanced cultural competence on campuses through shared learning and training. I can't say enough about how excited we are to have some of her experiences there and how how how much trust I think she's already built with some of the IDT members. So that gives me a lot of Hope in the butt office want to say that Q2 Steve Walker who also announced that he will no longer be serving as director. He will be retiring soon from the office of housing under his leadership. We have seen a number of not just affordable housing units be created truly God's housing being generated in community creating assault a sense of place coupling housing with services around transit-oriented development and so much more and we want to just take a second to recognize this incredible work over the last five and a half years and last noted at the last evolution that was on March 25th that we sent it out. We gave folks 2 weeks to give us feedback. You have one more week. So looking forward to getting some feedback. Thanks to the handful of folks that have already sent us some edits. Thank you for that. And we look for your feedback by next Monday so that we can have our first draft of the resolution ready for our Council conversation on April 18th. So again deadline for getting us Back is April 8th on the respectful workplace resolution that pertains specifically to our legislative branch and thank you very much council at president Harold. We included not just our second and third floor colleagues. We have the city officer. I started the city auditor hearing examiner and Inspector General. They have all received a copy of that as well for their thank you for all of your work has been an honor to serve with you as you push the envelope on creating affordable housing across the city. I just wanted to fill in the stand the issues with the the PDA. So I attended that meeting and and listened with interest on the North Lot development in prior to that meeting. I've been making calls to Olympia to support the North Lot development for affordable housing. So quite beware the project I didn't understand fully understand. I didn't have the option of read your letter was trying to listen to you. So what what are you're concerned about because everyone at the table seem to be very supportive of the project. I didn't hear any concerns. In fact, that was there was a write-up I think about the North Platte project and so can you help me to send your concern at this point? From the respondents door school and Bob cook in the committee presentation was a robust understanding of why we want to move forward on the North lot and the importance of the votes that are coming up to ensure that I shouldn't say votes the actions that are coming up to ensure that we are committed to moving forward with developing affordable housing the child care in the senior housing. What I heard was that one of the respondents said, I hope that they have an agreement that I can support when we get to that point which sounded a little bit like it was being couched in there needs to be more information or there's something that hasn't yet been decided. So in an effort to seek clarification I sent these three questions on Friday as a v i have been on Thursday and Friday Friday morning as a follow-up and have not yet received an answer, but I'm hoping that I can Circle circulate that to all of our committing murder. My sense and are on a real-time basis during the interview that they were very supportive and I appreciate your doing a deeper dive on that issue my expectation and we all have our own vote on confirmation for ptas and other types of appointments is that all members actually ask hard questions and and seek clarification. One of the questions I had was to know they do a lot of simple grants and major grants and whether taking on such a project would somehow affect their ability to give grants which they will not because they are, you know, they're using their rents and leases to get back to the community. But okay. Thank that that helps me clarify that so Cast member bonus question question regarding Elsa Paulding. Do we know yet? Who the acting director is going to be? I have not received that information yet from the executive, but I'll be following up and I we haven't received a number of comments from the committee members Desiring of robust process in the communication that we saw from the executive. It does sound like they are intending to do a national search. So I do believe we will have a robust processing and we now have a outline of Starfire expectations things to this Council. So I'm looking forward to working with the executive, but we don't I don't yet know who the interim will be in if we've gotten information over the weekend. I'm sure I'll get things about that before we end up meeting. Thank you. Read my last time you ever say that shoot High to information that you feel like you need to share this out loud. It's only a few sentences. Thanks for your interest in this information on the first question. Do you have any concerns with the proposed housing being developed on the north? But no. Will you be supportive of the housing on the North Platte and supportive of the planned child care and Senior Living Services? Yes. Will you be supportive of efforts to move the north. Project 4 without any conditionalities limitations are modifications. I will support moving the North Platte project forward. Will negotiations for ground lease for the Belmont are underway. There is not final agreement with concrete terms for the governing council's consideration. It would be a violation of a board members fiduciary responsibility. To presuppose any particular action on a hypothetical plan. When a proposal comes before the governing Council. I will consider in a of the purpose in the Pacific Hospital preservation development authorities Charter and is visionary and its vision and Mission then exercise my best judgment and taking position on the creation of the Northwest project as a board member. Yes. And that's it cook for that like breaking news, and I apologize for interrupting your last presentation, Johnson, I think she know we all have been fighting for more resources for that project and was happy to seeing the 9 million dollars as a good start in the state budget process this afternoon there to resolution that I have been working on that are up for a full Council vote one is resolution 31873 which would recognize the work around the University of District Light Rail station Community folks have been working on a project the last several years to create a Community Vision for what kind of Civic infrastructure they want to see around that light rail station given that multiple different Geographic representations from Sound Transit Metro the city of Seattle and frankly several different departments within the city rather than having each of those different entities. Come to the University District community and asked to participate in a public Outreach process or Community visioning process that Community proactively got together with some support and resources from us to hire makers. They went through a whole individual charette process as well as Community engagement process and where they landed was a vision for more and better mobility in the neighborhood so that when each of those different enemies come to them and ask for input they can just point them to this plan. It's a plan that I think was well thought the road took several years to come to fruition and resolution just merely adopts the council support for that plan II is Council resolution. 31876 is a resolution in support of a United States Senate Bill 70-26 also known as the personal care products safety act as a bipartisan Bill introduced by Center spine. Turn Collins to protect consumer health and the fda's efforts to regulate ingredients in the personal care products industry. This is a really important and personal issue for me as somebody who's watched. So many relatives passed away from cancer. And it may surprise books to learn that the last major legislation that was passed to ban chemicals in personal care products was in the late 1930s. We as a country have banned about 35 products from shampoos conditioners shaving creams lotions the kinds of things that we all put on our bodies everyday. You know folks said that you have bad about 1100 of those chemicals. I believe it is our duty to try to support these kinds of changes to National Law and am dismayed that it has been 90 years since we're taking a hard look at the kinds of things that go into the personal care products that we use everyday. I should probably also say very publicly that this is a personal issue for me. And for the missus Katie, does this kind of work on a daily basis to try to make sure that people understand the kinds of things that they put on their body so I don't want to get in trouble with Wayne Barnett without having said, yeah that my wife does this work to she's a big believer in what we can do to help make sure that the things that we put on our bodies everyday are safe few things. We don't have a planning and zoning committee meeting on Wednesday morning with contemplated a couple of small things. There wasn't enough to pull together an agenda and I didn't want to leave it to council member O'Brien. To Shepherd through a few last things across the finish line. So I think that that will wait until the next District 4 representative has been appointed. I have suggested to both councilman Bank of Dallas and councilmember wireless some Concepts to potential include as you all consider that final implementation plan for both the library Levy and for the families application preschool promise Levy. No, no judgment, if you choose not to take any of those ideas, but I've been around for the last three and a half years. I thought people might be interested final thoughts and then last week we had a really good discussion, I think on Friday morning at the Sound Transit West Seattle Ballard Light Rail extension elected leadership meeting got about a month left final discussions there, but I want to say I'm really proud of the progress that we have made. I wouldn't be ditching this job early. If I didn't think that you guys had it all under control. Also are good questions that were asked their by folks and I'm excited to see where you all and I'm sad that today is my last day but in many ways, I feel really great sense of accomplishment about what we've been able to do together and I'm proud to watch the Legacy continue with the great remainder of the year for the eighth of you and whoever is going to be the next person sitting in my chair desk as it relates to the plus committee. Did I hear you say that it's your understanding it will be meeting until there's a new person in your position or I I had some status app conversations last week and I was under the impression that the co-chair are the vice chair of the committee would be would be having and scheduling some meetings in the interim, but I don't know if that's the case. I think so. Depends on his ability to touch are those meetings in my absence and I do know the There's one issue that may require some timely action a contract rezone issue that has been remanded to the city that where we have to take action within a particular. Of time. I'm not aware of the schedule associated with that, but I'll leave that up to council member O'Brien as to whether or not she wants to have the second close committee meeting that we would have at the end of the month. My understanding is that it's up to him and you can make that decision. Although the council president. I'm sure is the one who really is in charge of all this we could always refer another committee as well and good for a to let me know I'll work on that. We don't have to have a real witch when they want to schedule here many. Thank you Alice. Good morning this week. Channeling councilmember bagshot at this point because as her Vice chair, I will be discussing at this afternoon's full Council agenda item number 3 end of the finance and neighborhoods committing report. So that is cancelled L1 19485. It is a ordinance that will authorize the superintendent of Parks and Recreation to execute a lease agreement between the city of Seattle and has a lake Holdings company LLC and this is essentially an ordinance that would allow the parks and rec office to move their existing offices that are currently in a Chinatown International District to a new office space at 300 Elliott Avenue West. It's a 15 year lease and the lease can be renewed for two additional five-year terms for a total of twenty-five years and I'll talk a little bit more about the details of the transaction at full Council. In a fact it means that a hundred thirteen of our existing staff at Seattle Parks and Recreation will move from the International District space that they're currently occupying to a space that is much closer to spr headquarters in the Denny Denny Triangle area next to I just wanted to give folks a quick reminder about about take your youngsters to work day. So my office will be taking over the hosting of this really fun and amazing event. I want to Johnson for having implemented this program at City Hall in the first place a couple of years ago. So this will be our third year doing this. My office will be hosting it and it will be on Monday April 8th, which coincides with the first day of Seattle Public School's spring break. They'll be a full day of programming available for kids including drop-ins from the scale Department K-9 unit. Seattle firefighters and a folks from the office of emergency management and we have a ton of swag from the sale Department of Transportation as well things that flash and Blynken jump ropes them and whatnot. So, I'm sure the kids who join us will love that don't give away the bells at the beginning of the day. That's why I'm not offended. If your kid for take your against her to work day you can still do so, it's not too late. You can reach out to Roxana Gomez and my office and she'll be happy to send you more information about that. I really want to encourage those of you who are here on Monday April 8th to make efforts to meet with the kids who are coming and I think it's a really important part of what we do here at City Hall and I think it means a lot to the kids to be able to walk into council member offices and see the actual councilmember, you know, we represent the verse constituencies. I think it's important for girls to see women in these rules. I think it's important for kids of color to see a majority of their city council is people of color and I really want to make sure that we are fulfilling our obligation to lead by example. And so I know that in the past tense for Johnson has said that you can close your door. If you are too busy and don't want to see them I am discouraging you from doing that and would really really invite you all to welcome these young folks into your offices and allow them an opportunity to see exactly how representative there city council is of them and that they too can someday work at City Hall and be a council member or legislative aide or or whatever it is. They want to do so really want to strongly encourage you to welcome then into your office and those kids really like the sinks and mini fridges behind the doors books. Everything's going to be fine. It's just like being at home. It's going to be great. So I'm really excited about that last lie. Just wanted to chat really quickly about some of the things that I'm going to be doing a week for small just wanted to acknowledge that today is April 1st, which is not just April fools day, but it is the kickoff of Sexual Assault Awareness Month and I wanted to Variety of programming throughout the month of many of our community-based organizations who dedicate their work to a prevention of sexual assaults on and that you can keep an eye out for many of those events. I'll be I'll be bringing as many of those events to the table here to make sure that you all are aware of them and are able to boost them on your on social media networks and hopefully be able to attend some of those events throughout the month are some really exciting stuff. It is being at planned and by community members throughout the entire month, and I know that tells liberals going to leave the effort on once again, I'm introducing a proclamation to both acknowledge Sexual Assault Awareness Month and denim days. So we're very excited about that as well and will have community members with us and Chambers to be able to celebrate that but I think that's in a week or two next next Monday next Monday. So great also really excited about getting back into Community tomorrow 8 Second I will be spending the entire day in District 1 which it seems unusual to say since I live there and I spend most of my time and I will be starting off my day a touring the River City skatepark in South Park. I will head over to the South Park Community Center and do a tour there and I will be holding District 1 office hours at Mercy Senseo coffee Cloverdale. Also in District 1 after that we'll head over to Concord Elementary School, which is one of the elementary schools that receive the investments from her family's education Levy dollar is really excited about heading out there and meeting some of the kids that benefit from our direct investment at the city of Seattle for families and education Levy really excited and then last night and the day meeting with the Amish Valley Housing Coalition group where they will be feeding us some Alice in horchata. Cuz of you who don't know what horchata is. That's fat rice milk based drink that is served very often and and Latino families to celebrate special occasions. So I'm very honored to be fed and taken care of by community in District 1 all day on April and 2nd South Park hold is a very special place to me since I lived there for 3 years including during a. Of time that was experiencing a peek of public safety concerns including gun violence in Munster youth. So I'm really excited to have to go back to District 1 in to South Park in particular to meet with community. And for those who are Spanish speakers only and I'm excited to also cold some of these district office and Community meetings in Spanish and English as well on Wednesday, April 3rd. I will be at the tree house luncheon and on Thursday April 4th. I will be Welcoming the French American School of Puget Sound in my office. I have the pleasure of being able to auction some of my time off to students at that 4 to go to school. I'm really excited about welcoming a group of 12 and 13 year olds in my office on Thursday April 4th to talk to them about the work that we do here at and the City Council on that evening Thursday the 4th. I'll be joining folks over the legal voice cocktails for cars and on the 5th. I am and excited to head over to the West Woodland Elementary School to visit with a fourth grade class to talk to them about immigration and Refugee issues. They are doing a special project to learn about what does immigration mean in America and I'm really excited about heading out there and sharing with him a little bit about my story and why it's important for them to continue to be engaged in those issues. So pretty inspired that a classroom of 4th graders is so interested in tree. And that issue attending the one America dinner on April 5th at 5:30 p.m. And hope to see many of you. I think he'll remember her both will be sitting at my table. If any of you are eager and itching to attend to win America's enter. I strongly urge you to do so cuz it's like the funnest party of the entire year. But if you are looking for a place to said I will welcome you at my table if you are so interested that is it. Okay. Thanks for going around the table and sharing all the information. So as presiding officer housing. Seattle Council now convenient executive session in the purpose of the executive session is to discuss pending potential or actual litigation and this gives us an opportunity to discuss confidential legal matters with our legal with our attorneys as authorized by law and a monitor from the city attorney's office is always present to assure that we reserve questions of policy for our public open sessions. Expect this session last for 30 minutes. So we'll say it will end at 10:30. 1044 annecy executive session is extended beyond that time. I'll announce its extension and expected duration and was that we will move an executive session.", "end_time": 2505.0}]}