{"format": "raw", "annotations": [], "confidence": 0.9415365825681126, "data": [{"start_time": 0, "text": "Good morning. Everybody think you're being here at City Hall. We are here for our governess. I could and Technology committee a regular to schedule May 7th meeting we have to agenda items were going to go over this shell Information Technology heart rgi presentation erasing social justice initiative and the digital Equity progress report or going to open that first Republic comment. I don't know if we have no one up for a public comments or move right into our Genie what I'm going to suggest the Samuels is that you read them both into the record and why don't we have their very close to related. There's supper topic with a close related with having everyone come up to the table at once and then we could try to cross pollinate the discussion a little bit. So why don't you read them both and record and if you're here with the for the rsgi presentation or the dishes Equity progress report coming to the table and enjoy me to Seattle information technology department Seattle it race and social justice. Haitian agenda item number to digital Equity progress report get a so unless some of you have political Ambitions. I need to know about you could come. Okay, before we dive into the RCI discussion, why don't we just go around the table with introductions? I see you're pushing turn green and already you're going to go. Okay. I am Tracy Cantrell. I'm here on behalf of sod this year the chief of staff for Seattle it. I'm Ted Weinberg one of the codes for the RCA change team in Seattle it Anthony Davis the other cool lead for satellite TV. Benitez before mower farmer RCI Kool-Aid Jeremy down contracts manager for sale it David Keys digital Equity program manager in Seattle it Jim Lauder director of digital engagement with Seattle it presentation and I'll just relinquish the authority to proceed. Anyway, you like us started. But all described is what we want to do is have as many of the people that have participated in this effort talk directly to you. And so we will kind of Step through the memo that we sent and each person will describe their participation. And so we're going to hear from our change leads and we're also going to hear from the digital Equity director Jim Lauder and I will let Jim begin with C digital Equity. Peace. Great. Thank you. So is luck would have it or coincidence would have it. We're also on the agenda to discuss the 2018 progress report on our digital Equity initiative. So I'll keep my comments brief in this context, but we shall I cease very proud to leave the city's efforts to close the digital divide and expand technology access and skills to all residents and communities are objectives in the digital engagement office are consistent with the city's rsji commitments to eliminate racial disparities in a t racial equity in Seattle. Through our work in 2018 over 4,600 residents receive digital skills training through our community Grant programs and other support that we offer to organizations and Seattle through our work to administer the city's cable franchise and the benefits that we've negotiated from cable operators. We support 223 Community organizations in receiving free Broadband access to help serve their mission and their constituents and we've also helped 2469 households enroll in discount internet services provided by Comcast and Wave Broadband through the free Wi-Fi and computer access that we support a community centers the city serves over 50,000 connections per month in those facilities plus hundreds of thousands more in libraries another city buildings. We arrange the delivery and set-up of 162 computers to low-income residents and 198 devices in total to thirteen different Community organizations through our Partnerships with affordable technology partners and through the technology matching fund another similar programs total. We we supported 16 Community projects this year last year in 2018. We also completed our technology access an adoption report which was a comprehensive population level survey that words related to internet access and adoption and the barriers that people experience trying to fully utilize the internet. And you'll hear more about those findings later on the agenda on finally. I'm proud to also oversee the Seattle Channel who in addition to filming and streaming us. All right now and it every council meeting in committee meeting. I told them to make sure they got my good side. So so they're shooting me from the back. I think he produces award-winning original programming at showcases the cultural Civic and community life of Seattle in 2018 to channel produce 60 programs that feature people of color and organizations doing rsji related work. For example, we covered indigenous peoples Day events here at City Hall. We featured Robin. Diangelo talking about her book White fragility and we covered topics such as immigration and Community displacement in Seattle on programs such as City screaming City inside out. So that I look forward later in the agenda to working with David Keys here to review our digital Equity work in more depth, but for now, I think I'm passing things to Grady Bonitas or to text back to Tracy Tracy. Thank you. Is looking at the whim be numbers and some each department is required to submit those. I am pleased to say that we did achieve our goal. What's more exciting about Justice statistics though of meeting a goal is on at this is why I bought you ready to try and then we've made a real emphasis on Contracting and bring it in consultants for minority businesses. And so I want granny to share a little bit about that work because those are really the drivers of our statistics. So when is the biggest initiatives that are RCI change team has committed to over the last two years is to bring help bring more minority business Enterprise. Contracting to Seattle it and the city so we are holding an annual this year will be our third annual MBE event. We usually hold it between July and August and I usually those those results aren't seen until the year after just because of the way Consulting Contracting works, but we have to say there are people coming from all over the Pacific Northwest to attend this it's also a good opportunity for the hiring managers to talk a little bit about the projects that they see coming in the next year or two and get that one to one engagement with potential vendors or potential Consultants. So again, this is this will be our third annual NBA event at the I was speaking to Jeremy and we when we migrated to PeopleSoft 9.2 we don't have the capabilities yet to pool. Specific NBA vs. WNBA capabilities at the moment, but I do I do think that we have been able to contract to contract Consultants on the very first MBE Thunder event that we did in 2017. So in addition our change team last year in March decided to we have a 44% change team and we decided to divide and conquer so we divided are changed him into four committees. What is the events in engagement? What is the resources committee? Another one is the workforce Equity committee. And the artist j i r e t racial Equity to look at committee are events in engagement committee has focused on doing at least a monthly event. All of last year. We did the NBA event we did where I'm from which was an internal engagement for Seattle it we also partnered with other City departments like spu to do the Juneteenth Eva. Also the bite of Seattle. We've also continued to have leadership engaged in two and play set bias training the year and they So that commitment and plan to continue doing that. We've also Incorporated but clubs and lunch-and-learns. So we've held a few conversation cafes around different topics going on in the Seattle area, but also implicit bias. Our Workforce committee is Greta Creek Apartments. There have been challenges to get employees to engage in the rsgi initiative in the change teams summer much smaller, even in larger departments and in some departments is really just got in full engagement energize engagement I should say. So where are you in terms of the feeling is though you got the kind of Engagement from employees as you like. Are you low medium high can sure to describe the context and Ira do recognize. It's always a challenge because people are very very busy in terms of dance in terms of is the supported. I think last year compared to the first year-and-a-half that week and so after we Consolidated there's been an increase participation from in 2017. We had a solid 1213 person change team now, we are at 44 so I have seen a significant participation from the entire department. As these events and these opportunities for RCI activities come about everyone wants to go to you know, that nbe fair, but they may want to go to a conversation Cafe, which is a little bit more intimate a little bit more of a deep dive for these types of conversations. I do feel that ever since last year. We've had a lot of one-on-ones with our intern CTO and now our currency to Euro where we've expressed how much we need leadership support to get that momentum for employees to feel like they are supported and they are allowed to take time away from their desk to participate in this fully engaged and supportive you see the change but I don't always attributed to that but that seems to be a consistent theme and where to get energized engagement. Leaves that we usually charge our time through project codes and this has been a request that we've made throughout the last couple of years. So we're hoping that this year we are able to get it because when managers fill out timesheets, they want to know what you've been working on. So we do want it to be a line item. So that is that could be built into the re three goals and we can see where we need to increase participation or seek more participation from depending on the different divisions. Two, I think I was that the next one in the speaking Cube. There was a paragraph in the memo at the very end of a talking about the concerns that the bill be expressed about the resource constraints that resonates with what you were asking Bruce in 2018, the five divisions of Seattle it outside of the digital engagement division struggled frankly to I get more than say two projects through the racial Equity tool kit to get a sufficient amount of training available and attended by employees at all levels of the organization and we struggled to get the data necessary to conduct a Workforce Equity study. The good news is that in 2019. Anthony and I are working directly with satellite TV leadership to do identify that there is a gap to acknowledge. There is a gap and to secure the resources necessary to close that Gap and move Beyond it to create like a a technology specific. Racial Equity toolkit that we can apply to a broader swath of our 150 project portfolio and just want to explain some of the other items that were doing addition to the toolkit. Our plan is to kind of partner and align ourselves with what h r i t h r has been developing a training and development plan to kind of aligned ourselves to provide more training for all staff and some refresher courses things that we were reassured that would be funded and hopefully backed all the way up the chain as well as we've made a request for a Workforce. This what this word always gets me because there's work first and there's work force split between city and state Workforce. The equity study thank you, which would provide us with more data exactly on where we might lack has a department as far as equity and diversity as well as some service to provide to move forward with provided support by our new CTO and hopefully continuing support. Hopefully, you know in the next year when we come to sit down with you will have greater results and and more more data. Cutter mosquito and we just for our large viewing audience. What are we talking about? Making sure that there's adequate services to the smallest Apartments as well. Cuz I think the folks like office of civil rights who are clearly a smaller entity and also are probably more likely to be filled with women and people of color or is that what you mean by service Equity Services both internal and external as the consolidation is happen, especially for some of our smaller departments. We continue to hear that old access IT services in a timely manner that's cost efficient as well have been a challenge. So looking forward to hearing more about that Equity service model and just put a finer point. Follow up and make a plug for specifically for some help to socr on some of their website needs its really I know it's a request that's been in with y'all. Just really that's a the resource that the public really relies on because it has all of the public facing information about our civil rights laws and how the public can contact socr to for enforcement of them and they I know they're in the queue. So the Citywide change team has a committee working on developing more SharePoint assistance. So to speak I recently visited the site and it is yes completely updated but there is a team working to provide a SharePoint that would Encompass the external and the internal and house both documents and trainings and things of that nature that would be accessible bio. I didn't think about that issue about the internal services to small apartment. I should have see that isn't it not to push the The blame I think one of the nicer to see that as a resource management from the executive side as much as anything else i c a r s a I should have angle if you will because of what customers could save some of the employees might be into smaller Apartments. But but on our terms of a resource allocation issue in time deadlines on service. I'd be more than happy to talk to any of you about how we can prove that. I always tell folks like unless I hear complaints sometimes I don't know where but I have to come in that I shall I T on for the most part outstanding service, but I do want to hear about the problems with the smaller Department. I just wasn't aware of that. So my day job is being the resource manager for the portfolio team one of the two resource managers that we have so we can blame you for events for prioritizing our portfolio across the entire city so that we're not just looking at what's going to produce revenue or what's going to produce cost savings but by factoring in RS giant factoring in ID service to underserved communities and factoring in life and safety in all the different factors that go into the public sector project portfolio created a a subcommittee of the business steering committee to focus on that prioritization and wants a quarter that we get together and look at the entire portfolio and re-sequence it based on which one really has to come first which one is going to have the biggest impact to the city first and stuff cuz the point I wanted to say that a lot of the conversations and you asked about you know, I think it's incredible that are changed him has grown from a dozen 2/40 and there is no end of enthusiasm in Seattle it for moving. These four words are struggles really are we want to do more? How do we do more? How do you balance that with your resources? When we get to the digital Equity report, I had some ideas there too. So that's a great Point Raise you thank you very much. I'm not doing a hard cut off from one of the other so it's so you sure to lead me on turns it when we want to just move more into the dishes like a point when they are shy pieces finish. So I'm letting you keep me so you pretty much through your present it over and there's a powerful questions I have or should have our share related. So I'll Reserve until we get to the digital Equity paste. Yeah, you got a brief overview of our efforts in 2018, but he's here's the digital Equity program manager in digital engagement. He's going to be taking you through our 2018 annual report. David great. So thinks it's a great opportunity to come back and and share. This console was really involved about 4 almost 5 years ago as we were developing a digital Equity initiative and plan and so we've been working on executing God and also responding to the community as we keep going as well. So this is a little bit of a report on what was done in 2018 and we'll talk a little bit about where we're going in 2019 as well. So our vision or digital Equity Mission as a as a city both big sea and small sea because as we're doing digital Equity work, we rely a lot on our trusted ambassadors in the community are Partners both across the city and different departments as well as across the tech sector as well as The community-based organization and the variety folks that are really on the front lines of making digital Equity work with us and so are our vision is that Seattle the city where technology opportunities equitably and power all residents and communities, especially those who are historically underserved or under-represented. So that continues to be a guide and where are investments in our effort go. And this is just a little snapshot. I'll talk a little bit more about the the detailed numbers in each column here as we go but our digital Equity framework in general covers the start of three primary areas in and a couple other so as we think about digital Equity, it involves the skills to be able to use technology connectivity. Jim mentioned earlier for instance the work on signing up folks were discounted internet programs devices so that people have them and can use them and then application online services. So what are we doing in our web portals to make information more accessible to enable people to interact enable people to transact with the city on a more Equitable basis also mentioned as we look at our strategies to ensure every resident has those necessary Technologies. We also recognize a part of our our work is to build capacity for Community organizations to deliver Services also, so you'll see that reflected as we talked about some of what we accomplished that that's both building capacity for individuals out in the community and building capacity for organizations that help serve community on the connectivity. So those internet service providers. have discounted services do they offer for an example to be kids on free and reduced lunch in Chappaqua schools cracks Comcast low income internet programs and there's another low-cost option as well. So both wave which we started up last year there low income program and then Comcast has their low income program. That. That wasn't my question. I was a preface to the question show. So, yes, it was just the short answer on that question. So Organizations. I'm assuming that we are working closely with them to get their potential customers hooked up to their children. And what does that look like? What are we doing to assist? The residence where the users to get the internet to lower internet charge because some of that might be eligible and a paying full retail for the shows. Not even though they're eligible. So, what does that look like? Our tracks aren't Asian? Well, I think there's a couple things so 1 is that particularly with the way franchise what we were able to do is to partner with them so that our cable office folks within digital engagement are able to actually assist in doing the the eligibility verification for folks in and help them sign up. So that's a really direct thing that we also and part learned from earlier experience with Comcast. Another's do we have independent information either through utility bills or utility bills? That would flag to us. All this person is eligible then are we capable of sharing that data with the customers? And by the way, you're missing a swath of people in this neighborhood because they're all on discounted. Are we doing that kind of work? Do you have that capabilities or other departments? I understand that we haven't done the handoff between the utility assistance in the cable customers yet in in the latest Cable billing that went out. We also let folks know about the program. We also did included in our technology adoption Community survey last year a question about people's awareness and use of the low income internet programs. So I'll just jump into the operators are required to provide information about these programs in bills that they send to customers. We also partner with Seattle Housing Authority to get the word out through their facilities that they both manage and Chevrolet. T-shirts with through the the Housing Voucher Program, but but they're there issues with using the utility billing data in this contacts that were trying to work out just because of the nature of of what's represented to the user when they sign up for the utility discount program how their information is going to be used as well. We know the eligible consumers that we just simply told them directly hate over here. And I don't know your subscriber is because you can't show partiality, but you might be eligible for this that kind of thing. We can go to that channel exert any of her bows and Q. Maybe you are doing this already but with the city's utility discount program, we recently moved towards you would want to do this because they're still a cost to the low income internet, but we move towards allowing sha to work with spu in City Light to automatically sign up because sha knows the income because you would not be living in sha housing if you weren't already low income, right? So they've been able to automatically not waiting for people to contact them to sign up for you to pee. It's an automatic sign up and I'm just wondering sign people up for low-income internet, but you could certainly have a way of automatically contacting turn up the great idea. And I'm also aware that some of the internet providers in recent years have said that sometimes they believe their subscriber ship on the Logan and it is lower than it should be in there not hitting their targets to provide all of the eligible people. We know that also the people are subscribing to services at a higher rate than they need to but sometimes making there has to be a companies have a waiting. If you're already subscribe to the company at a higher rate, you can't you can't have service for 3 months to transition to a lower rate because their target is Justin new subscribers only. So that's the challenge also in terms of transitioning people to cheaper rates. We could have changed out on franchise agreement or I tried all that was said about the worst. We've already done to connect folks to services that they're eligible for of I oversee City Light overseas on public utility. So this is a really great Synergy and your committee chair, but I think we are missing huge opportunities. And I know this is a slight deviation from your report, but I do want to put a pin in this and then publicly acknowledge that this is something that I think we are far behind the ball on and I think i t u r a in a perfect position to help us catch up when we look at what the state does with enrollment into healthcare Apple health for kids or apple health for adults. We have automatic enrolment if you're eligible for WIC if you're eligible for food stamps, if you're eligible for take charge you are eligible for all these other services as well. They have the data. They also make it less traumatising and confusing for people to fill out the application. So we made some strides Seattle City Light has the amount of people enrolled in the utility discount program by three fold, but they're still three-quarters of the eligible population not enrolled. And so when we think about ways to streamline the system instead of just giving folks a phone number or saying we're required to give them the information. We need to be figuring out how to automatically enroll them. And I just don't think that this might be something we would want to take out this year budget-related potentially or otherwise for you all to give us a sense of what we need to do to make that not just a warm handoff because I would be the second best thing compared to giving somebody a phone number but actually automatically enroll them. I agree that everything you said I do have an appreciation for the challenges with that though. I mean if it were that easy to probably would have been done but I think that's Mariscos when is well-taken may be in 2020. We can really think if they're if its resources than than less stress a resource issue, but but I do right recognize some of the challenges that face which of these are Commercial Services as opposed to government programs. So automatically enrolling in the internet service may present some challenges because of that and yes, and I think now we're realizing the critical nature having high-speed internet access. I mean it is truly a digital divide. So it's no longer a luxury for a sew-in folks. It's essential for job applications for access to so much information. So I think 2 to get as creative as possible man could be there could be. Raps outside consultants and other resources that can help us really astronomically change the needle on this and so I got it. Thank you. I'll be coming back a little bit more to connectivity dress well, but thank you. So, you know, we know that is a huge issue for folks. We know I'm from a survey and minimal at least 14% of our population has low digital skills, and we know that it's greater than that. So last year we supported 23 Community organizations directly that provided digital skills training the picture here is of education for all where immigrants are taking classes on basic computer usage internet citizenship and digital self-sufficiency to build skills. So we provided training for almost fifteen hundred residents and we know at least 373 of those receive training and job search and career skills. And those are the ones that specifically identified that certainly in some cases. There was one on one assistants that wasn't necessary always track so we know the numbers higher than that and then we are able to help at least 1295 youth with stem digital literacy and enrollment programs. So there's a quite a number of our projects that are providing after school programming and teaching digital skills at that time to so this is just a small cross section of some of those folks the ones that we have reported. So, you know at least 20 249 people are really low income reached about 1456 immigrants and refugees 1200 youth 96 folks with people living with a disability on one of our projects and partners Fox working in Seattle Housing Authority reaching some of those communities and 677 older adults and 45 people that we know of experiencing homelessness. This is just an example one of the projects last year was the West Seattle senior center with a shout out to a gentleman there a volunteer from the community Burke Tikes who's really helped lead the West Seattle senior center, and we were able to help equip them and provide training a result of organizations were funding doing that kind of work. Yeah, and when I looked at though, it seems somewhat low and I realize that's a challenge in demographic but the thought occurred to me that hearing in City Hall as an example when we have people return to homeless sleeping here that they come fairly early have to wake up fairly early. I think I don't know what time I have to be out now, but it would seem to me that even if there's some basic Skills are some basic access in addition to the semi we should triple that number pretty easily but I I don't know if those are the organism Samaritan technology then I'm interested in at least and looking at how some folks I think that maybe maybe have other behavioral issues that may not be conducive toward this kind of internet access, but a great number of them I think are right there at the edgware get the resume Titan get access to service can really make a huge difference in another more than 45 people like that out there. So that number seems a little low. So when I guess when we look at our portfolio the question becomes, how do we sort of address that Gap? I think it's really important point is well I'm with you on that and we know that we know the trucks are coming in and using showers at our commute. Center in using the kiosks there, you know, I'm coming in using some of the training there. So we know that that public Wi-Fi in those kiosks is one way that we also serve folks in the past. We have funded and worked with Plymouth Housing groups Lehigh downtown emergency service centers in others to help put technology in there to help. So so I think there's still a lot more that can be done. I'll talk a little bit to about the Wi-Fi's Seattle Public Library's expansion into the tiny home Villages this year has one thing as well as well. But certainly there's more that can be done and I think in terms of helping to link people to the pathways to opportunity then having the exposure and having the equipment in the connectivity in the training is an important piece of that pathway also, Seattle supported 23 Community organizations that provide additional skills training and then on the next slide we break up into some of the demographics of folks who received at training so we can assume that these 23 organizations or organizations that were serving these different demographics. And that's how the services were delivered. So is is it may be reasonable to assume that of these 23 organizations perhaps only one of them was an organization that was focused on serving the particular demographic of people experiencing homelessness. I think this past year. Let's see. So we completed 23 projects that we assisted and set it to some extent it varies from year to year if the technology matching fund for Grants are are more youth programs or senior disability or serving homeless. So so one of the ones that this past year or this current year, that's that's working now for instance then as a millionaire club. I'm so I presume you'll probably see more this coming year. I think there's also a challenge that again also in the capacity of some of the community organizations to track so both for people's privacy say can also do data tracking systems and also that that comfort and collecting the data from people. So that's something that we're working with them as well in I'm helping them better tell the story and collect that information and there's some room to go there as well. I guess you can't blame her bones point one of the things you can consider this a departmental call. I'm not putting a strong direct about that. When we do look at the technology matching grant program. We can have to shift the emphasis on. Are the needs of the day sometimes and maybe with their kid being emphasis on and I know you care and other organizations that benefited from this do folks on this demographic, but that might be a consideration the homelessness angle of the war. So I'm connectivity. So we mentioned that 223 organizations or receiving the free broadband internet that that we have off are able to offer to organizations providing access in training through our agreements with Comcast and wave so that that total value is about 468000 and those sites us-223 organizations estimated that they serve 200 5,000 residents. It's the first time we've really collected that data from those we've been doing an audit of all the the sites and that's helping us collect get more information and we're continuing to also tie those organizations to our other grant program. So, you know, so when we ask people when they're applying for technology matching fund we ask them if they have a cable broadband connection and if they don't it's an opportunity for us to also increase those number so so we have some of those services that will the number of sites this year this is super exciting because I hear you saying is that if they're eligible they can receive actually discounted but free by the number of eligible organizations or is there a cap on the number of these types of agreements that we perhaps under the franchise agreement? I have purchased. Yeah, so we do have a limit on how many that we can add each year and a cap. So it's like a maximum. I believe it's 500 and Comcast and and then there's a limit on on wave as well. It's about 20 new sites we can add per year right now. So they're certainly certainly room to do that. So it's basically the eligibility is that it has to be a non-profit and has to be providing some Community Access and training and or training. I have no internet service at the time that they're signed up so I can have whatever internet service for Mike. Yeah, and it's a third clear third-tier class isn't service. So it's quality service for organizations and lets them put that money back into Services instead of the internet. So it's a great resource. I'll just mention 194 the folks that subscribe to the discount internet programs last year where residents of Seattle Housing Authority community. So that's been really helpful partnership. I think with them. And so the city of Seattle provides free public access to computers and Wi-Fi and 70 sights. And so that's 27 libraries 29 Parks and Rec community centers six of our FAS customer service centers that provide just kiosk right now and other City Sites including City Hall here Justice Center King Street Station in toe through that combination of public sites are able to provide almost 900,000 kiosk sessions and 3.8 million Wi-Fi connections to people's devices across the city. Here's what the library has been working on the mobile connectivity. So they have three I mean 675 mobile hotspots available for check out last year. They had 8254 of them and 527 checkouts were through prioritized community outreach. So that's when they're reaching into immigrant Refugee communities and other so they also have done more Outreach to some of the homeless communities this past couple years and this past year that also resulted in connecting five tiny home villages with internet through hotspots through fix hot spots with T-Mobile as a partner there. I'm so that's just a really positive thing as we see it as well. Remember, I really appreciate the work you're doing this specially help those who are experiencing homelessness have access to Internet. Can you also talk about the access to hotspots or Wi-Fi and enhance shelters or Matt on the ground shelters? I don't have a lot of information about that. You know, we know that we have supported in community community rooms in some of those organizations Wi-Fi connectivity. And so some organizations. We haven't done a full survey of exactly where that is. We know through a couple of matching fund projects and through through some of the cable Broadband connections that go to organizations serving homeless, if they've added Wi-Fi to those primarily in community rooms. I'm I know and it totally of some organizations that have increased access to individual Apartments. We haven't done a full survey on that at this point. I saw you writing it down. So I appreciate that have a better understanding of how many of our enhanced shelters and non-enhanced shelters the mat on the ground places along with the number of our permanent Supportive Housing units that office of housing helps to regenerate how many of those facilities do have access to Wi-Fi services as council member purple than that. I'm sorry council president Harold mentioned, you know, it's no longer a luxury. It's a necessity especially for access to Medical Care and keeping your job access to the kiddos homework even that'll be an interesting learning curve for me. It's really important that we have access to that internet service. So I love to hear more about the shelters in the permanent supportive look into that. Thanks. What sort of this is a run through their budget we offered them in expanding that program last I checked the waiting list was about 3 months long and 1,500 people really really popular program. And if there's something that we as a city can do to leverage their investment in hotspots, I would really like to look at that. Well, I used to work at the library and started the program when I was there. I would say it's a function of money. It really just comes down to that. I think since the program was started the library was able to negotiate a much better deal. And so the money that they have allocated to that is going farther and was able to get that waitlist down to the level that you're saying. It's still not great, but it's it's better than it was. Why was there so I mean that that without me or three three years divorce from the organization I can say is probably still all about money. Likewise if we wanted to support them in purchasing more hotspot. It would be a matter of this Council making it a priority to provide the funding for sure. Yeah. I mean, I think that would be that would be one option. The one that that you would have the liquor little ever on certainly but again, I don't know I haven't delved into the details of the Levee that was just approved for example to see if it's Pacific funding was set aside to expand that program. But you know, I know it's wildly popular and it's just a supply-and-demand issue at this point. They're good. Run 10:20, okay that we help the community get for organizations. So in 974 of this total number of devices came from Finance administrative some services from our city Surplus computers being redistributed to schools and Community organizations and start to see a little bit of the distribution that went out there 46 tablets, you know, we funded seven smartphones and then a few robotic kits and 3D printers and other things that are providing access to more advanced technology for education purposes. So in this is just an example of the library and us and Somali families have safety task force working together on where the library provided training to participants through Somali Family Safety task force, and we also helped enable them to get laptops through that program. So bringing together that skills connectivity devices train. 782 laptops went directly to low-income individuals. Some of that was through our partnership with Seattle Housing Authority and the HUD connect home program that we are participating in. And then just kind of turning into online services so part of the gall increasing accessibility summer of last year. And then this program has continued we partnered with a Civic user testing group to do usability testing on the Seattle. Gov website. They worked with Seattle Housing Authority residents for them to also be usability testers is a great great kind of step forward and turns his diversity and who uses our site until that's helping us with navigation more friendly design looking at voice-activated online services. In the city work on its affordability portal. So, you know, so that single point of of presents where people can find out about ways to get free and discounted services to help ease some of their financial needs. Finally just the last couple slides here. I just want to kind of re-emphasize, you know, as we work towards digital Equity. What a partnership that is. So the funding that the council approves for us to work on digital Equity, but we reinvest in community and are able to match the efforts from the community to enable this work to go forward. So it really is US public-sector folks with a library the Housing Authority Seattle schools working together along with contributions from the private sector from Comcast wave Facebook that contributed to the tech matching fun last year T-Mobile and then the community so, you know through that work there were 269 nonprofits involve 244 community volunteers who donated almost 7,500 hours of service working towards digital Equity until that really extends what we're able to do with the dollars that you guys Allocate to this work. Can I go back to the Precinct Line number 14, please show that there is online now, so that's a portal by which a person going in now get the utility discounts utilities is down at the bottom. Is that what's that since they can access the information about the programs and filter State based on their their interest. So we we we just combined all the information into one place. There's work going on right now to streamline the application process or some of those programs. The majority of those programs are not City programs. So there's a limited control we have over that before the ones that we do control. There's a project underway right now. So does that link to the does it link that's information on them programs, but then does it link to the application process where those applications are available online that the links are all in there as well. Yeah. It's a step in the direction. I have been on the city of Shadows. Website is this pretty obvious to someone that just happens to go on it or how many pages back is it or do we know how would one get to this how they know that there's a making show more affordable, but we can check to see where the links are available. We also just completed a major enhancement of our search functionality and we have the ability to bring certain resources up to the top of of search and and have more granular control over that so that that's another thing that that we could do cuz you know affordability is not a term. I think that a lot of people looking for a discount program would use it's a term of art that we know what it means but we have the ability now to Pepper that page with all sorts of terms and metadata and keywords to make it easier to find and I can go back to the team and find out what they've done to make it more discoverable. Is it is to get to and how much usage were getting out of its go but I like that pay just want to come back to get you to go for it. But I hadn't seen that page / affordable just to put that one out there around folks try and while we continue to work on that visibility and presents go to Seattle. Gov / affordable. So I just you know shout out that it's not just Seattle it but their it departments that contributed to improving digital equity in 2018. So it really is putting that digital Equity lens into the delivery of program services that helps helps us all together as a city. I work towards this goal. Last year, we we launched and are continuing to develop a digital Equity Network working with King County as well. So this is a little bit more Regional approach to bring people together to look at how we can leverage share best practices. And and so I think that digital Equity Network as we keep going forward will again help sort of further that that knowledge in that effort on digital Equity. I think just to jump in real quick the concept behind this really emerged a few years ago when third-party report on Seattle commended us on having a lot of programs in the community to support people on on the TV digital literacy, but sort of Dingus on on those programs not being well aligned your coordinator easy to find so so we we took it on to convene the major players in that space and are working with them and some research Partners at the u-dub to develop. More alignment common outcomes and breadth private practices for digital skills providers to use so I was going to retire but I think this might be a good point is I let me preface this by saying this has been a phenomenal presentation and outstanding work that committed in in executing. Well, I usually have to compliment like that there going to be a butt right that I think is conspicuously missing when I look at what we can do better as a city not I don't point the finger what we can do is I know there's a lot of phenomena programs a lot of Corporations you doing like Microsoft has the digit girl program that it's a lot of research behind the Amazon has some program where they use what they call Amazon. Manzana teaching folks had a cold and they have many more resources than the city. And what what my what I'm not saying is really a very intentional effort for us to get Max some use out of our dollars to try to partner or support our kids in our elders are aging population in are lower-income folks apartment in getting getting some of those resources program and impersonal Astoria is my wife who works at Microsoft. She took a bunch of kids from Cleveland High School in my daughter's they are too did you girl and she was shocked at the lack of diversity over there? And then she's on the other end hammering myself how they creaked increase the diversity. We know that there's a problem with women and some of these areas and minorities are so so so when I looked at the presentation in spite of all the great work tonight at night, I wouldn't take a dollar within the technology matching final we're doing a lot of these work embodies Grassroots organizations, but wouldn't it be great if we can get similar? Corporations in there with them piping resources piping Services into the end of the same organizations that we're fighting weak as a city as a hub can play a role to facilitate that it's a strategic Direction one of which I don't think we've taken in the past and I don't even know if there's a c are all aware of what the private corporations are doing for philanthropy and for addressing the digital divide. Why would we know but but art of maybe our port for the next year could be explained that as a possibility. So Tracy with more of the private sector organizations from a technology aspect and we could just leave that element of community service and those discussions and I think that's something that I can work with the leadership team and Saud because it is a very natural progression of the partnership that we want to have with companies that work with in our city or in our surrounding areas. So we so we visit Cesar set up the framework. I think through the Innovation visor accounts will we have those same players? Make sure off Amazon Zillow. They're all at the table and it is form Norm store manager that saying goes you got to get there but this is exactly the kind of partnership that I would like to see. I think I T group is in an ideal situation to not just friends smaller organizations birth certificate of the structure. If you will for these different programs anyway linking with Innovation advisory councils a good one as we look at those Pathways to opportunity what we are also continuing to do to think we can do more of his a link those projects together. So a group from Microsoft former Microsoft employees called Computing skills for all brought a technology Career Training to one of our centers with exposure to careers. And so we did a visit to Big Fish Games with them for instance another example of kind of craving both the exposure and ultimately getting some of those technology. Partners to understand what the community is in to bring some of their Investments as well what I'm talking about. So I just kind of to sum up then so so last year there were about a hundred 1.4 million + City contracts with Community organizations. So we have the technology matching Fund in a couple directed grants from our department. Just also a shout out to the office of immigrant Refugee Affairs ready to work program. So we're going to constant communication con Davis and folks are about that program as well and the neighborhood matching fund awarded a total of 97002 projects that focus on Tech skills. And then we conducted the technology access and adoption study. So we released the results of this about a month and a half or so ago. So we're taking this information out and using it as part of discussion with City departments outside organizations. We have a meeting coming up with Seattle jobs initiative. So I'm taking some of the data that we know about the needs in the community and using that as part of the frame to keep folks working forward on digital Equity work as well. And we also Jim just mentioned we working with University of Washington. So we've done a comparison of different career and different skills curricula and assessments so that we can articulate what different levels of skills are so that we can help be clear about where we're getting to in terms of training folks and work with organizations that are providing training. So they I understand and can help residents understand what the foundations are on those Pathways and the next level to get them to other Tech Career Training. So I don't think it's a great piece of work is available right now at seattle.gov 2018 text survey all of your leadership and the digital. Engagement record. I think you're just doing some cutting-edge works. I want to thank you for that. I want to bounce around a little bit if I can and I don't have a lot to say on the Consulting contract first. I want to always think of how much data and a lot of departments in my experience. Sometimes they are afraid of the data but no faction faction. So you do start to leave yourself exposed to some poking around when you do that and it but I think by doing that you're being very transparent so I can go back to the the Contracting results a little bit. I think we have some challenges here and I'm just wondering you recognize them as well. And and what are we looking at? We have a lot of zeros and some certain categories in that are not ideal in terms of the Consulting contracts and the purchasing order work. So maybe can walk me through this number five of eight. Whoever I didn't I don't know if it's r e c i t more the department leaders, but do you see some challenges here in and maybe we could talk about the challenges you've had? So there's there's a couple of observations when you look at this and what I focus on is do we see a zero anywhere because that for me is kind of a call to action and you can look at the end of them. Call to action. So when you see that and this goes back to the comments that Granny made what we're doing is we're looking at this data and going these are areas where we need to shore things up. And so there's this concerted effort at these vendor fairs that we're having to reach out in a more aggressive manner. One of the things that were trying to understand is if we brought people to the table, why didn't they result an actual contract work? Some of it is because it takes time and others of it is we make have enthusiasm but they walk away and maybe they don't register on the roster. So we're trying to make those things be part of the sessions that we're having while they're coming to learn about opportunities. We're allowing them to sit down and register at the same time. So those are some actionable items that were looking at when we see some That we have to show up. So I assume that if you're looking at let's take an example where in purchasing a blanket contract. What is a blanket contract going to let Jeremy? Sew a blanket contract is a contract that's put out by FAS purchasing. It's usually for a limited term that 357 years something like that and it's always a result of an RFP and anybody who is awarded a blanket contract any Department can do business with them with generally no thresholds of dollar limit. So like Home Depot or something like that, you know, okay, so if I'm the So does a vendor have a blank contract with the city or particular Department with the city? So you have the ability to use a blanket contract with any other vendor that has blank Hunter the other departments to buy pencils. Let's see one off your you have an item you do a purchase order, but they don't have a standing contract. Is that the difference or what? Okay, so so when you do that you have the ability you don't know how happy that you're the bility just to select someone on a purchase order and $52,000. You have to get three quotes and you have to go with the lowest quote job between 8000 and 50000 is and that's governed by what that's our internal procedures or yellow or what? So that's so it's so that's just an eternal. Is that consistent with all the Departments with that you need to I die to 8050 thousand. So do I so so so the 8000 50000 purchase they still have to pay it now, they would take it three quote quote. You're always report. That's just a policy than there's no legal basis that just our policy. Go to load. Why would you are the higher quote? We can now as far as changing. I'm excited to start asking questions, but given the changes in the state legislative session as relates to i-200. It seems like this might be an area where we could look at those requirements and create different lovers for prioritizing some of these contacts exactly. Quick question to follow up on how we're defining I guess most affordable isn't there some caveat with that at the state legislature? We don't do just the cheapest as to be the cheapest and best Oreck lowest cost in Best to indicate that we're not interested in quality products. That might be in short cutting workers are not like that in our statute not familiar with the Define detail, but I would assume that it's not only Lok wasp cost but you need to meet us standard of quality and Jeremy and so in the purchasing were talking about just Goods but basically and so it would be like a specific brand of something so it would be you wouldn't be comparing a to be you. I'll be the same thing. So if I needed a number to standard pencil that you know, it would it would be the exact same product sold by 3. Companies who wrote I do remember that Seattle had at one point at ethical sourcing legislation. It might be interesting to see how that's being applied or if it was only for only certain products products. Including pencils should see how we expand that. I think at the state level we were looking at the city's example when we were thinking about purchasing uniforms, for example for our Corrections Officers and wanting to make sure that we weren't looking at Sweatshop produced uniforms. And so well there might be the cheapest option. We wanted to go with the cheapest in the most most ethically sourced and Ivar Seattle or perhaps it's another way for us to get out this question. I'm sorry. I interrupted your lineup is okay. I mean, I remember and prior work the had to examine the criteria to do a sole source procurement and what the threshold was to try to Do sole source procurement sonication and Jeremy. I want to thank you. You're basically just educating me on a process throughout cyh, I don't mean to cross-examine you your teaching me. So I appreciate that. So on the purchase order situation when we do the purchase order and get three bids, it seems to me that If we realize for example, the number of African Americans on the purchase order side is zero and Native Americans are zero as an example and we stepped back from that and we said okay, let's look at the purchase orders we've done because you have over $1000000 of purchasing order power is someone step back and says we know our numbers are low, but overhear at yes. They're buying their pencils and they're doing well in this category. Maybe we get our pencils from the same Banner just seems is anyone stepping back and looking at these numbers and then being very intentional now we can get these numbers up. Well, I think from our perspective we get these desegregated numbers on an annual basis at the end of the year when the wind be a report is published when the wind reports come out on a quarterly basis. They're not this granular. We can only see the total amount of wimpy for Consulting roster that they don't break them down by Let me ask you a better question. You saw this report as I did right? So when you saw these facts are there 12 zeros. What did you do? What did RCI team do what did you do? at least for forecasting in the future 10 and I both looked at the numbers and we wanted to try and build and sort of a a clause to management as far as fulfilling their wimpy goals are WNBA Eagles at a level of I want to use the term okrs, which is the objective and key results which is a philosophy that wants to use going forward as far as if it's parallel with III somebody help me here if it's if it's different, but I can kind of chimed in here but to Anthony's point. So you look at these numbers and what we wanted to do was make not only the change team aware but it leadership team aware and so the items if he's referring to okay ours are really leadership goals. And so making them very clear to Seattle it leadership where we would like to see improvements. Does that kind of characterize your intent weather is more than just a man asked to participate but an ass to fulfill at a certain rate to meet the goals. So let me ask a question should understand the Churchill. Let's take the million-dollar of purchasing order capability that we have. So total wimby participation is only 15% So does that mean that 85% just went to larger turn on wimby? Organizations but those are for smaller purchases, right? Right under a 50 mm and less. Could they have also gone to MBE? NBA you would still be combined that that just seems as though and let's see. What is our Target for that category for wimby participation for purchase orders woodchuck Target is that her purchasing overall is it was 17% They don't we don't do a target for like a contractor blanket order. It just all of purchasing combined. What seemed like on the particular I have to assume that on a purchase order side of things are smaller purchase purchase. I have to authorize purchases the department at so it seems like you have a much higher than the 17% number one and see my you should just knock that one out the park if we're serious about this kind of inclusion inclusion inclusion a work. Maybe I'm missing something. I would you agree of that that the goal should be higher on the that, you know part of the challenge but we seen this kind of work is well, we can't find anyone to do this kind of work, but these are small purchases and I have to assume that you can I mean our actual for purchasing in 2018 to 24% and thank our goal for 2019 is 25% And that's the highest of any Department in the city. Can you find the direct route you again? Anything under $8,000? Voucher you can you don't have to get three quotes you can just go directly to to any vendor that they can offer you the good that you need. okay, I'll talk offline about this issue and maybe we could come up with some creative ideas and how to do better basically. Some of that do you share my enthusiasm on wanting and prove this area? I hope you do because the numbers are speak for themselves and feel that could be woven into this procurement process is something that could be explored. Moving back up to the consultant section. I understand the challenges when folks are not on the roster and or that low numbers of people on the roster. So it's difficult. If you're not even on the roster to move you into a category, we actually received contracts but in the I'm just curious if you know cuz I think your role is just putting together the information this has FAS is body of work. Is that correct? Or is this your department specifically, this is our department specifically. So this is the procurement for your department not like I got it what's going on in the Asian Pacific Islander category. We've got almost 40% on the Consulting roster, but only 1.3% actually getting contracts. I miss you. If I could serve day inverse of the problem with folks not being on the roster my take would be that it's the type of firms that were working with that lend itself to those numbers. But Jeremy, do you have some insight is basically used for large businesses, but you can do up to $52,000 for direct contract anything with a large business over 52,000 has to go out for an RFP. The consultant roster is only eligible for small businesses and small-business. The Consulting roster has about 77 different categories. If your small business you can register for the appropriate categories, and then you can do up to $314,000 with somebody on the Consulting roster. So they're they're both contracts but the consult and rosters specific only for small businesses within one of those 77 categories that cancel the contract is For small or large businesses up to $52,000 the number I mean the percentage of people getting contracts under that demographic is 130 8th of who's eligible. It is the way I read it where I was a few occasions and it's about a third of this actually represents our spend. So so under under the consultant roster, we actually are spending 4.3 million dollars and thirty-nine percent of that spend is on as with Asian Pacific Islander owned businesses. So that's an actual spend its it's so this I don't know and maybe I'm not. Maybe I'm not with interpreting your question correctly, but both of these line items represent. Our departments spend on contracts just two different flavors of contracts. It is that does that help or did I just completely spend? Percentage of Democrats of companies within the demographic that are make up for the Consulting roster correct of the of the spend that we did on the consultant roster the 4.3 million of that 39% of that spend was with Asian Pacific Islander owned businesses. If they run a Consulting roster that helps a lot. Okay, that was confusing me. I thought like you're right at the consultant roster that's going to that would told a hundred and then you can have the percentages but that's not what that means. It's okay. Thank you. And again, what I'm going to do is to look at the other like FAS. We had a great RCI presentation FAS answer to look at where their numbers are very good and we could try to figure out what they're doing how they're able to achieve that and look back at this is what we can do for my strategy is now that I when thousand modified. 200 which gives us much more flexibility and being affirmative in our our goals here. Anticipating there may be something put on a ballot at some point that if we can the city can quickly get some really good success stories on how we can use the freedom under the new law to to really do better. And so I'm going to talk to the exact about what that looks like because I my gold at my suggestion would be under the Old Law. We had all these 12 zeros, but under the new law bringing all these numbers outfit. So I want to have those success stories be able to evangelize in the in the world. Is it in case something it's on the balance? So that's that's my goal. Okay, great presentation. I didn't mean to startle is not a negative knows just where there's opportunity. So and I will say this this might be a little negative but I don't like glossing over this if you guys saw the zeros in your coming here talking about you're committed RCI and you see zeros I do expect I don't want to if you want to cross-examine people on this data. So I had you doing some fun. Now I'm going to work but I'd like a conversation. So it goes like we're doing some great work. Here it is there some challenges we have it just works for a better working relationship. It would least with me so that I appreciate all that for sure once doing so well that was down as you're having a great afternoon.", "end_time": 4747.8}]}