{"format": "raw", "annotations": [], "confidence": 0.935946393609047, "data": [{"start_time": 0, "text": "Good afternoon. Thank you for being near the May 28th. 2019 city council the full city council. Now come to order. It's 2 p.m. On Bruce Harrell present the council with the clerk. Please call the roll mascara for Brian Pacheco Salon Gonzales president how much this point? I'll move to adopt the introduction and referral calendar, but I believe councilmember cazalas has some changes she like to propose to men the proposed introduction and referral calendar by introducing resolution 31889 entitled a resolution in support of the right to bodily autonomy and the right to access a safe and legal abortion and affirming the city of sales Clinton to act consistently and practically in support of those rates. It's been moved and seconded to amend the introduction for a calendar to add that item and I look forward to that discussion on that resolution. So this is just to put it on our agenda for today all those in favor of that Amendment, please go die. I opposed the eyes have it that is amended in customer Gonzalez. You have any other and I believe I move to amend the proposed introduction and referral calendar by introducing resolution 31890 entitled a resolution affirming the city of Seattle's commitment to fostering a welcoming community that protects and declaring it support for providing permanent protection and path to citizenship for immigrant use an temporary protected status and deferred enforced departure recipients For Whom the United States is home and be referring it to the city council meeting as agenda item to Has been moved and seconded to a Mehndi introduction for a calendar as stated by counseling Ricans Alles any other questions all those in favor of the amendment, please what I I opposed the eyes have it. So we have these two items on today's IRC for consideration any other additions or comments on the insurance fraud calendar? Cal move to adopt the introduction or Pro calendar as amended all those in favor of the amended introduction referral Calendar, please what I I opposed the eyes have it those two matters will be discussed this afternoon. There's no objection. Today's agenda will be adopted. You know Jackson today's agenda is adopted there no minutes for presentations for presentation today or for Signature today presentations. Would you have a an exciting presentation by a council member Pacheco Katherine Pacheco. You have the floor, sir? Thank you to my colleagues for sign this Proclamation declaring the month of May as bike everywhere month and thank you for my staff and pulling this together last week. Just want to celebrate bike everywhere month during the first few weeks on the council and take this opportunity to promote bike has a more sustainable and fun way to get around our city. The future is scooting as counselor must get his head. So I like this is going to be the first step of what I think the future will be for a city to say as well as the first few weeks on the council biking every morning as well. As after work is probably the biggest mental and emotional relief of the day, but I'm definitely supporting folks to get around by bicycle. So all that I want to read the text or read a part of the text saying that may has been declared National Bike month for each of the last six and three years and it's so again in 2019. Therefore let it be proclaimed by the city of Seattle that month of May 2019 is bike everywhere month and I will be returning this to this proclamation to Vicky Claire from the Cascade Bicycle Club and Santa Clara Canada from Seattle neighborhood Greenways any further comments for good? Okay, if there's no objection to suspend the rules. We love to hear from our guest on this matter concerns. Pacheco's the recipient are. Yes, she is Can I take a picture? first time Hi, my name is Tomas you have here on behalf of Vicki Clark from Cascade bike club. I'm a community organizer at Cascade and Washington Vice. I want to thank the council for recognizing bike everywhere among a little bit of history with used to be called back to work month, and we change that in recent years to reflect that people. Don't just like to work they bite everywhere. We also host a bike everywhere challenge dearly and this year participants have logged over 76,000 trips. Totally More Than 827000 Miles written and saving 275000 lb the carbon by not driving, which is definitely something to celebrate. We've done want to thank the council and we look forward to continuing working with you all to make sure that we get more people on bikes need to go and make sure that our city is sustainable helpful and fun for all of its residents. So, thank you again. My name's Claire Can't turn here from Seattle neighborhood Greenway for today. And the rest of the council biking is a fantastic way for everyone to be able to get rid of need to go. And for those who aren't able to get on a bike or don't really want to have a safe comfortable places to bike on a street will make all users of that street safer, whether they're walking whether they're in a wheelchair. What is the bus or driving and having a safe connected network of places to bike to get around our city? Makes us happier makes us healthier. It gets people where they need to go in a safe and environmental event environmentally friendly way. So thank you very much for this and have a great day. I think you can customer but check over that presentation. So this time will take public comment on items that appear on today's agenda or are introduction fro calendar or are 2019 work program. I'll call you out in order of what you signed up in we have two speakers would like to address us and that the first be Marguerite Richard and she'll be followed by David Haynes. Yes, good day. Everyone one particular resolution is dealing with people. I guess telling other folks out of man things and usually when I go other places I just speak and I think it's a crying shame that I think recently Baltimore had to come up with a resolution against racism and discrimination because they had to clear it up public epidemic because people were getting so sick and that the blacks there weren't really elevating. They were going further down, you know, you seen neighborhoods like that across the country. So I'm speaking against this resolution because I feel that it's wrap into the Cesspool of racism that we must continue to drive out because it's a evil. It keeps working against people like they said there's only one race the human race. Do you believe that if that's so then how could myself end up with for trespass notices, but just speaking you didn't like it. Didn't say nothing wrong. I don't get it and I keep asking people. How do you get it? And they said just keep on speaking if they want to put you on the front page of the newspaper. If they want to give you 8 million dollars to for being vindictive against a person, that's black. They don't go all cuz the nation is waiting to hear from people like me every day. Somebody is rising up the speak against this. I don't know. I don't even I don't even have a name for but I bet you've never met can come up with what he calls the fascism. So we'll see what's going to happen next. Acura next speaker is David Haynes. Mr. President city council, please. Don't sign the resolution 31888 Des to do with a permanent tie-backs permit enforcement 21st century world-class Arena. Not a leftover Cold War piece of 60 year old or however old cracked concrete that's like a slab of architecture already cutaway causing and creating cancer inside and outside that Arena the council go to Folklife. Luckily. It rained early the Dow down the toxic breeze. So children and adults were sneezing uncontrollably. The setbacks are a danger because the whole structure has been left vulnerable after the government gave a hundred million dollars to dig a 15-foot hole in the middle of that Arena. Would you rather have a thousand workers creating a brand new safe fresh-air Advanced world-class 21st century billion-dollar Arena the NBA and the NHL could really, you know, actually use proper or would actually come to or would see the council capitulate to a union work in a pay plan cheating us all while empowering a low-class billionaire who already bought the city council with others conspiring kick Kickbacks office Shady deal setbacks of this magnitude should for city council to realize that at least a one week delay may be like reassess the memorandum of understanding and you know clarify that we're getting ripped off and used as a billion dollar ride off into not a world-class 21st century safe and new and properly propped up without setbacks. It actually take place of a flawed foundation in addition in a separate issue. Please city council reject the Catholic church. Has it been a beneficiary of the Fort Lawton Redevelopment, but not qualified to build anymore subhuman dilapidated cinder block house in real estate Empires that will conclude our public comment unless I neglected to sign it that you like to speak. Okay, we'll conclude that section. Please read to please read the payment of the bills the title of the payment Bill section, please. can smoke one 19532 appropriate mindspace are in Clemson or during the payment there is Please call the roll on the passage of the Bill O'Brien Pacheco president hero. Please read the first agenda item 31889 in support of a woman's right to bodily autonomy and the right to access a safe and legal abortion and affirming the city south commitment to act consistently and practically in support of those rights. I think he comes president. I'd like to start by requesting that the council rule I would like to request that the council rules be suspended to allow consideration of a substitute to resolution 31889 which has been distributed to the council and should have been at your seats when you arrived this afternoon. It's been moved and seconded that we suspend the rules in order to consider this and I think there was a a change that would suggest we support that all those in favor of spending Rose, please what I was spending cuts Merrick and Ellis speak to some of the changes that we made to resolution 31889 that required us to go through that substitution process. We had an opportunity to share a draft of resolution 31889 with representatives of both Nero pro-choice and Planned Parenthood got some feedback and Incorporated that feedback. So this substitution version that you have before you which should be version d4i incorporates many of those changes primarily. What we did is change the recitals to to reflect a more gender-inclusive aspect to the language of the resolutions. I want to thank our partners over at Planned Parenthood for their thoughtful Edition and modifications to the underlined. In essence with this resolution does admit I know many of us were at the rally on Tuesday last week that it was organized by Nero pro-choice Planned Parenthood and others and I know we have representatives from Nero pro-choice here in the audience of thank you ladies and everybody else for being with us really appreciate it and I think it's important for us is to affirm our ongoing cities commitment to ensure that all of the Investments that we're making and all of the policies that were supporting both here at home and abroad are consistent with what I believe the vast majority of our constituents believe which is that a people deserve the right to have bodily autonomy and the right to access safe and legal abortions at a lot of us had an opportunity to speak at Tuesday's at rally and really take a strong firm statement on how the city of Seattle will continue to stand in solidarity. Not just with people here seeking a right to bodily. But everywhere and anywhere in this country and in this world and that we are seeing a lot of incredibly scary laws coming out of other states that effectively ban safe and legal access to abortions that is really really dangerous and we should make no we should make no mistake of it is a direct attack on the Reproductive Rights and on the movement for Reproductive justice for all people and I feel really strongly that this is a good use of our time and a important policy statement for us to make on the record to continue to stand in solidarity with people across the country who aren't as fortunate to live in a state like Washington and in a city like Seattle that really has spent a considerable amount of time prioritizing the right to bodily autonomy and to reproductive Justice and and Council breathing that one of the things that we do here at the city of Seattle is that we partner with King County Public Health to deliver. My services and a space the reproductive health and so that we do have us a stake in the game here of Roe versus Wade were to be overturned that would create significant questions in terms of how we deliver Public Health Services to people in our accounting in our city in the space of reproductive health. So I'm feel really strongly that is important for us to share our position with our Congressional leaders. And I with our community that we will continue to stand firm in this in this movement for Reproductive Justice actual. Thank you and thank you so much words that you have given us and all of just the stall words that you are both personally and over the years. I really respect that and I want to acknowledge one of the sentences here that I feel so strongly about and I'm councilmember Gonzalez for your leadership at this statement is at the bottom of page to where it says policymakers. Instead focus on the maintenance and expansion of Supportive Services whose aim is the reduction of unintended pregnancies the minimization of sexual violence and the success of All Families by investing and comprehensive sex education access to comprehensive sexual and reproductive health care and quality affordable child care that this all makes so much sense to me. I am completely appalled that we have a president that is trying to roll back all of the games have been made but if nothing else if you want to stop a procedure that you feel strongly about then for goodness sakes make these kinds of investments in childcare and in comprehensive contraception and make that available to everyone most recently I was talking with someone from our Public Health Department about Larks the long-acting reversible contraceptives how important this is for women. To have access to and it's talk about one of the best investments that we can make for people who need this kind of work. So I kind of kind of help and support. I also want to acknowledge Seattle public schools and our department of Early Education. We put money into support the Nova School Nova needed to have a and still does need to have a healthcare facility on site and I want to recognize that we can be partners with Seattle Public Schools. All of you that are here. This is incredibly important course the the work that we're doing around Roe v Wade is critical, but I'm just like so strongly in support of making contraceptives available to everybody who needs them and to have that support. So thank you and thanks for your leadership on that can cash my bike shop. Any other comments councilmember mosquito week we talked about this the last year we've talked about this the last few decades that Women's Healthcare is Healthcare and we need to stop parsing out reproductive Health Care from actual health care because Comprehensive Health Care should include access to contraception and abortion services to make sure that healthcare's truly comprehensive. I think one important note from last week was that I got some pushback for using the word control the this is about control and we should have no doubt in our minds that those who are pushing the legislation that this resolution comments on and other cities is in another state that this is about control and control over our bodies control over our destiny control over our economic stability control over our self-determination and those who are Sing this agenda to restrict our access to Choice are quite frankly doing this at the very time when women are continuing to speak up people who are done identifying as female continue to speak up for our rights. And in many ways, they can't stand it that we're speaking up speaking truth to power and and sitting in seats of power. So this should be a symptom of a signal that we will not sit down stay quiet or shut up. This is about Healthcare. This is about public health. This is about Justice and I'm incredibly proud of our city and the for all of you who have been advancing this call for action for not only the last few years that we've seen more and more tax against a healthcare access, but also for the incredible tenacity that it's taken for decades of work for us to continue to stand on the shoulders of those who come before us to fight for access to Comprehensive Health Care on one additional know that I'll make as a compliment Gonzalez mention our partnership with public health seattle-king County. And as we continue to stand up an accident Sanctuary City here in a sanctuary area part of what I think we will be called upon to do is provide Sanctuary to Providers and have no doubt that this city and this County stand ready to pour offer that Sanctuary to individuals in need of healthcare, but also to the providers who we so desperately need as well. Looking forward to working with all of you as we continue to stand up for on this basic human rights and access to healthcare leadership on this and thank my colleagues who is spoken on this time. It is not named it for an 2019. We're still having a discussion and feels like we're losing ground. I'm honored to be part of a body that has fought for these rights for so long and stood up for them and I want to concur with his comments about this is about control. It is not a name to watch male-dominated legislative bodies around the country spend an inordinate amount of time trying to pass legislation to control the rights the ability women to choose what to do with her body. I'm all of the same time completely ignoring the other side of the equation and and how healthcare for men plays out and not have pieocracy house to stop and we need to get to a fair system. Unfortunately, the way things are in some states in our country inn at the national level. We will likely be having these conversations for a wild city council, but I'm grateful that they're amazingly does here to do that work in treating community members who continue to make sure that we understand the Dynamics out there. So, thank you. Thank you cast from Brian customer herrboldt council member of Gonzales efforts in this area as well as the efforts of community organizations like Planned Parenthood in there all every few years. We here on the council passed resolutions in support of 1973. Is Roe versus Wade and are stating our ongoing commitment to the principles in that in that ruling and often. We are attacked by observers of the council activities is saying that we are taking symbolic gestures that don't have meaning and the fact that we are here today and we are faced with these Draconian laws being considered in Dates of our union says to me that the actions in the vigilance of organizations like yours on these issues is not symbolic. It's incredibly meaningful and it's so important that we keep our eyes on the ball and that we stand strong in favor of women's right to choose and that we recognize that this is actually in fact all about control. So thank you so much for your work on these issues herbold. Okay, if I think the way will proceed as I'll actually move it and then it once it's removed and second and then I'll ask us when he's got cuz I was to potentially a minute to such a diversion 5844. Okay, so I'm going to move the resolution is racial presented. Is there a second? Okay. and so now I'll entertain a motion councilman Gonzalez for a substitution for a version for the motion to substitute version 584 version for all those in favor of the association fees. What I I suppose the eyes have it. So now we have a substitute version. We are both forecast for Gonzales. You want to close debate or we meet about point of information that occurred to me as folks were providing their comments in support of this resolution, which I really appreciate and so one of the things that I wanted to point out is that even though we are seeing State legislatures across the state passing these rocconi and laws that would severely limit access to healthcare for certain people in. I also want to remind folks that here in the state of Washington. All those efforts have not been successful. They are still very much attempted every single year. And so this is an incredibly relevant issue for us as representatives of of the most populated city in the state and I will remind folks that just this last regular session right here in the state of Washington. There was at the introduction of House Bill 2154 in the state legislature, that would have an effect on prohibited and banned abortions. I'm right here in our own State and it would have also criminalized any provision of those services and so I know it is very similar to the law that was just recently passed out of the Alabama a state legislature. And so I want to make really clear that these attempts are our movements from the other side that are Trying to chip away at the right to bodily autonomy and certainly here in the state of Washington at we currently enjoy the privilege of being able to fight against those at the successful passage of these Draconian laws, but we have to continue to be vigilant and and to continue to take really strong positions and as the city of Seattle we are I'd like to leave on a city of influence on our colleagues in the state legislature on these types of issues. And so I think it's absolutely important for us to continue to speak up and to also remember that we are not immune from the sentiments and this ideologies in our very own State and in our own legislatures. So it's a really proud to be able to take a final vote on this resolution. Thank you think you can swing Gonzalez, okay. Going to call on the boat those in favor of adopting resolution 31889 as a minute, please vote. I I oppose vote. No the motion carries resolutions. The insurer will sign it actually. Please read the next agenda item has commitment to fostering a welcoming Community to protect all its residents and declaring support for providing permanent protection and a path to citizenship for immigrants Youth and temporary protected status and deferred enforcement departure recipients For Whom the United States is home. Cassandra Gonzalez in support of legislation introduced in Congress that will create a legal pathway for dreamers as well as individuals who are currently eligible for temporary protected status and deferred and deferred enforced departure the American dream and promise Act of 2019 or hr6 would put 2.5 million dreamers and immigrants eligible for temporary protected status or deferred enforced departure on a pathway to citizenship individuals who are eligible for protection under this bill have typically lived in the United States for much of their lives. The average dreamer came to the United States at the age of eight while the average TPS or DED eligible person arrived as early as 1997. This is an issue with bipartisan support at the federal level and one that will transform the lives of millions. It'll also be a life-changing for their families and it will go far and helping to strengthen our communities when dreamers and others can go from 2nd class. Listen to fulfilling to fully becoming an American according to the Center for American progress who put out a fact sheet on the American dream and promise Act of 2019 and its impact in Washington state in particular. There's a few a data points that are highlighted by Kap. The first is it Washington is home to 52200 immigrants who are eligible for protection under the dream and promise act these individuals live with 120 1200 family members among those family members 23500 are u.s. Born citizen children dreamers in Washington state who are eligible for protection under the bill arrive in the United States at the average age of eight years old TPS and easy eligible immigrants in Washington who would be eligible for protection under the American dream and promise at the 2018 have on average lived in the United States since 1996. And when we look at the largest Eligible communities under the American dream and promise act in terms of our own numbers here in Washington state Seattle has the fourth largest population of eligible communities across the state. And so we come in at about 4,300 people right here in Seattle. That would be eligible to find a pathway to citizenship if the if Congress adopts the dream and promise Act of 2019. So again, I feel this is very much aligned with what are constituents expect from us and look forward to having the support of my colleagues or we vote on their proposed resolution. If not those in favor of adopting the resolution, please vote aye aye those polls vote. No the most scariest a resolution to cancel my Gonzalez for this. Please read the next agenda item. From the regular agenda agenda and wanted the report of the select committee on Civic Arenas resolution 31888 amending resolution 31857 providing conceptual approval of a significant structure turn permit to Seattle Severina company LLC to include the construction of permanent tension to tie box and portions of Thomas Street East of 1st Avenue north and west of 2nd Avenue North in a long-term occupation of those permits intention to tie backs in the right away to enable the renovation of KeyArena at Seattle Center Canby recommence a resolution be adopted of the amended meeting that requires a conflict at this point on an agenda show. So she doesn't need a formal excuse, but she's she had to go. Okay, so I will move to form an excuse comes to remove skater from the remainder of the meetings are second all those in favor excuse accounts primer. Mascara to say I oppose the eyes have it. So I'll now proceed with the resolution front of us on Civic Arenas and dealing with the Key Arena construction customer. Where is in her leadership sheet did the Lion's Share of it? She was kind enough to allow me to share one of these small insignificant issues on tie-backs, but none the less I shared it. I thank you for that. But this a resolution basically gives conceptual approval of was called a significant structure term permit to the shadow Arena company to construct maintain and operate at a permanent tension tie back the required to operate a tunnel under under under and across Thomas Street. Basically the arena company that's in charge of construction revised its construction plans include these permanent tension tie backs and they'll remain and Thomas Street. They're necessary for these for the feasibility of the construction project. They also during the meeting gave us a status report on the project and everything is going as planned and they are very pleased as are the central staff members of hours in our department very pleased with how that construction project is going. So basically of this resolution a day is adopted I ask. We'll continue the work going down that road and they will draft an ordinance that will Grant final approval the term permit and will describe the proposed conditions of approval at that point which will include the annual fee in the maintenance obligations and the indemnification provisions of insurance in the bond requirements. So getting this resolution is it is necessary to allow. continued work any questions on the resolution Okay those in favor of adopting the resolution, please vote by those opposed vote. No the motion carries resolutions. The insurer will sign it. Thank you very much. Please read the next. Agenda item and Technology committee 318-860-5613 general rules and procedures of the Seattle Seattle City council amending attachment 104031806 chapter 11. Can you recommend set the resolution be adopted as amended 11 of our rules section B3 which basically adds A disruption provision during the public comment section of our public hearings or anytime within the chambers and basically dad's a new section relating to abusive and harassing Behavior much of which can also be described as criminal in nature of a certain. We don't condone that in council chambers during public hearing before a public hearing or after public hearing. So these changes are allowed to address that issue. We circulated these changes to several bodies that sir to watch our rules. Make sure that they're not only cost. Usually sound but a consistent with good sound public policy and looking at my chamber decorum, and we've had no objections. So that's what this resolution does. It adds that section to talk about the prohibition of threatening and assault like Behavior any questions on this resolution. Okay those in favor of adopting the resolution, please go die. I know the motion carries resolution doesn't show sign in. Please read items 33 Lebanon and all of them. Please read the short title. 3 is actually separate. Yeah, so you read them separately for the short title for all of them, but that's certainly read them all individually to maintain an operated pedestrian skybridge can be passed. Thank you. Everyone get buckled in. We got a lot of fun stuff coming out of sustainable and transportation committee today jump around a little bit. But this first one is simply an extension of an existing permits for a sky bridge that covers an alley in South Lake Union passed a little over 10 years ago. They have to 10-year renewals. Nobody's don't come back to committee but they made some insurance changes if they are required can the committee so we approve that and I recommend you support Any questions or comments? Did not please call the roll on the passage of the bill. O'Brien Pacheco salon Bagshaw Gonzalez herbold president 95201 accepting various Deeds for street or alley purposes. Can we recommence the bill passed them in one of the timer by whatever is best for you show. Why don't you speak to them all and then I'll have the clerk go back and read each up at 1 in division will vote on them individually or six separate ordinances each accepting gristedes or easements for 20 Parcels. So the six bills combined it's about a hundred and twenty property easements changes. We talked about this a few times before the public. I'll just state that oftentimes in a new development or Redevelopment. There's minor changes to property lines that need to be made where the city will will acquire additional right away or other easements for access. These Parcels are often very small maybe a couple square feet to allow the proper width of a driveway or sidewalk or other command or access to sometimes Utilities in those types of things. I'm in our Charter that whenever we do something with property that has come the city council, but on the small things we let the department accumulate 22 time to put them in a bill because of the pace of construction in our city. We've been the last few years have been seeing multiple ordinances at a time which one in this is a rather big one but all fairly straightforward. Okay, so that's number that's all of them. I'll just you've already read number for into the Rockets will vote on that and you can just read the other one. So sex number 6 I guess but not Council 11952 and any other comments. Please call the roll on the patch of the bill. O'Brien Pacheco Bill passenger sign it and then I'm out of work just read the item in and if you need to make comments about an individual individual one just sort of speak up. Otherwise, I'm just going to vote on them since councilmember O'Brien describe them all good men flirt accepting 20 limited purposes easements for public sidewalk Street or alley Street skis Main Street and Alley turn around and traffic signal purpose. Escamilla recommence a bill pass. Any questions, please call the roll on the passage of the bill president Hayden favor and unopposed. Agenda and six counts of belt one 19523 accepting Thursdays for street or alley purposes. They recommend a bill passed for us O'Brien Pacheco Gonzalez herbold. Please read the next one 24/7 20 limited purposes easements for public sidewalk alley or Street and Alley turn around purposes. Could you recommend There no questions. Please call the roll on the pastor the Bill O'Brien High president Harold supposed to go pass questions. Please call the roll on the pastor the bill purple president Harold 8 in favor and opposed it says could be recognized the bill pass. The no questions. Please call the roll on the pastor the Bill O'Brien president Harrell 8 in favor, and then opposed to the next one. Capital One 19526 accepting Thursdays for Speed rally purposes. It can be recognized the ball pass Pacheco sawant Gonzalez herbold post-surgery the next one. Cancel. 119 527 vacating the alley in Block 19 air has a cerebellar 2nd Edition in the block. If I 6th Avenue Blanchard Street and 7th Avenue, Lenoir Street of the petitioner equine Development LLC, Can I sell pass? Brian thank you very much. This is the final action on vacation that week conceptually approved a number of years ago. This is one of the three the first three Amazon blocks in the Denny Triangle area. This particular block is the block with the Spheres on it. As you may recall a number of years ago. We did an alley vacation for each of those three blocks the combined public benefits and included a sensible open space and additional streetcar for the South Lake Union Plus operating money for that. Once the conceptual approval is done the projects move forward with construction according to those designs when the project is completed and it has been complete for a couple years. They eventually come back to the city to confirm that they did. In fact kill the project is designed including the public benefits. We have checked that off and the recommendation to committee was to support this so this is The second of the two blocks of we're finalizing the alley vacation on the third parcel is projected to open up for occupancy sometime in the next couple months and we will likely see that by the end of this year or possibly early next year. They could catch her and Brian any questions or comments not please call the roll on the pastor of the bill. I so want this is all US president. Open 19512 Elaine to the cities 2018 budget authorized acceptance of funding from non city services committee recommends a bill passes amended for the public to let folks know the city goes to our budget process every year and we approve spending Authority for the things that are in our budget. But in addition to that throughout the year the sale department of transportation, in other departments will go out to try to get grant funding for projects specifically in the transportation area were often competing for federal grants state grants or local or Regional grants and including from the Puget Sound Regional Council has to approve that they accepting can spend that money. So that's what this ordinance does. It's typically good news when we hear from you when we hear from us. On this and that we have been sick. Select winning other funding for projects that are already on our Capital project list. I will save it in addition to accepting grants How We Do traditionally we did make an amendment in committee to this which is very unique. There is a project on to that going to be East Marginal Way That We are looking to break into two separate projects ones part of the Heavy Haul Corridor and then also a bike facility on the Eastside of East Marginal Way, and there is a chance that we may get some additional funding from Puget Sound Regional Council as it that project is currently on the top of their contingent list and so in addition to approving I'm grants that we have already won and received were also we also amended this legislation to offer conditional approval to ask. To accept that Grant if in fact they do when that and we would like to know in the next few weeks if that comes through I mention that just because it's a project that for folks to renew my bicycle across the West Seattle Bridge into downtown Seattle. It's it's a major route and it is not a very friendly route. There's a lot of heavy traffic on that. The lanes are the road is not in great shape because of the traffic sucks her off and trying to get around people and the delineation for both bicyclists and cars and the big rigs that are down there is complex and it feels very unsafe. So even moving forward just a portion of this project which this would do it for a successful will allow for a much safer experience for folks bicycling and I'll also I believe improve the condition for all roadway users because it will be a clear delineation delineation where are cars and big rings are supposed to be and where bicyclist is supposed to be. So hope got my fingers crossed that something will happen if I come through and we may get I'm final design later this year and construction shortly after. Very good. Thank you guys were Brian any questions or comments on this bill. That please call the roll on the pastor of the Bill O'Brien Gonzales president Harrell 8 in favor and then post the next agenda item Northeast 40th Street lying between 24th Avenue Northeast and the burke-gilman trail be granted as conditioned the conceptual approval. So we heard from the project which is just to the Etsy just to the east of the burke-gilman trail just east of the University of Washington campus and to the west of University Village. The there is a street there 24th Avenue Northeast. Is a dead end it dead-ends at the trail and I previously excessed apartment buildings that are being cleared for this new project, which is a few hundred units of private student housing to go in there. The street was is no longer necessary with only access his project and so they are asking to vacate that and paying the fee for that and as part of the public benefit they're going to produce a new connection between the burke-gilman trail and and University Village. Sorry, I mentioned 24th Avenue Northeast. The streamer vacating is Fort North East 48th Street to access 24th Avenue Northeast for folks that are familiar with the burke-gilman trail up there. The trails heading north is where there's the number of overpasses the crossover to to Hecate Pavilion. Sorry. Is it Alaska counts, Pleasant Hill, Alaska Airlines Known as the HEC Edmundson Pavilion crash into the parking lot for the north of that trail. If you're if you're running or bike sling or whatever you can kind of sense that the university Village's off to your right there, but there's really no good way to get there. There's a little foot path of Mines down through the dirt there and then you went around to the north with this would do is recreate a very visible in open graded Trail the Ada accessible that has all the way down to 24th Avenue Northeast. There's another project that will be making improvements and 24th Avenue Northeast to make a much safer pedestrian crossing over to University Village in addition to providing that new public Trail access. They'll be providing a bicycle repair station. Like we see it send them replaces and also a water bottle refilling station there in addition to some seating actually. It seems like a really great public benefit for this location. I really appreciate the poem. Coming up with some creative ideas. And of course thanks to the folks at s. In particular Beverly Barnett for her work on helping them guidance to the process and making sure that the project came up with public benefits that are in the interest of the whole city. This is the conceptual approval. So this is where we essentially give our thumbs up is just a clerk file, but we will be committing to Grant the ultimate vacation likely in a couple years when the project is complete and they've built this according to these plants very good any questions or comments on the clerk file? Those in favor of granting the petition as conditions. Please hold. I suppose both know the motion carries. The petition is granted as condition in Sherwood sign the conditions of the city council. Please read the next agenda item. Returned item 13 appointment 1353 appointment of Bryce Kolton as member Seattle Transit visor board for term to August 2nd 2020 the committee recommends you're going to be confirmed. Thank you. Bryce will be a great addition to the Seattle Transit Advisory Board price as a software engineering background, but is active in urban issues including Transit really great discussion a committee about just questioning them on some ideas for how we improve Transit access moving forward. I think he'll be a great addition and then look forward to and appreciate his time commitment to be part of the transaction. Any questions or comments? Those in favor of confirming the appointment, please. Go die. I don't suppose both know the most carries an appointment is confirmed. Please read the next agenda item nopales Sherman as member sweetened beverage tax Advisory board for turn to August 31st 2021 the appointment be confirmed. I'll make this really long and drag it out. Dr. Sherman is serves as the interim chief medical officer of Community Health Plan of Washington has a background in public health and he will be a great addition to this this Advisory Board. This Advisory Board is bookstore from they are focused on education, but also public health for communities most impacted by by the overconsumption of sweetened beverage. Know that the sugary beverages disproportionately impact communities a color and low-income communities in our city and as we move forward collecting the sweetened beverage tax critically important to me that we have both Community experts in public health experts helping us guy does Investments back into those very communities that it is partially impacted. So they have Alternatives healthy alternatives then Sodapop so that they can improve their health outcome and hopefully avoid paying the sweetened beverage tax going forward to our investments. Very good. Thank you guys for Brian any other questions or comments on this appointment. Not those in favor of confirming the appointment. Please hold. I buy those opposed both know the motion carries an appointment is confirmed.", "end_time": 3292.9}]}