{"format": "raw", "annotations": [], "confidence": 0.9438315064266876, "data": [{"start_time": 0, "text": "Got to wait on pumping. Should be done. Good afternoon, everybody. Welcome to the sustainability Transportation committee. Today is Tuesday, March 5th. It's 2:01 p.m. My name is Mike O'Brien chair the committee joined by my colleagues council members Johnson and Swan. Thank you so much for being here stop today by both the levy and just when we have a few items have up to 2 minutes each. I'll call you names and come on Ford Alexandra. Men's going to be first followed by Michael Taylor Judd and then Ryan packer. G A Carmichael shooter a dirty not too big on TC might encourage. My name Alexander a nice article about societal for my understanding. Is this article from Atlantic different newspaper? Party City in America, that's exactly what I told Kelly everyday for 10 years more than 2,200 times stop Seattle fascism with idiotic face. I give you a classic example from Transportation. So, you know about what the same token just a small Street. What is go to court house 300 feet before like a post 510 car parking parking in disabled people parking right now is this idiot? I can put six six six six. Commercial parking for parking commercial parking for 350 in a civilized country. What is European country from Africa? You understand what this mean commercial parking postal delivery commercial parking from 11 to 5 in the morning 7 p.m. To 5 did something but is very unique is not surprised me. So you have right now is exactly about this transportation department. Good MCAT parking for disabled parking by half next Courthouse make sedation, very complicated right now for disabled parking find a parking. Thank you very much. I apologize to the members of the audience had to live through that cast member Bryan council members. When is Michael Taylor Judd? I'm here this afternoon offering comment as chair of the West Seattle Transportation Coalition as well as former chair of the north Delridge neighborhood Council speaking in support of the resolution for the Delridge multimodal project project to key points. I want to make one for a lot of the neighbors this project cannot move forward fast enough, even though the current duration of the project dates back to 2015 conversations around these issues have been dating back several years before that. It was originally just a Paving and Boulevard project. So we have been involved for a long time and advocating for some of the things that are in this project and then additionally we want to give a shout out to S. Department of neighborhoods. Yes. Has done an excellent public Outreach around this into the neighborhoods sending postcards out holding several in person open houses doing Outreach in multiple languages into our neighborhood as well as a taking advantage of the possibility to snow here in the next couple weeks actually about the north Delridge action plan updates s. Really took advantage of that process while it was going on to participate in open houses with that that had literally on site translation and utilizing the PO yells from the Department of neighborhoods to go out and do things directly where people are in their language and where they're used to sharing and communing with each other so we could not be more supportive of this project. Thank you. Ryan Ryan you give me followed by Meghan Murphy and then Robert catch. Hi there. I'm here to talk about the Public Health crisis happening on the streets right now in your presentation on Vision zero shows that the past 5 years were basically indistinguishable from the five years before that was only a 3% reduction in the number of people who were killed or seriously injured on by traffic in Seattle. The stagnation is disappointing, but it's not terribly surprising given a lack of progress. Their city is made on sling crash furniture deals are pretty vulnerable users at intersections and enforcing our existing traffic laws. I like crosswalk complaints in 2017 five people locking up biking in Seattle were involved in collisions every two days that I year was the third year in a row that more than 500 people watching were involved in collisions for far too many people that choice to choose an active mode is rewarded by injury or possibly death according to the movie. 27 Vision zero quarters by 2024 but the improvements on his quarters are in most cases minimal spot improvements how many quarters would be be be completed? If we ensure that every single one was the highest quality possible-- What is the only outcome of our Luciana Levy in terms of Azaria was making Rainier Avenue safe for everyone who uses it that would be a better outcome than 27 quarters. I can check off a list so far in 2019. We've already lost three lives walking and biking on our streets. It's time to take off the rose-colored glasses and stop relying on 2006 to give us a good trend line. It's time to systematically change our streets. Thanks. Thank you, Ryan. Megan thanks for letting me speak. It was really awesome to be here yesterday. I wanted to say farewell to a Brian and November because I got to watch us battle for housing against and it was on CNN against Amazon and I'm the big tax. But first there was like all these meetings downstairs and I think you were the one who got him started. I don't know but there was a ton of meetings about I'm affordable housing in one of the only council members with a green Vision, like what I know. I so want doesn't muscade up but you really like spit out you stand out for that and I'm going to miss the way you vote in the comments that are brought up and I'm only hoping I'm hoping Sean Scott I'm get selected. So anyways yesterday we envision how much power a mayor has in Burgess on took over for for the one for that. Anyways Burgess took over and when he did and then the housing Got into this huge crisis. He steered us away from using the money the way that may or Moon would have used it. And so it was really interesting to contemplate how much a public servant really leads us and now Durkin is threatening. The women's shelter will and I know CCS supposedly supports Johnson and they got 5 million from Bezos. So it seems like people are in other's pockets. And if somebody called like about a priest that was going to be at a church and like over 200 people call. We're waiting out all the all the priests that we don't like and if that many people called about a public servant that I think that it's worth having at a public level to weed them out. But anyways, I've seen people get mad at O'Brien to though for wanting housing and I thought well, that's silly if they are organized. I don't know that's kind of night. Here nor there, but it was for wanting something good in Sheltering people. That would be on the spectrum of a virtue and not the sin. Okay. Thanks, Don Brubeck. And then Vicky Clark has passed on Rainier Avenue. Sure, you're aware. This this is like Groundhog Day, you know every year we come we asked to do the changes. We're going to do them another year and if I'd ask and I thought we finished Outreach. I thought we picked a design. We all got mad the bike Lanes weren't there and they replaced the bus lines and yet here. We are still trying to get them on the ground and still getting the safety improvements out there that aren't just like hey, we threw a flexi stick in the street. See if anyone runs that over did they do by the way, they're gone. Now Henderson came back and put them in the other guys care Minnesota frustrating to see things in the reports that come out wrong. For example of a took almost 11 months to release their traffic report and they forgot several at Aldi's in southeast Seattle. And as far as I can tell have not been corrected. It's very frustrating. It's literally or braces someone's death to validate that someone died and they were offended when I pointed out that the city did not count their loved one as killed and they said they died within like 2 days after the crash and it was reported as a injury Collision in the man who is ran over by the Link light rail train was not counted the man who was killed at the other end of the Othello. When hit with a Link light rail train was not counted at least we could do is count the deaths that we are creating on our streets and I'm just so sad to see that we're delaying and delaying and delaying the things that might actually stop that from happening. So thank you for listening and dumb. done Good afternoon council members. My name is Donald Brubeck. I'm here representing West Seattle Bike connections safestreets group. That's part of the Seattle neighborhood greenwaste coalition to speak in favor of the Delridge rapidride H multimodal Corridor and I'll second Michael Taylor Judds comments on the excellent Outreach and involvement of the project management and Outreach staff with us in seeking input and actually going out in trying out roots on bikes with us. So we support the design objectives for biking than walking connections to Transit stops and two destinations along the route to create an all-ages inabilities bike cord through the flattest and most direct routes of ailable from White Center to the West Seattle Bridge. This I think we do have some mixed reviews on on the state of the design at 30% that the project extra moves bike Lanes in the north part of the corridor that can be an acceptable trade-off for a dedicated by Slaine if the adjacent parallel 26th Avenue and Greenway is upgraded to current standards. It was the second one and it does not slow traffic speeds or eliminate cut-through traffic without additional safety improvements that we have outlined in a letter February 24th to the project team, and I like to submit that to you today as part of the record here, and we have some other safety concerns in in other spots. I would really appreciate the work that's already been done on Juno and Croft place to link the two Greenways. Thank you. Thank you. Vicki and Vicki really followed by Gordon padelford and then Andrew Kitty Good afternoon, Vicki clock Cascade Bicycle Club on Seattle streets trending down but also shows without making changes to our streets fast enough every death in serious injury on a roadway is a failure by transportation system, but it's more than that in the face of a proven roadmap Vision zero is reckless is a failure to act with a friend Neva a family member be the next one to pay. The ultimate price is a business card disproportionately Transportation uses. All ages nobility bike infrastructure is essential to make an ostrich steak for bike lanes are proven measure and creating streets with safe a travel speeds. They bought the people walking from fast moving vehicles. And obviously they make safe places for people on bikes those low-hanging fruit repaving projects like 35th Ave Northeast Patrick of moving cause quickly is replaced with the vision zero model Building A system that considers and keep safe. Everyone there a long-delayed projects Phase 2 of the light feather. We need to act with us and see the city is planning to build just two point three miles. That's two point three miles and a city with around 4000 4000 Lane miles total 2.3 miles. But doesn't reflect the scope of changes needed to meet Vision zero goals and ultimately make sure all Seattle residents to get home safely today to commit to doubling down on the city's commitment to Vision zero. Stephen in Council Members, my name is Gordon padelford on the director of Seattle neighborhood Greenways. A vision zero is a really important and critical program and priority for the city. But sadly it's been underfunded under supported and really under prioritize by both departments and I think by our political leadership, it is something that's critical to keeping everyone safe. No matter how they're getting around in our streets you're walking or biking you're driving catching a bus and speaking about Rainier Ave in particular. I think the community's right to be frustrated and right to ask. Why should we trust the city anymore to make our community safe. This project was promised in 2016 and was promised for 2017 and the 2018 and then 2019 and now we're hearing again for the mayor's office a mess. Just wait, it'll come in 2020 and I am through at the end of my line of making excuses for the city and I think the council should really act to exercise oversight over s. And the mayor's office and say this is the most dangerous Street in the city by far. People are dying. There's a crash every single day on average. Why haven't we done more to make the street safer for everyone the community is there supporting change change is always hard but the Rainier Beach Action Coalition all the way to the Rainier Valley Chamber of Commerce are in support of making these changes. This is something we just need to get done. Right if this were a giant Convention Center or a new Arena it would have been done years ago. And those are great projects. I'm not slamming those projects, but when we want to as a city we can move Heaven and Earth to get these important priorities Bill and what are we doing for Southeast Seattle or we just say it's on the back burner and we'll get to it a few years from now, right? I think that's just as bad for everyone as a really bad luck for the city and for all the goals we trying to spouse and just acting Vicky's comments. It's also just ridiculous that we're planning to build in a 2.3 miles of bike for this year in Seattle. So how we going to make it safe? Ikea Garden I knew I knew you the last one who's signed up for today. If there's other folks they would like to make public, today. Please line up on Andrew. Go ahead. Thank you. Thank you for holding this my name is Andrew Keta and I was Rainier Valley Greenways. I live in southeast Seattle near Hillman City and I walk and bike all over and I'm here to say that the current configuration of Rainier is a disaster. It's it's basically a crash Zone last week. Vladimir was killed on Rainier Avenue and last summer just a few feet away. My friend. Alex was killed it on his bike. And while these people were killed the city has delayed the Rainier Avenue Safety project. S. Has plans now. I've seen them the thing that continues to mystify us is why they're rolled out so slowly. Why it it really is mostly a question of paint. So I just want you to work really hard at getting this done. I also want to say that I live in a part of the city that has really gotten the short end of the stick on bike infrastructure and a variety of different funding and from the standpoint of view of equity. This is a really important thing to do now. So thank you for supporting them. Someone else who wants to buy public, today. I'll just know that we have some folks in the back that are holding a sign about Rainier Avenue and showing up at all of our meetings, and I know you're not testifying at the microphone, but I appreciate the comments that you're making kind of presents. Thank you. All right, we'll close public comment and move on to agenda item. Number one on bike prisoners forward and Jasmine if you don't mind reading it into the record bike lane design Workshop update. Are you doing? Welcome everyone. Why don't we start by a quick round of introductions for the record? Joseph Lockwood Capitol Hill housing Foundation. Well, I'll start as awesome as you all know, the pike-pine corridor is a very critical Corridor for bike infrastructure in the city. It's the route between Capitol Hill and downtown and it's a vital Corridor in many other ways for the community and we wanted to ensure that when safe infrastructure is put in it meets the needs of others in our community as well. So we're here today to talk to you about a community Workshop that we hosted that we believe could also serve as a model for other projects in the city where when people have a chance to hear each other early in the process. The hope is that you can stop controversy from erupting later on the goal is to avoid surprises and make sure everybody It's to be hurt. So that's what we're here to talk about. That's exciting opportunity for us to learn. So look forward to it. So this goes back a number of years in 2017 during the one Center City process Central Seattle Greenways engaged with a number of other neighborhood organizations and started doing some initial business Outreach basically just informing business owners that changes were coming and asking about loading needs and their concerns about safety in the corridor some initial questions trying to engage them in the subject and then after city council passed the basic bike Network resolution Last Summer. We prepared to work with us top planners and make sure the design of those bike Lanes would work for everyone on that street and we realized we needed to do we didn't have all the information we needed to advocate for the needs of the community. So we started this process of creating this event because just about every year at least for the last seven or eight the capital ecodistrict host the community for him on some topic related to sustainability for the neighborhood and we've and some of you I think all of you have been to one of these or another we've been on a variety of topics everything from affordability to how to find Pathway to ownership to rent organizing to living I-5 And some of those ideas have really taken off. This year we partnered with folks here at this table and they'd already planned to do an event. So it was actually really fortunate. We had an event planner under contract and the topic was really a great fit for us to the protected bike lane and Pines been a priority for us for a while. We are Ardent supporters as well as Vision zero and we're part of the community package Coalition that helped the city secure funds from the convention center and part of that was 10 million dollars for the pike/pine Texas. Bike lane. Next time please. So there are a couple of things I think as Clara mentioned this goes back and then Brave years, but they're a couple of things that we did as a lead up to the event. One of them was this pop-up protected bike lane as part of parking day and the next slide, please. Are we don't have that acts? Like that's okay. Also did a bunch of business Outreach because we knew that the folks who own and operate retail along that Corridor would likely to be the most affected her. I certainly with him. I was concerned about impacts. So we did a lot of Outreach beginning in 2017, the renter initiative partnered with Central Seattle Greenways to do Outreach. And then in the lead-up to the event again Central Seattle Greenway is this time with support from gspa went out in teams and spoke with a lot of folks and it was actually really gratifying that many of those folks came to the event. They weren't all pleased about the project but I think they still hurt. Yeah that works up with a little bit of an experiment. We didn't quite know exactly what was going to happen or how many people would come but we had about a hundred and fifty people participate in groups of 12, each of those small groups after we gave the whole room some context for what was going on and what we understood the city was considering then the groups identified the values that they shared and discussed how to balance the needs we had business owners at most of the groups as part of the conversation. We had Representatives term disability communities and really almost everyone in the room is The Pedestrian at some point. So that P point was with pretty strongly heard. Each group was led by a trained volunteer facilitator and a map expert what we provided groups with where maps of the corridor and Some pieces made out of sticky notes and we didn't know how those would go over but people really got into it. It was great to have a physical thing to play with that was done to scale so you could see what would actually fit on the street and what wouldn't and understand the challenges of trying to meet all the needs for Street users. Another thing that works really well. We're stickers when folks came into the room. We asked them to put stickers on their name tags identified all the ways. They used the street and the idea behind that was to remind ourselves that none of us use the street and only one way. I am not just a cyclist. I'm not just a business owner. You know, I have a dog I have children and I eat at restaurants whatever and that was actually a tremendously successful people really enjoyed the stickers and dumb and I think it really did help folks can a bond over all the ways they use the street rather. Kudos for indoor bike parking often at these sorts of events at the people who like they're actually feel like they have kind of been left out. The parking situation and we were able to provide by parking inside the building 7 one who kind of keep an eye on their bike and feel secure and know it was there to make quite a statement about all the people willing to buy got on a rainy night in October. We were led by fantastic volunteer facilitators and map experts who we trained and those folks were key to helping the group sees their time constructively and what we really heard from people with that that the group's really did have constructive and productive conversations. When we first scheduled the event we heard from a lot of people concern about the length of the event asking people to come for 3 hours on a Thursday night plus, you know half an hour beforehand to get their dinner and get settled seems like a stretch but people got so engaged to didn't want to stop the conversation. They just wanted to they really wanted to dig And talk with each other which was gratifying. We we all we all have a stake in our streets and and care about them. What was really gratifying is how much they wanted to hear each other's perspective people talking to each other understanding. So so people who buy Kinder standing the business owners perspectives and vice-versa people concerned about pedestrian safety disability access all that sort of stuff able to have really really productive conversations about all the needs and the challenges of the street. And and one thing that we heard was that this is hard work trying to figure out how to balance the needs. So we heard some real appreciation for the job that I stopped planners do but you don't always get to hear so that was a kind of a kind of a perk for some of that we did have some folks in the room to provide information and it was great for them to hear that I think. At the end of each group shared their map and a worksheet with their conclusions. No two groups had the same ideas, but they all had thoughtful ideas and there were consistent themes that will share in a moment. The workshop was really great. I mean we were all thrilled but we fell short in our goals for racial diversity and for disability representation, and we also heard that a Thursday night isn't great for a lot of people for a lot of reasons. It's not great for some parents not great for some business owners. So we just ordered a survey that was meant to parallel the workshop and we did more Outreach and we also and I went out and talked with the national Federation of blind blind folks and did some other Outreach to you to get some more perspective, but the survey went out and we got about 435 responses most of them really substantiv the themes and the priorities were Be consistent with what we've heard from the workshop and from our business Outreach previously. So that was good to see that there was some consistency there but it really made it clear how how difficult it is to meet and talk to people face-to-face versus an anonymous survey. Some of the responses were hostile or Flip or cynical in ways that we didn't see in the dialogue in the workshop. So we just really emphasized for us the importance of bringing people together to talk to each other and hear each other and work together, Thank you for sharing all this with us. One question. I had was how the slide you had where you had the Whiteboard not by Blood but though That's useful but it seems like people were discussing like General aspects of what they think should should come in to be there also discussions in this Workshop are there plans for future goal shift? You also discuss specifics of the bike find biking Network. And the reason I'm asking is that we've had several phone calls from the people who live in the neighborhood about some specific things that they would like to see because they they just as you know, because you're biking yourself, you know what you need and what needs to be done. So I wonder if there are specific things that came up and also I wonder if I can send you these these things that we've heard and maybe get some from you all this based on your expertise and maybe they can come up in the future Workshop. Yeah, and in terms of specifics, we we captured some general things you wanted to to Really capture the shared priorities in the shared values because we knew for one thing that every group was going to come up with a different specific configuration just the nature of the Beast. So a lot of the stuff is really General about shared priorities and suggested Solutions. The map itself shows specifically the different color papers represent different things like whether it should be a two-lane two-way bike lane on the north side of the street or separate the North and South Yeah, there's a there's a color key that I don't actually have memorized at the moment. But yeah, they were they represent in that when I believe you're seeing that there's a bike lane on each side of the street. The magenta is the traveling and then the other colors represent parking or loading zones or turn turn lines. So it's a little challenging to make out those but again since we knew that the maps were not going to be the same from table to table what we really wanted to make sure we had were the underlying principles and to surface any issues that we wanted to ensure the planners were keeping in mind. And so that's what we were trying to do with the worksheet was really kind of Pull those things to the top so that we could could ensure that we had a wave as advocates to look at the designs the city came up with and be able to see whether they met the community's needs that makes sense of our priorities with to make people feel like they were being heard and so we've fully documented like all that we have we hired Alex Garland to photograph the whole event and we documented everything and took pictures of every map and and they are all different. So we we captured both kind of the granular differences as well as what people could agree on. Thank you. so we did capture all of little granular or agranular details of the difference of people in people's designs, but the big things that people came together around or the big four priorities that we listed up here and these were overwhelming support from every table from a lot of the surveys that we were hearing from business owners from people who live in the area from people who visit the area just to hang out and play to shop. Everyone was agreeing on these for big things The Pedestrian Safety Company convenience was big four people a lot of the businesses in the area depends wholesale on the number of people who are walking up and down the street and we secured a number if you'd like to find specific intersections over and over again as specific places where they felt unsafe and then we highlighted those in the data and then also that they wanted the space to be an even more save more comfortable environment than it currently has, you know, we People talking about The Pedestrian environment in terms of wider sidewalks and and better Crossings and a better pedestrian wrong as well. The continuous safe intuitive bike route. There was some mixed ideas about where people wanted the bike route, but it was overwhelming that they wanted to be continuous all the way from Broadway to 2nd Avenue. It would feel continuous that would feel like one safe intuitive route people wouldn't have to be whining around and following signs and not sure where they were supposed to go and having it be predictable were people loading zones for business and passengers was huge. One of the biggest things that we heard from business owners. Was there often really upset when there's a removal of parking for most When there's a removal of parking what we heard almost overwhelmingly was it's not actually long-term parking in front of the stores that people are concerned about its loading zones and a lot of the Outreach this conducted in the city has loading zones / parking and so a lot of those concerns are getting lumped together and the biggest concerns that we heard. We're loading for the business themselves. A lot of the loading zones are in this the middle of the block and they're not particularly well enforced which means that some of the larger trucks can't get an out of them and we're ending up in the middle turning Lanes which is illegal, but very common up there people were concerned about where those those loading zones were going to happen. And then for T&D TNC vehicles for Ubers and lyft's also being able to come in and out of loading zones at the end of the blocks is a lot easier than pulling into the middle block and also just reduces the the conflicts in terms of pedestrians and bikes. Everyone else who's competing for space there and then just having a very clear very predictable traffic flow for all users whether you're driving whether you're trying to catch a bus whether you're biking whether you're walking we heard this particularly from the blind community that it's if if the traffic flow is is off of where you think it should be there where it's you're expecting it to be that creates much more dangerous situation for all users. And that was one of the biggest concerns that we heard about the bike lanes that are currently on Broadway was just a general confusion of people not knowing where they were supposed to be where they were supposed to be expecting traffic to be coming from what was happening when those lanes are starting and ending and all that. Are bicyclists for both people really wanted a clear predictable slow for all kinds of traffic. So as a car knowing where the pedestrians are going to be where the bikes are going to be as of bicyclist knowing where you're expected to be at The Pedestrian knowing which direction traffic is coming from and where you're expected to encounter it. And those four things sound really intuitive, but if you look at a lot of Seattle planning and a lot of those things aren't happening right now. So we wanted to highlight those four things. Next time please. So Justin summary. I want to pass these around so you can see all of the partners that were involved and also because I have a stack of those in my office John Moore. Let me know in in general. I would say that the event was Great, the folks where they are as free, sad were really engaged. They stayed. Doesn't hurt to give them food and beer but people were really into the conversation and there was a lot of you know, there was some disagreement, but it was very civil. So it was a really good process and there were a couple I don't know if Sam's here, but there were a couple of folks from a star as well as King County. And hopefully she'll give an amen on this that said that this is really how this is really a model for Community Design This is now this is people coming out as pretty sad to see each other like each other in the eye and have real conversations about an important topic and a topic that has its controversy. So big part of what made us successful is that it was community-led and we brought people together from different perspectives. It was also incredibly well plan and I can say that cuz I had kind of a small role in the planning is mostly the to hear as well as Makayla. Fern from our office. He just spent a lot of time a lot of hours organizing volunteers cutting up little pieces of paper and really kind of keeping everything on track. So kudos to them. We hope that this can serve tomorrow that the city and other neighborhoods can benefit from out of the trial and error that we went through it's not perfect as we mentioned. We had some challenges in terms of getting the audience there that we really wanted but it was successful and we think that it should be replicated. And I would go except for a Step Beyond just sort of sharing what we're saying today and suggest that the city may want to contract the planning team to create a toolkit for the neighborhood's not every neighborhood has a Clara and Bri and Makayla, so we would like to make it easier and maybe we can even have more permanent Play Pieces then post it notes. So that's just a suggestion. I really appreciate appreciate an opportunity to his presentation and they're really grateful for the work you do and I think just to build own observations. You just made Joel than what you or the presentation so often times and we are greeted with skepticism that questions about whether you're here to tell us what you're going to do. Are you actually getting feedback and then it often turns into various groups showing up in a meeting to you now have a louder voice than another group of eating and when community members come together really frankly without a lot of leadership from the city, but take it upon themselves and work through the differences and folk show up in there like the folks. That's a different room. This is a room. We work on Solutions and you all can present. Solutions and help to find where there's Common Ground help help us find where there's some trade-offs and they're going to have to make in Folkston. I was and where to show up to advocate for the with those trade-offs look like I think we have a potential for getting much better outcome. So I really like the idea of what you did and I like the idea of having a toolcat. And so I think we should think a little more about how we can we can carry that over to our neighborhoods. The neighborhood on Capitol Hill has some great Advocates and also has a lot of people that are very engaged around these issues which is not unique to Capitol Hill but not every neighborhood is probably going to get a hundred people out for 3 hours to work. So how that how that fits different numbers differently if it's true, but I am really grateful for this. I realize that we've neglected to mention that we we were doing this largely for our own efforts to understand how we could best advocate for the community and to have to make sure everybody was involved in the process, but we are obviously not the city. So we have shared all of the information from Oliver Outreach with us. I have been working with the the planning team to make sure that they have all the information input and they were very excited to get all of this to you and Sam is here today to answer any questions you have fun on that front to Adam. They were so messed up people at the workshop also or there were and we invited representatives from s. And from Metro to the workshop to answer any questions for suspense had because we didn't want people creating a design that was physically impossible right that the other actual things that they didn't know we're going to happen if it was really helpful to have those folks there. Yeah, and I and I will also mention that we we gave people some specific what we knew to be with the city with most likely to do right which was to put Lanes on Pike between Broadway and Belleview and then have Lanes following the pike/pine Renaissance down to 2nd long-term permanent, but we knew that wasn't going to make everybody happy. So we told our facilitators that while they could not lead people down a different path if their group went rogue, we wanted to record that we wanted to know that and we did hear from many people at the workshop and we heard it again and again on the surveys and we've heard it from the businesses that long-term. They really want to probably the best way to do it is to extend the pike/pine Renaissance all the way to Broadway to have those be one way Lanes but one way or another Most everybody wants the westbound bike lane to be on Pine and the eastbound to be on Pike having it be a couplet instead of having them both be on pipe to a certain point and then moving people over to Pine to continue which is much less graceful. So just to let you know that we didn't give people that option but we knew that they were going to bring it up and they did so and we share that with us. As well. Call appreciate that work and I appreciate that stuff going bald and put Sam on the spot right now, but I would love to have a private follow up with the prefix that I start to understand. What are the next steps in this in this project and get a sense of where they are and I think would be appropriate to bring them back to a committee at some point in the near future to talk about in the next steps in and what are the common term investments and were the long-term Investments and how soon we can get them on the ground? Alex anything else I just want to say thanks as somebody who has political ownership over a controversial protected bike lane, you know what to watch community members come together to try to find collaborative Solutions is really great. I can also warrants mentioning that the fact that we have to spend so much time and energy going block by block neighborhood by neighborhood in order to make it safer for people who choose to get around my bike to be able to do so is and it's an important amount of work, but I'm still at 8 as I enter closer closer into my retirement is an elected official. I'm struck by how hard that work is and how easy it is for the infrastructure to be built that gets people in and out of cars every day. And so I want to say just thank you to you guys for that work another many in the audience to share that opinion. You are within the bureaucracy her working hard to do that too. But we have a lot of work to do if you know it takes us out of Community organizers 150 people being fed and well either caffeinated or liquored up and then be given, you know, a great pathway for discussions. So then a couple years later and that building and critical an important mile and a half of protected bike Lanes when we can snap our fingers and we build hundreds of millions of dollars of car in the structure without. So, I'm frustrated by that. I'm grateful to you all for creating a space for us to not have this be a controversial topic if and when it comes to us cuz that's really critical, but I'm at the same time regretting that we have to spend so much time and energy on this little things when I feel like if we were all collectively making the decision a little bit differently, we could be bigger Bolder investor. So it's a little Bittersweet for me, but I'm grateful to you for the work. I really appreciate your work, and we will clearly be back in touch shortly after Thanksgiving dish upon this and thanks for being here today. Thank you. All right telling us we're going to switch to another presentation on Vision zero Jasmine. Do you mind reading that into the record and all invite presenters forward Vision zero update? Welcome everyone when we start with introductions, and I wanted to stay and make a few opening remarks before I hand it off to you all. Excellent. Thanks for having us today. My name is Jim Kurt, and I'm with the project develop into Vision at s. Thank you both for being here. I want to just Echoes some of the comments were here in public, today some of the comments. I've been receiving frankly over the last three years and I'm sure you have to apologize that I'm going to maybe sound a little preachy and you know exactly what I want to say, but I will do it for the sake of just doing it. This is such a critically important and I'm really grateful of the city's commitment to do this work. It's been a few years since we made the commitment and it was under another May or not a different department director. And I know you all have been through over a year without a permanent Department director which can vacate challenging and at the same time holding that reality with the fact that the people are getting harmed on our streets and what we have some great planning and some good commitments. I think I share a lot of communities frustration that we haven't been able to move. Faster on this and I'm sure the committee that oversees the work of s. And it's hard for me. Now. I've been an advocate long before I was here and now I'm here in a position of power and I feel also someone to our list to move this forward until I look forward the presentation and I also want to figure out what we can do collectively and you know, this wasn't this wasn't this mayor's presentation commitment to make I want to believe that she's committed to Vision zero and and it would be nice but really want to hear how she plans down this move forward and how we as a council can support accelerating some of the work. I'm hoping to hear that there's a lot of stuff that's in the works and it's just take a while and it's about to hit the ground and we can get kind of excited about that. So take it away. Thank you, I'd to want to just take a moment and just address some of that that, and sent and thank everyone for being here to highlight the fact that What Ryan Packer said is is 100% correct? That traffic fatalities on our streets is in is indeed a Public Health crisis in the United States last year nearly 40,000 people were killed on our streets. We know that these collisions are mostly preventable and do not have to happen. I can tell you that there are 12 to 13 thousand crashes on Seattle streets every year as well. But we do have a very safe transportation that work here in Seattle. We have a long way to go to get towards Vision zero whenever a tragedy occurs on our streets. I know both Allison and I and all of our colleagues at the Seattle Department of Transportation really take it to heart it really hurts when we know something awful has happened out there and I personally every morning check out the Seattle Times in my phone to see if anything happened overnight. And so this is something that we are all over and we are working to accelerate. The pace of our implementation Rainier itself has been technically challenging project, but we are moving forward and we are moving forward soon. We have recently issued work orders to accelerate our projects out there starting eminently with the reduction of speed limits on every arterial streets in the Rainier Beach Urban Village, which includes Rainier Avenue South include South Henderson Street, Renton Avenue portions of MLK to 25 miles per hour that will help and we will begin implementation of the phase 2 Rainier project this year. We intended to finish with our 2019 work before school starts on September 1st. But we also acknowledge that there is many places in the city that we need to be before there was the tragedy on Rainier Avenue just days before an older gentleman was hit and killed on Lake City Way at Northeast 85th Street again. Just trying to cross the street and it highlights the fact that while we have projects on these streets where we have to rely on all the tools that we have to Teresa Vision zero call. So what we want to do today is kind of really highlight the ongoing need for a continued comprehensive approach to getting to ending traffic deaths and serious injuries on city streets by 2030 which is efficient. There is about Okay, so we're going to walk you through really quickly here. We're going to go a little bit over the background of our safety efforts here at the city of Seattle talk about the data in the trends projects initiatives and next steps as well. To briefly run through the bracket background here in 1997 Vision zero was launched in Sweden Allison and I got to meet the guy who spearheaded that over in Sweden and it was actually something that they decided to move forward with because they suck so much momentum with nits out of the national highway traffic safety administration here in the United States. They took a slightly different angle with vision zero and nine is the major factor in determining whether a crash occurs and how serious that is in the year 2009 like to tip the hat to the state of Washington because they were very much for runners and safety in theater 2008 launch their targets HERO program which continues today in 2012 Seattle was the first city in the United States to declare that Zero fatalities in traffic and serious injuries bizarre Transportation safety goal and then in 2015, we brought it to Vision zero, which was then subsequently codify to the comprehensive plan that you're after that. In part 2 to your help in 2016. We also made a huge step forward by reducing our default arterial speed limit to 25 miles per hour. We reduced the speed limit on 2400 miles of are non arterial streets to 20 miles per hour and our downtown Corridor here are core here to 25 as well. We'll talk a lot more about to be limits later in 2017. We release our groundbreaking bicycle and pedestrian safety analysis, which was a proactive attempt to treat the symptoms of traffic collisions proactively and last year. One of our greatest accomplishments was to get that bpsa assessment into our complete streets checklist. And I think this is really important thing for everyone to understand the vision zero program itself. It has a smallish budget. We have roughly three million dollars a year to address a safety on every street. In the city, but by including a review of Crash data on our Capital project development program were able to ensure that we when we have the big dollars on our big capital projects that we're not just going out there and essentially rebuilding things the way they are we are taking it a thoughtful look at the crash patterns and we are developing Solutions so that we can address those Craft products and move forward. So it's very much a budget multiplier for the vision zero program and I feel as if this is really going to help us achieve our vision zero, moving forward to this. That's great to hear Jim and this bullet point from last year. So is that Fully implemented and and major capital projects going for now. Yes, that's correct. And so the stuff that's going to be implemented this year. We'll have gone to that analysis or is there a little more lead time out of time between when we're planning a project and we put together the complete streets checklist. And when we're done with design and ready to build our two projects that have thoughtfully considered the safety data. So, it's me you were very excited about this. No one's asking you to delay other projects are the projects also in the works that are going on that didn't have the benefit of this but there's obvious things we can do it. We will take a few minutes to make some corrections there to absolutely So as far as the transgo we have had massive growth as you know in the city of Seattle, but we continue to be on the right track toward the safer Street. We are among the safest cities in the United States. I believe the only city that has a better traffic fatality rate than the city of Seattle is New York City which has hundreds of deaths per year, but they have 9 million people living there but we learn as much as we possibly can from our colleagues in New York City and across the country through the vision zero Network, which is an organization that helps consolidates what's going on nationally on the vision zero level so that we can all you know, go over our lessons learned and move forward toward safer streets. I appreciate you highlighting. And I appreciate the Tanner there which is both, you know, great. They were one of the safest cities in the country and it's still not safe enough. We clearly have work to do at work again, but I think we're That anytime someone dies in our streets. It's potentially a dad and a mom or sister or brother. It's a loved one of someone and we really take that to heart. And also I would I would Gander and guess that most people at this table and in the audience tonight have experienced some sort of traffic incidents in their life for there was someone in their family or friend I know for myself. I Was I Thinkin the third grade the first time that this impacted myself. So this is something that we should as a society be able to Rally rally around quite easily in my opinion. I'll repeat something I hear from the director customer Johnson. I are at a table with him periodically in a powerful statement. He repeated to the folks down at Puget Sound Regional Council was shortly after that Amtrak failure people died, and he was called out to committee hearings in Olympia to As you related to to our committee up here. He said yes, this is tragic that this happened and I'm happy to talk to him we can do and you should know that every month. I forget the exact number every 10 people died in the state. And so if you want, you know, we have ideas about how to make this a friend. So it's it's it looks good with this little disappointed account number Johnson made earlier what we get used to and what we accept and then how much we contemplate change and then you step back and look at the data and think about how you know, you can give you mention today, you know, I think about the world post 9/11 and how much how much the world has changed because of that horrific incident and obviously loss of wife and you look at how many people have died in traffic fatalities since 2011 or 2009 11 2001 The number and it pales in comparison to what the response has been. Can I say Amen to that? Okay, so specifically this is preliminary data. I want to stress that the data may change but it does appear as if we are coming up one of the better years for traffic deaths in the city of Seattle which includes a 25% reduction in Fatale bodies are between 2017 and 2018 with 14 total fatalities and 170 serious injuries. We did not make a whole lot of project progress on the serious injury a front which is something that we are absolutely concerned about in many cases. Those can be in a very close to fatal crashes and in many instances, they are life-changing for the folks who are involved. So that's why we want to look at not just the deaths but also the folks who were seriously injured seriously injured Pedestrians continue to be overrepresented in our data in 2017. We had 11 pedestrian fatalities in 2018. We had eight so we're going the right direction but that's still a people and we had for driver passenger fatality is one bicycle fatality in one motorcycle fatality last year. Took a couple things I heard in public, today one was just about the data and I've struggled with that in myself, but I'm not in it as much often it feel like when I want to get the data. I need to go do a Seattle Times search to read to the Articles. And so are you able to address will be heard in public, or someone said hey, I found these deaths that you guys aren't reporting. Yeah, if we were aware of the incident on 15th Avenue South Side Robert was referring to our traffic operations Transportation operations group actually manages the data and it's a partnership with the Seattle Police Department in the Washington State Patrol. So the police department obviously fills out the pollution reports and then we send them to the state so that the state can capture those as well. There's a lag time and there are some communication issues that we are we are battling it is not uncommon in the United States for the for these issues to come. And actually the our data here is actually in much better shape than in other cities across the country where there's six to eight months lag time between when a crash happens and when they get information about the circumstances and Bob we definitely have some room for improvement, but I imagine that the police are directly involved at the time of application of followers app. Someone may be injured but if six months later that turns into a fatality the police are probably out of the picture by that point or are they not not necessarily but there are mechanisms in place to go capture that to go capture that and occasionally one of those things fall through the cracks. That's one of my priorities to make sure those things are eliminated and that we are on top of every single fatality or Serious injury that occurs in our city. Your comment on this graph was not sure what happened in 2006 or what happened before that. But obviously the the drop from 2006/2007 is great. I am you know, if we were to fit a line to the data points in a limited 2006 that trend line would be quite a bit different made me feel glad and so I think if I understood the public who made it up there was like Hey. Time to drop 2006 off and let's see what we've done in the last 10 years. And so just want to make sure you're not playing games with the data to show that Trend and or or something there. I think that's a really insightful point. And I believe that came from Ryan as well. And you know, he's right in 2006. We had far more vehicle fatalities and 1% over the years is that drivers and passengers are involved far less in these types of crashes because of airbags and all the different technology that's going in to make Vehicle safer pedestrians and bicyclists. We don't have a steel chassis to protect us and so it's up to us as a city to designer streets so that when somebody inevitably makes a mistake the consequences, aren't that We have a couple more slides here on data and Trends this one here year-over-year. We see the same set of contributing factors to crashes with a distraction impairment speeding and failure to yield consistently in other cities across the country faced the same issues with the last year of datasets again preliminary we're seeing distraction. Now the second top cause an impairment contributing to 50% of the fatal crashes last year. So an issue to continue to work on and then we're also seeing speeding particularly high and speeding so when folks are going 10 miles or more over the speed limit in conjunction with impairment leading to the really really bad crashes. Allison I wonder if I may interrupt mr. Chair, we as a city get to control two of those variables but not necessarily the other to write a lot to design our streets to make them safer for people we can do a lot to enforce the speed limits in lower those payments recognizing the people for the most part feel comfortable going 5 miles an hour or so over the speed limit, right? So then we go down the more we get in that safety zone work if people are struck they're not dead but there are surviving that incident however more and more of the national debt is pointing to these fancy devices as being the largest or larger contributing factor in your debt is saying a 300% increase in distracted driving is the last three years alone. That is very scary. I assumed that that's what other cities are seeing. Is there a movement afoot at the state level at the national level to contemplate a ban on Data-sharing for example within cars. I've been told that the technology exists that allow would allow for you to get access to data but only in a hands-free environment knot with device in your hand. I'm curious about what the state of the national practice might be about how we can get ejaculate the distraction elements here because it seems as though driving a car while operating your cell phone is becoming more and more the norm and that is what's leading to more and more deaths on the roads millier with national level. Related to that. I don't know if Jim is strict and that was really spearheaded by public health Seattle & King County as well as our partners up at u-dub Harborview Medical Center up the hill and moving forward. I am aware of movements within the vision zero not work to try to expand those more strict laws across the country. I recently got back from the trap where it was the norm to still talk on your phone and it was interesting to say the least and quite frankly from my perspective frightening, but I do think that there's going to be a lot of Consternation discussion and consideration of stricter laws on the the ability to get that information into the hands of law enforcement when something bad does happen in the show that was introduced that made a visual verification of higher level in fraction as we continue to contemplate on what that looks like. I think that'll be interesting but the solution here can't be to put a police officer on every corner and peeking in window. The solution is got to be as technology evolves as we get smarter and better and his cars are doing a better job of keeping us safe. They could be better than doing a better job keeping us all safe by making some of those small scale 2 weeks, which I've been told are possible but just are continuing to be valid. Yeah. I definitely have heard of five different technology out there that is available. I do think they're working out some Kinks right now, like for example, you know for the technology to understand when you are the driver and when you are a passenger, Band again. I one of the things that's an issue. But I think you're spot on do we have any data in here desegregate amongst the note say the difficult consumer driver vs. Professional drivers and take an Uber and Lyft rely on these exclusive and delivery more and more and I'm I want to hope that as professional drivers that those companies are keeping an eye on things and and those are actually safer use but I'm curious if we have data either locally and nationally about if there's an accidents are happening there at the same rate with everyone else. Can we got a real problem? That's a regulatory on that right now. We rely on data reported from the company's so there's that but I don't believe that in her own crash data. We haven't seen necessarily like a higher incidence of DNC. Drivers involved in crashes I will say and we'll touch on this more later and under kind of the education component of things is that we are continuing to work with TNC and cab companies to not only reach Riders and passengers with information. But also to talk to their drivers about how they serve as professional drivers and the role that they have to play in Vision zero and I would add one thing to clean up outside the policy and Regulatory technology discussion. Another thing that will touch on in a moment is how we can use technology for good in an educational awareness campaign. We ran a safe driving competition that got some really positive behavior change results including reductions in distraction. So there are all that to say it takes so many different ways to get at each of these issues and that's the approach that we're going to continue to take so Couple more things on this side is in terms of failure to yield to pedestrians. I'm gym. We'll talk more about this in a moment, but we are looking at putting in leading pedestrian intervals, which can contribute in New York City has seen a reduction in a 30% reduction in ped fatalities and they can attribute some of that back to things like weeding pedestrian intervals just giving pedestrians, you know, if 3 to 7ish Second head start at the crosswalk. I also want to really highlight who is most impacted by fatal crashes and many folks who provide a public comment touchdown this as well, but people walking people biking people motorcycling are vastly overrepresented in our data set also older adults the two recent fatalities that we saw and Lake City Way and Rainier Beach were over the age of 75 and that's commonplace in our pedestrian. Fatality data sets. So as Jim mentioned, these are people who are not protected by vehicles and as you age or just not able to recover as quickly as you are. I think this is our last night on data and Trends. So to wrap this up we see most of about 90% It looks like our map is a little bit where legend is a little weird fuzzy their attention to the icons in the legend. But we see about 90% of our serious and fatal crashes happening on arterioles. And even though this map is small you can kind of see some of those arterioles pop out. Just wrapping up kind of the data component of this while it's really critical that we rely on data to make our decisions and where we make investments. It's also really critical that we remember that each point on this map each. Represents a human a person who either lost their life or was seriously injured, so these dots and I noticed in the back of the room in the white Silhouettes that someone brought that are across the city our daily reminders about what this work is about. And I'm Vision zero kind of helps us set the framework that even though this kind of stuff happens every day. It is not acceptable and shouldn't be tolerated. So traditionally approaches around Traffic Safety is have focused on the three E's of engineering enforcement in education. And we're continuing to do that. I will know they're not all waited equally, we as an agency responsible for the engineering component. We work with enforcement. We also do public education Equity more and more across cities as it should is leading we should be leaving our framework around this around Equity to and we are as we use data to decide and to find where we're working. And so we see, you know, we put our investments towards the places that need it most and more often than not those overlap with communities of color. I also want to point out that a task. We have colleagues who are building out of Transportation Equity program. And so we have a great opportunity there to work with them on making sure that safety is incorporated into their work as they develop an equity agenda and that Equity is Presented in our work as we move forward with vision zero think we're going to talk a little bit more about how we're also working harder across the department to reach historically underrepresented communities and how we engage them. One of the commenters earlier today pointed out that effort in Delridge, but it was Vision zero. We really want to make sure that were talking to people and communities of color are talking to limited English proficient folks with information about how to use our street safely, They were also working with SPD on a racial Equity toolkit related specifically to enforcement that should be ready in Spring. Okay, so I think we transition now into projects and what we have in the works safety corridors being. The lead I think program for the vision zero program and thanks to funding from the Levee to move Seattle. We have a ton of projects in the works the last two years. We've been planted 6 projects and this year alone. We're looking at 8 or more depending on the availability of our cruise. So we are really ramping up our efforts here. And I think you'll notice if you haven't already major changes across the city Northeast 65th Street is under construction will be substantially complete and may 35th Avenue Southwest base to is under construction as we speak bring your face to as I mentioned earlier. We are moving forward with this year. Absolutely and we have projects in just about every corner of the city also want to mention that will be working in the central business district every year until our Levi expires until we find another funny towards there and what you'll see we're doing in the central business district is what really focusing on those pedestrian Crossing. We're focusing on protecting pedestrians at intersections by printing in protected turn phases as well. How about we have high hopes for the safety corridor program because we know the street design is the critical element in this probability of a crash and by adjusting the street designs, we can set expectations for everybody's losing interest rates in the central business district has been phased in starting a couple years ago. And as of The Pedestrian in a tablespoon of whole stinking are we starting to see the two is a premature to get any data there. It's a little early. I think we have I'll talk a little bit more about it in a little bit, but we have 43 in place right now, and we are evaluating hundreds of other intersections. We intend to install a 50 per year moving forward but most likely a whole bunch more than that as we develop our policy and see their effectiveness. I just want to offer that it's somebody represents. I'm out and have stretch of something that is not be substantially complete from estimates perspective until May gym, but his for all intensive purposes. Substantially complete for the community's perspective the protected bike lane that we've constructed on 65th between 20th and I-5 interchange has already resulted in a lot more users a lot more folks are using that Corridor than whatever otherwise who tell me even though we don't have that stanchions up yet that they feel a lot safer cuz it's clearly a place where it's okay for them to be the cars are not weaving in the way they were before and let them particular intersections where we've installed in one particular intersection with install the leading pedestrian airville. That was a place where the pedestrian fatality of years ago. We are seeing a lot safer turn movements in that neck of the woods. And so these are working and it it has been we did require a little bit of money and it took a little time but it is making a big impact on people's laps. Nothing is perfect or people want more Crossings. We want wider sidewalks. We want better lighting. I mean all those things are continuing to be part of the to do list, but the project elements that we've implemented so far already making the street feel a lot safer for a lot of my neighbors in the grid this great feedback make very much. Speeding is one of the cornerstones of our program as well. As I don't really have to remind you of this. I think I've said it three times already but it is a critical factor in this 5:30 of crashes. It's simple physics, but Seattle has been leading the nation and the way that we are looking at and evaluating and adjusting are speed limits. And again, thank you to your help with that back in 2016 since then we've had an aggressive program to look at not just houses where we want to adjust speed limits, but how we set speed limit in our team has been featured across the country basically with the pioneering work that we're doing interesting ly enough to fhwa actually doesn't allow cities to use something other than the 85th percentile to set speed limits, which was buried in a documents that we found at and we've been able to Pilot using the 50th percentile speed to set speed limits based on You know how fast vehicles are going but also we have high volumes of pedestrians and bicyclists. Do we have Transit activity? We have a lot of driveways that are causing conflict. So we're looking more not just that how fast are how slow vehicles are driving but what's going on on the street and I think it's a much more holistic way to set speed limits and we're super excited about our war plan moving forward which we have accelerated since last time. We were here a couple years ago. Again, we reduce the speed limits on all nine arterial streets to 20 miles per hour and since 2016. We reduce speed limit on 200 about 200 miles of arterial streets. We are focusing on our Urban Villages because we have 80% of our pedestrian collisions occurring in those areas. So it's a really strong data point that really has helped everybody at s. Rally around this plan here as you can see. We're about a third done. With our Urban Villages and we will complete our work within the urban Villages and the next 2-3 years. In addition. We're looking at are arterioles that do not run into urban Villages and those projects. We really want to adjust if the design of the street so that we can achieve lower speeds create those more comfortable Crossings for folks were trying to catch the bus and where we can get in those by facilities as well to create a a nice environment for everyone without vehicles with him by 45 miles per hour. So we were very proud of the work that we've been doing on speed limits and we feel like we have a really aggressive approach moving forward is to evaluate and adjust the entire city of Seattle and just the the near future really took your comment about Federal Regulations. I didn't totally track that but I think maybe what I heard was that previously our ability to reduce Signed speed limits required a certain amount of study and engineering and is it accurate to say that we've discovered that maybe there's a little more flexibility which would allow us to move more aggressively. That's exactly right at the 85th percentile has been kind of the the golden number if you will for Traffic Engineers forever and there's been some great work done across the country on this including at the Washington State. I did some research into where the 85th percentile came from. Nobody knows right but we he found out that it was used on a highway project in rural Ohio in like the 1960s and for some reason it stuck and Celiac Seattle is not real Ohio. So that's not a one-size-fits-all equation there. So we're really really happy that we found that flexibility and we we also have, you know a city traffic engineer who's really really excited to push this as far as we can hear. I know that simply changing the number on a sign or when there's no sign Simply Having a different policy won't necessarily communicate to the user's it's different and so enforcement is a piece of this design obviously is a big piece of it and Design Reno takes time, but that's said I think there's a lot of folks in the rain just like at least get the the sign a Job Corps or whatever it is so that at least we can start and maybe we only get small Returns on that immediately, but I'm excited that we have Smart to move aggressively in love to support that actually act like yeah, it's all about awareness signs up their super reflective people see them as drivers. You come into the city of Seattle. You cannot pass a speed limit sign when you are entering the city whether you're coming in at 145th on Rainier or coming off an off-ramp. James Street, you're passing to sign him up everywhere. Okay, and here's the lpi's we did have a video that was attached to this here to demonstrate what an LP I'd is and it looks like it's here Johnson. I could act one out, but he's got to be up at 3. Might not work. We might need a re-enactment that would be pretty entertaining but in general pedestrians get the walk signal while all the drivers have the red that allows them to be in the crosswalk take the crosswalk and be seen by drivers. Typically in Seattle were using at 3 to 7 second Head Start, but across the country. It's been more like 3 to 10. So we're trying to develop a policy that pushes is towards the longer ended that scale here. But as I mentioned earlier, we have 43 of these that have been installed. We have a list of hundreds that we are looking at right now. We also recently received a grant from the Washington State Theo T2 to install these throughout the city of Seattle. The typically will reduce pedestrian crashes by 40 to 60% That's just general crashes all crashes of all types and what New York City has seen where they installed nearly two thousand of these already found one of the only cities in the country. If not, the only where pedestrian fatality they're actually falling. So after Consulting with our colleagues in New York City and kind of noting that this is one of the things that we really hadn't been embracing as a city. We've fully brought this into the fold at the a task. And we are really excited to start rolling these out on a regular basis collisions were happening with left-turn movements. Are we prioritizing these MLP eyes for those left turn collisions were worth what we see a high volume of left hand example and allowing. Restaurants to take the crosswalk before so that we got a better visual. Yeah, and ideally we'd like to have those be protected only left hand turns as much as possible so that we eliminate that left turn conflict altogether. I like to think that were in many ways. We overload drivers with things that they need to do, right? I think about sitting at the intersection of Lake City Way and 125th on a rainy night in December and you're trying to make a left turn you have to gauge oncoming traffic. You have to make sure there's nobody in the crosswalk you have a lot to do and if you have any distractions in your vehicle kids, maybe you know that compounds everything. So if we can eliminate that the kind of fudge factor that we have out there and really just organized and structure. I rode way so that things are much more predictable. I think we're going to start really seeing results there. We are prioritizing rlp eyes based off of RV PSA and also are esab invite. Hope chest and safety analysis. Regarding enforcement is a xanny that I think is really critically important particularly for the impairment issue, which is a hard one for for us to get at but I think Vision zero has really been a game-changer as far as are our partnership with SPD. We've now been meeting with them monthly since 2015 where we go over the details of recent crashes. We talked about our emerging issues and and basically set forth our enforcement priorities for the near future. Obviously. This is a data-driven model which SPD completely embraced and that was under the previous administration where they had placed a high value on data-driven work and I had their whole seat that program in which they would review crime and Transportation safety information. We have partnered with the traffic collision investigation Squad so that we can get Their forensic science information so bunch of Engineers and planners on my team have gone through background checks or able to go over to a speedy and read through the amazing amount of information that they collect that we had never had access to before so we are learning so much more than we ever have. It's been quite enlightening to say the least and we're going to continue that work moving forward. It's our desire to make sure that we know about every pedestrian and bicycle Collision in particular that happens in the city and the details of those crashes so that we can understand the circumstances and develop solutions that are appropriate for those issues. It's so great to hear that. I'm checking with some of those folks may be inviting them to Comedy to talk about their expertise me know they that's obviously by the time they're investigating Something's Happened and so it's after the fact that you know in a minute. That might be really valuable thing. And how technology is hurting us on that front the flipside on on impaired driving. I'm wondering with you know, the increase of bility of of uber and Lyft and more Transit available in our city. Are we seeing reduction in the impairment there an office and technology is that continue to be I think it continues to be our top issue. I'd like to say that we've seen a reduction but year after year, it's the number one factor in fatal crashes. I want to believe that more people are taking transit or an Uber or Lyft whenever they're going out but it's always been the case that for every driver that the cops get there, you know assumed to be many others that slip through the cracks. This is a huge huge issue and I want I don't want to steal Allison spender, but we have recently renewed our partnership with Mothers Against Drunk Driving, and we have some things in the works to address that from kind of education and awareness perspective, but we clearly rely on SPD and their DUI patrols to get out there and a nap people in over the holidays. We had a really long deployments with SPD a really long emphasis patrol around impairment and they did a wonderful job of nabbing many many many people who should not have been behind the wheel and we subsequently had a really relatively safe holiday season here in Seattle Johnson earlier mentioned potential for technology to help with this back to driving and we require, you know for certain individuals or chronic DUI offenders to have vehicle oximeters. Should be a standard equipment on any motorized vehicle that you have to do a little breathalyzer to unlock at it. I know I agree at Washington State have some of the strictest DUI laws in the country as well. But you know the laws don't do enough and after a few drinks y'all Louis took your inhibition is gone. So it continues to be a brass but one that we are really thinking about photo enforcement is another thing that's of course, we've deployed successfully here in the city of Seattle at in our school zones. We are looking to install new cameras before the next school year begins. We also are looking at the red light camera program as well which is ahead of amazing impact on intersection safety. We've dropped collisions at intersections where those cameras have been deployed by nearly 25% That's a very challenging. Mark to hit snooze Okay, so we're going to touch on education which we've talked a little bit about it just to give you an understanding of the framework that we are working around last year. We put together a strategic Communications plan that centers around a goal of building awareness shifting attitudes and behavior were talking about like cultural change and shifts to ultimately change behavior and be identified four key strategies and also a tactical approach that again, I'm I'm probably sounding like a broken record at this point, but that just looks at a variety of different ways to reach people because that's what it takes. So how do we know if we're building awareness every couple years as. Has the runs a statistically significant customer satisfaction survey and this past year. We are able to slide in a question about whether people had heard of Dallas. Effort to end traffic deaths in serious injuries 35% of people had it's a start most importantly it sets a baseline for us to understand where we are and then there's opportunity to grow that and continue to measure it over time later this month. We're going to be kicking off actually just next week some market research with a research firm focus groups with folks across the city to understand better understand people's kind of General perceptions around Traffic Safety their understanding of what Vision zero is so we can really start to ground our education and messaging approach on data. So what are some of the things that we're doing when it comes to education and Communications run Vision zero, but we are definitely focusing back on the top contributing crash factors. We are also as I mentioned earlier focused on reaching communities of color and people with limited English proficiency, we have Partnerships with radio stations that are reaching key audiences like young men who are often behind-the-wheel and responsible for many crashes. We're reaching Spanish speakers, and I'm working on a new contract with Renta Somali news. We're trying to get more ethnic media Partnerships going. So I'm really excited because we're working with Renta news to put together like 5 or 6 in language videos on a number of traffic safety topics with folks in that Community also part of that partnership will spark some conversations with East African TNC drivers. and I'm also be able to deal run ongoing ads and Stories in that Publications, that's just one example of how we need to kind of expand our reach in those communities around the issue of impairment specifically Jim mentioned. We've been working with Lyft and Uber and Yellow Cab in the past, but he specifically with lift over the past. Almost four years around the issue of impairment where they have provided in-kind donations for discounted ride codes that we can promote at different events on social media things like that. We have an upcoming one and April Senator on 420 and cannabis use kind of dispelling myths around impairment not just involving drunk driving but drugged driving as well. And that's something that we're seeing increased across the state. So dispelling some of those myths and engaging with private Partners to help provide people with there are so many choices and options and I'll turn it is out there. You don't you shouldn't be driving impaired. But how do we get that out to people is what we're continuing to work on. We're also building a really good relationship with the Mad board chair at the state level and then we continually work with the Washington traffic safety commission. There's an upcoming they offer annual grants. And so we're likely going to put together a proposal focused around education when it comes to him. I also want to just mention given the folks in the audience and who provide a public comment that we work in partnership with Seattle neighborhood Greenways around events, like the world day of remembrance around you know, supporting putting up the white Silhouettes and more recently around a pledge for folks to use the word crash not accident. So we rely on and are working on building out Partnerships with organizations across the board other agencies and individuals really we need to Remember that we're all making decisions as we're traveling about the city and Anything could happen to anyone of us. So, how can we get the message out? How come you humanize this issue to to help shift and work towards the behavior that were looking for? Good morning. God on my side. I think we also add a jar of bees and something else a snake. Yeah. Yeah, I was to look out for in 2019 is a follow-up a second phase of the bicycle and pedestrian safety analysis, which the initial study looked at crashes from 2007 to 2014. And the second phase will use a new exposure model and also include an additional three years of data and then include protected bike lanes for the first time. I mention this little earlier but Seattle safest driver was one way that we've use technology for good in the fight against distracted driving and and lowering speeds. So in 2017, we teamed up with an app company and with Pemco insurance and we offered cash prizes to save drivers in the app measures. Whether you're speeding distracted heartbreaking that kind of stuff and gives you feedback after each trip. You can compete against your friends and family members things like that until we engage 4,000 people across the region and I'm positive behavior change we were able to see results which is what we're after and it's hard to measure that sometimes said to be able to measure it just like that was outstanding and then we're looking forward to running that competition again this spring again with the help of time, but with even bigger prizes so measure a door ajar other technology in the car, there's technology in your phone that can do math at that Washington State Roadies recharge pilot about pricing on roads, but you put one of those little devices in your car for them to get the data. Is also available on the app and I bet they start to play around with it. You could see it scored every trip he made and it was like speeding cornering breaking my camera with a household with teenage driver and wife and I we can go on there and see how they did. We had a fun time last year comparing notes with SPD and Hoover better drivers. So the other two items on this slide this summer, we're going to be putting out a new online dashboard that helps tell the vision zero story and kind of weeds together the data with kind of narrative and hopefully some personal stories that also can just leave everything together. And then lastly we're working on developing a three-year partnership with SPD that's focused on conducting Can safety emphasis Patrol? So those are instances where we in advance tell the community and tell the media that we're going to have plain-clothes officers crossing the street at unmarked intersection because every intersection is a legal Crossing and then you got another officer down the street and in case people are not following the rules in the point there is just to educate folks and provide education and a warning and possibly enforcement but really it's that just raising awareness find that issue. And the next side is kind of redundant, but this was all meant to be a little bit of a sneak peek on a bigger progress report that we will be issuing this spring with more information about in our vision zero Corridor project what we've been doing over the past two years and what's to come later this year and into next year. Really appreciate your ongoing work in the team that's doing the stuff. I appreciate hearing how you're incorporating some of this work to the broader work of esta. What is great. I appreciate your kind of acknowledgement of the frustration that despite despite could work in spite mean when they say the cities. We still have a lot of work to do and I'm I'm interested in working with community members including folks who testify and are active on social media thing as he emails. It really care about this about what what's a set of Investments that we could be looking at this budget year to really make sure they know we're trying to live up to the school and we're on target to hit that 20-30 goal. I'm maybe even accelerate it so and so. There's a lot of people out there was a lot of great ideas, but would love to hear your ideas. You know, if we had another, you know, x amount of dollars, you know, we can do more core doors are we would invest in this or what what that might look like? I know there's a lot of public demand for it. No one's against safety prioritization is a challenge, but I think that's something that a lot of us on the council would be interested in working on so I actually would Excellent. Thank you very much. I think if we can not get back to you with the key ideas that we have. I I know I have some thoughts on it that would take another hour to go through with the height in the near future. Thank you both. Thank you Lord by all right next to items in 15 minutes invite presenter Ford. Identify item number three councilmen 0119473 and Ordnance granting the University of Washington permission to maintain and operate a pedestrian tunnel under and across Northeast Pacific Street Weston montlake Boulevard Northeast for a 10-year term renewable 42607 10 year terms station. I mean, I figured you might win the award for the most visits to my committee since I've been here, I don't know if that's unique to me or it's just the reality of the work you do. Going on. So go ahead and Jump On In walk us through this. So the proposed ordinance in front of you is to allow the UW to continue operating and maintaining a pedestrian tunnel under Northeast Pacific Street and It was originally permitted in 1985 and included a vehicular tunnel at the time and the tub this particular tunnel was taken out as part of the construction of the Link light rail station at the u-dub and also the reconfiguration of the streets. And so this is now just for a an existing pedestrian tunnel. And it was over to the hospital. It was a bizarre intersections. So it did it didn't make a lot of sense, but I'm not stupid as the triangle parking garage to the UW Medical Center. So that's the location and you can sort of see that it access it goes from the triangle garage and here's some images as if you're walking from the garage into the tunnel and then on the other side, the other image is the escalators coming up at the Terminus. There's also elevators there for people who cannot use escalator or so, but the escalator On private property so not part of this permit. And the tunnel is approximately 800 square feet in the right-of-way and the fee for the way it was originally expired in 2015. And it wouldn't operating under the existing terms is $1,680. We don't require bonds for public agencies. So the u-dub we assume is going to be around for a long time and won't walk away from their obligations. So we don't have requirement for that and we're here today recommending approval of this term, Norman spray for structural renewals pretty straightforward and I appreciate the update on all this Johnson you okay with moving forward with 19473. I will second on favor. Next item and item number for cancel that one 19434 and ordinance relating to the Appropriations for the Delridge multimodal quarter project. Welcome everyone introductions. Capital account Central staff taking it over with us. Strength of the mobility division Capital project project manager deputy director over Capital project delivery display on time at the moment that will drive the presentation from there. So we were actually originally scheduled to come and talk to you in December of last year. And at that point we had received estimates for our stormwater portion of the project and we just felt that as an agency we needed to take a closer look at that and work for their with spu and Refinar estimates and really developed the projects that we felt good proceeding beyond the 30% design Milestones. We've spent some time at both with the community and with us to you and our Engineers to get us to where we are today, and we feel very confident now that we are in a good place to move beyond the 30% design Milestone and I will let the team talk to you about specifics. Text Lorelei and thanks for having us I'm going to go through pretty quickly. I know we're short on time, but I do want to give a little bit of background. I know most of you are familiar with the project. We are currently at the 30% Milestone is shown with the the star there a 2015 through 2018. We went through planning. We went through a very robust process of about reach developing Alternatives and coming up with are selected alternative that we that moved in to 10% design in 2018. And we came to you in July of 2018 and give you a briefing on that and then we advance that to 30% Just a reminder on the Proviso you you have at the key kind of the key points. Yeah, we want to come and give you an update on 30% design. We also want to really provide update on the The Pedestrian and bike facilities specifically and really hit on some of the feedback. But we've been getting from the community and how were Incorporated not into the design as we go since since we met last July we did we have conducted robust Outreach based on the feedback. We're getting open house late last year very well attended we had along with that open house. We had an online survey. We got I don't know a hundred hundred 50 comments on that a lot of good feedback on that. We've been meeting with the advisory boards local events Mass mailings email up dead some media work. So we've been doing a lot of Outreach based on that 10% to inform our 30% This is just an overview of the project area kind of a reminder. Again. This is you know, the overall H line project is basically replacing the 120 taking that that 120 and and branding it as rapidride King County are Partners who are here today. Thanks for coming Jerry and Laura about there anything outside of the blue and red area. So anything north of West Seattle Bridge and south of a Barton there that's that's delivered by King County Metro. And where were supporting them in the city of Seattle anything in that blue box. That's s. Transit plus multimodal were delivering that with Kane County as supporting Partners their funding Partners as well as that is a design partner on that and then we're also the Redbox were delivering a Paving as part of the project. Get into a little bit more detail there. But but there is a large AAC project at the North End of the corridor. I'm so just a reminder existing conditions. This isn't a principal arterial to about 4 miles. There are sidewalks on the corridor. There are bike facilities and it's a mix of a parking restricted unrestricted. So very busy street. We all know that and the 120 is a very busy bus line next to the 30% design and could you do that to look look at the map because this gets into a lot more detail as as we go. For Transit. Yeah, this is primarily a Transit project. You were looking to improve speed and reliability. It's not just bus stops is not just the branding at were also implementing a mile and a half of 24 7 bus lands about 1.2 Mi of Pig only bus lanes 13 station in pairs in city of Seattle and those herb station updates. It's not just the the, you know, the Furnishings were also balding in a lot of cases and adding other amenities at those locations. And then we're also doing a lot of signal upgrade. So Transit signal priority, we're implementing to queue jobs to try to get those buses moving quickly through that through the corridor and reliably Some of the bicycle facilities which is basically at a signal, you know, that the bus can can jump the rest of the advanced signal so that they can get ahead of the the group at an intersection just a way to keep them moving quickly on some of the bike infrastructure the way that we week they the alternative that we came down on is to have a southbound protected bike lane between Juneau and Cambridge that's showing there in Orange. And then utilize in the green ways that the run parallel to the corridor to get to get Riders north north of Juneau and North I had a pigeon point. We simply don't have the room to put in protected bike Lanes throughout the corridor if we're putting in the transit lanes and if we're retaining some of the parking there, I'm so long with that southbound protected bike lane, which is about 2 to Miles. We're also doing some improvements to those green ways to make sure that the Greenways are functional and also making sure that they're connected to the corridor. I'm so the folks using the Greenways can can easily access the the corridor and you see some of those connections Hudson Street a thinly do you know, which is already it which is already completed. And then connection Improvement down at Cambridge. Some of the pedestrian facilities. So we're in addition to the to the station stops were also on creating a lot of East-West connections across Delridge on especially where we're putting in stations at 3 rapid flashing beacons updating I-88 facilities at 21 intersections. We're doing signal upgrades mini the intersections as well. Paving I mentioned that that's about 10 Les Miles of Paving that were installing it's a mix of reconstruction and overlay how there's also some stormwater drainage facility infrastructure that goes along with that all talk about that in just a sec Laurel. I alluded to in the introduction on there is some parking in packs that I'll talk about as well as we go and then the utilities so we are partnering with spu in Seattle City Light. There are some locations where were installing some new water main and some new sewer main. We're also putting in some pedestrian lighting at the south end end of the corridor. I think I'm going to skip the cross-sections for an interest of time. Let me know if you have specific questions on those. I wanted to spend a little bit of time on the comedian gagement. This is there's kind of a lot of information here, but I want to touch on some of the some of the big picture things that we heard from the community and how we're addressing then we heard as I mentioned we've heard a lot more than this. We've we've kind of compiled some of the main things that we've heard but one of the top ones, you know, we've heard that this Discord or needs Paving loud and clear. So we added that we reallocated ac funds to add Paving to the project which is really important for folks along with that. We're also adding a planted median at the North End of the project. Get that fit get that Boulevard feel at the corridors. It's beautification effort, but it's also a safety effort as well to keep drivers from you using that Center. Turn lane is a passing Lane work sending the the bike lane to Juneau. We already Incorporated that are 30% design that was very important to the bike community and we were able to do that application to the 17th Avenue Southwest. Greenway. We've heard a lot of of input on that and we've been working with with Don and and some of the greenway groups to to make sure that were Incorporated in that the appropriate level of of facility there to the people feel comfortable using that as a northbound route. One of the big ones was that staircase. It's it's it's it's showing here between Webster and Myrtle on 17th Avenue. We're creating an alternative routes of the books don't have to use that stairway on 18th clearing out some sight lines putting in some speed humps and signage and then the other piece was I looking at 16th looking at improving that street. It's an arterial but making sure the folks that are confident Riders can use that and get through a lot quicker. So they don't have to take this sort of meander between Webster and Kenyon hard on 15th. We are a lot of feedback on that. We're still keeping that 15th Avenue Greenway Jennifer for all ages all abilities, but we can add some bike Lanes on 16th to get people through. We added some Crossings. I think I mentioned some of the greenway connections. I won one of which is that Juno. We've already completed that Hudson Fenley Graham or even put that in design. One of the a lot of feedback that we get from folks is around where the stations are located. Generally that that alignment is set. We done a lot of Outreach in a lot of discussions about where those need to go what the stop spacing needs to be and we've been working really closely with our partners King County Metro on that to make sure that those the spacing is around a third of a mile or less. There was one specific request that I wanted to highlight and that was moving the station from Findlay to Brandon, which is a kind of towards the North End. I know Brandon is is Hey II neighborhood destination. It's a real Central Point. A lot of people wanted to see a station stop there. We're going to be evaluating that going into 60% but there are concerns about extending the length between between stops to Beyond a third of a mile. So that's something that we're still evaluating but generally are our approaches to keep that those station stops where they are speaking engagements. However, I know you're in good hands with the author of The Proviso sitting directly to my ride. I apologize for going with lover. I want to just say I really appreciate that you have identified items that are going to be received further evaluation between now and the 60% design. I think that's really important on my understand you're juggling a lot of different priorities for different members of the community and appreciate your putting up in on this Station Move recognizing that a lot of the concerns that we heard early on in the project were related to the the distance between between stations in and frankly just concerned that this was going to the focus on the speed of the corridor was going to be more focused on serving people trying to get off the peninsula than the way the work horses. That is the 120 the 10th most use used route for Metro is currently functioning, which is also a lot of Intra Peninsula transportation to appreciate that. This is going to look at it future analysis. Also just want to call out, Thanks for putting randomly received a constituent request is not plugged was plugged in as a stakeholder is advocating really strongly for a crosswalk on Hudson and we were able to tell him that there was one plan. So that's that's always nice when those through those little bits of serendipity happen. Thank you for the work that you've done this far. Should I keep going? Okay, so One one other request that we're getting from folks and we're we're taking a very close look at is extending the bus only Lanes to the the northbound bus only Lane in south of Alaska. There are backups there today that go well well south of Alaska we've observed them. We've been taking some date on that. The trade-off of courses is Blossom parking. So as he see a lot of these comments that are remaining a lot of those around parking. I'm so excited. It's a balance between, you know, getting that that additional bus only laying in versus keeping parking and what that would bring in terms of savings on the bus on the bus service. Maybe night and weekend parking at Youngstown if if you decided that you needed to make that trade-off sure that would be an option as well. Maybe not go 24-7. Maybe it speak only as I will be evaluating those options and looking at some of the data Lubbock closer going in to 60% Louisa. Boren asked us to evaluate design in the location of the school cuz there's a lot of parent drop-off and pick-up we were able to modify the the alignment to accommodate some additional park in that area. So that was we see that is a win didn't didn't sacrifice anything in terms of the d'Alene channel is Asian. We just had to kind of change some things around in some cases. We are able to accommodate folks on specific requests like that on some cases a week. We aren't so one example, you know what the south end there is there are some parking in packs that we're putting that. Only bustle and I'm it's simply too narrow to accommodate additional parking. We are keeping the parking on the on the east side of the street, but that on the west side of the street where we're putting in that southbound protected bike lane how we have the people on the bus lanes. They're simply not room. We will be doing a parking evaluation looking at some of the off off Delridge parking on side streets. I'm in really getting a handle on what the parking situation is at the south end. We know that's very important. There's a lot of multi-family housing in that location as will be continuing to look at that as we can and then and then there was a request to look at that kind of the south of of Henderson between Roxbury and Henderson look innocent traffic-calming elements to get those bikers just a little bit further south into the White Center neighborhood and we'll be looking at that as well going in to 60% I appreciate the fact you can read the the pressures around parking which we hear a lot and I just want to emphasize it for me when we have a bus route that you know where the most utilized in the system that we have when we look at trade-offs, you know, a balance is important, but I've certainly skew in favor of let's not let's not have the people that are taking the bus be held up if we don't have to Okay, I do want to say a word about the stormwater Code Compliance cuz is Lorelei mentioned that that was a large challenge I going in to 30% So when we came to a 10% that Paving design hadn't been developed very far. So we took it to a bit up to 30% design level and we quickly found the stormwater on Delridge way was extremely expensive and put his way over budget and it also impacted our schedule how we want to have this wrapped up by the end of 2021 to overlap with with King County Metro is H line service opening date. So we we took a step back and we kind of looked at are different Alternatives. We did a kind of mini Vee study to try to look at alternatives to get that stormwater system where it needed to be in terms of budget and schedule we think we found a solution to get that storm water on side streets and additionally work with SP you to try to get a alternative compliance agreement in place that we're paying them kind of a fee and Lou based on the based on the design. They take that money and invested in a in a project on Longfellow Creek that might make more sense for the for the overall Basin. So we're working very closely with us for you to try to work towards that we saw a lot of work to do on the design of the side street option, but we think it's very promising spu is is working very closely with us and they think it is as well. But we do have some work between 30 and 60 to get there and get that an agreement ironed out. And is spu in the decision-making roll about this alternative employment agreement. Assuming that you continue working towards that all that that design for that other projects are they are they the deciders essentially it's a it's a negotiation but I would like to ask you who holds the the keys to allowing a feeling there to take place meaning they have a project in a plan to be able to use it. So what what a start is committed to do is fill the actual Code Compliance, which we can do on the side streets. But if there's a better investment for the city as a whole than SP would say, yes, we can do a few in the Salvation Song the compliance that you're referring to his The Code Compliance not spu's consent decree a compliance. Exactly. Yes City stormwater Code Compliance And weird weird design in such a way that we could we can build it keep on budget keep on schedule. If we don't move forward with SVU on alternative code compliance agreement, but that that would be a preference. I also do want to mention that we are were working with Sound Transit at the North End. We know that there's a Link light rail station coming apart a Ste 3 between Genesee and West Seattle Bridge, you know, there's alternatives are fairly early in the process, but we know that they're there could potentially be impacts to that area and we want to make sure that we're not going too far down the road with the with the infrastructure work knowing that when Sound Transit comes through they're going to tear it out. So we're we're coordinating with us with Sound Transit making sure that were Intelligent about the design there make sure that were you don't coordinated with them and not going too far with that design for the 60% design. Yes, I do. And we've already CJ made the decision to limit the payments go up because we're certain that if they move forward that approach it would have packed the paving. So we automatically already know that that's a piece that we've limited because yes for that oblock piece. And when you say limit the paving scoby just mean the number of Paving miles that you're doing in that area or what what do you mean by it's instead of full reconstruction where to be doing Mill and overlay with spot panel replacement. So it's at it's more of a 10 year fixed instead of a 40-year fix knowing that there's a possibility that we need to come back when Sound Transit comes in and do a little additional work there and West Seattle Bridge is probably half a mile we've been working very closely with Metro to develop a Project's Pacific partnership. It's really Critical with both H line Capital elements in the greater than to this Delridge Capital project as well as to the overall success of the H line project which benefits are parts of Seattle even be on Delridge itself or currently negotiating an agreement that we expect to have finalized. To 60% milestone for their funding contribution. I can County's budget includes funding for the HOA until we feel very confident about having a contribution. It won't be exactly 15 million that might actually be less it'll be based on actual and cost-sharing off for the project. We are working moving forward to having an integrated Outreach plan this spring for our next round of design speaks of trying to talk about the both our thoughts and King County's investments in this Corridor man in the interest of time King County has offered to send out Summers an email with a more detailed update on Age line itself. I'll try the corridor if that's of Interest opening date specifically or the opening day of fall 2021. And as CJ the side we're working very hard to make sure our construction timeline help support that opening dates are more Windows updates about their process for moving forward specially with a scope updates in the Westwood Village that we're not covering is Yokai. How does the stormwater upgrades taking until 2022 impact that that 20 21 opening? So what are what are the main reasons of pulling that stormwater work off of Delridge is that that that saves our schedule essentially? It brings us back to the 2021 date. So with with with stormwater on Delridge, we would be we would be in 2022. The slides that we have previously on my phone, they are slightly different. So there's a bullet point on this light in front of me that just says construction delays interesting since 2022, but what you're showing their doesn't say that I'm not sure what you're So overall a cost estimate were at about just a little over 30 million for the transit multi-modal improvements Paving is a little under Thirty million stormwater. We have arranged there because we're still whilst we're still working on that number, but we put in the 10 to 12 million range, which puts us right around 70 million for the overall project our funding 72.3 million and big caveat on King County Metro has Marie alluded to we're still working on the agreement on the funding agreement for that so subject to change. So next steps were working on 6% design development June of 2019 were also doing his part of that. We're doing a very large ridge push to get back out and really I get some additional feedback and then provide an update on where we're at. We are working with SVU on the alternative compliance agreement that I mentioned. We're working with King County Metro on trying to finalize our agreement by that 60% deliverable as well. So busy spring for us looking to finalize design by the end of 2019 and then begin Construction in 2020 hot spring early summer of 2020 rap up construction by the end of 2021 get the service running that your July 2018 presentation noted a grant requirement to get to 90% to 90% design by June 2019. Is that still a requirement? Was that women were still pursuing small start? We need to look at that. I need to work with the state on updating some of the commitments and part of that grand but we at this point continue to utilize diagram for design work. That's all we had any other questions. I don't have enough project is going to return to you Calvin and see if you want to just give me the the Proviso legislation. What's the Proviso that restricted 2018 spending until this presentation Dental Council receive this information and have had to pass this legislation. So pretty today and it's so it's so pretty straightforward but clicks to you if you want to speak to an I see you're handing out looks like maybe an amendment to this meant basically states that before appropriating funds for construction the 2020 budget the council's intent to review the project to ensure the final scope and design reflect continue to communicate and input in the project development rather than aligning this Proviso with a percent design stage. We've lined it with the The process so that there will be no inadvertent delays related to busy committee agendas. So hopefully that works well with your schedule it's consistent with I think our ongoing interest in oversight. This is a watchlist project. I'm on Council watchlist that was adopted on Monday and further. I think the the background on this is just recognizing that a stage base appropriation. We want we want to make sure that we recognize that Reliance of it on those without understanding your schedule and your pressure is in and the impact that delays have on both of those things in and funding that they can carry the Ask of delaying a project. So trying to again find that that middle ground council member herbold. I want to thank you for this approach because I think for us it lines up with a natural, you know the budget process as well as a natural whole point for us to make sure we're ready to go to Construction. I will share my appreciation of that one. Shall we go ahead and one of them go ahead and move the bill and then we'll consider the amendment. So I'll go ahead and move cancelled 011-9434. And now when we consider is your Amendment. May I move the new section to as follows section 2 before appropriating funds for construction of the Delridge multi-modal Corridor project in the 2020 budget. It's the council's intent to redo the project to ensure that the final scope and design reflect continued Community engagement and input in the project development. And then we have ended cancel bill in front of us telling anything else we need to do on that before favor of a passing Council bill 11943 for is amended to thank you all for your work on this from the public today in your Outreach and it's great to hear we when things go wrong we tend to focus on that and it seems like there's been a lot of the great work done in this community and I know Then there's a lot of desire to get this right for a whole host of reasons, and so am I just applied you for a good average working will be checking in again as we move for really appreciate that on behalf of my constituents. I do want to fly before we close this. I think there was a slight that we didn't get to design details and I had on his on his left, but I just want to make a plug for their on their additional recommendations around the 26th Avenue Greenway and request that you consider those seriously. I said sign work continues cuz nothing else. Thank you very much.", "end_time": 8214.3}]}