{"format": "raw", "annotations": [], "confidence": 0.9375995836759868, "data": [{"start_time": 0, "text": "Good afternoon, everybody Welcome to the sustainability of Transportation committee. And it's Wednesday May 29th 2019. It's 2:03 p.m. My name is Michael Brian. I am chair the committee on my colleague council members want thank you for being here and started a bike calorie for thank you Kelly for Staffing me today's agenda is one item. It's a briefing on Accessory dwelling units legislation and we will get to that after do public comment. And so we will go in a public comment. It looks like they're probably about a dozen folks signed up. So we'll do two minutes each. If you don't mind bringing me over the list will set the timer. I think most you know, how that works. But you can watch the timer you can sneak out to two minutes and then when you're done with that, we will be talking about the draft legislation. I have a C12 signed up Rudy Chrysler's going to be first followed by Emily Johnson and then Alice Lockhart. Rudy taken away I'm leaving the University Park neighborhood just know herself out University of Washington have a problem. That's the only owner occupancy rule is concerned in our neighborhood destroyed and replaced by mcmansions. However, we do have the problem doctor investors by our property. Sometimes pushing out families that might want to leave it leaving our neighborhood. And then what they do they drop the house apart to turn it into rooming house rooming house, of course not regulated in the city of Seattle and maximize their profit by putting as many students as they can into this house is not happening. If you do this, if it's just this home is owner-occupied. Am I still the rent but they don't chop it up into room in the house. Social media site that frequently these conversions are happening without the permit and thank the neighbors have to complain and I get to stop work order and the whole exercise be multiple examples like this is not a scenario that's considered in the in the EAS holders many signs that you have in your model. What is clearly something that the investor like to see and so that's what's happening in our neighborhood me fail to see how turning our city over to investors is going to help us with these men real social problems that we have. And so people chili urge you not to drop the owner occupancy room. Animation joined by Council and potato. Thank you for being there. Hi, thanks very much for doing this. So as you know, I'm with Route 50 Seattle and we approach the housing crisis not just as a moral crisis, which it is but also as part of the climate crisis because we know that every time we put folks out of the city that their carbon footprint somewhere between double and quadruple and we just can't keep doing that and meet are any of our climate goals for 13 years now since I've owned my house, I have wanted to build an accessory dwelling unit or over a larger house that I can have in multiple units or something at my house is 790 square feet and I work at home. So I can't really have a roommate without space. It is absolutely ridiculous that like a mile from downtown a single person is living on a 4500 square foot lot and you know, I had family who were willing to loan me the money. But I couldn't do it because of the parking restrictions and it's just crazy that we are facing the kind of housing crisis that were facing and we are putting increasing numbers of not increasing anymore. Thank God but I did these all these restrictions on something is a simple solution like accessory dwelling units as long as we should be encouraging people to build as much as I can on the space where they've torn something down as it is now we know that a lot of modest price rentals are being torn down for mcmansions and that's absolutely crazy and it is by definition when we have more housing it is going to release more of the pressure even if you know, if a if a developer came and tore down a house and instead of building a mcmansion, they built a new single-family home with two accessory dwelling units inside that's still two extra families or in the Jules will not be competing for other closing and so should not be in the business of restricting housing builders be able to build them all at once because we know that if you somebody has to wait a year in order to do it. It's not going to be as rational. It's going to be more expensive and they're much less likely to do it. So again, as long as we're allowing anybody to tear down and housing we should be encouraging them to replace that housing with this much housing as they possibly can. Thank you. Alice's next analysis to be followed by Doug bambrick and then Margaery Richard Good afternoon Council or at least the three of you? I'm Emily said it always respected climate climate. So this time I'm just going to tell my personal adus story like so many others. I've also been waiting for this legislation to be able to upgrade my property and be able to provide a bit of affordable housing relatively my partner and I we moved to North Seattle in 1994 moved into a wonderful house with a wonderful yard with two big pine trees in a few little trees. We raised two great kids and because we never cut down a tree that came up on a property. We now have, you know, maybe 30 plus trees and we've also in addition raise countless Broods of chickadees and Jays and crows and robins and other birds with whom we love our Nest. It's now empty and we're ready to make a change this legislation has three things for us that we really appreciate the small increasing height limit will enable Are attic to become an actual leaving space for another homeowner and the I'm sorry the possibility of building 280 years makes the math work for our family that we can do this and the parking restriction again, the birds the trees. No more parking. We can put two two cars in the driveway as it is and that this is going to enable us to preserve this lovely old house on the existing footprint preserve the neighborhood looking field at so many are fond of in this city and do the right thing for fordable housing and as you know, I'm always talking about for the climate to thank you so much for the care. You put into the details of this legislation that matter so much and for this opportunity. Is this the right one? Hi, I'm Doug bambrick. And I'm just speaking on my behalf. Very briefly. I came here mostly to learn to I just heard about this in the Seattle Times this morning and my first concern diakko some of the comments just before me I would not want to see a nut reduction in new construction concern I have is it there currently a lack of Supply in 4 bedroom 2 bathroom 4-bedroom 2-bathroom housing in the city for families extended families. Maybe the kids want to stay at home. The term mcmansion is I buy believe is For a large house with a small yard not necessarily a bad thing considering that it's multi-millions to buy a house with a big yard and a big house. So the larger house with a small yard just it just is what it is. It's a result of our current zoning. If you limit that the 2500 square feet, I'm just thinking we're going to limit the amount of new construction 4-bedroom 2-bathroom new construction. If you take away that Supply the result will be in artificial inflation of existing so I don't like that. I think that might be a problem if it's in that that that's kind of tough on Family Center trying to find housing in the city and they're happy with the mcmansions or whatever big houses townhouses on with no yards if you take that away, it should be for a real real public good if we need more smaller units, I would make the argument with the hall UPS on we've done that. We've increased a lot of Supply do we need to really impact families to increase that Supply more? So if we do that, I'd sure hope there's not a reduction and see if you have a 4500 square foot lot. What can you bill today? Once the zoning is done if it gets done. Will there be a reduction in buildable square footage if there is that violates the basic supply-demand of of economics and that would be obvious foreseeable consequence hate to do that time is up. So you just wrap up. Richard is going to be followed by Eric aderhold and then show a new bowl. He has Miss Richard hear you're talking about dwelling units and I was wondering are those supposed to be like slave Porter's because I've heard from people that get in contact with slumlords and they're not happy with the dwelling unit that they're in and I don't see any provisions. I think I wrote the one about some woman. maybe it her 90 said that she didn't even have a manager there at the time when the elevator went out and she had to call the fire department and fire department at the If quarter up the stairs carrying her so I'm very much concerned when you use the word dwelling units and people using discriminatory practices. And then you say you have a race and social justice to a kid. So I don't know what these Provisions are all about, especially when people are getting thrown out at the chamber's for just having free speech and we have someone that is in violation of their oath Gonzalez five times and everybody is closed closed mouth about that, but other people could have their lives thrown amok by just coming up in here just having a personal conversation with the council and I still haven't gotten anything in writing to tell me how anybody can travel this country and use Free Speech, but it can't be used in this domain it. It just is beyond my mental. Comprehension and it should be Beyond anybody else's that agrees with free speech. It's just deplorable despicable and it must come to an end. Just like tyranny. It must come come to an end to a stop in to a halt and if you don't see it through me. Oh God forbid. If you anybody else come up in here challenging you in terms of what the law says vs. What you're involved in. Good afternoon. Thanks for being here. Thanks for listening. My name is Eric aderhold home owner near Greenway little bit but my house two years ago, and I've been looking forward to this legislation ever since I love the idea of building a backyard cottage for my wife and I to retire into after our kids move out of town and we don't need so many bedrooms anymore. I just have something nice and simple and efficient for us at that point. And so, you know, there's a lot of things in this legislation that that make it more appealing as an option for us, but one that I specifically want to talk to you about today is the owner occupancy thing. I know there's a lot of opponent stay in this is all about enabling investors to come tear down our whole neighborhoods and put up rental triplexes and all the stuff and even if you think a rental triplexes bad, which I don't I live next to rental properties and they're great neighbors, but It's it's about flexibility for homeowners like me as well because I have every intention of living on my property indefinitely. If all goes well, I'll be there in 50 years, but maybe I get a job opportunity that takes me out of town for a couple years right now with no edu. I can go do that and I can rent out my house and it'll still be there for me when I move back and I want to move back, but right now with owner occupancy, I can't do that. I have to like tear down a to you or something. I don't even or sell my house. I don't know, but I don't like the idea of having to give up that amount of flexibility just to another house on my property. So, please consider passing this whole legislation owner-occupancy and all. Thank you. Shari's next show you can be followed by Meghan Murphy and then Martin Kaplan. Thanks for letting me speak today and I'm wearing my AIA Seattle right now. I'm on the housing task force for AIA Seattle and just wanted to let the committee know the AIA Seattle sports all of the changes that are in the draft legislation and we're excited about how much more flexibility it will give to homeowners and others who would like to create a d using dadu's and also how it will give more opportunity for multi-generational housing additionally just wearing my own personal hat as a residential architect. I've had a lot of people asking me when these changes would come into effect and they're looking forward to them and it will make it more possible. For more people to build a d using dadu's at at my own home where we have a da do you and love having it? We'd like to build an Adu in our basement and under the current rules. We can't right now. And we love to do that in the future. Thanks. I've been attending on bread met in Seattle. We were talking about policies of the state and private property. And so I think adus address that the state on private property owners that own Capital are consuming like large amounts of rental property and then they make a large amount of profit at the top and then the people on the bottom of the pyramid are being drained of affordable housing. So I think adus are a good way to offset Amor condensed Seattle because where I'm from I always compare and contrast Iowa and Washington State and we have a representative Stephen King who I told the city council last week that they should urge him to resign and he says that We in America are on the Forefront of Western Civic civilization and we're preserving it and people from Mexico where immigrants are in the shadows and they need to stay in the shadows. And he was asked to resign from all those Committees of the Senate and so I agree that he should definitely resign and the thing I like about Washington State policy is that we we are in a different way to Western and Eastern civilization were cross-pollinating were using technology to create like Tamika last week at the lunch and learn were infiltrating new wet. We're going to the community stakeholders and asking them how they Envision their community and its I have a place to live permanent place to live in a place when it gets hot out to play in water and I can afford food and I have a job that is actually, you know, it's on a McJob or and I don't have to worry about mcmansions. I'm forces. I need to work at McDonald's, you know, it's they have working conditions that are on sustainable. And so that's why I like adus because we are like envisioning a new way to organize a city. Thank you, and then Don miles Hi, good afternoon. Council members. My name is Martin Kaplan. I'm here representing the Queen Anne Community Council land use Review Committee and just want to speak for a second on the legislation. As you know, we appealed the 80s and try and encourage you to think outside the box when it comes to forwarding this legislation in 2006. I was on the Seattle Planning Commission and worked hard with my colleagues to advance this the original any existing Adu regulations as they exist right now did a lot of studying in 2010 as you know, when city wide and I've been working on that kind of ever since I was a big advocate of that Queen. Anne has always supported increasing density as you've also always increased our densities well in a above the psrc. Commendations. So why did we appeal this he is when we actually agree that density is is good and in when done right it can make room for others and we have no problem with that. I want to remind you and I want to ask you to re-read the hearing examiner is decision the very first pair of the very first sentence in her conclusion and her decision reads like this given the groundbreaking nature of some of the features of the proposed legislation. It is impossible to know whether none some or all of the effects of the appellant claimed by the appellant will come to pass and that's why we appealed this is because Annie is should be able to inform you the decision-makers and inform the public of potential impacts and relative mitigation. So I would ask you to consider that there are many amendments that can be advanced. Pursuant to this legislation, they could really benefit the entire city and respect the extensions a lot more than it has. Thank you. My name is David souter and very much in favor of this legislation. It's great of the thing I have concerned about it is that I would like to build a Carriage House a DUI. Did Dad do on top of my house and the rules haven't yet changed enough there still I couldn't build it under the current code and I can't build it under the proposed code. So I sent and submitted to up to very technical suggestion. I would have talked about it here, but it's hard to do without drawings and pictures and getting really into the weeds. But I do want to make another point about the owner occupancy requirement. I'm happy to see changed, but I want to put out the idea that it's not even constitutional to even require owner occupancy. I think that that's something that you might want to consider that it's it's a requirement that we've lived with, but I think it's a suspect and so just an idea to think about. Thank you David. I have stopped forget the technical aspects of your email and we can have some back and forth on that too. Thanks done done. You're going to be followed by David Haynes and then I know some folks to sign up an additional lest. I'm done miles. I'm a queen anne homeowner. We purchased our home in 1976 and we purchased a rental house in West Seattle in 85 are go with the rental house was to keep it affordable. We've had our rent so is below market value. We have to Metro bus drivers there that have been there for ten years. Our own home was built in the backyard of the mother of the woman who built the home on Queen and we have no space. for a detached dwelling unit at anytime I and very little space on the street for parking off-site. I think it's essential that we think of affordable. housing in terms of our own community members and there are no incentives to provide affordable housing in our rental property or no benefits, you know where certified I'm through all the all the processes but there are no incentives. I would think in terms that a to use in and detached dwelling units that it should be about the owners accommodating housing within their property every other week. We get a letter and in some cases completed real estate agreement from corporations to buy a rental house in West Seattle. That's the kind of pressure. The city is experiencing. Every major should be taken to avoid in any of these land use changes something that would encourage speculation and turning orange. Warheads / 2 the corporations that are seeking is seeking to have them. David Europe city council celis out the city council sabotage the Great American housing build out to appease longtime residents who traded on and sold out the younger generation and the native locals. If the front page of the Seattle Times is correct the council needs an amendment to ensure a more robust use of residential property for living space. If progressives want credit for increasing Green Space by denying the still needed land to build housing. This will prove that socialism that seems to make it fair. Everyone has a small crappie living space still on the side of the road doesn't work to solve the problems. Stop catering to double triple mortgage speculators worried. The younger generation will have a new affordable better option of a new home to own not rent ever seen the brand new so-called quadplex off Leary Avenue on the right corner of 6th Ave. I think right before the bus stop in the light. It hails ale the entire ground floor is specifically used only by Auto traffic from the neighbors driving by the bedroom bothering everybody with the headlights and the noise from the car. Give me a rundown housing a small guest house is a big mansion wannabe. There are many people who aren't lazy who don't have cars and want to live a hike in a bike away from everywhere. Please don't got the core value of robust square footage accommodation the cell its speculators already tipped the scale of humanity remortgaging other people's futures. Give us the real quadplex with more living space more square footage higher up away from the street Ambiance with a potential few and tear down all these run-down homes. I keep holding up progress and claiming they're still in title. Thank you David. I think I saw some folks who signed up. Come on forward. Hello, my name is Richard Allison, and I'm representing myself and tree pack. The proposed lights Atul legislation will not protect exceptional trees. Green infrastructure, that is so critical to us right now with climate change. We're having record heat. We're having record routes. We have a continued winter rains. Where are the kids going to play where the backyards going to be if your building? Lots of a to use in the backyards is going to be no place for big trees and must be some means of allowing both big trees and also more a do units which means very selectively building these structures. If we just go ahead and say build wherever you want. We're going to lose the green infrastructure of this city. You are a leader in climate rain change legislation for the city of Seattle. How can you propose this bill without doing something to protect the big exceptional trees? The Heritage trees the existing code is not working. It's not being enforced and it's not working. If you really cared about building more homes and also saving the trees you would put it in the legislation. You would not take the can down the road. This is an interview exceptional tree sacrifice ordinance. Do the right thing and put some Clauses in there to not allow the removal of Heritage trees. There are less than 200 Heritage trees in the city of Seattle, but you won't pass legislation to protect them. There are exceptional trees that are 36 inches in diameter, which provide tremendous shade stormwater runoff provide tremendous habitats. You need to stand up to developing to say you can build all your adus, but not in certain places. Please help protect Seattle's infrastructure. It's green infrastructure. Thank you. Someone else would like to buy Bubba come in today. Right seeing none will go ahead and close public comments and all invite presenter forward. Once you're settled if you would introduce yourself. Alex Mucci Council Central staff Thank you Ali and then Missy I will read the agenda item number one briefing and accept on Accessory dwelling units legislation. I'm just a really quick history here is mr. Kaplan noted. This is work around back to the cottage. Has it been going on for a couple decades? And I think when we go to NY units some even longer than that my involvement in this started a little over three and a half years ago. When we asked for and received a report back from the time the department of Planning and Development about how many folks are building these units. Are we seeing into the housing option and start a process by which we heard from Community meetings Daughters of people with hand and heard a lot of what we heard today. The intention of my intention of the time was to pass legislation that summer that would have been summer of 2016 because of some of the legal challenges we've been forced to do environmental impact statement, which we did we learn some more of that process that that was also challenged. Recently, we got the word from Harry examiner that work clear to proceed on that and so we're back to where we were but with new information and a new piece of legislation from 2016. My goal today is to have Ali walk through the draft legislation to for us give us a little bit of background on some of the conditions were seeing out there on the ground really highlight some of the changes that when proposing to make between current regulation and the proposals and also where there's an opportunity to talk about if there are different options, we could be considering than colleagues looking for thoughts are feedback on these for the timeline really quick will be have a public hearing on the evening of Tuesday, June 11th at 5:30 here in Council and then we'll be back in committee on Tuesday June 18th at 2 p.m. And I hope would be the movie ready to consider it. Mince and voting out final legislation on June 18th that I was going to need to hear. It hurt a lot for me, but hear from others on if they're different directions. We want to consider and have that discussion. So start today with Bill Maher from the public. Can we have more that discussion on June 18th, so we able to build accessory dwelling units. I'll spend a few minutes going over some background and then I'll walk through the draft proposal first. You've seen us fight before we have to start with it. I just want to confirm terminology when were talking about accessory dwelling units and there are several terms I get thrown around and I will sometimes I'm flip between them but when we use detached 80 years or dad to his were talking about a detached accessory structure backyard Cottage are often referred to the carriage house and attached Adu Garden Apartment basement Suites that that sort of thing. So why encourage accessory dwelling units this has been going on as one of the strategies to think about how to increase housing options in the city and primarily in this case is really looking at increasing the number and variety of housing choices in single-family zones looking at ways to have more affordable options than typical single-family home, which many people can afford afford and provide opportunities for homeowners to generate some income or adapt to their changing household needs. So I'm looking at some of the barriers to Adu production. There are several things that may be holding people back one or regulations, which is primarily the focus of the ledges go changes that will be walking through today better cost and financing challenges and the complex process that homeowners have to go to so when we overlay all of these barriers it sort of a small number of people that sort of where all of those things line-out for their lot meets their all the requirements. They have access to the capital needed to develop in their interests and the ability to go through the process of building building an Adu So looking at the production of 80 use in Seattle over time, you can see that in recent years. We have semen testing and increases the market has picked up an increase in the number of adu's Bill but it's still relatively low and if you look at some of the surrounding cities that have regulations that are more similar to what we're looking at in the proposed changes and you look at the average number Produce Portland is on average about 270 per year. And what I heard today, is there on track to look at about one per day on average that's increasing in Vancouver, British Columbia. 732 in Vancouver allows 280 use of what they call a lane with house as well as a attached. laneway houses So in terms of who is eligible to be to build an accessory dwelling unit and who benefits right now, it tends to be people who own homes and in our current market fewer and fewer households can afford to buy homes. This slide is looking at sort of overtime who can afford to buy a single-family home in Seattle. So there's a declining Sheriff single family home sales at a four-person household can afford based on their income in the last column for 2018 less than a quarter of home sold have been affordable to a 4-person household earning the medium medium income so, you know, which is around somewhere between 100 and $120,000 per year. And if you're looking at who owns home at in the information, we have available illustrates that homeownership berries by race and knowing that 80% of homes in single-family Zone there owner-occupied access to renting in single-family zones under existing conditions as well as having access to the wealth building opportunity that adus and homeownership can offer isn't likely to benefit everyone equal equally absent additional intervention. So in addition to the land use code changes their number was strategies looking at trying to find ways to help low-income homeowners access financing to build these homes as well as looking at opportunities to build rent in income restricted units. This this is from the age of six 2016 ATS. Customer Herbalife questions to ask a question of homeowners under 100% Am I what roughly what number of homes is that? How many home sales does that represent? Yeah, I'm sorry. That's and it's not that I don't have that number. I appreciate it. I was trying to guess which questions we would ask and where she would have to say. I don't have it in about stop a head of the council member who came up with one. You always surprise me. I just I just wanted to just a remark upon the dramatic shift that's happened in homeownership access to home ownership by income in this is one of them know that we're looking at a graph just over 10 years. And this is a dramatic shift in a few look at livability expressed in terms of housing cost analysis. Of course. Mainly about rent because you're next graph indicates its majority renter City and that kind of stuff is happening in most metropolitan areas, but this is also a very strong indicator of housing cost as well. It's 40 nearly half in 2008. what accessible to what unread 80% of Ami and look at 2018 just 11% of home sales. Yeah, I think it's important question as you're looking at thinking about how these changes impact sort of the cost of accessing housing in in these areas and it offers a different housing type. And so it's a sort of a complicated question in a little bit different areas where we have consistently been adding just density vs many areas that are currently zoned single-family. We've actually seen a decrease in population despite overall significant growth growth in the city the chapter 3 and chapter four point one in the ass provides a lot more detailed discussion of serve his historic zoning pattern some of these Trends as well as we expect to see in the future. Thank you for being here at so this slide is information from a survey that was conducted in radio owners and occupants in the Portland area and it is just demonstrating how most people are able to construct and finance an Adu it does require that you not only own your home but that you have equity in it. So it's just another way of sort of looking at who is who is benefiting in the egg and tends to be wealthier white homeowners who have access are there cash on hand or enough equity in their home. I'm cuz it's getting it accessing a traditional loan is difficult. And this is just to be. This is about how homeowners Finance the construction of an accessory unit on their lot actually going to ask a question about it at some point because a lot of a lot of homeowners of color, especially from the black community in the Central District who you know who are some of the most fortunate ones who haven't been completely pushed out and I've lived an intergenerational and now themselves are retirees and 1/2 have want to build an accessory dwelling unit on their lot because it also represents some sort of stable income. It would represent some stable income for them if they rented it out, but the obviously the first barrier are they going to run into is financing are there examples from other cities in terms of the municipal government providing public financing for homeowners, especially homeowners? Of lower incomes and so on and there are some examples of programs be in the start of a very early stages and have primarily been driven by sort of a community organization that's partnering with the city or other nonprofits to try to figure out a financing plan. And so it's not there are some examples and we went through some of them through when we presented on the racial Equity toolkit that was connected on this part of the ear is work and I can send you those examples, but we don't have a lot of good examples of sort of on the ground. What is working. I'm one of the things that we are trying here is something that comes to my bro Brian sponsored last during during budget is expanding the cities home repair Loan program to allow people to use to access low interest or no, no interest loans to create more space those loans amounts probably are not going to be enough to build a detached accessory dwelling units or thing, but it's an initial step and then there's also other work that I'm involved in a Interdepartmental team looking at other strategies partnering with sore nonprofit lenders are there other ways that we could help support the financing options and not put people who may already be sort of, you know able to afford their home, but don't want to take on a significant more debt that might put them at risk of foreclosure in the future. So I'm exploring strategies as well as trying to reduce the cost of constructing a to use that would help sort of bring the how much potentially the city could loan in line with what it actually cost to construct. Another another thing another is a startup in Portland that is as a different model where they actually build a modular home and delivered to the site. They work with homeowners is a couple ways they can do it. But one is that the the company would would own the home and and essentially lease the land from the homeowner and that lease payment would be a percentage of the rent and they sign up here to 20 year. And then defeated 20 years the homeowner gets to own the the backyard Cottage and so they do all the work and put it in another is no financing or do they handle the financing? And so, you know, if there's there's tools out there that are developing with how they pan out and how they make sense the intriguing. But I would have coarseness her pregnant with everything that the best way to do is to fight figure out some sort of public financing option that is funded through Progressive revenues because even though I've got you down to a corset that's that makes it immediately viable. There's no question about that. Some corporations making a profit off the interstate. Okay. So now I'm going to walk through the main components of the proposed legislation. And what is going to be described today is what is in the draft legislation that was posted with the agenda today. I will also highlight some policy options are choices council members could consider this is in no way meant to be an exhaustive list of every policy option you could consider but if there's a particular area or interested in exploring let me know when we will work on what those options could please feel free to ask questions about this is the intent of today's here where there's interest worth pursuing and where there's not interest will focus elsewhere. Question, I don't know if this is an interruption in your flow and ask what date are we seeing from other cities or even he even with the restrictions that we have in place in terms of the rent at which the accessory units are being rented out because obviously one thing that we've been talking about that is off interest to us as making it affordable for homeowners to building units in the first place. And then the other side of it of course is the renters and nrr primary interest in all of this is I mean, there are two primary interest in this one is to reduce the carbon footprint as a million others were saying in public comment, but then the other is a very important thing is affordability, which is very much related to the carbon footprint. So are the rents generally affordable. I mean what what is it following in terms of the market itself having very high rents? So in general what we've looked at in Seattle, it's a little bit hard to parse out exactly. What is a rent for an Adu versus other types of types of units, but we did look at Citi Trends in single-family Zoning for versus other markets and tried to look at it get some information about what ATMs are renting for in in general compared to average rent in single-family zones are generally cuz they're kind of like a single-family home tend to be larger at a lower a lower-cost. But that is someone a result of just the per square footage cost and then we have not drilled down to sort of getting more detailed information yet. There's some something in the draft legislation that would ask try to do a survey to get more details on exactly what these types of units are rented for hear. What we've seen in other cities is that anywhere from you know, 15 to 45% of 80 user being rented at or below Market rates. And so one of the key things that we learned from the Portland survey. Is that homeowners really are looking for flexibility often times? They are building them initially to help pay their mortgage, but they end up housing a friend or family member and typically are renting at rates that are lower than lower than market. So there is a three studies and cities in Edmonton, Alberta Canada the bay that you spay and in Portland and also found that that you see a much higher number of units being rented at more affordable Brands what's not clear from that information is who they are being rented to and whether or not they are being rented at lower rents to people who have lower incomes. What percentage was at or below use a range of about 15 to 45% I think the Portland survey it's in a slide way down the way down the line, but I think it's around 44% of 80 use in Portland are being rented at or below market rate. So and then if you look at those three studies, I think it's about 18% of 80 years or at or below market rate. So if you sort of compare that to for example are mandatory housing affordability requirements that the higher rate of affordability that would be required under that mandatory program. Okay, so that's one of the first changes is to increase the number of accessory dwelling units on allowed on a lot today. You can have one accessory dwelling unit and that those Astra should read the lot must have at least four thousand square feet of lot area till our day to you. This is my week of public typographical errors. But this so undercurrent existing even have one attached or one detached and if it's a detached you have to have a minimum lot area for a thousand square feet The Proposal would be to allow 280 use on a lot that could be either too attached or one attached in one detached. The current draft would require that if the second if there was in the second 80 years in a new structure, it must meet a Green Building standard. So there are a number of options comes members could consider this includes no actions or do not increase the number of a to use allowed on a lot to adopt as proposed. You could modify sort of the mix of two only allowed to attach to only allow one attached in one detached. What was studied in the preferred alternative is requiring that the property owner at the property is owned by the same person for at least one year prying to prior to adding a second ATU that's not in the current draft in another option that has been discussed the council member O'Brien has raised is adopting an incentive zoning approach that would only allow a second Adu if one of the units on the lot is rent and income restricted, what is tricky here is because this would be a land use code incentive program in Washington state. It would require at least a 50 year term of affordability. And if you look at the current cost of constructing a to use and what the rent would be if he was rented to someone at 80% Ami which would be the highest in. Level we could have with the requirement. It just it doesn't really pencil. So it's unlikely that anyone would or very many people would take up the opportunity to add the second Adu. If if this was required the incentive zoning Provisions that are authorized under state law are really men are really meant to focus on multifamily larger development projects where there's more of a mix of unit types where the the costs are sort of calculated differently. So well, this is an option available to council members. I'll just note that it would maybe unlikely that many people would take advantage of the building II ATU I'll just comment that I remain very interested in figure out some way that we could tie affordability to this. I think is a lie mention what we do see is it in Seattle, but at least both intuitively and from the anecdotes we hear smaller units in these neighborhoods will almost certainly be more affordable than the other options are available in the neighborhoods in is a question of who are they rented two and if they're being rented to folks that have high incomes, you know, that's not a bad thing, but it's not going deep to the problem. We're trying to solve and so some way of having some of these you rent restricted. I think stay law today at least as we understand the moment. The restrictions are pretty significant. I've spoken to at least one state legislator who's been working on state-level ATU legislation and asked about the concept of giving us more flexibility about this, you know, if that's not something we're going to get today, but There's there but I heard was interested in and some flexibility going forward to allow. That's so it's something that we may want to I'm interested in maybe crafting this in a way that it if we can't get a rent and income restricted unit today that we can maybe switch to that if the state law or to give us more flexibility. It's horrible. That in other cities were saying only 40% be at or below Market. I think it's concerning cuz the market is already really pretty curly here in Seattle. So if there was a way to couple this approach with some sort of Some sort of Public Funding that might help impact that calculation. I would be interested in looking at that and I mentioned when you and I were talking my recollection and I haven't had a chance to check on it of whether or not the proposed ANF funding policies talks about a potential pilot for financing rent restricted Adu units Brian proposed during budget and is being discussed as part of the changes to the housing policies, which would be a loan program. And so there would be an income in rent restriction there. And so if there's a financing option attached then we have it sort of a different weekend. We can require the rent and income restriction and it's not quite under the same sort of restrictions as when it's a Use code incentives to any programs. I think that the city would focus on would likely and clearly hearing from this from all of you that should be focused on providing sort of serving low-income homeowners and low-income renters. But my point is that although the Loan program theoretically does not have to be tied to an incentive zoning approach could be right we could theoretically say second unit if second unit is Affordable and this is the funding under the city's policies that could be made available to make it affordable and allow the project a pencil out. Yes, you could I guess you could try the the two things together that you could I mean if the requirement in later started it would only be a second unit. If you can only get a second unit if it was affordable to something and income restriction and then the the loan Provisions would be an opportunity for people to actually maybe take advantage of it this particular pilot there too many numbers in my head and I'm off I often say that there are a lot of numbers here. I think the maximum amount is about $45,000 or so. It is in most cases probably not going to be enough for someone to build a second accessory dwelling unit is more likely to be enough for someone to finish that basement and make a legal bedroom. Perhaps create an entirely separate attached accessory dwelling unit. I'm it sort of it in that in the early testing phase. So I don't know if if those things would work, you know, I don't know if it would be enough to provide enough financing for the second unit. Yeah, and so it wouldn't need to have to pay for all of the second unit. Just be necessary to make up that Gap. I just making this pro-forma that you've you've developed not pencil out is what I was thinking in my head. And a similar approach but slightly different strategy if the city and I think there's interest to try to make this more accessible in one of the ideas is having some more lending tools and if the city wanted to, you know come up with some sort of subsidized loan program assuming we can get around and when we can around some of the other constitutional requirements, you know, we would have the flexibility to say. Hey folks want to participate in this here's a requirement the rental terms of add in so I think there's opportunities going forward to figure out you know, how to find that sweet spot where I'm going to providing some benefit the homeowner in the Navy that the homeowner was planning to rent to low-income people anyways, or this is what they want to do regardless Whether tis enough benefit that make sense. So the next change will go over is the increase in maximum household size under existing regulations. The how many people can live in a dwelling unit is regulated in all dwelling units within the city of Seattle. Typically you can have up to any number of related persons and not more than eight unrelated people living in a dwelling unit in single-family zones. It's a little bit different in that that it applies to the entire lot. So under existing regulations, if you have a home or you to have a home and an Adu the maximum number of unrelated people that can live on that lot is 8 unrelated people this proposal would increase that to 12 unrelated people if there are two accessory dwelling units on the lot. So that's just recognizing that there are you know, potential for four households are to me three households living on that lot in providing a little flexibility I do though think it is worth noting is a lot of people have latched onto this number of 12. The average household size in Seattle is about to .12 average family size about 2.9. And so it's pretty rare to have a ton related people or you know an 8-person household on in a single unit and saw this would provide some flexibility if you had a few no family of 4 living in the main house, it would actually allow, you know other families to live in those units. It's unlikely to be a common feature where you would find 12 and related people living on one lot. So options available would be to take no action adopt as proposed or you could modify the proposed increase with the household size for you know, somewhere between 8 and 12 or provide other requirements. The next change is related to minimum lot size and the maximum square footage of a single-family home under existing regulations to add a detached accessory dwelling unit to a lot. You need a minimum of four thousand square feet of La tarea. The Proposal would reduce that to 3200 square feet that would make lots of single-family used. It would increase the number of eligible Lots from about 87% to about 95% of lots know. This doesn't change other requirements like lot coverage and yard requirements. If you have a smaller lot that is already exceeding or at those limits you wouldn't be able to add a backyard Cottage in addition. The maximum size of a detached accessory dwelling unit right now is 800 square feet and that includes any garage or storage area in for an attached. It's 1,000 square feet The Proposal is to allow an increase of 1000 square feet excluding garage and storage area. I'm in keeping the ATM at 1000 the attached at 1000 square feet into this will just allow some flexibility. But again without changes to the maximum lot size and other standards. It doesn't change the overall vocal out on the lot of just if you have the space and flexibility, you could accommodate a larger unit. And just reiterating at the bottom that there are no proposed changes to the minimum lot size to create a new single-family lot. There's been a lot of comments about increasing the number of subdivisions in that service and you still would have to meet the minimum lot size requirements to create a new single family. Options available would be to not change the minimum lot size or increase the size of a to use adopt as proposed or you could modify the proposal for the lot size or the maximum size. And as always you be constrained by what was contemplated in the Eis, but there's some flexibility to move between somewhere between 3200 square feet in 4000 square feet. That's the current minimum for detached accessory dwelling units for looking at modifications the maximum size. There are also some changes proposed to the existing regulations for detached accessory dwelling unit height limits right now the height limits vary by the width of your lot and the type of roof you have that would continue with some simplification in allowing some additional height that should help accommodate allowing a8d Adu over garage in some cases. This diagram just shows that the change is relatively modest. The no action would be what is allowed under existing conditions. The proposed changes to allow an increase of the Bayside to 16 ft and then an increase to the peak of the roof and it would allow a couple of feet of additional height if you were Incorporated Green Building futures, Options available no action or adopt has proposed or decreased the proposed height changes and or sort of modify the Green Building. We are lot coverage. So under existing regulations a maximum of 40% of the Year rear yard may be covered by accessory structures in any portion of the main house. This is an addition to an overall lot coverage the proposal and I'll slip to an image in just a second that it was Straits this better than the text. I think but would increase rear yard coverage to 60% for a detached accessory dwelling unit. That's a single story and it would only allow that's if it doesn't result in removal of trees over a certain size so that the idea here is to allow some additional rear yard coverage if it is accommodating sort of a aging-in-place single-story dad that might be better for mobility issues in those sorts of things. So this the image on the top the dotted line sort of outlines where you can build the main structure of the house. So that is the area outside of require require. The darker gray is a footprint of the house and the darker green box is a detached accessory dwelling unit the dark green and the darker gray boxes together represent a 35% lot coverage the total you can have structures covering on the lot is 30 of not more than 35% can be covered by structures and then in addition to that you can't cover more than 40% of their yard, which is generally the rear 25 feet of the lot so that dark green structure on the top or exclude me the dark green box in the top represents a 400 square-foot footprint is covering 40% of the rear yard the bottom structure shows what changes when you allow 60% rear rear yard covered. So when you allow more of their rear yard to be covered and you have a larger accessory structure Back the footprint of the main house has to get a little bit smaller so that overall you're not exceeding 35% coverage on the entire lot and allowing 60% coverage on the rear yard make sense. So you could again take no action adopt as proposed and one of the options you could consider in this is in response to some comments. We received one of the speakers today mentioned it would be to allow that increased rear lock coverage regardless of height if it's to accommodate conversion of an existing structure to add on a backyard Cottage. So the idea would be someone may have an existing two-story garage accessory structure and they want to keep the parking spot and add on to accommodate and accessory dwelling unit and allow that additional rear yard cover incentivizing reusing that that main structure and that could be a car that could be combined with option b I street parking requirements for accessory dwelling units under existing conditions when off-street parking space is required for an Adu and there are waivers you can request in certain circumstances. It doesn't allow you to eliminate an existing off-street parking space that's required for the main house. The proposal would not require any off-street parking for accessory dwelling units. It would still require that with one off-street parking space for the main house. One of the options considered in the ya-yas in addition to taking no action. They're adopting as proposed would be to require off-street parking space only for the second accessory dwelling unit. Overall. The analysis in the is didn't find that we see significant impacts to parking to on-street parking Supply by removing this requirement, but this is an option available to Can can you talk a little bit about that about the Eis findings and the impact on on parking sure. So we looked at we picked for study areas in four quadrants of the city in use parking data. Some of which I've been collected previously from the Department of Transportation and some that we collected he specifically for this he is and use that those Temple area that represent a range of conditions in areas in neighborhoods around the city to understand the potential impacts of if we allow more adus if we allowed to 80 years in a lot and all of them are parking on the street and what did I do to parking Supply and we used a typical threshold of if that demand would increase sort of on-street parking usage above 80 at 85% occupancy rate. We we identified that it would be a significant impact and we didn't find that across the study area, but we did find is in certain areas where there's already parking. Strange, this could have some localized Geographic specific impacts. And in those cases feel like we didn't identify what specific geographies those would be but just acknowledging there something blocks there certain parts of areas particularly those that are closer to multi-family and Commercial zones that already have some parking constraints that those would be addressed through other parking mitigation strategies that the city already uses. What's interesting and when looking at these different areas of the city is where you find the most parking constraints is also where you tend to find the best access to Transit cuz there's just there's already more density existing in those areas to wear on street parking utilization is higher is often within close proximity to those multifamily and Commercial zone. So it's sort of a where there are other potential Transportation options not in every case and exclusively their tents there tends to be higher parking. So what you're saying is that there are areas of the city that are already at or close to being at 85% capacity and that you the is shows impact to those areas but not generalize impacts not generalized impacts and the like so in the for sort of specific parking study locations, we found some blocks where capacity would be a door or just over I'm 85% But in this study area as a whole not we didn't find that impact our shelter. We didn't identify as a significant impact but we did acknowledge that some localized impacts could occur and so are you know an option that's not listed here. There are opportunities just like with other pop parking requirement. If you wanted to have a geographic specific parking requirement, you could do that. It just it's a little where you see parking constraints the medication is often served. access to Transit residential parking zones in a lot of that infrastructure is in place and some of these areas so it's a Certainly, there are there are plenty of neighborhoods in Seattle where on-street parking is at a premium. Those are largely places that are already zoned multi-family more commercial zoning. Where is Sweet hard to find and then and so is Allie said I think the the single-family neighborhoods that a button that those owns those few blocks is where you'll see spillover effect as you get deeper into exclusively Zone single-family. We tend to find the parking is not really a constraint. Just want to know cuz I called and emailed me on your question earlier about the number of homes. That would be affordable two people making I'm about 100% Ami it would be about 23% That was about 195 of an estimated 845 home sales. That's incredible. Release order for me at least makes fat percentage real, you know about the availability of of homes in our city and into that what that would mean is. How many are going to people above? sorry, I'm going to have to tell 23% so you know about success exit 895 home, so You know. Okay owner occupancy requirement. So we spent some time talking about this in the next piece at the last committee meeting under existing regulation the property owner must occupy the main house or they do you for at least 6 months of the year The Proposal would remove the owner occupancy and owner could add an edu to their to their rental property as I noticed on a previous slide in the preferred alternative in the is what we contemplated just having a one-year ownership requirement for adding the second day to you. So that was discussed. That was discuss their this proposal just remove the owner-occupant. There are a few policy reasons to consider when thinking about removal of the owner occupancy requirement. I'm one of the main ones is looking at equity and just in terms of how this regulation treats owners and renters differently, but it also provides flexibility for homeowners. We heard and testimony today somebody who is an owner-occupant and wants to build but just the the Central sort of concerned that what if they want to move away. What if they want to rent it in the future may provide some are there real or perceived barriers for people to make that significant about significant investment in addition, you know, I'm going to be looking at removing the owner occupancy requirement in the Portland survey, even though they don't have an owner occupancy requirement. They found that you know more than half of properties are owner-occupied about 65% are occupied by the owner, even though they don't have that requirement. And then this was the site I was referring to earlier where it showed that about 44% are below market value and 49% are at market value. So I didn't quite phrase those numbers correctly. So 44% below 50 almost 50% at and only 7% above so I think that's an important clarification. And so I think that is one of the sort of indications and looking at it and I can provide more information. Turn on the survey and looking at the ways that people have changed how they views their accessory dwelling unit over time as their needs have changed or their family situation has changed. What's the base number on that of your percentage? How many were you looking at its on average about $260 a year being built? I don't know what the total number I don't have. The total number of ATP is Dalton Portland here, but I can get that for you. I'm sorry. Was that number that you just showed was at Portland? Yes. Okay. I think it's also worth noting that removing. The owner occupancy requirement is one of the key factors that's really increasing the number of estimated. Eighty use that would be built. If you look at the analysis in the I asked one of the main differences between alternative three that was contemplated and the preferred alternative was whether or not there was an owner-occupant occupancy requirement and there's about a thousand unit difference between the estimated number of adu's produce and that is both due to the fact that about 20% of parcels and single families owns a renter-occupied now, so those are properties where the property owner cannot add 1/8. You even though they're already a landlord and it's also due to the choices people make do. You know concerns about what if they need to rent it in the future and then that that type of thing. So there are several options available one would be no actions are not limiting the owner occupancy adopt as proposed in starting to get some comments about short term rental use one option would be to only allow short-term rental using properties with adus if it's an owner-occupied property the regulations on short-term rentals that were adopted by the council. Almost two years ago would never allow for a property with 280 use in a single-family home to be entirely short term rental the regulations allow you to get a license for your own home and plus one additional unit. So if you live on the lot your own home in one of the 80 use could be a short-term rental use if you don't live on the lot under existing regulations and there were two only one of the three could be used for short-term rental use It's okay. I understand that that option is specifically related to the owner occupancy requirement, but I'm also interested in just generally limit. Short term rental used by this. I think this legislation is about it in my mind at least is about increasing the capacity of rental housing and in doing so making property ownership more affordable for folks who are already living on on those on those properties whether or not that means that they are renting to somebody and using that Revenue to to support their cost or as as mentioned before allowing a family member to live on on the on the property and spreading out sort of those shared extended family cost increasing affordability. That way I am concerned that allowing again. We want we want homeowners to benefit from the revenue that they generate. Terminator you but I think as a matter of policy we have the ability to show a preference for the type of tenure that is generating that revenue and I think rental housing is what we need in the city right now, you're one of the findings in the IRS was actually and if you really if you look at the full cap cost of operating a short-term rental in really including your time spent cleaning and flipping the unit and all of those things if you're not hiring someone it may be actually less profitable. But your Sweat Equity mean something study guide number of ways that could be crafted that's certainly an option available to council member. So I'll work with you on that. I hear conservative constituents that removing. The owner occupancy requirement will lead to real estate speculation and motor down of single-family homes. Can you speak to it that he is found this regard? Sure. So in the is we looked at that question pretty squarely was one of the main focuses of the analysis and if anyone really is interested, I suggest you read appendix a in in the is what we found that is in general while speculation is a thing and it is occurring in single-family Zone. It is as we heard today in public, and it is something that we are seeing today what we'd expect to see with the combination of changes being contemplated in this proposal that it would not have much if any impact on the sort of residual land value and so the likelihood so what will happen is that what continues to be the most profitable outcome is selling the biggest house possible. And so that would still continue to be what would be the what a developer perspective. I'll be looking to renting out all three units is not the most profitable option. So we would expect to see some of that switch if these changes by themselves were going to increase increase speculation. And so what it doesn't said and it's combined the owner occupancy requirement and some of the other changes but particularly owner-occupancy combined with introducing a floor area ratio limit that reduces the maximum size of the house should have surveyed moderating effect on how these changes will impact the server speculative Market. So next floor area ratio limit again, we talked about this in Greater detail at the last committee meeting under and this is part of the proposal that most of it is focus squarely on Accessory dwelling units regulations about the size and placement of accessory dwelling units. The floor area ratio limit would affect any development in single-family zones that were developed for single-family use soap under existing condition. There's no f a r limits the maximum size of structures on Lots in single-family zones are effectively controlled by yard requirements height limits in lock coverage which results in effectively being able to build about a house. I like 1.05 times the lot area so floor area ratio is the relationship the size of the lot to the size of the House of you a 5000 square foot lot and the F1 the total square footage on that lock could be 5000 square feet if it's .50 B 2500 square feet. Which is the proposed change would just set reduce the maximum size of a new single-family home but exempt from that calculation and a floor area below grade in any floor area in an Adu. So what this does is it incentivizes adding accessory dwelling units to the lot or if you are tearing down the main house tearing it down and rebuilding it with a new main home plus one or two accessory dwelling unit. So instead of replacing one smaller house with one larger house you replace one smaller house with three or four units and there was reporting today. I'm sure it came from your analysis that showed how many fewer mcmansions would have been built if Regulation cyclosporine place and some of that was presented at the last meeting but about only about 10% of homes throughout the city and single-family zones that are currently built would exceed the proposed limit but about V almost 50% of homes that have been built since 2010 would not be permitted under this proposed far limit several of the examples in the article today not all of them, but some of them would be allowed if it was a man house plus one or two accessory dwelling unit. So I'll just look to this slide. So the house on the upper left is a older smaller house. That would be below the limit. The one on the right would be exactly at the top right would be exactly at the limit of .5. The one in the bottom. Right? That is a point nine f a r s about 4500 square feet that would not be permitted as one single unit, but it could be permitted as one unit plus to attach accessory dwelling units if the proposal was a. Did the house on the bottom left would not be allowed but that's about a 5300 square foot house almost. So options available would be to not impose an Fai limit to adopt as proposed. You could adjust you. Could the Farr limit that is higher than .5 and I should note that it's 5 or 2500 square feet. So many Lots in our single-family 5000 Zone that don't actually have a minimum lot size of 5000 square feet. So they would still be allowed to build up to 2,500 square feet and you can expand or reduce for area that would be exempt from the from the affair limit. Sawdust art of the main the meat of The Proposal there are some other things in the draft legislation that's worth noting. This includes adopting a new tree requirement when constructing an Adu so it would require if you're building a new 80 you and your lot doesn't meet the minimum tree requirements for single-family zones to add a tree as well as introducing flexibility on development standards to facilitate preservation of existing trees flexibility for conversion of existing structures or some stuff like if your accessory structures built into side are there some flexibility build in their flexibility for entrances and then providing some height limitations for things like Dormers that add some interior living space in The Proposal here. There is a request that sdci report annually to the Council on Saturday TV production looking at what how many lots are building 280 use how many of those thoughts result Demolition and complete Redevelopment as well as a request to conduct a survey of a t u owners and occupants. So we could have compared with happening in Seattle to to other cities in addition to that. Some of the other issues that are starting to come up with questions about how many is a lot of homeowners take this out how many new landlord the reintroducing to the market and how familiar are they with the local landlord tenant laws in the state landlord tenant laws the Seattle Department of construction inspection often offers trainings and materials for landlord. So one thing council members could consider is just a request you sort of think about a tailored training for new homeowner for new landlords. That really are going to be just renting one or two property and thinking about a a focus sort of training that would help that that emerging landlord Market. Avenue of the Cities of any of the Cities mandated training small landlords of this kind and some cities including our own certain landlord tenant laws exempt adus so that they'd it doesn't apply to accessory dwelling units in some cases that is due to federal fair housing laws about exemptions if it's in your structure and you live on the site, but in other cases has just been a policy choice to not not require compliance with certain landlord tenant laws that I'm not aware of anybody requiring it, but I have seen some particularly nonprofit organization to offer offer up. A question as it relates to the first bullet on the Tremec Wireman. How does this requirement related to preserving existing trees relate to our ongoing discussions around a new tree ordinance, which I'm not really quite sure where that legislation is is is trying to mirror some of the concepts in that Citywide Bill to apply them for this particular type of development or well, this is the last version of the bill I would say it's still it's a it's an open question of whether or not there was consensus about what was in that proposal and whether or not it represents the various interests. I'm making regular. However, it does it it borrow some of that and some of the incremental change that was adopted in the mha Legislation so it's not taking a broad look at all, you know Olive Tree regulations, but it is sort of adding flexibility to incentivize preserving existing trees add the requirement to add new trees. If your lot is doesn't meet minimum requirements now as well, as you know, like only allowing the additional rear yard coverage if it does not result in loss of a tree so it's bringing in some of the concepts is also stating more clearly within the accessory dwelling unit section of a you know, this expectation that you need to be clear on your plan that out where trees are on the permit reviewers know where there are trees what the sizes and how the current regulations apply cuz I think it was noted that we have existing protections for trees. Some of which are not always implemented in the way that was intended. So if we ended up passing stronger tree regulations sometime. The future. Citywide bill would that how would that interact with the tree regulations in this bill? We would look at all of all tree regulations in the city. And so when making those broader changes we would be looking at this to see if this is consistent with our needs to be modified to be in line with the proposal. So for example in the RSL changes as part of the mha legislation, there was a point system adopted for figuring out how much tree is required on a lot that's not currently in place in single-family zones in this legislation doesn't propose to do that. But that may be something that makes sense to apply and in all zones in the future in addition in some cases it may there's been a desire to create a payment in lieu option and if that was in place at some point in the future, we would want to consider whether or not that should apply in in single-family. So that was all a long way of saying is that is a larger body of work that this would that would address this area. If you know if you adopt changes now, they might be slightly modified in the future if we take a different approach to regulating trees. Thank you very much. This is supposed to be in my committee currently. So I have met with the urban forestry commission downspouts in my office who is holding up. The back wall has been assisting me in this alley has been fabulous and looking at where we were a year ago. There's a lot of interest in resurrecting that I had hoped that we could get it back in front of council. Before budget but I've also been told that I may be smoking something and that it probably isn't going to happen. But there's big interest in more tree canopy tree canopy study. And of course the equity issues about some neighborhoods including Beacon Hill, for example, we heard from Estella Ortega this morning and she was very interested in those who keep moving forward with a real assessment. They would like to see more trees that like help and getting those trees planted and maintained and that's something that I too would like to see so we've got a lot more work to do on this but I think you know being a tree Advocate this is something I think is really important and I may have to hand it off to you this horrible to carry it forward next year, but we'll see what we can do. Are you heard it here doing whatever we can to get this in place of this year my intention with his legislation is to 10. Preclude what's coming there but a little bit to anticipate but I think is what I heard a lease a is what's coming high level I think is a lot agreement when you get down to writing the actual language is having folks start to question. What does that mean? And how is it interpreted as a fair amount of work to do but be great if we can get to that this year. It's a big opportunity for us to bring the community together because there are folks that say all we want more trees, you know, you have to preserve the treason. Of course, we all want to do that and then you come it up against with principles that maybe just opposing each other if somebody wants to build an Adu or a day. Do you and their backyard to for a family member and the only thing that's stopping them is one large Douglas fir. How do How do you wait that but payment in lieu is one possibility that we've talked about? I'm really would love to be and thankful that you're interested in this see what we can do by the end of the summer. Decide you've also seen before but this is just shows what was estimated in the in the is on how many 80 years would be produced under existing conditions almost 2,000 versus the sweet and proposed changes at I'm just over 4,400 and the proposal also is estimated to reduce the number of demolitions of single-family zones primarily due to the Farr limit introduction to reduce the the potential number of demolitions over 10 year. By about 500 units. So next steps will be to introduce legislation. I put here June 3rd, but given some of that sort of technical tweaks that may move until June 10th, but a draft of the legislation is available on the Committee website and it is unlikely to change significantly from that except for some of the components that were discussed today potentially as customer Brian mentioned a public hearing on June 11th and discussion impossible Bell on amendments in the proposed legislation on June 18th. Ali that was very thorough. It's almost as if you've been working on this for years Colleagues I thank you for all your work on this and you're capable of holding an amazing amount of information and numbers and I'm I won't hold it against you if council member her both of them. Do you want one question? Do you have a good team, I appreciate the discussion the participation here to thank you all for being here. I didn't hear I heard some questions about I'm short-term rentals. We had a really good discussion to think about affordability. Not exactly sure where that goes with this legislation. I need of those as far as potential amendments to this but to the extent that folks have different directions you want to go with us. I think I'm why would love to hear that if you have that now how it will want to know that as soon as you come up with that so that we can start working Alternatives. Obviously, we will hear from the public I imagined. Decent turnout on June 11th. And so I know I'll be listening to hear what what things I've missed after 3 years of working on this and but if there are Concepts that you want to consider that are different than who must been talked about today or some of the Alternatives that Ali talking about they're just Concepts at this point. And so if folks want those flushed out about how they would be an amendment proposed for the legislation to be really helpful for me to know that if you want to work directly with Allie, obviously, that's totally fine to transfer bait shop. And I've actually spoken about this one issue that comes up many times when people say you have to have off-street parking have to have spaces for people and I'm interested in looking at the rpc's and in particular. I understand on Capitol Hill that a home can have as many as 3 3 parking stickers for a single-family home and I'm wondering whether we could look at that as an entire lot so that Lots get three or however, whatever the numbers might be that has determined in the future. But to say okay this home ghetto this life gets free parking stickers. And if you want to give one to the person that's living in your in the DEA. Do you grate which means you've got two left in the home or if the individual who's coming into the small home doesn't have a car then that doesn't impact the neighborhoods as they are. So I'd love to look at that. The second is one of the things I loved about Portland's Model 5 or 7 years ago. We first looked at the Mike was when they had some pre-approved designs. So it made it easy for Neighbors to say I want design number two because it'll fit size and scale in my backyard. I'm really interested in as we're making these decisions that they have is little impact on neighbors as possible. So for example, if it's a tall house, you don't want to have at all day to you that's looking into somebody's windows. So I don't know how we deal with that or recessive but I just as a principal I'd like to put forward that of course we want to make make them reasonable. So whoever has ever living in it has a respectable place to live and at the same time. I don't want it to have a negative impact in the next door neighbor's so love to talk to you more about just as a principal. I'm not I don't know exactly how that gets to find in legislation one potential option and to think about is the executive has been working on developing appropriate. Planner design competition and so it may be just a simple as providing some direction about I'm some of the expectations and what those design should be thinking about including sort of the context of where the neighbor's house has an alignment of Windows in that sort of thing to address privacy concerns. Thank you. Thank you very much for the presentation. It's always enjoyable to the mathematical kind of Weights. It's it was really enjoyable to go to the presentation adjust on the question of affordability and amendment. I think that I mean do your point I don't I'm not sure how much of that could be built in concretely into this legislation I think is important but I also think the conversation and affordable that is extremely important because I'd end of the day just simply having zoning changes is not going to bring about affordability affordability has to be consciously implemented policy and implemented in different policies including this one. And so I think I really am looking into what kind of options we might have in the future for Public Funding for for homeowners, working-class and middle-class homeowners to build accessory units in the are on their lot is that an extremely crucial because again, as a lease of the data is indicating it's mostly very well-off homeowners were Belinda in in in my anecdotal experience. It's relatively life decisions were able to build it and then a lot of people with really good salaries were able to rent those units as well and he has smaller units are more affordable. But in terms of pi r squared square foot cost it still is a limiting component for many working-class people. So I think it's important to consciously keep talking about it. And I wonder if that as far as the specific thing that you are interested in cast member O'Brien in terms of Mandating the second Unit B income restricted. I wonder if we could put in some sort of claws where it says that, you know, of course if you're able to do you take advantage of the but otherwise, it does come into effect in the sense of I don't know when the state laws are changed. I'm not sure what we're looking things on me that illegal to do but may not a good answer yet. But I think if if the hive out there can keep thinking up ideas and maybe we get to something or at least figure out what we do what makes sense for us to do now to least preserve that flexibility important. An SMS before I'm I'm I'm interested in the second unit also being a rat restricted unit and utilizing the pilot project that is identified in the AMF plan to make that second unit affordability pencil out for the for the the homeowner is developing it. So I get it wouldn't be paying to build the entire unit. It would just be funding that would allow the developer to basically recruit recoup the cost of the reduce rent so that it would still be a development that they could afford to build one is the only folks eligible to participate in the pilot are low-income homeowners available to a low-income person. It's blowing Commoners who are eligible for the loan and then they would make it available to so it's low income that is the current program like that. Who is that who has access to my funds today? And my understanding is Our Hope in the pilot that we put in the budget last year as we might get to 5 to 10 homeowners. So it's it's it's both modest in in size and also fairly restrictive at least based on who can afford a home ownership. Is there a reason why we couldn't change the requirement non low income property owners can access the funding as long as they make the unit available to a low low-income renter. I don't know if they're I don't know that the answer to that question, but we can we can look into it. I think one of the things that is important to think about is this is an assumption that we could find low those homeowners who are ready to build a second or 2nd one trailer is just that import clarification, but you actually I can I'll talk with my colleague who is working on the NFL and about about that. I'm not sure I'm not certain that we can offer those loans if it's not alone to a lower income home in her but it may be well, I mean the same as they have a private landlords how much how much will they have but they on what they have to do any exchanges make sure that units in the building are held affordable. So I don't know the principle of seems like there's consistency there. The other piece is a mean one of the reasons we were able to do this pilot in the budget last year was because it was so modest and scale and it's It's using funds that could be used for other uses. And so I would love to see a program that would help, you know over a decade, you know, thousands of units low-income be done. But that scale that program will be significant enough that it would there be an opportunity cost of other housing units in may not be built because of that and so interesting to find out what are things we could do now and maybe put some language in there to talk about what opportunities or maybe the study to figure out what an option is maybe available so that we could figure out how we how we assign our housing priority throughout the city of our subsidy dollars are best to use what the right mixes. Alarm for take out my Galaxy one question. I forgot to ask. How does how does how does RFA our limit compared to other cities? Suppose f a r limit limit is pretty consistent with other cities and how they regulate the size of of those who have that. They are limits. For example, the city of Boston has a point five f a r for there are 5 Zone that has a 5000 square foot limit Los Angeles has a similar requirement the City of Minneapolis as a .50 requirement for their single single family zones in Portland is also looking at introducing & Farr limit. It's a little bit different. They're looking at brought her changes in single-family zones. Where would be about .54 single-family home and you get a little bit more Farr at the duplex or Triplex for that serve thinks about this proposal is consistent with what other several other major cities have in place for regulating the size of single family homes. Thanks. Thank you for that information callings. If there are any further questions will wrap up today again, encourage folks who can be at the hearing on June 11th for the national share some more information and maybe get some new ideas to the extent that you have ideas. You want to continue to flush out. Let's continue to discuss about those ensure they make sure the central staff has that so we can work towards this we heard today in public, the number of folks who've been waiting for years to get this done so that they can proceed with permitting and building and I want to get this right so I don't want to rush people but I do want to I'm not delay it any more than necessary if possible. I just like to say council member Brian how much I appreciate your fortitude on this. I think from the beginning of our first year on Council together, which was 10 years ago now, this is been something that you really charge. You really been leading, and I feel that we have made great progress. I appreciate that Ali excellent materials. Thank you.", "end_time": 6090.5}]}