{"format": "raw", "annotations": [], "confidence": 0.9445849275717171, "data": [{"start_time": 0, "text": "Good morning. Today is Wednesday, March 13th at your Oksana. Today is Wednesday, March 13th, 2019. And it is nine 9:34 a.m. This is our regularly scheduled meeting of the gender Equity Safe Community Education committee. There are two items on today's agenda first. We will have an initial discussion with the Department of Education in early learning and evaluation Plan B package. That was graciously passed by settlers in November 2018 and their response to gun violence across the city. So as usual we will begin at with our public comment. Each speaker will have up to two minutes to provide the committee. Other feedback public comment on matters that are on the agenda. We have three individuals that have signed up for public comment again, each individual order get two minutes the two minutes. I will ask you to conclude your remarks so that we can continue to move through as a list of public comment speakers. So the first person is Alexandra Erin soup. It's working and I spoke to come to this chamber and spoke hundred times about this point. What is absolutely critical to make Police Department better in exactly an hour of US court. Number one. We cannot open a public comment to Police Commissioner be covered with Police Department. If you cannot speak in public comment in a police commissioner what this is guys is this America or this against top of the KGB. It's number One never leaving CCC 430 years never I repeat never I hear so chief of police curfew in a in exactly right now. We have six years old. Gation US court if you don't have one Q&A from police chief, how is it possible? It supposed to be every month people posed to be control URC employee repair. You supposed to be controlled and another 700,000 people is employer is number one city in America. It's not surprise me because console right now. It's up your criminal open public meetings. Constitutional law 5 * 5 * if you cannot police commissioner or chief of police artificial City and I call this many times stop, Seattle. And I apologize. I have to sit through that but thank you for being here. Thanks. Hi, my name is Joe and I work with Seattle neighborhood group. I suppose I should have called Rainier Beach a beautiful safe place for you and I'm here on behalf of my team comprised of both Community Partners including rate of each Action Coalition Boys & Girls Club of King County and then also agency partners including the Seattle Police Department born first born out of the burn criminal justice Grant in 2013. And then we've been sustained by the city of Seattle since 2016. We use in place based approach to reduce youth violence in the Rainier Beach neighborhood. Since 2015 we've had several non-arrest interventions fully in play some of these include safe passage rate of each quarter graders. So on and so forth. I'm here today to speak to the shots fired presentation that you'll be hearing later. Today. We're concerned that the headlining chart in the presentation where it shows Rainier Beach has is leaving the city in numbers of shots fired overshadows the chart where it breaks down where those numbers are coming from in in the trends that we see it shows a steady decrease in shots fired in Rainier Beach following 2015. And we want you to take notice of that. This is consistent with a 30% decrease of violent crime among Youth and Young adults in the rain original since our Dimensions have been in place as you review the presentation later this morning. We ask that you look closely at the numbers and consider the effort set our team and many others in Rainier Beach. Doing to create a beautiful safe place, and of course, we would welcome the opportunity to discuss our work with you further. Thank you very much. And then can I give you can give it to Roxanne and she'll make sure that we get the information. Thank you. The one in council members and thank you very much for having us here and go cougs. I'm here to speak on behalf of the promise program which part of the outlet of this morning and I'm speaking on behalf of not only South Seattle College where I served as the president but also on behalf of the Seattle colleges and if I could also on behalf of my colleagues from Seattle public schools and the city's mayor's office and deal office who work together on the design process in the year leading up to this work. I really want to underscore the hard work and the focus on Equitable outcomes that was put into the design work the precursor program to the Seattle promise is the 13th year program, which was developed 10 years ago at South Seattle college and Through The Misfortune and environment that was really focused on serving students of color. We are the arguably the most diverse institution in the state of higher ed, and the And we have programs like Trio federally funded programs that have been in existence for decades that serve underrepresented students. We have initiatives that really focus on serving students of color and a lot of the good learning and the good application around what it takes to make students who are entering the college be successful really went into the formation in the development and evolution of the Thirteenth Year project so that when it evolves and the Seattle college has put forth a concept that would address the needs. It was really well informed by that background and last year many many hours were spent with this team partners of expert in education to really evolve with the Thirteenth Year was into the Seattle promise to address the access and the completion goals that we wanted to achieve through the promise and I believe that what you will be reviewing really represents that good work. We already serving our first cohort levels of diversity that are higher both at the high school and at the College of the students that are served in the general population. So we really feel like it stands strong. Long as a successful program for Equity outcomes. Thank you Rosie. Is there enough the end of our list? Is there anyone else in the audience? You didn't have an opportunity to sign up at would like to offer US public testimony. Please come forward. If you can start by telling us what your name is and then after you're done with your public test when you can just write your name down that be fantastic and we're here. I'm we've tried to make several of the council meetings in the past couple of years as we are a growing. Our membership has now in about a thousand numbers across Washington and one of the areas that we are now serves structuring and focusing our efforts is how we can best support communities with at-risk juveniles for gun violence. And so we're here today. I'm actually here representing us just so that we can learn more about the Seattle Police Department's programs what their proposals are and also to let the city council know that grandmothers really support the organization's that are working in the at-risk communities to do everything they can to educate the use and we are looking forward to partnering in any way that we can so we just wanted to let you know that we're here. Today at we care and that we're doing everything that we can to ensure that there are sensible gun laws in place and enforced. I'm to keep our communities in our school safe. Thank you so much for being with us. Is there anyone else you'd like to offer us some testimony on matters that are on the agenda? Go ahead and close out the public comment period and we will go ahead and begin our items of business. So if you are here to present the item one, which is the initial presentation on the levy implementation evaluation plan. I'm going to invite you to join us while Roxana Q's up the presentation. navigate to Good morning. I'm going to have Roxana read it and item one into the record agenda item one families education preschool and promise Levy implementation and evaluation plan for briefing and discussion. We have quite a few people at the table and and up before we get started. I wanted to make a couple of some opening remarks and then we'll go ahead and do surround of introductions and imma make some opening remarks and then I'm going to hand over the presentation to Tractor Supply. Are you going to take us off presentation? Okay so first and then we'll go ahead and get through it via 56th slide deck 56 Pages evaluation plan is 130. because read with me saying president of Seattle Central College. Metro PC nugget at the director of Ketone post-secondary education with deal 10 volts the finance director for film director for deal when I get back Council Council staff you so much for being with us this morning. I am excited to kick off the Seattle City council discussion on the proposed families education preschool and promise Levy implementation and evaluation plan voters overwhelmingly approved this critical education living in November of 2018 as we all know and as the chair of the education committee, I am really proud of the work that the city council did during last year's legislative process that led to the development of an education Levy that big damn this council's priorities together with the priorities of the executive and and members of our community in partnership with Seattle college and the Seattle Public Schools district are Levy investments will be anchored in educational Equity with a focus on clear outcomes including closing the kindergarten Readiness Gap with our quality Seattle preschool closing the opportunity. First students in increasing graduation rates and creating Pathways to college and careers with Seattle promise and I'm really excited that we can be here to talk this morning about how important these Investments are across the educational Spectrum as somebody who grew up in central Washington State who was a beneficiary of Migrant Head Start who was a beneficiary of a lot of support systems in the K through 12 system and who also had the pleasure of starting off my higher education with two years of Community College at at Yakima Valley Community College. I really understand and appreciate the work that the deal is doing and that work that sell college is doing and their work that so many of our preschool providers do to make sure that we are able to Route our investments in this face through a lens of education. But but primarily also just to make sure that we have really wonderful outcomes for our kids as throughout the sea. I'm really excited to be able to post this conversation today in this committee together with kids member Johnson who's been a key Ally and partner for me in making sure that we do right by our kids. So I'm really excited to begin the conversation opening remarks before we get going. Alright appreciate your support of all the way leave this up to here and in the continued support that will have one of the other before we dive into the presentation want to also thank superintendent Juno for her support and Partnerships. I know we have Seattle Public Schools representation here as well. Also, I want to thank all Chancellor pan and in the presidents that are here today off everything that you've done to get us to this point. So here's a brief overview of what I were a presentation is going to look like today just a brief outline will have an overview of the Fed Up Levi. I will hear Little bit about the chameleon partner voice. I will dive into the overview details will I with promise and then we'll dive into Early Learning Preschool and then will close this with our K-12 and community-based and health sections. So wanted to also start off with our why within thinking about deal Moon reflecting. Why deal does this work the reality of deal can only think about Serving our Seattle families and just importance of felt and ensuring that fell tweets all of our Seattle family needs. We know the value of Act of accessing high quality learning is extremely important for our Seattle families. We also know that it's even more valuable that are Seattle families will be part of this growth expansion that were looking at a time within Early Learning space then just thinking about just not only the growth and expansion that how kids will be able to start and enter a kindergarten ready to learn which will be that learning will compliment compliment by the health Investments and other K12. I'm Investments for us is super important rewarding that word that were investing in this but most importantly and just to be honest as a former High School principal one of my favorites that I get overwhelmed and talk about that I get to think about this. The opportunity that kids will have when they graduate from high school that will have an opportunity to have two free years of school always reflect back and think about standing on the stage of giving a speech in and look at the crowd and you take that panoramic view, you know now knowing what principles and other folks that are graduating young people knowing that every kid will have an opportunity for a to four years of college is super impressive. So I wanted to say that this is no deals Y and we know that these Investments are all will ensure that our families will be successful. I'll to compete in Seattle. If you can compete in Seattle, you can compete anywhere so wanted to start us off with that why I'm a little bit about our self Investments you of course our V investments will invest in preschool to post-secondary. We're definitely going to increase access and utilization of programs and services. While we're all historically underserved students and I will dive a little bit deeper into what historically underserved students are in. The upcoming slides. The fapp is definitely looking at funding these three core strategies throughout the entire on February. We're looking at on Equitable educational opportunities or looking at a high quality learning environments and we're looking at making sure that there are student and family supports throughout the fair plevy. As I mentioned earlier, we hears our overall goal of the Levee and besides the partnership with families and communities to make sure that we're building a better economic future for our Seattle Scholars. So we wanted to highlight that I mentioned earlier on a previous slide that speaks to our other served our populations students at work. I'm focusing on clearly. This is what we're looking at focusing on our outcome and Target is a African American black Hispanic Latino Native American Pacific Islander underserved Asian populations, in other students of color make sure that they achieve academically from the preschool to post-secondary continue want to just wanted to make sure we we identified and call that out as well. Next we will talk about what the Highlight a little bit about the community and partner voice and implementation. So when you look at this slide, this is really high level overview of of the areas by a strategy on which is preschool & Early Learning K-12 community in K-12 and health and under each area of investment. You'll see just a few bullets of who we targeted throughout this chameleon partnership and without going through all of them. I just just give it give you a brief second to look at the individuals or organizations that we've targeted throughout this process of the things that this city council indicated was a priority for us in this is been a particular priority for me personally is making sure that we're also layering some of the Demographics that we are targeting with the component of language and making sure that we are reaching into English language Learners in particular who also, you know, obviously that's not that's layered on top of of the racial categories that you listed there. And so I just want to be I really want to want us to be intentional about as a category of folks who we are seeking to reach in terms of the work that we're doing here or go cuz I noticed thank you. So I was as I was mentioning, this is just an overview of the Community Partnership voice that we've collected and as you see these folks the folks that we are engaged throughout this process. We just wanted to hide like that and show everyone that next what we're looking at as far as the levy oversight committee involvement. What as you see this timeline right here. We've look we've actually I've started back in 2017 of so I'll take you to this timeline in 2017. We've developed the V Levy implementation priorities and principles. I was available to Olivia oversight committee back in 2017. And then you'll see I'm a between January and June of 2018. I kind of feel like we were sitting right here around the same time last year. I get in Council approval of the fifth and Levi package and I'm as you highlighted in your openings in November of 2018, which actually we just a few months ago, but it seems like it could have been longer on the voters approve this affect package which then a month after that in December of 2018. We've had we were so we sat at this table and a half hour off LLC members confirm by counsel. Which then brings us to kind of where we are now from January 2019 to present we've had loc meetings and recommendations to transmit the implementation and evaluation plan. And then I'm up coming later. This month of March will definitely have a loc meeting regarding our a partnership agreements that will be sharing with you. Also. Just wanted to really highlight this online and just showed a commitment that everyone is committed to live over the past couple years and thank you to customer you've been a part of the process on here every step of the way. And I appreciate the cooperation in the work that we've been able to accomplish together and still think you look right here where we have is our budget overview. And you see the slide is a little sometimes it comes up funny, but I'll just read the budget overview to you. The green is the preschool & Early Learning which is approximately 54% of our budget. You'll see the light blue color baby blue light Blue Bombers as k12 and Community which is about 29% of the fifth of budgets. The dark blue is the health Investments, which is approximately 11% of this felt 7-year budgets. And then the Orange is the small 6% which is our Seattle promise. I just wanted to just make sure we share this lie with everyone on prior to our moving forward. He watching at home. It is uploaded on the website and it is appearing accurately without the formatting issues in the system. That sounds great. So what I'll do now is let us dive into Seattle promise and I'll ask doctor at Thank you, Dwayne more excited to have her partner's here today to prevent to you. And I've got dr. Sheila Lane who's been very instrumental in the code design of the Seattle promise. She's been working very diligently on this and I actually just start off by talking about Seattle promises. So the sale promise provide students Seattle students tuition student support and includes non-tuition financial support for eligible students. And so as we heard earlier in the public testimony this model to sell promises program and promise maintains that has open access to call it for many students who wouldn't otherwise pursue a post-secondary education. So that's something that we're actually very excited about scale promise. We know that the jobs that we are seeing even today require 70% of them are require some type of post-secondary education. And so what we're really proud of is that in 2017 as we mentioned marriage work and thought to reduce the financial barriers first for sale. Lake high school graduates and with the help of the council and public vote in place. So I'd like to dive into thank you. Thank you. I like to dive into the goals of the saddle promise. And so and strong and strong partnership with the colleges on the scale promise promise program is an on being means-tested program designed to increase access for Seattle high school students to enroll in Seattle colleges be North South and Central and to support them to earn a certificate credential or degree of their choice or intended outcomes. As you can see here allows students turn up to 90 credits for the certificate credential transfer degree and we aim to provide a seamless pathway for students traded to college and as a as future slides with Sean about to display some of the race-based obtain a gap goals that we're trying to achieve. Thank you. So what we have here as we're really looking at the universal access and Equitable outcomes have been mentioned dental colleges are open to all students of all educational levels and abilities as an open-access institutions were proud of this partnership this year the 13th years in full force at 6 high schools in will be in expanded into 17 Seattle public high school starting the next school year 1920. As well-known practice the Seattle promise will provide Staffing and so as we see here, we've got Student Success specialist and college advisors the ratios for them for Student Success specialist. These will be individuals that will go into the high school and talk to students and bridge that understanding awareness about what college is we really believe students have to develop that sense of identity and understanding that college is there for them and we're also looking at bee specialist working with the ratio of 300 to 1 so it really condensed ratio so that there's a high-quality support system there. We also have in place College advisor than this model. So that students get the Hands-On approach a wraparound Services once they're in college and have that soon support. Really looked at existing research to focus on the Simplicity in this design. And so what we've found is that research has shown and even within the Thirteenth Year scholarship program research has shown that keeping this model simple is probably the best approach so that families and students aren't caught up with eligibility requirements and a big goal that we're really trying to achieve is a college-going and called completion culture within all of our schools. We really believe and feel very confident that students are are really really want to breed that supposed to mean What we have here is in the first year of Seattle, Saint we expect to be we are going to be in 6 cool. And so with that we have lower rates of students in that but by your to we're going to be expanding to the 17 schools and So within your two students in the 12 12 grade will be getting support and be getting that exposure to call us and application support to the scalp promise. We will be in full effect and so will have students here already participating in Seattle promise both in the thirteenth and fourteenth year or model as you can see, I have to meet at 870 students once were in full operation mode. We feel very confident that matriculation estimate for Seattle students. I want to highlight some of the demographic ratio is that we're going to see in this ending in current 13th year approaches. So looking at some bass the Baseline data in the school year 1819 Seattle promise cohort what we see is that at least 60% of the students that are participating are on free and reduced lunch. So we are actually making a change in making an impact for students who are considered low income in free reduced lunch in terms of race and ethnicity as you can see in this pie chart. We really do reflect a very diverse demographic as you can see blocked is is the largest group has followed by Asian Pacific Islander, white and Hispanic followed by Multicultural and Native American which we hope to be able to increase that as well. Tri-River really looking at even further at the school that we're currently at if I can get your eyes on the bottom of the slide. We're currently in all six schools that we're currently in six schools cheese self Cleveland Garfield Ingram Rainier Beach and West Seattle. Within that we have when we look at the chart above the bar chart shows that of all the students in the schools. We have 48% that qualify for free reduced lunch of that population. We're currently seen that 60% participate in the Seattle promise or sees me in the Thirteenth Year. And so really free reduced lunch students are over-represented or I would like to say very well represented in the current demographic. I want to take your eyes to West Seattle. So West Seattle currently estimated at 22% of the students on free and reduced lunch. Even there were seen that 42% of the students that enroll in Seattle, * actually participating are 42% are on free and reduced lunch. So we have really positive outcomes and we believe that even as we expanded to schools that reflected up a certain demographic that will still be maintaining Equity. I just I just want to make sure that I'm tracking what you're saying. So it's not 42% It's 42% of the 22% It's 42% of the 11 right there. Of the 11 students which which is 22% you're telling me that this chart represents 22% in West Seattle 22% of the students attend in West Seattle High School are on free or reduced lunch, correct and of those 22% 42% of that is enrolled in the promise cohort. So of the 22% 11 from West Seattle are currently in the school year 1819. What is the 42% mean of those 11 42% or if we go down to five or six students would be currently participating so less than half of the 11 students are on free and reduced lunch. cracked are you break next? Now looking further into this life which shows the equity in the synthesis him a cup of that same cohort 1819 Seattle promise participants students and it's broken out on the bottom of the slide based off race and ethnicity being Asian Pacific Islander, black Hispanic multi-racial Native American and white of 290. We look at the bar charts above also show now the demographic breakdown within those six six within the six schools and they definitely show that within the black population where we see that we're serving 51 black students within the within this cohort that makes up 27% much like the pie chart that I showed earlier. So we are seeing very high rates of students from diverse backgrounds that are able to participate in this and this research definitely is reflected an existing National programs were modeled after play Space Place based on similar programs are placed face, Kalamazoo. One for example that has definitely shown that race and ethnicity and underserved students are definitely reflected in promise promise programs. Do you have any questions about this one to make sure that I'm tracking all of this stuff? Well this year how many students do we have that are in the 2018-2019 cohort because our number on this line is 190 students are number on the previous live is 114. I assume that those are representative samples of the total population currently on this slide. There's 190 total students because it's broken down by race and ethnicity accounting for all of them. So if I go to this life, I have 114 students. This is the makeup of 60% of the total population. So if you look at all six schools On the bar chart to the left 60% of the current cohort are free and reduced lunch students. I think the question is broader. It's not about how many the question is. How many students are enrolled in the the 1819 Seattle promise cohort in the 18-19 cohort? And these other slides that you're walking us through or just subsets of the a hundred of the hundred 90 students that are in the 18-19 cohort. But that's helpful as we look at that the setups line for all this, you know that I'm kind of continued ramp-up of the program like having realistic expectations about the Staffing up of the cohort considering, you know, we need to add success specialist called advisors. All those things associated with the expectation is the next year's program is this year's program cuz we're in 2019, but it's the 2019-2020 school year. So the soon-to-be seniors will have about two hundred and sixty or so and that the following school year will be up to 545 that important to understand and it'll be great to see how as we get those ramp-ups ensuring that we are targeting if you go down the slide making sure that we're targeting those students and again over. Representing those that are traditionally under-represented both in terms of race and ethnicity and in terms of economic equality I think is going to be really important. So complicated nature of the earth. I'm trying to just unpack them a little bit to make sure that the data that were tracking over the next couple years as we roll out. The program is going to be easy for both to understand and I think we are here in a little bit is the two folks who spent the overwhelming majority of the last year-and-a-half thinking about this program is struggling a little bit with it. So funny some ways for us to make it a little more user-friendly to understand would be great. So currently this light shows that were in the first year were going to continue with the high school eligibility at 6 schools in 217 schools second year were also pursue conducting a racial Equity tool kit to do exactly we're talking about SSR Equity measures and access Howard and these recommendations will be delivered to the loc Levy oversight committee and the council and make recommendations of how we can expand on this program to see what's going on with our program and we're really trying to design the kind of approach where we still have the authority to modify eligibility criteria for tuition. We really need that time do they will see what the behaviors and patterns are for full implementation as Michelle Thomas matures and performance is monitored. So deal will see the recommendation of the lse to implement new eligibility criteria, and we will be notifying Council 30 days before any changes take effect. Cancel Waze. That's the puzzle and you have mentioned that you wanted to see prioritization of students. One thing that we have actually brought into play as a contingency plan. So should the case for its saddle promise exceeds a fat Levy funding intuition funds will be prioritized for low-income students first generation students and students of color African American Hispanic Latino Native American Pacific Islander and underserved Asian populations. A little bit about the model in the design of of Seattle promise on we have actual metrics and stuff that we want students to be following her to guide their path into saddle promised one being within the 12th grade. We actually want to walk students through completing the scale promise application to actually filling out the application that is developed by the colleges within that students are also going to be applying to the distinct colleges that they're going to be applying to North Seattle and Central that Hands-On support for the wasp and the FAFSA application. So that students can actually apply and get the kind of a that they're eligible for for those that do are eligible and that's a very complicated application process. We want students to have that kind of support built and students will be asked to participate in Readiness academies. What these are 7 seminars and workshops built into the day where students are brought onto campus and they're actually learning about College opportunity they have there actually going to be filling out their financial aid application filling out any additional forms that they need in order to prepare for their first time first experience in college. We really wanted to mystify what college memes for students and help them understand what careers look like and how to pursue that type of a major stood certificate. Once they get to the college's also one of the requirements that Seattle public is that student earn a diploma from Seattle Public Schools. And for those that carry out up to this point, we are going to ask that they participate in this summer bridge program. What we want to do is handle the summer melt concept so students many times over the summer because of something that happens within their families or something. That's something fun for seeable reason might fade away from pursuing college. And so this is a really important. What I would say is orientation to the campus and really over the course of this spectrum. These students will have somebody as soon as poor specialist that's actually talking to them knows our personal stories knows what's going on for them in case there's some issue. That's why they can't start so that we can help us that those barriers on during the summer bridge program. This is typically in August once students begin their Thirteenth Year and enroll into Seattle College's students will be asked to meet quarterly. If not monthly with an academic advisor this way. She was a hundred to one and this is where students for example if they have some concerns about courses that they need to take academic advising that's needed. Sometimes they might Have that sense of insecurity of taking a taking a certain class or just not feeling like they know how to navigate the college. This is where that advisers the port would really help and last but not least. We're asking students to main satisfactory academic progress. And this is a term in it and a mechanism in which the colleges are often almost institutions of higher education use this approach to maintain student momentum a progress towards degree. I'm really quickly on in this proposed implementation plan. Does it require a different way does a proposed implementation plan still allow for for portability and mobility of students. In other words. If you doesn't matter what high school you graduate from, you can choose to go to whatever College you whatever Seattle college you want to still included as part of the design of Seattle. Promise. Yes this first year it was not because we were at Levi funded it so that it could be fully portable for students that I choose where they want to go. Okay, and I did offline raise some concerns about that maintain satisfactory. Make progress component. So I want to just let my colleague know about that. And then I know Brian is a tracking that issue and we'll be doing some analysis for snhu identification. It's a term of art as it relates to education maintaining satisfactory academic progress your doctor. You're welcome to explain it to us if you wish but if you're curious cuz that's certificate or degree and if they are spinning their wheels taken credits that don't matter or if they are not making progress towards some degree, then they're not making good use of the money at all. So I think the way that the design is proposed does not take into account part-time. But we do have we allow the flexibility of something happens in a student's life that they can work with their advisor the Student Success specialist, and we we have in the Thirteenth Year program allows students to stop out as needed or to go part-time as maid of the gold though is to get students towards completion and we know from the research that students to go full-time and more likely to complain. That's why I wonder if you might just talk a little bit about that application process. I mean one of the things that Christina talked about is how we are planning to intentionally try to ensure that folks from low-income backgrounds or students of color are first-generation students are the ones that could prioritize for the program is that surface itself through traditional college application or is that can be part of our promise application itself. And how many applications will student have to fill out? Is there a chance for us to have sort of one application or that the applications look similar enough that it doesn't look too confusing from one application to another so they will have to fill out to because the college application is actually a state board. So every Community College in the state uses the same application and it's fairly simple and the Seattle promise application. We're trying to keep it as simple as possible as as well and the focus on low income and underserved students is working in the High schools with the building principals and with the community-based organizations that are there and that has been our approach to always partner with college access programs that are in the schools or that oven in the community. So we're not just in the high schools. We're also doing workout at community centers College fairs that are hosted by and community-based organizations to make sure that we're getting the word out to those students were traditionally underserved. So the doing that is not necessarily through the application process, but by using counselors nonprofit organizations Advocates within the schools to do Outreach and ensure that applications get into the hands of those students that they continue to apply Apple. The strategies and purchase that we will Encompass with in Seattle, Sorry by offering tuition. So tuition cost for up to 2500 / Seattle promise student for those that need more we have the equity scholarship. So Equity scholarships are for students with a 0 EFC this will provide support for non-related tuition expenses because we understand that students have additional expenses in order to pursue their college education. And so and really we really believed strongly and Equity approach of providing College preparation persistent support. So we've dedicated a bulk of our investment into the retention support. And so we want to make sure that students are college-ready and that there's a transition Center in effect for them as I just showed you in that model and want to make sure students are able to persist in complete their education. I think this is one of the opportunities where we want to make sure that someone who is eligible for the promise program is also getting understanding about their eligibility for other benefits. I'll look at that Equity scholarship number and think as we've heard around the table that all of that money could be sucked up into books in a heartbeat, but that somebody who is eligible for the promise program is likely also eligible for the other benefits that we might have through other buckets with in the city where that's the Walk of Life program whether that's about child care whether it's about some of the other things we want to do around housing. So, how are we going to ensure that someone who's applying for the program understands that they are that they are eligible for this other great City programs as well and not sucking up all their $1,500 into Transportation when they may be eligible for the Orca lift program coming out of the Department of Transportation spend it. Talking about shortly and we are looking at Child Care Subsidy so that we can provide that affordability for students with children to see what kind of options are available in the future. And so one of the other things that we want it really highlight is that students in the Levee which I'll be talking about keto investment. We actually have five high schools and we're going to be targeting a lot of our investment approach until 5 high needs high schools to add extra extra emphasis for students and Sheila. Do you have a chance of success specialist? Those folks are really going to focus on connecting students to Resource is not only in the community and through the city, but the resources that we might have at the college light Trio like the United Way benefits Hub Navigators that we have in those folks are specifically in our colleges to connect students to resources outside of the college, especially low-income students. Who may be struggling with housing insecurity or food insecurity box that said to have housing instability. I would imagine folks might not be willing to check that box, but everybody's interested in housing. That is Affordable or transportation. That is Affordable Mina. Would you be interested in a discounted bus pass? Everybody wants a discounted bus pass. So thinking about ways that we might be able to Market that so that students today as opposed to trying to ensure that every student very limited time. But those advisers can Surface issues I think would be helpful to I want to get a sense of whether the wraparound plan that you've described doctor Lang is included in with anybody from deal. Is that included in the implementation plan, or is that something that would be included in the partnership agreement? It's included in the implementation plan because the implementation plan includes funding for a Student Success specialist caseload of 100 for 100 Seattle promise students. There will be one advisor assigned to them. So they get to know the students fairly well and the the Outreach counselors who are working in the high school get to know the students pretty well. So a lot of times I don't have to ask that question because they are there helping them fill out those forms until they know those students fairly. Well, then they get to know their students stories. This is a potential issue in your issue identification work that be great. Great, but you don't we'll ask Monica to guide us to the Early Learning piece off of a successful for your demonstration phase of the Seattle preschool program. And I'm the bulk of the preschool & Early Learning Investments revolver rounds modifications and tweaks to the program on based on all of our experiences and experiences are providers and from diehlstadt. So I definitely want to thank the committee and the council for all your support over the last four years as we launch this program from the ground-up. It was an incredible process and we're really delighted to have seven more years to do to make our program better and more accessible and continue the good work that we started to the overarching goal for the Early Learning Investments is a tall Seattle families will at he'll have access to an and utilize the high-quality Early Learning services that promote success in kindergarten and what we hope to see that children are I need to survive in kindergarten that we have high-quality Early Learning environments that are evidence-based culturally responsive and Equitable and their practices and that that families have multiple ways to gain access to these Early Learning environments because we recognize its family is different in different needs. And once I does not fit all and It ultimately the race Pace opportunity opportunity gaps or closed. So the early learning strategies are divided with Investments divided into seven different strategies. And the first four on this slide are directly associated with the Seattle preschool program. As I mentioned earlier. We've learned a lot from our pilot and our modified strategies and so really reflect experiences in the best thinking of our providers are teachers our families and our internal deal staff. So, I'm sure you've heard me City force of a biggest learnings were around one size does not fit all so you'll see that we are incorporating more flexibility and a differentiated approach both of our Fighters and our families. We are we we've learned that quality has to be that can't be cumbersome. So we set the bar very high for spp and we're not wavering from that at all. As a matter of fact in the most recent review of the Pre-K Pre-K is an American cities report. You're the only city that met 10 out of 10 of the equality benchmarks. So we're not Leaving from that but we also want to recognize that sometimes these high high high standards can set up sitting vertically some barriers for providers. And so we're trying to be creative and work with our providers to make sure that they can meet the quality standards. I'm in a differentiated approach and without causing hardship. And then finally we also want to reduce barriers for a family is so access for families meaning means that we're continuing to assess our program policies and a processes and some unintended areas that we may have created for families. So we're continuously trying to simplify the application process increase eligibility and also the support that our families can can use so the four if you can go back one or side. So the four strategies around sppr the first bucket is the service is intuition, which is our tuition subsidy and and the the payment that we give our providers for for running rsfpp programs. I'll talk more detail about that a later flight. Our second strategies around quality teaching and this has really been a huge success for us. And in what I mentioned earlier in terms of the outcomes that we wanted the types of classrooms that we've been able to establish through at STP. So are equity-focused responsive coaching the curriculum training the assessments and continues to quality improvement as well as Workforce Development that we've been doing with are on scholarship program for teachers comprehensive supports is an a strategy that focuses on ensuring that any child can fully participate in spp, as you know, some children come to come to STP developing more than one language at one time or they have special developmental needs or they are experiencing homelessness or other trauma and exhibiting challenging behaviors. And so one thing we want to make sure that our teachers and a providers are equipped and have the resources to serve all children because that's the only way that we can make spp Equitable and so I'm funding comprehensive support is real. An important component of a knee high quality program so different types of things are Public Health Partners implement the Child Care Health consultation. We are focusing heavily on establishing strong support for dual-language Learners as well as students with individual education programs special education. And we also provide a lot of technical assistance to our providers to meet the different needs and increased Family Outreach and a month also family support and in are in this next iteration of the SVP, we're going to be creating a family advisory Council as well to help inform our practices and her Johnson Middle of the application process. How are we getting the word out? I mean, I'm the guy who sees the odds on the inside of buses, but we want to make sure that we're targeting folks. Then I'm more targeted passion than just all of us Transit nerds. It's so we are on we're using ethnic. Yeah, we have also mainstream media. We're using our providers. So all of our providers word of mouth is really the best mechanism as well. So in addition to social media where I get providing all of our sites with the materials and the resources to promote their their programs in the upcoming application, which is opening in on Friday and one would imagine that once you've got a kid in the program you want to try to get that kids siblings in the program and that kids your your friends kids in the program. So that word of mouth thing. I totally appreciate but I love the focus on at think media in particular and in language materials that providers can hand out because I think sometimes we all think we're interested in it, but we don't have the time to really contemplated some being able to take something with us and think about it more and be able to follow up with people. I think it's really great. And in the final strategy under the spp component is organizational facility development. This is just a continuation of recognizing that we need to help providers expand their facilities licensable affordable space here is really a challenge and so on WE this in our past and Levi we've we've spent about 6 and 1/2 million dollars with direct development on facilities development. And then also organizational capacity is something that we recognize that some of our providers can benefit from business practices. So short-term consultation on on running a small business. To the last three strategies are separate from spp, but fall within the Early Learning realm on the child care subsidies funds child care for SVP and pathway participants providing supplemental funding for the city's c-cap program, which is a child care assistance program for income eligible families on the rest of CCAP is funded through the sweetened beverage tax, but this is specifically for spp families are homeless child care program is an investment that is a continuation on with our direct contact with child care resources that over 15 years has provided Child Care subsidies for families experiencing homelessness, providing additional support in case management before then and finally our newest and strategies around family child care mentorship to end. This is a new program that were starting up with that will directly support our family child care providers and I'll talk about that in a separate slide. So just to summarize some of some of the some of the changes are differences between spp past and future so over the course of the seven years were going to be expanding by 65% to reaching up to 2,500 children by the year 2526 as I've mentioned earlier. We are on focusing on increasing or sports for special education and help and plan to expand our inclusion classrooms throughout the program. We are also focusing on supporting our dual-language Learners both in dual language programs as well as non dual language programs, but all we know that all of our program serve children who speak multiple languages special education inclusion program as we refer to it. That's the one that is through Seattle Public Schools. Yes, okay, but there are other types of classrooms that are not as PP plus specific Christ, right? Programs are open to all children. So there are kids with special needs in all of our programs throughout the throughout the city. Spp plus the one that's goes through Seattle public school classes in peace is the one that is specially designed to be an inclusion classroom where they reserve a specific number of seats for children with IEPs and and have a special Staffing structure. Great. Thank you. And also what you're going to throw our comprehensive supports we we will be supporting families experiencing homelessness at a at a higher level and it will have more resources for providers. I'm in finally just improving extremely streamlining processes for for everyone involved in terms of Eligibility and prioritization. We are really excited to open our eligibility for all Seattle three and four-year-old soap in the previous iteration of spp. It was only income-eligible three year olds and I'll be all three and four-year-olds. We're also expanding the free tuition fresh whole to 350% fpl previously was 300. So we're recognizing that childcare and preschool is is very expensive. And so we want to make sure to Seattle contacts into consideration and we are also prioritizing access for children experiencing homelessness or who are in the foster care. Animotica. I'm at 50% FPL. Can you can you just give us the hard numbers around that again? And I have to write a 350 for a family of four is 90825 + 300 + 70 is seventy-seven. So it's it's going to make a big difference or delinquent in tuition or a challenge paying it on a regular basis for those families that were right in that middle ground. And I'm assuming that the implementation plan will have what is going to recognize that we were expanding the eligibility to all of the three and four-year-olds and that we find the federal poverty line marker in terms of the eligible criteria service evaluation plan takes into account that there's this modification and we'll be tracking it. Correct gif And finally wanted to go to the the next slide please is around the family Child Care mentorship Program. So Seattle has over 350 licensed family child care providers the majority of whom speak Arabic or Somali. So because the fcc's are such an important role in our in our Early Learning Network in often, especially supporting families who are from immigrant Refugee communities. I'm deal has expanded purposely expanded our supports and we're working on developing a cohesive SEC strategy. So we commissioned to landscape Study last year to look at the our family child care overall in the city and we also assembled our family child care advisory Council that work throughout the year to offer recommendations and strategies to to best support them. And the the one thing that really surfaced from both the study and from the council is that family child care often are very isolated. Don't access the same professional development that centers can they have different hours. And so they need a differentiated approach to professional development and support and so we were really excited when this mentorship opportunity came up and and we are going to be working directly with C. Imagine Institute who is currently implementing and of a pilot of an FCC mentorship program through the state. I'm so we'll be working with them directly to Taylor at the Seattle context and will be developing that with with them as soon as we get started. Yeah. I don't think we can underestimate how important this body of work is within the context of our investments in preschool and early learning and we know we all know that we live in a child care desert, but I think part of that system is is the lack of people who are entering into this industry and and it's really important for us to play a strong role in. Making sure that we are I'm supporting people who want to enter into this space to provide these really critically important often times linguistically culturally sensitive type of learning environments for kiddos in in the city. So I'm really excited about this body work and I know that seems like we're having some good progress at the state level is well that will help us be able to leverage these dollars in a way that I don't think we fully understood when we first were developing our Concepts around 7 Institute at FCC mentorship program. So thank you for the work on this. Okay, here's what we'll do now is kicking back over to Christina for our K-12 community base. So sorry before you get started. I just want to do a quick time check. So we started at about 9:58. So you guys have about 20 minutes to you. I'll get through this quick them. All right? Stop with the goal for the K-12 phone. Can you baste Investments? And so really our goal here is focusing on students having students completing a high school students graduating high school. And what we're looking at is aligning our investments from K through 12 and making sure that students are on the pathway to graduate high school have experience as a present for that. I want to process our outcomes that you can see here in this slide and really I want to just start by discussing our outcome based approach that we have. We have a poor performance pay model that we and Compass what that means is that we really allow those School building leaders and the community who know what the issues are in their building the concerns and we allow them to design a proposal and up and design an application that's going to treat the solutions that they need an orange crate or outcomes. So we lead with our outcomes in our proposals. We do a competitive application. And as you can see here, we're all we want to ensure that students are academically prepared. All sins are academically prepared graduating high school on time called you here ready really invest in evidence-based promising practices as you'll see in our investments. We are investing in educator and divers find the educator Workforce and you'll see that some of our targeted approaches are about expanding learning time and called and career Readiness and ultimately with the fat Levy want to close up to Hangouts. So what we learn from our 2004 and 2011 Levi we wanted to gather the best practices that we found their what we found was that school-based Investments. This is our largest investment bucket and school-based Investments are these large Investments that allow schools the ability to design it up a proposal or Solutions and give them in a certain amount total amount of money to be able to implement those interventions. What we plan to do is fund five high schools five middle schools and up to 20 elementary school with in this lobby with that. These leaders will be expected to expand learning learning academic support and what that means is students will have that expanded learning time. We know that not all students can learn at the same rate need extra extra tutoring opportunity for our building design that To develop and come out causing her ready? The next investment strategy do I have his opportunities and access and so because we know that not all students that we want to Target with this Levy are going to be in those 30 schools. We have opportunity and access which allows a school that have a smaller ratio of Levi Focus students to to pursue some of the city investment and also achieving the out-of-school-time and expanded learning and College and Career Readiness goals that we have in mind there. Last but not least we have a wraparound services. And so we want to look at the whole student the whole child and we have Investments to support Family Support Services through Seattle Public Schools. We also have Investments to support homeless and Housing Services Port Services for targeting targeting doubled up students and in the future, so I will be getting to that. We also want to focus our investment on 4th and transportation and previous Levy's we've actually invested and targeted this intervention on middle schools which were continuing to do to provide transportation to and from sports activities, for example and provide coaching stipends last we have this new investment approach which is culturally specific unresponsive where we invest through mentoring and cultural responsive programming as you all know in the city of Seattle. We've got our best initiatives that prioritizes blackmail achievements were continue with those efforts and key and we also have our educator diversity Investments, and I want to thank you for some formulas for the Investments that you Sandusky funding and we want to continue with that and we'll get into a fight about that as well. I just provide a first-hand testimonial for a quick minute. One of the things that we really spend a lot of time and energy on as part of the levees. I'm reading and math interventionist for those K-5 students at somebody's got three K-5 students right now. I will not name her but one of the three girls that has had some struggles and doesn't consider herself to be a really great reader and that has manifested itself and have difficulty getting homework done etcetera Etc. But with the help of a reading interventionist this year she is now flip the switch and is reading constantly around the house homework has gotten easier sometimes as parents even well educated parents well-intentioned well-informed parents are not the best teachers because they don't want to necessarily look for me and I want to learn in a different environment but those reading interventionist for my family have made a huge difference in seeing that kid be successful. So unfortunately that doesn't have the reefs. Places to provide to everybody but we step into that space and I think that is really making a big difference not just for my family but for a whole lot of other family, so thanks to all the good work that you guys doing helping make my little kids be successful students. I'm moving on to these homeless Investments. We want to actually what we're trying to do with this investment is we've got 4.15 / 7 years and its investment. And what we're trying to do is bring bring up a prevent prevention-focused School District student score on Stapley house. So we currently want to do is the mckinney-vento law actually allows and has a very liberal description of students that are experiencing homelessness that includes doubled up student. So we want a Target or investment in areas where we see the need is not there is not yet met. So we're looking at parting with hsd on a contract to be able to serve those students and with that we want we want to work with an existing provider that hsd has and bring that type of service to the table so that there's a quicker service to students and families that are experiencing homelessness. What we know is that in the school's students are going to find a trusting a doll or may disclose that there Fancy homelessness. And so with that provider would actually be able to call a phone number to the service service provider and let an access someone that is trained and knows how to do the assessment for homelessness and be able to meet with a family that much quicker and so the key elements to this is within our investments. We would provide some emergency assistance funding for Valley Springs and homelessness that might provide some funding for emergency rent. It might provide money for because they're doubled up living with other families might provide the kind of funny that's going to help them to stay on stabilize or or move in with someone in the situation that's going to promote long-term stability in the school. The other thing is that we're going to be able to provide that referral and connection within 24 hours to three days with bringing an immediate provider closer to the school. What we want in our goal here is that teachers would be able to do what they do best, which is teach students and the throne. Out there trying to find housing support services for students. We know that the mckinney-vento office is very limited and there's a very high homelessness rate. We know each School in Seattle public schools has at least one student resource closer to the school. So that teachers can stay focused on teaching and if there's someone close to that to the families in order to get expedite this text support they need we're going to conduct a competitive RFI process using existing on City Resources with hsd and when families aren't eligible for the types of Port that we have we will be able to pipeline them into City or skinny City and Regional efforts for homelessness. And you didn't bring in the past in our conversations. You've been using the flowchart to sort of compare and contrast how the current system works and how this particular design is going to work. And I knows that you didn't include that in your presentation, but I will make sure to if you could follow up with us and make sure that I like that and future presentations for Council Members. I be really helpful cuz I bet I do think it's a lost relative of our principal concern is that we want to make sure that that students and their families who are experiencing housing instability are going to be able to have maximum ease of accessing service is available here, which is not currently what is occurring per se and an in large part. That's not not because the school district in others aren't committed. Providing services to the students as just by virtue of the horrific underfunding of the mckinney-vento program that is really put the school district. No position to to have folks in this position to our between multiple jobs with very little funding. So I think it's really important for us to show how we are going to approach this design to really best support some of the systems that currently exists within the school district to allow batteries a better and easier access to some of these critical investments in the more efficient process not so much for your navigation for the families in the sincerity and a big big change. That is it. We're going to have folks service providers going to families as opposed to the other way around which will be really I think a key Improvement. Next I'll discuss our educator diversity Investments over the course of seven years were going to be at investing 5.28 million or 5.2 million over the next 7 years. And this is building off of an existing contract that we have with Seattle public schools that we hope to expand. We saw some great results. So investments will serve diverse aspiring Educators with the prioritization for multilingual black African-American males ultimate goal is to diversify the educator Workforce are being represented Seattle Public Schools only about 19% of the educator Workforce until the public school is is represents them. And so dedicated to doing is pursuing a contract with Seattle public schools and was community-based organizations. What we have found to be true is that students that are that are pursuing education degrees in education careers. A lot of what happens for them is when they just don't know how to navigate they don't know how to get into those programs. And so we're looking at building a tiered approach for students at 4 current practitioners that are in their instructional aides that need an AA we have a pathway for them for those that need to be a bachelor's degree have pathway for them. And for those that need a master's master's degree. We have a pathway for them. So we're really hoping you know, I'm building that skill-set. We're expanding our class to Start program that's existing that's been successful for us across the way at War really focusing. Is it on a funding an s e that's going out to the schools and targeting students and being able to identify students in the schools and targeting those that are multilingual and aspired to become future Educators and Advance their careers. So we'll be providing tuition assistance and I call it culturally responsive retention support about cut because what we know is that for people of color that are in Teaching and education professions. There's this invisible tax of being the know-it-all of diversity. What's Randall schools that are predominantly white and so we want to be able to provide that identity development for future teachers as well as their teacher education development. We also have embedded in their mentoring opportunities and coaching a professional development opportunities in line with existing sale Public School efforts crate. I just want to take a quick little paws. So we have some special guests in the audience this morning. So we have a students have just walked in from the tops K-8 through 8 school, which is located in Eastlake so high everybody, how are you doing? There's your touring as City Hall learning a little bit more about how city government works. It just so happens that we are having a presentation about Investments that the city of Seattle makes in your education through r r a levy program. So really excited to have you all visiting us at City Hall and really excited that you can pop in for just a moment to hear about some of the work that we're doing here at the city to invest in your success in your future and what we're hearing about now is how the city wants to make sure that your teachers are are more diverse meaning that they they look and represent you culturally and linguistically and really excited about being able to tell work on those issues. So, I don't know if anybody else from either the school district or deal want to give some welcoming remarks to Our Guest. Usher I mean, I always love our work is never misses an opportunity to congratulate you all for taking this opportunity to come down and they learn about City Hall in the government. You guys will be extremely impressed with what you see we have two amazing of council members up here that are passionate about education that are making sure that that she mentioned that I'd only teachers represent that look like that look like you but also that we are supplementing and complimenting the work that you are the services that you need within school in order to be successful. So looking forward to learning more about what you guys are doing in the end and when you get to high school just know that you will have a two free years of college paid for despite whatever high school you go to so really encourage you to take advantage of that opportunity, but welcome to City Hall. Let's have a round of applause for the students. I apologize for the interruption towards your presentation time. That was perfect because we were actually concluding on this slide. Is there any questions that? I don't think I don't think so. Thanks. Okay. So what I'll take us through a quickly of our our our K-12 in school help you'll see what the goal is. Ultimately we want to make sure that our health Investments are giving kids an opportunity to have access and utilize physical and mental health services that's going to support their learning. You'll see our outcomes up here. We're making sure that we are race-based opportunity gap for clothes want to make sure students are healthy and ready to learn. We also want to make sure that our Teen Health Clinic. I'm sorry student base health centers are evidence-based and provide high-quality and culturally responsive Equitable care and most importantly want to make sure that the providers Implement a best practice role of a model of medical and mental health care, which is extremely important to our young people in schools. We have four strategies that were focusing on throughout the healthcare. I won't go too much into them, but you'll see as I just mentioned as far as the school-based health centers, the two strategies below are very important to the success of of the schools. We also are looking at what I'm talkin about school-based health centers were looking at providing some seed funding for expanding its next year Middle School Robert Eagle staff in Lincoln High School. Those are the three new schools that were looking at expanding student-based health clinics to we also have some seed funding for renovo that were working right now with Nova in and provide us to see how we can provide support their I wanted to touch base on that. We also provide support or additional services for school nursing. We want to make sure that something that is compliant with the spade and and students have an opportunity for me. No lies. Ation shots are my favorite always have a favorite in all of these but my favorite is the oral health one. I'll just keep reflecting back as a high school principal or remember certain parts of the day the dental bus with pull up. I'm using the correct term for its but the the dental bus will pull up in the parking lot is students will be able to run out receive services are definitely going to I'm continue that strategy and then the last one I'm Health Systems enhancement is opportunity for professional development for medical medical and mental health providers, and we're also I'm providing a bit more web-based mental health monitoring and feedback. So that is just a high-level overview of our K-12 Health on front the strategy was super excited about them. And my last Light are really are just wanted to highlight 2-2 you all and in the community and enforcing Seattle our upcoming in event. We have a community outreach event later this evening. I'm at the Youngstown. I will be co-hosting that with arts and then we'll have a few more all throughout. The other district will have one on 19th and Magnolia library and then we'll close with the one at the University Heights. I'm coming up in March. So just wanted to share this it and hopefully folks will come out and join us in and I'm learn about all the work that we're doing. When was referencing obviously School nursing and school-based health centers are very focused on the building. Whereas as he so rightly pointed out our dental and oral health care is a roving facility. How do we choose wear robes to and when it's there. Model over the last seven years and really holding it on how they're approaching and partnering with each of the school that they're in the support that the Levee provides them allows them based on capacity to serve about 10 of our existing School based Health Center. So I want to be clear that not everybody is served by Levy dental service. But the mobile van that. Is regular Chappelle mentioned is actually operated by ichs another provider with a different set of funding. So they're all so serving and providing Dental Care to all of our students in Seattle schools those that have school-based health centers, but that is not Levi funded. So partially it's about a decision around who does what service in what areas and the partnering organizations in the school-based health center providers sponsors m in terms of how Neighbor Care has chosen to do that all of the schools that have school-based health centers have access to direct dental care on site. Okay. Alright if there's no other questions on before we close. I just wanted to also think Michael Stone from coming up here being up with us at the table as PS4 for Michael for many times what you want to thank you for coming up. Okay, so I don't think there's any other questions I want to thank you all for the work that you've done to get us to this point. And I think you've given us a lot to think about and consider and I were excited about digging into this body of work with assistance of essential staff to really make sure that we get this implementation and evaluation plan on the correctly. I know that it is a oversight committee and that we have a letter from them giving us an indication of some of the things that they like us to continue to work through as we go down the path of our legislative process. So I'm really excited about the opportunity to take those recommendations into consideration and to continue to work with the department and with our partners at the Seattle public school district and with our partners at the public health Seattle & King County Public Health to and Seattle colleges to make sure that we are all on the same. The process we will take up this topic of the implementation and evaluation at here in council chambers that will be an opportunity for council members to hear from our Central staff around a variety of issues that they have begun to identify in some for my direction of the part that they're in in their own due diligence of the evaluation of the implementation and evaluation plan. We will then expect council members to submit any potential amendments to the proposed implementation evaluation plan to Central staff by no later than April 2nd 2019. We will then have a special Committee hearing of this committee on April 18th at 2 p.m. At where we will consider any amendments to the Implementation and evaluation plan and potentially vote on those amendments. We will also I hear a friend deal about the partnership agreements with our various Partners who we work with to do this work and have a possible vote on those partnership agreements if we're ready to do so and it's my hope that we will be able to get the entire implementation evaluation plan as amended to full Council by April 22nd of 2019. So I really appreciate your your flexibility and understanding and needing to have a slightly modified activity schedule for consideration of this. I had some some family commitments come up the week of April 8th. So I really appreciate your old flexibility in helping me fulfill those the family commitments by being willing to have this work get done just slightly later than we had anticipated. So I appreciate that. Alright, thank you so much for being with us. Okay. We are going to hear from our can we hear it? Like right on X amazing. So we're going to hear from our and second presentation here. Thank you so much for being here. We're going to hear from the Seattle Police Department now. So Roxana is going to queue up the presentation and I'm going to ask that you are by Chris. Thank you for it. Doesn't matter where we want to be. You didn't you didn't you didn't come with a Entourage today. It's just you. I want to read this item into the agenda and then we'll go ahead and do introductions and then Crystal handed over to you and you can walk us through your presentation Seattle Police Department shots fired data and gun violence response for breathing in discussion. Awesome and we go ahead and have you introduced yourself for the record. I thinking good morning Madam chair council member Johnson. Thanks for inviting the department to be here today to discuss this important topic of gun violence and what SPD is doing in partnership with our other City agencies in the community to reduce these incidents. My name is Christopher Fisher and the executive director of strategic initiatives for the Seattle Police Department in this role of the Department's data analytic efforts as well as our research and policy engagement. Thank you so much. I'm really excited to have you here with us this this morning. This is something may have been the terror of Public Safety is is inviting the sale Police Department to come into committee and and just give us a sense of where some of these incidents are occurring and then also give us and the public a general sense of how the department is addressing some of these issues. We understand that gun violence is not just a issue of Public Safety. It's up. It's a public health reality and the city of Seattle in partnership with the police department has really taken a public health approach to a lot of to gun violence in general and so really want to be aware that today's presentation is not necessarily seen squarely through that that holistic filter, but it is an opportunity for us as policymakers to get us. From the police department in terms of where some of these issues are occurring throughout the city had to give us and you know, the better a set of data that we can rely on in terms of considering approaches for meeting the safety needs of Our Community member. So I really appreciate you being here. Just go ahead and get started. Yes, please. So to begin with in 2018 be actually saw some very positive results from both the ongoing prevention and engagement efforts that the Department of Public Health perspectives that you just mentioned and some of our enforcement actions during prior years with a paid-off specifically as you can see on this slide 2018. We actually had the second-lowest year in terms of shots fired since we began track these data this way since 2012, which overall that means we have 13% fewer reports of shots fired in 2018 compared to 2017 additionally was actually the third-lowest year for fatal shooting. So what this data is looking at it includes shots fired, which is when there's a report of someone heard shots fired in either. There's an eyewitness or there's evidence of property damage your shell casings were found. If someone says, I think I heard gunshots and we go to the scene and there's no evidence. There's no eyewitness. That doesn't count. There's also then showing non-fatal shootings were Someone is injured as a result of gunfire but is not killed in the Fatal shootings are those where it is a homicide as a result of a firearm. We do not include in here self-inflicted suicide or officer-involved shootings deserve that the criminal incidents when we talked about shootings and shots fired. The department does track those incidents where somebody is using a a weapon to free herself inflection or otherwise different additionally. It was also the third highest year for non-fatal shootings, which is that it's a good trade-off was not a higher for people being killed there were people who were hit and saved and we distribute a lot of this says you look good research around the country to the ever-improving trauma responses, especially as a place like Harborview is one Standouts what cities around the country there was a lot of change in the survivability of gunshot wounds, especially following some of the military engagements over the past decade or so a lot of improvement in the technology to help people if they have been shot. So that's when they when people are getting shot fewer people are being killed. A lot of that goes to the great surgeons and others at Harborview and it's also important to note that later slide and we'll get there but in 2018 SPD also recovered about 10% more firearms from the street. Now that includes a wide range that people voluntarily of paranor relative died and you don't want it. They had a collection and you don't want to deal with him and you turn him in that also includes finding them finding them involved in criminal incidents, but we did we were recovered just over 1,400 firearms return dinner taken by the department, so it wasn't increase and think Anytime we have fewer guns that could potentially be illegally used out on the streets that helps contribute to the reduction. We saw in the shots fired. And then another thing that's on this slide and it's a little hard to see on one thing. I would offer to you. Then. I'm sure or any of your colleagues is easier to do the sort of briefing across the street in the department behind like our security firewall cuz we could drill into this a PowerPoint is not the best way to zoom in on where stuff is happening at the neighborhood level, but we gave it our best shot here. And if you are looking at it, I live and not on the screen and you can zoom a little bit on to the PowerPoint, but we tried to look at where things happening geographically excrete. We heard that request from your office and we looked at this over the past seven years. That's what that sort of heat chart on the left. And the math on the right or showing is those are the top 15 neighborhoods across the seven years if you total them up in the important thing really to note here, is that while you're the year, you might see some variation in who's in the top generally Rainier Beach the Central District Brighton. Dunlap and Rainier view or all consistently sort of in that top that style of those. We are micro community policing planned neighborhoods, which is what these neighborhood names come from their 5758 depending on how the community feels from any one year to the next about how they want to organize themselves, but generally those for 5 or somewhere in that top 10 and consistently when you go across the seven years you see Rainier Beach is number one with shots for the in central area and the ones I just named but thanks to a lot of concerted efforts to address in some of these neighborhoods Gang Related violence in some neighborhoods sort of ongoing a fuse between people who I wouldn't call it gang. It just territorial group took me away every language you want to use but not sort of the formal definition of a gang just disputes going back and forth and a lot of working with communities in some neighborhoods. We'll talk about in a little bit have seen from the high. Is it 14 and 15? We've all experienced generally a trend down in terms of how they're experiencing occurrences are reported occurrences of gun violence, and we know there's more work to be done. But most of these neighborhoods seem to be on the right track. You can see in these data an uptick in The madrone Squire Park area. If you could draw down on this what you would see is a lot of that happens on the boundary of the Central District and Madrona and which is an artificial boundary in the neck in the mCP process. We had to pick up really loud as boundaries are defined by where census blocks and it's just a way to help with G is geospatial mapping is to keep things all of the same level. And so if you moved that boundary down a block or two, they are up rather North the block or two. They would be in the CD here are there in Madrona if it's if that area so I wouldn't get too hung up on a particular neighborhood is up or down when we know by Drilling in it's an is an area of The city it's just the way we're aggravated out by neighborhood shows. There was an increase in in the madrone mcpp, but it's really right on that border between them and the CD is this data. I know that the police department has made a lot of progress in in making a lot of its data very public and accessible. So is this is this shots fired? My neighborhood map is that is that a widget on your website that people can access for lack of a better term or two members of the public who have interest in drilling into their particular neighborhood. How are they able to do that? So right now this is only an internal dashboard. And the reason for that is this is not natively coming out of a record system a detective every week reviews all the incidents that are that could likely have involved gun violence or do you suppose Firearm and she refused them and codes them and tracks our quote-unquote shots fired at the end of this month. We're launching our new record management system. Thanks to a lot of support from the council and the city and that's going to make it more active and live. So it's not going to be so dependent on this weekly review on an updating of it are our plan and hope is to swap this out to be a public version. It won't be as detailed as most of our public-private sort of internal external dashboards to be no want people to drill down and know this happened at that house for privacy reasons, but we do when I have the shots fired publicly right now, they're inherently in the homicide and assault data. If someone was hit the just the criminal shots fired would be hard to find in our public crime dashboard, but we do want to have a public version of the shots fired. We do know people want to see this it was just right now too hard to Speed that system from this manual process but moving forward will be able to appreciate that. Cuz one of the things that we've been talking it to the department about is getting this more specific shots fired by neighborhood map because it's a question. We get a lot from constituents in terms of will where are these things happening in the city wide lens as opposed to really getting into the granular detail of where we seen some of the the trends occurring over a long. Of time and I think this is a much more helpful tool for for us as policymakers looking at Public Safety Public Health Investments to address the trauma of gun violence and and in trying to figure out how we can go further Upstream to prevent these things from occurring is an absolute priority for for us and then I think a lot of news for more Public Safety oriented folks really have Tristan is information to see how well the city is responding to those particular needs as well. So I appreciate you all taking the time that it requires to really drill into some of the data to generate this kind of mapping cuz I think it'll be really really useful in the future. Additionally one other point to know from this slide is you can see if you if you looked at it in a slightly clearer version that on both the North Gate and South Park in CPP neighbor, is it actually sort of gone against that trend of coming down from 14 and 15, but through some really concerted efforts specifically in South Park. I think a lot of leadership from you madam chair and then councilmember her ball to make sure that we hear from that neighborhood a lot when they have concerns that ain't working with that Community with the Southwest Precinct command R Clapper to policing Bureau who does a lot of work through Community engagement and youth engagement of the neighborhood South Park is actually really seen in the past year a great production. A lot of that was addressing some problem locations that were consistently experiencing gun violence and a lot of work, but from across the city and the Law Department in a bunch of folks helping to address those locations, but we've seen a turnaround there in South Park. Continuing to focus on what can happen around the Northgate area. There's a different type of issue but that is definitely on our radar that those are two neighborhoods who saw a slight uptick sand 16 and 17 and we're really trying to turn that back down a little bit. Going back and forth. If you will between the Thumb locations, are we seeing success of similar micro policing in one neighborhood and we're just kind of chasing it to a different man chasing a bank. Talk to me a little bit about what's going on there. I can't say specifically for that neighborhood. I'd have to talk to the the folks on the ground about what the dynamic is in that specific area. But I do know generally from the research you don't tend to displace and gun violence this type of violence tends to be associated with a location that is attracting. So if there's a feud with where someone lives or a block that someone quote unquote feel they own or control most of what my memory and this isn't a sort of operational perspective but in the Beacon Hill area, it has been there was a there was one or two houses were there some consistent involvement and we've tried to address that and I know we've heard from community members about some of those locations, but I have to get back to you after talking to folks probably in investigations about what they really think is the issue there. All right. Pastor speaking of other neighborhood information of this is something that actually in one of our most recent hearings with you. There's a lot of discussion about one in information from the council District perspective. This is now on our general crime map up on the public data. You can see the Major Crimes by Council district and so here on the left. We just looked at the past two full years of shots fired by Council District just afore that perspective on the darker the gryon it the more frequent the report of shots fired over those two years and then some people could see really within that if you sort of good overlay them in a in a transparency on the right is the more traditional hotspot or density Maps. Where as you go from Blue to Yellow to red red is where the most frequent across those two years it really what we see here is you know, if you added more years on it would really distorted getting noisier you'd see more distribution of dots across the map. But those hot spots would be pretty persistent up and down MLK along 23rd. And union for those two years South Park definitely popped but is quiet it back down and then around the Chinatown ID Pioneer Square also in the past year or two Us in those two years that I have a spike in terms of density of her all you don't see here, but you can it doesn't rise to the density analysis, but you can see visually there's a little bit of a concentration along Aurora if you follow that straight line to the dividing those mcps and along Lake City Way and a small little cluster in the U District which were all things that really aware of that. We have seen a little uptick in those areas and there are operational plans in place trying to address what has been driving that some of it has been just completely for lack of a better phrase random buck that they've happened in the same neighborhood there hasn't Sense that there was a particular reason why it was happening in that area. It's but other other attractors of crime can sometimes bring with them also gun crime? That was the point in the slightest when to see if any questions before moving on. So it's like three we took a look at last year 2019 the demographics of those who were involved in these incidents be they known victims or known suspects. So we had 79 incidents in 2018 where someone was injured by a gun or killed and demographics for we have demographic information on 84 of the victims and a hundred and three suspects at the time of the incident since some of these data were pulled obviously investigations me of her cover uncover more but this is what we had when we started pulling these data and generally regardless of the year that you look at if we have done this for 17 and 18 the scale would be different but not the pattern victims are split between being young adults sort of in the middle age bracket of 3249 suspects when we know who they are. They they are definitely trending younger on that 18 to 29 that that's not you need to Seattle. UC nationally who tends to be involved in gun violence for a variety of reasons it is that 18 to 24 25 29 age group, but we see that play out here and obviously a good number of unknown suspects which is always something we're trying to drive down victims and suspects are predominantly male. I also not a surprise when you look at local and National Data and the racial demographics are actually short proportionally fairly close to her a few categories. If you turn those numbers into percentages of totals or percentages of the column where they'd be off 3 to 5% but generally the demographics of who is being the subject of a victimization violence or inflicting are the demographics are fairly similar in end. And is it your sense that that's consistent with sort of the national Regional Trends as well depends some places. It's you're going to see how much a different makeup just because it is there's nothing startling their troubling. Thanks, but nothing startling surprise us sort of the disparity in the victimization and the suspects but it's not something that is out of the ordinary when you look at National Data and helpful for us to get a better understanding of what kind of programs we need to be investing in on the on the community-based side to make sure that we are supporting interventions that are squarely focusing on younger male and folks of color to really be able to interrupt some of the violence that we're seeing happening within our communities that are also inflicted with communities. As you said earlier met him her so much of that not a law enforcement. That's it's it's a symptom of broader disparities on a whole variety of factors. And then this this light is really just to give sort of an update of house 2019 looking so far. So we actually pulled this to get this ready through last week's update but it actually has been there's a little bit I have the numbers from this week that they're not on here, but we do know that January of this year was us up a little bit from January of last year last year was fairly quiet January this year up to a little bit but then definitely came back down in February tribute a lot of that to the great work of the department also save me a really interesting weather in February would probably didn't hurt the case. I know lots of cities when you when you have extreme whether it can you play out that way? I know Chicago when they had that super cold snap had very little and Ethan Dolan's -20 there. They had a pretty quiet week. 47 this is 41. That was last week this week through Monday. We had 47 compared to 43 in 2018. So the the Gap got smaller so definitely wear trending fairly close to the sort of close to record year. We had last year in terms of recent Lowe's. So I think things are continuing to look good in terms of where the incidents are occurring and I'm from geographically just looking at where the dots are. The only thing that we've really noticed that's unusual in these Trends is a little bit of an uptick in the number of incidents around the U District and that mcpp the tissues around physics word of down MLK and there were near area along 23rd and Union as we've seen in the presentation that is historically where we have the gun violence very little in the southwest Precinct in Manning. Just one in South Park, but small. Cluster around the U District no real definitively say no real connection without having someone from investigations here, but for my knowledge, it's it said it is more sort of it not an ongoing issue, but sort of one-off issues that they're very aware of here and let you know. I just want to recognize that we of course want to be able to live in a community where these numbers are pretty close to zero on so, you know, even even one death as a result of gun violence has too much and an absolutely preventable and so we obviously want to get to a point where we see much smaller smaller than what we have here. But why don't you recognize that these numbers are important and significant because it's somebody's life. That's me. Impacted as a result of gun violence really want to acknowledge that Seattle is a little bit of an outlier in the sense that as compared to other major Metropolitan city is like ours. We we fare much better in terms of this particular issue than others and maybe you can talk about that a little bit more ads for the National Police in conferences or any of analytic get-togethers and I've gone and then sort of training. So the work that we do really run these dashboards and the great analytics at the team does and they'll show sort of the shots fired map and they'll be like wait that's that's for a whole year or like the note say how many homicides did you all have in will see him anywhere from 20 to 30 in the liquid for the whole year. So I do think through a variety of reasons I think from a very strong and in Community for my department that tries to keep a connection to be able to hear what's going on on the ground through some really good new legislation and regulations around the gun access and storage and other issues and just arrived a lot of things into perspective to the city's taking her from that public health perspective that we are very fortunate to not have I think equal to a lot of our sister cities that are our size and sword are Dynamic the the level of gun violence that they do have been as you said, you know, any of it is too much but I think through a variety of factors. We are definitely on the the the middle to low end of the person crime in general but definitely on the gun crime specifically not just in the city of Seattle, but as as a County as well, we have strong Partners in this base with with King County, Oregon County Council Lincoln County Executive Dow Constantine, very Very very strong Partners in making sure they were looking at this as a regional issue because when we dig into these numbers in the reasons why a lot of this gun violence is a friend and who is committing it often times. It is from throughout the region and outside of the literal borders of the city of Seattle. Of course, we do a lot of Public Health work through our Seattle King County Public Health to really again build an ecosystem regionally is Route the state to to really make sure that we're pushing all of the different pushing and pulling all the different lovers that we need to in order to on to reduce gun violence as much as possible within within our community has a really proud of a lot of the work that we've been able to do around extreme risk protection orders in an experimental in that and space and an Innovative in that space in a way that is really creating an impact. We on our legislative agenda for the state and federal government every year. Have a sweet of her priorities related to as sensible gun reform laws and safety legislation hear the city of Seattle. We've done a lot of work through this committee answer Pryor iterations of this committee on sensible local laws related to to firearms and excited to continue to explore other potential opportunities this year in that space as well and really just appreciate the Department's willingness and change in mentality around making sure that that we are utilizing a public health plans to address this issue and I think that all of those things combined together with Investments and community-based organizations who are trusted allies in this work as well and all of that together results in an environment where we can have some of our counterparts cities sort of standing How relatively speaking a few shots fired we have in our city as compared to other major urban areas. So when I think the department for that work cuz there's nothing I was going to ask you a question Chris about the u-district itself, you mentioned and the chart shows that we've seen a higher than usual amount of shots fired in the U District at what point does the department take that data and realize that that trendy looks like it's going to continue that it's not in your words would have went off but instead is something else brought all this happened in the neighborhood at what point do that shift happen and what are some of the strategies of the department then uses in order to decrease incidents. We look at this data gets updated every week. But anytime there's a shots-fired there's a significant incident report that goes out to Command Staff and captains. So people know and stuff happening and then it's East at every two weeks. That's definitely going to be if there's been a homicide a shots fired in your Precinct as the captain you're going to your know. You're going to get asked about it. What do you know about it? You're going to ask investigation what's going on? There is a part of the trend. So I mean the department takes any issue of the illegal use of a firearm through the top priority and that's good. That's brought up consistently in between the definitely at the sea staff management meetings where the the precinct captains going to brief on what he or she knows and then investigations will say I was just part of a trend we think this is something that there's going to be retaliation. Do we need to put in something to quiet it down. Is there a problem location that we need any other dealing drugs and that's attracting the violence and we need to shut that down. So we always have that that problem solving conversation and it doesn't take the third shots fired. I think every time there's a there's going to be a different way to if it was someone heard it and then we found the shell casing and there's no property damage. No one has heard there was no Maybe someone fired stupidly into the air or whatever that that's going to have different than if it goes into someone's house or someone gets hit that's going to obviously get a little bit more of this right then and there but even if there is in that weekly review of the data that seems like a weird we are trending for having a lot of even if no one's getting hit or property damage does shots fired in a neighborhood that's going to come up and see statins going to kick off that problem solving conversation around what's going on here. What can we do to quiet it down? And we also routinely quickly than hear from any Community. Hey, we're not used to hearing this weird to hear these but it seems to be happening more frequently that stuff normally come straight to the Chief and to the precinct commander and that kicks off its own series of events as well. Just be helpful for me to have a follow-up conversation about what some of those answers have been in response to the first three months of the year and a higher density in the force. Speaking of responses so quickly to run through sort of what we're currently doing those sort of long-standing and not end recently new and them what this word of on the horizon. So speaking from the perspective of you know, it's a public health issue as well as we're not going to be able to solve this without the community support. A lot of our efforts are really focused around Community engagement and how they're both can be advocates for us. They can help solve the problem and also in times when we need the support in the trust, they provide us the information to get the dangerous weapon and person using it off the street so through a variety of the task forces that the city has we are, you know, the department makes use of alive and free which generally for those who don't know what that is. It is in the model of sort of ceasefire of violence Interrupters. It's get there at get out on the street when we know there's a concert going on and let trusted community members try to Tamp down the temperature get people to put the guns down that model has worked across cities in the country in terms of helping to control gun violence. We routinely partner with the US attorney's office who is The vehicle for the project safe neighborhood funds from the federal government. We are working with them and the Department of Correction to focus on folks coming out of d o c or high-risk and Alan to participate and gun violence or are thought to be on the route to potentially engaging in violent to try to do a lot of sort of custom notification or direct deterrence talking to them. And this is very much along the lines of the worth of David Kennedy and others do around know we know you're here we can get you Services. We can hook you up with access to jobs in treatment and hot like but if you use a gun we know you're one of the folks was going to be using a gun if it happens in this neighborhood and we're going to come straight to be early on the list of the people we come and talk to make a choice here. We can help you or we can keep her eyes out for you if violence does happen. We work with the United Life Christian clergy in Seattle link on the comprehensive game model. To really bring in all the other resources to really on those and that's a lot of focused on getting preventing people from going into that life. So to speak to getting involved in gun violence Burbank participant in the are best initiative in terms they are very reverse mentoring campaign. And then if the youth opportunities initiative from a crime-fighting perspective on more traditional, we are a member of the regional gun crime task force, which is our model of the best practice National Crime gun Intelligence Center. So basically I just means we participate with all of our regional partners and when we find legal use Guyana or shell casings, we enter that information into the national integrated ballistic Information Network to see you know is has this has a gun that we have or the gun that fired the shell casing we have is it been used in other incidents that allows us to start linking cases connecting and solving more cases of this incident. Same gun was used in the same incident and starting to build that that that picture of where our guns moving around the the community and how are potential offenders working around the community. I'm in 2018. We are 237 new hits in that system and 123 of those linked to SPD cases where we had evidence in one of our cases that matched up with the night in evidence shots fired that gun that produce the shell casing was linked to an I've been had so just depending this really adds the information to the work that are investigators do to try to figure out who's pulling the trigger. Where are the guns coming from a man who's using them? And then as you mentioned a lot of great work in this past year through the red flag law of the turbo the extreme risk protection order and the domestic violence protection order teams in 2018 in the ER botim. Assess 2080 incidents are individuals. They did 32 urbo petitions 29 of those they were granted a full or bow and have seized in 2018 BC 79 firearms from 27 individuals. And then the domestic violence team recovered 137 firearms in 2018. Most of those are voluntary compliance. They are your weapons in the person does that are Pros are obviously a different situation where somebody is at risk of harming themselves or others and we go in and sees them all all under due-process all through judge, but we had some of those National meetings. We've had a lot of cities very interested in this urbe work that we're doing and it's definitely expanding across the country in a lot of folks are looking to Seattle for how is this working with lessons have you learned so it may I think the team here is an excellent work and people are definitely interested in talking to them and see how that's working. There are there 79 Firearms. He's from 27 individuals my colleague over here. It is much better at math and I am did the division and that's about that's an average of three firearms per individual. Although I'm sure that when was this one was a substantial cash a story of one that had that a significant portion of those on 1% So this is a mean we know that most victims of gun violence and death in particular are in the arena of domestic violence. And so I just really important for us to continue to highlight the word that we doing here in to support this work of the police department to recover those firearms and get them out of hands of really dangerous volatile situations, but of all the information that I've seen that is the area Regrettably Firearms are used most successfully meaning that somebody actually is murdered in that context. If there is a firearm being used so really bad trending in the right direction in terms of getting those Firearms out of the does volatile situations are federal Representatives, cuz there's a potential bipartisan bill. I think it was part of the Omnibus and it might still be getting worked out about sort of incentivize in jurisdictions to do this across the country by giving them support for these teams and we pointed out that we did this team with no support. So how about don't disincentivize those who don't do it reward those who've already done a little bit. So hopefully they'll find a way to throw a little a little support cuz it that was something where we had to be pulled folks for a very good reason to form this team, but they're they're not doing other stuff now, so give me a little support from the feds if they're going to give support to other people would be great. And then some other things were continuing to do we have the ongoing collaboration with the King County prosecutor's office wear their analysts are working with all the other police department so they can track shots fired like we do for the city. They track it for the whole County. We work with Harborview and your injury prevention. Dr. Ali and others around Hospital based interventions. We obviously the chief is the rule-making Authority for the new safe storage law that the mayor durkan and the council move forward and got into place and we're also going to be working with it to evaluate. So how does that work? We're working with the Washington DLC 2 as part of project safe neighborhoods and just other ongoing work to really Outreach the high-risk offenders who have been you know, when to use guns in the area and just an important points in no doubt that the department the investigators, I think from that trust that a lot of them is filled with the community. We really have annexed generally an above-average clearance rate for homicide. Nationally the clearance rate for everything that chick Lisa homicides over the past 10 to 15 years has heard consistently Trail down. If you look over our past nine years are average is at 68% We've been some years at 91 year. That was 47. I think if I remember correctly that pulls that average down but generally we are far above the national average of 60% Would you think that speaks to the great work and relationships that are investigators have and then stuff that sort of on the horizon the Arnold Ventures formerly the Laura and John Arnold Foundation recently partnered with ran to launch the national collaborative on gun violence research and they're doing I believe three rounds of giving away $50. The on 7/9 are 7 different research tracks and we had four research teams asked us if we would be partners with them on some proposals. I don't know at least one of them has already been told to proceed with Stage 2 of putting together a formal proposal and I was looking at the effect of verbose. I think you were a prime a prime place to generate knowledge in that area. So I hope that gets funded we continue to help with the helping individuals of firearm injuries research committee out of Harbour View and we are also working with the Washington Alliance for gun responsibility and criminal justice researcher to do with a lot of other cities have done and look at Arne Ivan Trace data to develop a picture of where are crime guns coming from and how are they being used? And so we're working with them to sort facility at that relationship and get that report done. So this stuff we're doing now. Any questions, thank you so much for putting together a very thoughtful and thorough presentation. I know that the department is is increasingly data-driven particularly in this space. I really appreciate all of the work that you put into making sure that that we and the general public have access to this information and really appreciate the department continues to do to reduce gun violence as a good partner with community-based organizations and really look forward to hearing some good results on some of the potential research worked at identify other best practices to continue to see Improvement in the number of gun violence incidents occurring in our Okay, great. Thank you so much for being with us. That is the last item on our agenda and there is no more business before the committee. So we are adjourned.", "end_time": 7730.0}]}