{"format": "raw", "annotations": [], "confidence": 0.9304273532724928, "data": [{"start_time": 0, "text": "Regular regular schedule plus Community is on Wednesday, June 5th starting at 9:30 a.m. Here in council chambers before we can we not have to approve agenda for today's meeting if there's no objection to today's agenda will lead them to be adopted. You're none today's agenda is adopted. At this time, we will take public comment on items that appeared on today's agenda. We have 10 minutes a day for public comment speakers limited up to two minutes of public, Niva speakers commented season 2 minutes of microphone. The microphone will be turned off because are asked to begin their comments by identifying themselves and the agenda items that they wish to address as a reminder public comment is limited to items that are on the agenda on the agenda or within the purview of the committee. So first on our list is Ruth dinner president of the save the market entrance for the design review forum. Yes it thank you very much. Can you hear me? Okay, can you speak into the microphone? Can you hear me entrance. Org and I'm here today to talk about the need for design review reform particularly as it relates to the CPAP process right now our current process puts the cart before the horse. We consider design aesthetic design in the design review process before staff has had an opportunity to complete the Sip a checklist which considers important attributes of the built and natural environment and before Sabbath had an opportunity to review request for waivers and departures to put aesthetic design before functional design is Impractical. It's like I need the foundation picking the paint color as a priority before you plan the foundation. So I would like to know when this committee will be considering new reforms for the design review so that I can come and participate at that time. I thank you for your time. And also thank you so much for your thank you. Next on our list is ringing. Thank you very much. Very briefly. We're challenging Tower at 1516 2nd Avenue proposed Tower. It would Loom 500 feet above our Historic Landmark and put it in a 100% shade in the afternoon. It would overwhelm our Ally and create tremendous traffic problems and public hazards by appropriating the alley for public for its own use as its entrance and it would make it into an unregulated Street. It is wise to be out of proportion to the rest of the neighborhood were this many historic buildings and 2 years ago the design review board rejected a proposed building for this site that was half the size of the one that's currently being proposed and that the design review board unanimously approved. Arc point is that the early this Outreach which this was the first project that was required to do didn't work the developer had its way. During the early design review. The review board was totally uninterested in hearing public comments and did not take into account 275 page documentation of the problems that we submitted to the review board. thirdly the review board approved this and as a result of it. The project is now vested with the City without having taken into account at all. Its functional requirements. This project is way out of scale to the rest of the of our neighborhood and it is not scaled to the infrastructure that through the neighborhood offers nevertheless. It was approved automatically in the early design review really design review is arbitrary capricious and results in unpredictable outcomes. It has to change. Thank you. Next is Steve, Gillespie. Good morning, Steve Gillespie from Foster pepper here for Seattle Pacific University to text and then I want to thank the committee for taking up our billing and thank you in particular mr. Chair for jumping into the deep end of the pool and serving on this committee. This is a big challenge, but I really appreciate you stepping up when the city needed you. This bill has been more than two years in the making a closer to 3 by the amendment that we proposed implements a comprehensive plan change that Council approved in December and in the run-up to that it was one of two items that Council address cont comprehensive plan Amendment items and Council address in all 2018 in the run-up of the two that we work with elected officials with staff with community members Queen Anne Community Council industrial and Advocates North Seattle industrial Association and others In an effort to make sure we addressed concerns in the consisted message. We've gotten given the narrow scope of the amendment that is proposed and the purpose behind it is one of support. So we have some individuals who spent their entire professional live advocating for preservation of industrial fans who support our our Amendment and so we're going to ask you to support it as well. But policy decisions were made during the comprehensive planning process the amendment process in 2018. And like I said this text Amendment implements that a policy decision you're going to hear today that the amendment has two parts. The first part would allow the university to place institutional uses in newer buildings newer than 1987, which is the limit right now within a very limited Geographic scope in the short-term subjected to Industrial and Zoning. The second part would allow creation of a major institutions overlay, which is the result of a years-long public process, which I think is the most involved the public process in the city of So you're going to hear a lot more about it. I'll be back here talking to you and I'm happy to answer any questions if you have thank you very much. Thank you. Next is Megan Cruz? Great hikes. I'm also here today to talk about design review reform. We've seen it narrow over the last 4 years and to be really basically about Aesthetics and it's ignoring the Public's concerns about light are privacy and functional design. It. Does this building have the ability to contain its waist and a delivery trucks and most of these new towers that are going to hold a thousand people do not I think that it's also become rather illegal for him. And when you walk into a design review You've Got attorneys for the developer and I think that's somewhat an intimidating Factor when it comes to people who are volunteers who are being asked to make a decision and if they want to consider consider one of these aspects that might mitigate the hike book and scale of a project is required by the design development guidelines. There's a lawyer there to argue at and increasingly they do get vocal and these meetings. So I think that we need to put the public back into this. Process and I'd like to see that happen pretty soon. Thanks is George Danner? Thank you for your service. My name is George Danner. I live at 1415 2nd Avenue the senecan and I'd like to speak about the design Review Committee of the cynic In Me Is get rid of the design review board, especially the downtown board. I personally testified in public at two meetings. Both of them is my testimonies were stricken from the reports that followed it. I witnessed the design review board condition a meeting for prior to a recommendation meeting where they asked to developer to supply specific information prior to the rec meeting the hell direct meeting. They not only ignored their own recommendations, but they didn't allow testimony from the public concerning the very important regulations. I know you can't eliminate the design review board, but Makeup is it's basically a rubber stamp for the developers. They hold public meetings because they're required in anything that this committee can do to make the public feel like they're being listened to would be well-received. We come here to testify because we have time and we live downtown and we see the effect of design reviews decisions and we see these effects over time and so we are the canaries that come back to tell them where they made bad decisions. But and we continue to do this and we continue to be ignored and the cost to the city over the next Forty or fifty years is going to be paid by all of us and design review needs to step up and recognize that their decisions have long-term impacts and make adjustments in the board members to Get other people on there to help make these decisions. Thank you. Thank you. Nexus Steve Rotella Well, we're back to normal here. Where only the chairman is here at the public, which is the normal way. This committee is functions the last couple of meetings. I was quite surprised to actually speak to more than just the chairman. I think that it's time again to mention all the great environmentalist in Seattle. We still don't have a tree ordinance. And while you say you are also green we see so many things pushed through this committee, which I consider to be probably less important, but we will go forward destroying our heritage trees which will not be replaceable in a in my generation and the city doesn't seem to care but we call ourselves a green liberal City design review is something that I remember when it used to mean something. I mean more than what color your Hardie board is going to be painted the importance of design review when Urban Villages came around was that we had a wide range of things including parking including size of building what it what what would real Fit on that lot. What would fit in that neighborhood? What would be viable now? It's reduced to the merely the color of thing because the amount of bulk you're entitled the parking spaces not necessary. And whether desist function fit who cares in the city well neighborhood to do care, and I think it's time that the city comes back to making design review a real process that looks at a site looks how things fit and makes the building fit the neighborhood instead of the neighborhood accommodate the building, especially if it makes a bigger profit for the developer and thank you for listening. It's nice to have at least one person here. Thank you. Is there anyone else who like to speak? please good morning. My name is Alicia Ruiz and I'm here today on behalf of the Master Builders Association and we would like to fully support this measure. Is there anyone else for public comment? See none. I will be closing public comment. I will next be moving on to our first item business, which is a discussion impossible to a 9 appointment in ten reappointment to design review board know I would you please read these appointments into the record agenda items one through 19 appointments 01326 through 01344 appointments of Honda Phoebe Erin bogert Timothy Carter Alan Grainger, Daniel, Maier, Jen montressor Garrett. Nelli Lauren powers and May so as members design review board for a term to April 3rd, 2021 and reappointment of Melissa Alexander Katie. Hey, Matt Hutchins Crystal Loya patreese Martin. Stephen Douglas Porter Belinda bail Andrew Haas. I was star Townsend and Brian Walters as member design review board for a turn to April 3rd 2021. Everyone's a table, please introduce his house and work for the Department of construction inspections, and I managed the design of the program. My name is Daniel Maier. I'm a mechanical engineer at PE. I've been in Taylor Swift tours. My name is Garrett. Nelli and I'm going to practicing architect at NAC architecture and the new appointee for the Northwest design representative. My name is Jen montressor and I'm landscape architect at Berger partnership. My name is Phoebe bogert on the landscape architect in principle with Place landscape architecture. I am an appointment t as well for the Northwest board Lauren Powers. I'm an architect Arc Architects, and I'm an appointment to the Eastport. My name is May. So and I'm an architect Atma soon, and I'm in the appointee on the Southeast board. Thank you Lisa, will you please refresh us for everyone here that what the Design Group diet design review process is and the role of the design review board so the design review program reviews at private development on private property, it covers the entire city, which is divided into eight districts. Each district has its own design review board is made up of volunteers. So today we have six of the new nine appointees. They are volunteers that serve for two year term and conserve up to two years. They are all very passionate and dedicated volunteers who are lending their expertise in the field of design development Community interests at landscape design Etc. And so the that before you we have some excellent new additions to the board in our opinion that we made recommendations to the mayor and Council about Can everyone at the table please spend a minute or two just to tell us why you're interested in serving on the design review board? I'm so my name is Daniel Maier mechanical engineer community. I applied to a hundred board because you know, I've been working on projects in Seattle for the past four years. I've been in the industry for about eight years. I love Seattle. I love my neighborhood. I see I've seen a lot of bad design in DC where I'm really from and I thought that You know cuz I had a lot of Architects and I thought I could bring a different perspective on a different set of experiences to board on as an engineer. So that's why I applied and I was going to be here. Thank you. Hello, my name is Garrett and I'm a practicing architect here in Seattle. I've been living here for the past 4 years and have grown a great appreciation for the city and the culture in want to get back to the city that has given so much to me as a practitioner on the public realm. I'm very interested in the way that the built environment in our faces with our communities and how we can ensure the growth of Seattle happens in the Democratic manner. I'm honored and inspired to to use my services as an architect to elevate the voices of the community and to ensure the the Democratic growth of the Northwest region. Thank you. I'm Jen montressor and I've lived in Seattle for over 20 years and I've watched it grow and change a lot and I'm passionate about the livability of our Sylhet City and maintaining that and our public realm and as a landscape architect. I am particularly interested in all the spaces outside the building envelope and how that can influence the fabric of our Urban realm and be Democratic space and have a very human scale. Thank you. Hello, I'm Phoebe bogert again. Similarly to Garrett and Jen. I consider myself an advocate as landscape architect and an advocate for the public realm and very often as our city grows and expands. This is the same. This is the place where private development really intersex and affects the public. So I think those pieces are very critical. How does that develops and how the building on interfaces and creates a truly pedestrian and public experience along the right-of-way is really that kind of she said we're fighting with the design review. Additionally. I am the Seattle native and have seen this yet the city grow and grow over time on and I'm in the relatively new neighborhood. And so I was originally from Central Seattle and now I'm in the Northwest and so I see this is a really great opportunity to become more and interval to my new neighborhood. Thank you. Again, Lauren Powers. I think my first interest in serving with the design review board is really having an active role in the shaping of our city very interested in kind of the relationship between new development and responding and supporting existing character and identities of neighborhoods. I have experience with and believe strongly in a participatory design process and the ability of that process and architecture to strengthen the livability of neighborhoods and communities in look forward to the opportunity. I got myself and I'm a recent transplant from Vancouver Canada. So I feel like I've been really lucky to have lived in some really great Urban environments and right now live in Capitol Hill and I think that in terms of you having seen Vancouver growing over last 30 years and some of the Grand Canyons and having served on a committee there as well planning committee to figure out you know how to do a really sensitive Lee respond to growth. I feel like this is real passion of mine. And so having moved to Seattle last fall on a mediately saw the vibrancy of Seattle, but also some of the opportunities and challenges with this kind of New Era bro was Tom and so I think for me serving on design review board is really where has planning to cut the rubber hits the road so kind of for the planning touches the ground and so a Cuz I review board is really a conversation between public the community on people who want to build in the community and also kind of a more professional I'm opinion of you know, what would make good Urban Design and so I feel like my contribution is really being passionate about design how I can serve this in terms of making this a better city is listening to all the different voices that are going to be impacted by development and also applying my professional skills in terms of being able to apply some design standards as well and having that. Kind of a of flexible response ultimately to the contacts then and making the city on much more livable place. Thank you and welcome to Seattle. Could I add a very important piece that I left out of my introductory remarks which is what design review is which is the review of new buildings looking at the architecture and Urban Design. So as you can see from this group of people here that there that the focus of the program is about the appearance of this new physical development and these are all people who work are very interested and passionate about the field of design and applying that to design of you are not here today as well people who couldn't make it today today to are out of town and one had a conflict. I'm hung. There will be serving on the downtown board is the local residential representative. He's a licensed architect as well. He lives downtown and he's done a lot of high-rise buildings internationally as worked at MG to and then most recently at link Design Group. We also have Tim Carter who Architect who lived up in Maple Leaf, he owns his own small practice that does a lot of a mixed-use residential buildings and he has lived in Seattle for quite a while and then a final person that we have is Alan Grainger who is a retired license architect from Gigi LL. He was one of the founding principles who now lives in West Seattle only serving in the west Seattle board. Thank you, and thank you all for your service to the city. And if I could ever be a service to you, please feel free to reach out to me as well with that said move to confirm the appointment 013-262-0134 for if there is no if there's no objection. Hear none all those in favor of I the appointments. Thank you. Thank you. Our next item of business and discussion to our two appointments and one we appointment to the Seattle Planning Commission know it would you please read these appointments into the record agenda items 20 through 22 appointment. Is there a 1/3 46201348 appointment of Jamie Marie stroble and a Levine as member Seattle Planning Commission for a term to April 15 20 22 and reappointment of Amy shumann as member Seattle Planning Commission for a term to April 15th 2022 All everyone is disabled, please introduce themselves. My name is Vanessa Murdock. I'm executive director of the Seattle Planning Commission. Anybody a stroble? I am one of the planning Commissioners Vanessa. Can you please give a brief overview Planning Commission is a 16-member volunteer body that is advisory to the mayor and city council and City staff on housing land use and transportation policies. We are not a regulatory body. We are advisory. We are also stewards of the comprehensive plan, which is the cities of the master plan that guides growth and development throughout the city. And I can you please State why you're interested in serving on the Planning Commission the great privilege of being on the Planning Commission for the last two or three years now, and I originally came from the nonprofit sector working with primarily immigrant Refugee youth in the Chinatown International District, and we was working with my use around a lot of our projects with Park redesign. We worked on a comprehensive Plan update and I was realizing that a lot of our communities. We're not really represented at many of the decision-making tables and that sparked me of getting involved with both housing affordability work and then joining the applying for the Planning Commission. I really think that having a strong equity lines and making sure that immigrant Refugee communities are represented at the tables that are actively being involved in decisions of how the city is being shaped is really critical thank you and Vanessa. Can you please me to the appointment and you are not here today is a new appointment, and he is out of the country and unable to be here today and missed human who is a reappointment is unable to be here due to a death in her family. So Mr. Levine comes to us with over 40 years of experience in both the public and private sector development. He worked 24 years at the Seattle Housing Authority 13 of which serving as executive director. He recently stepped away from retired from the University of Washington where he was a part-time professor of real estate development bothan the profit and nonprofit sector. So we're very pleased to hopefully be bringing him on board and Amy shumann is an environmental planner managing the LED and toxics program at King County health. She's served on the commission for 2. The Spar and brings a wealth of experience of how the hell planning can be informed should be informed by public health concerns and how public health is certainly affected by the decisions we make in the planning land use and transportation sectors towards of Oats. send an email to confirm appointment 01346 to 01348 those in favor, please vote I I have to go to Spencer. I don't suppose about no idea appointment to pass. Thank you again, and if I can begin to be of service, please. Feel free to reach out to thank you very much for moving forward on our Council appointments. This will hopefully bring us up to 13 out of 16, and we look forward to filling those other appointments when Samara has made her decisions. Thank you. Our final item of business today is a briefing from the Seattle Department of construction inspections on Council Bill 1 1 9 4 9 8 which allows for a limited expansion to the major institution Master plans into Industrial Park holds. No, would you please reduce the abbreviated title into the record agenda item 23 Council Bell 11948 9 in ordinance relating to land-use and Zoning allowing limited expansion of major institutions uses in a portion of industrial General one into zones and Industrial buffer zones located near near Seattle Pacific University Independence sections of the Seattle municipal code. Call the folks of the table, please. Introduce house list Whitson Council Central staff are Department of construction and inspection. Alright, well, thank you council member. We just wanted to give you a quick overview of the ordinance by covering the background so that the current code language in the proposed changes real quick. We just want to go over the SEC I purpose and values line take a look at it. So for a little bit of backgrounds major institutions include uses like hospitals universities and colleges according to the comprehensive plan these major institutions create one and six jobs in the city. Seattle Pacific University is one of these major institutions and is located on the north side of the Queen Anne Hill Neighborhood. The university has limited potential for expansion residential uses shown in the beige and brown are located to the south and west of the University and Industrial and Commercial uses shown in aqua and orange are found along the thin strip of land to the north and east along the ship canal. Most of the industrial land is part of the Ballard Interbay North End manufacturing and Industrial Center. What we know is the bent neck. However in December 2018, a comprehensive plan amendment was adopted that removed roughly three blocks directly north of the University from the bin Mac. So this land use code amendment is basically a second part of that effort. So we look at the current code language major institution uses can operate within industrial areas. But only within an area located 2500 feet from the overlay boundaries and only inside of buildings that were built by October 7th, 2019 87 this leaves limited opportunities for the types of buildings and environments that are suitable for University facilities. The major institution overlay selection also restricts the overlay expanding into residential and Industrial zones as opposed to some of the smaller colleges that are on in Seattle. I'm not sure exactly. There's a minimum size limit above which a college or university would be classified as a major institution. It's based on the amount of land area and the amount of square footage in college or university use. So population size isn't taking consideration or anything now about 16 of them in the city right now I think is what comes out to be. So if look at the proposed changes specifically what it does it update Nate's footnote for industrial zones and provision for major institutions owning. It would allow the major institution uses to operate indoors or outdoors in this 3 block area. It also allows for an update to the University's major institution master plan and future expansion of that major institution overlay into this limited area. And like I said the amendment set specific Geographic boundaries to limit future expansion into industrial areas, unless some other amendments take place. So if you take a look at the map shows the area that would allow for The Limited expansion kind of in that blue color. The proposed amendment includes the specific area where the university could expand and this would ensure that the industrial properties that are still part of the bin. Mick can be maintained for industrial uses. But since the properties inside of this area still zoned industrial current industrial uses can remain on those properties. Do we know who the current owner of the parcels it is Seattle Pacific University a good chunk of them already, but there are some other private industrial properties in their own by different entities. So really with that I'm here for any questions that you might have. Well do we know how it's being intends to use? The additional Parts was the land? Well, I think that's going to be part of the upcoming effort that they're going to do. I think when she heard from Steve Gillespie was saying was that they still would have to go through and figure out this part of major and Susan master plan larger changes, but if they're smaller ones in the meantime, they could do that, but it'd be a larger effort to kind of do the overall changes to figure out what they want to do with it. The legislation would allow the university to build on new buildings in the industrial area before the master plan is updated that would require a notice to the major institution Community advisory committee and regular permit review. Well, thank you. I think you could join us today that legislation will be back before the bus Committee for Public hearing on Wednesday, June 5th. Thank you again for your time this morning. This concludes our May 15th 2019 meeting of the planning land-use and zoning committee as reminder. Next regular committee will be scheduled on June 5th 2019 start at 9:30 a.m. Here in council chambers. Thank you again for attending. Thank you all for attending. We are ignorant.", "end_time": 2064.4}]}