{"format": "raw", "annotations": [], "confidence": 0.926656186580658, "data": [{"start_time": 0, "text": "You're watching. Good afternoon, everybody. Thank you for being here for our July 8th meeting the July 8th 2019 city council meeting of the full Seattle City comes come to orders to be in my Bruce Harrell president of the council will the clerk. Please call the roll eight presents a very much if there's no objection today's introduction and referral calendar will be adopted. are no objections the introduction of throw calendars adopted and similar if there's no objection today's agenda will be adopted. Do you know Jackson the agenda is adopted there no minutes or approval today. And I do not believe there any presentations this afternoon. So this time we'll move into public comment. Thank you for being here for public comment. So at this time will take Paula, on items that appear on our agenda for the introduction and referral calendar or the 2019 work program and will extend for 20 minutes. I'll call the oven in the order with which I see the signatures. We speak will have two minutes. So we'll start off with mr. Schwartz Richard Schwartz be our first speaker and then and she says Vai Bailey Bailey bear II speaker Good afternoon. Yes, please. I found myself involved in and I'm sorry, but I don't think your microphone make sure we can hear you. How can we start the time over please? Thank you. I'm back in March. I found myself involved in an incident that generated considerable public comment about the city's lack of response enough to miss to Citizen concern for the past 3 years May Community has been frustrated by the city is consistent reluctance to respond to its pedestrian safety concerns related to the Westlake cycle track given the height and public discussion on the issue of responsiveness. We thought it might be a good time to try again on April 11th to email. District representative Sally Bagshaw on March 24th and April 11th to email Transportation committee chairperson O'Brien on March 25th, April 16th. And June 24th female council president are all on June 19th to email desk. Director Zimbabwe. We have not received a response to any of these contacts in early April. We spoke the council member or I was on the phone. She said she would have her staff contact us the next day to set up a time to meet with her at our office. I never heard back from them. Nearly April councilmember herbold suggested we contact The Pedestrian Advisory Board. We did so asking if we could get some time on their meeting agenda to discuss our concern is said no we ask them for an explanation for that decision. They never responded on June 24th. We contacted Stephanie formas at the mayor's office. She said she would have the nearest Transportation device will get back to us in the next few days. If not heard from you on June 19th. We raised the issue with the transportation committee meeting at which the nice Mastiff I plan was being discussed. We received no response all we have asked the city after the city. Is it responsibly mayonnaise at the sylheti it built to the heart of our community. That's an eminently reasonable request You're Gone by the book and raising her concerns. We've been polite and we pursue spite. This is a nice I ever counted today. We have been consistently ignored. We need to know why I'm here trying to as you can see we tried I tried contacting people and got no response. So I'm here today. Hoping to get some response. I don't know the substance of thank you for sure your comment and I'll call in on the next speaker in a second. I don't know what response to your calling for specifically in your emails. Are you sending the same email to all of these parties are all different emails and so here with us on this problem with pedestrian safety and buy us you're referring to to you and others Express their concerns. I left the other copy of it today for you and transportation issues when I'm surmising it seems like mainly of Enforcement issue because it is it would you say when switch is it more of a transportation issue to some extent? Oh, that's why I spoke to Transportation committee, but that didn't give us any response either. So do we think we can get mr. Schwartz a response to a transportation issue of his concerns and I forwarded to the last drop it at there lots of Transportation concern throughout the city and I just think this is not elevated to a top priority is a process that we spent years working on getting the shorts disagrees with the policy that we've taken are we going to back? And forth without trying to do is I'll ask my stuff to do a sort of a search of of your email to see what kind of response we can pull together separate your comments. Thank you, sir. Is it bait Lee Bailey? I'm sorry. If the best friend said if there's another sign up sheet with other speakers one of the perks be so kind as to him if there's another sheet speakers if there's this be a last week or otherwise, please Okay, we're good. Yep, good to go. Councilmembers thank you for being here name is Bailey and I'm here today on behalf of unified Seattle at the college student living in Seattle and disappointed is being treated especially within the low barrier shock encampments in South Lake Union eye care deeply about the homeless individuals here in our city and I'm tired of seeing this treatment being falsely interested represented by only City officials to get them re-elected versus their actual care and needs the increase in homelessness is too discouraging to say the least you have to weigh homeless people are being given Aid is more upsetting the city solution to put these people into small garden shed, like in Cantonment started by like-minded drug addicts and allow for the free use of their substance. There is no Rehabilitation Medical Aid no mental health counseling or job training only drugs and despair. Seattle needs to address. The elephant in the room is the overwhelming uptake in drug addiction plaguing our citizens leading them away from jobs in community and instead towards poverty and addiction sick people into shocks and encouraging them to live a slave to their addiction while providing them with little to no future and hope is not helping them in. Anyway unified Seattle on the other hand wants to see real change to create a strong plan to help these homeless individuals in our City Unified Seattle wants to help the homeless become active members of our society. Not just people hitting and shocks far from the public eye. We need real solutions not shocks, and I love to see your participation in that effort. Thank you. Okay this point I'll close for the comments Uno speakers that I want to speak to you want to pick up that's why I was asking. I didn't see your name speak up on that on the sign up sheet tonight with that are ya I was listening to eat the airwaves yesterday. Can I sign after I speak and they said that there was a homeless encampment that was self-governed and was doing pretty well. I think it was up by Beacon Hill or one of those light rails. Anyways last week. I think it was you Bruce Harrell that spoke up to take action to help the people in the homeless encampments because it was actually doing really well on self-governing itself. There was no complaints of drugs or anything that I know of her. It's kind of Miss mythologize to like make a political issue about helping homeless people in like separate people like make them fight with each other about you know, how to treat homeless people so like $100,000. We spent for surveillance on these camps that were already running themselves just fine, you know, and these people don't have anywhere to go in there waiting to get into somewhere safe. And you know, it could be that they're doing a good job on their own. I haven't had a chance to go visit them but these new groups are popping up around Seattle to like hate-mongering like to channel anger towards homeless people and it's actually really sad because there just isn't enough affordable housing and dumb. I just hope that as a community we can help them self govern themselves. I also heard on the airwaves that a lot of the pollution was from people remodeling their houses. They would dump the garbage by the homeless encampments and then blame the homeless people for it to get angry so that way they didn't have to pay the fee when they took it to the dump and I just think it's really sad to politicize people who are physically emotionally spiritually suffering. You know, I use that as a as a political tool for people with enough money for housing. I mean people that maybe they don't have enough money for a house that big and so their anger has to go towards somebody cuz they're encouraged everybody whose normal owns a house. So anyways, I'm just glad to be here. Thanks close by the come in and we'll move on to the payment the bill section. So please read the title 19565 the moves and segments of bill pass at any comments. Please call the roll on the passage of the Bill O'Brien 8 in favor, not opposed sustainability and transportation committee 60 accepting the gift of funds for design and purchase the planting at for business nodes along Delridge Way Southwest as part of the Delridge Way Southwest Rapid ride, H line project. The committee recommends about pass customer Brian. Thank you GIF week except from the Delridge neighborhood Development Association. It's a little over $6,000 and it's essentially donations that have been gathered to upgrade the planting along that Corridor the community the typical types of planting the city would do. We decided they would like to see something a little better and raise money to do that instead of work sucking his money says F. Continue with that very good a big thanks to the NDA and their work specifically focused on improving enhancing the business districts in the north Delridge neighborhoods and working really closely with the opposite economically developing to do so, this is a high-priority action in the north Delridge action plan that this Council recognized a couple weeks ago now and it's the four specific neighborhood areas identified in the north Delridge action plan our Andover Junction Delridge Community campus the Brandon Junction and the Sylvan Junction. So I'm pleased that not only is D&D a doing is focused. But that s. Is I'm doing some some good work keep paying the neighborhood. Working class operation with off City, tellement before accept this gift Alright good to go. Please call the roll on the passage of the Bill O'Brien favorite unopposed. Please call the please read the next agenda item transportation to accept a specified Grant the committee recommends to go pass acceptances for work on the calendar on Park bridge and think this is a bridge that we could be getting some seismic upgrades as I mentioned earlier. The this was on the contingency list of projects the city had submitted to the Puget Sound Regional Council for the grant approval process because a couple other projects in advance. That were not able likely to be able to complete the project by the end of the year for the funding requirement the city thankful. He was able to accelerate this project to use some of those Grant funds we wouldn't have to the region would not have to Forfeit does Grant funds to go back to the federal government and its allows the other projects. They were behind elsewhere in the region 2. I'm sliding for the next the next Grand process. Thank you customer Brian any questions or comments on this bill? If not, please call the roll on the passage of the Bill O'Brien 8 in favour not opposed to go passenger side. Please read a gin item number three Advisory Board returns, August 31st, 2023 the computer commencing appointment be confirmed for a number of years. I'm probably first interaction has her work with got green on the priority higher. She's been in Chambers recently a lot. Cuz she's been very active on the sweet beverage tax Community Advisory board work because got green play tokuda Walnut. And so this would give her a formal role on the cab her history. He's working with as an organizer with SEI. You 775 and then just a great Community leader should be excellent addition to the sweetened beverage tax cab. Thank you customer Brian any other questions or comments on the appointment? Okay those in favor of confirming the appointment, please vote. Aye aye those opposed both know the motion carries an appointment is confirmed. Please read the 4th of June the item as member urban forestry commission for a term to March 31st, 2022 the Kirby vacuum NC appointment be confirmed 20-30 District works with developing developing facility managers or is he programs based on reducing energy use had a great conversation to committee about his interest in an update to Seattle's tree ordinance. He seem to be fairly well-versed with the direction that's going and is excited to join this committee and hopefully work with this Council in the coming months to get an update to that. Or get any comments or questions. You're not those in favor of confirming the appointment. Please vote by those opposed vote. No the motion carries an appointment is confirmed as your agenda for the day or there any further business to come before the council? Okay. If not, we stand adjourned and everyone. Have a great rest of the day.", "end_time": 1011.9}]}