{"format": "raw", "annotations": [], "confidence": 0.9453523716865442, "data": [{"start_time": 0, "text": "Good morning, and thank you for being here for the government sectors and Technology committee. We have two items on our agenda today one will be a modification to a rules procedures for the city council. The other one be a discussion on the ordinance relating surveillance Technology & Privacy protections. And so as usual will start off with a public comment. We have a couple people signed up call you out and you are with what you signed the document and we have. McKenna locks and Cynthia space or space please? Good morning. I'm a kind of wax on the policy and advocacy coordinator at the Council on american-islamic relations of Washington State's. I'm here today to express concern over the council's proposed blanket approval of current practices around a s. Use of license plate readers and CCTV traffic cameras, and hope to ensure that the council takes full consideration of input from the working group and community members around Technologies under review the consequences before of unregulated use of surveillance technology. The nypd's surveilling the Muslim Community in New York using tactics, including license plate readers, which are under review here as well sign order to prevent future of you. So we need to ensure that concerns raised by stakeholders and impacted communities are addressed and strong and comprehensive ways. The Seattle is the strongest of the strongest measure adopted by American city to provide regulations and oversight of surveillance Technologies leadership. Partnership on this issue. I didn't pioneers as Pioneers in this area. We need to ensure the rest of our country who are watching us as a model to ensure a responsible and strong efforts are taken and we need to ensure that Community input is hurt and valued. I would be very ironic if our carefully created process which again many others are looking to as a model resulted in a trust cost approach simply approving existing agency processes without considering whether civil liberties concerns have been fully addressed the recommendations of the working group and a focus groups for future review group's I should not only be included in si are write-ups but rather should be addressed through concerted efforts to set limitations on the use of surveillance technology to conduct studies on societal impacts reform training or curriculum to ensure compliance or any other effort deemed appropriate for the technology under consideration. We as a city need to set a precedent of proactively Preventing misuse rather than trusting. The agency promises are sufficient energy today to further review The Working group's concerns and recommendations before voting on The ordinance. Thank you. Hi, I'm Cynthia Spears. I'm a member of the public an independent security researcher and a Seattle resident. Members of the public and the surveillance advisory working group have read the sirs participated in the engagement meetings and devised the feedback provided. The CPAC is not have Hazard the stealing Council should thoroughly he'd all of the concerns raised transparency is necessary but not sufficient. The purpose of the surveillance ordinance was not just to provide transparency but also turntable improvements and refinements be made regarding the use of these Technologies. The council should not rubber-stamped existing usage of these Technologies as described in the sirs Concrete technical and policy feedback has been provided but not followed. The privacy of Seattle residents must be rooted in a strong Foundation of one written policy or organs for the the respective Technologies employees trained to use those Technologies. Who controls such as granular access control and logging what should be designed to fit the policy not the other way around and 3 written contracts with third parties as applicable. Any one of these three alone is insufficient. The working group has pointed out gaps in all three of these areas in regards to these s. Cyr's. Please consider the working groups feedback for your time and consideration. Are we have another speaker Marguerite Richard? I'm trying to catch my own mosquito. the day everyone I'm really concerned about the way this nation is going as far as I think you're talking about the I guess in dating people's privacy and I feel like I've been treated less than a human being and this is 2019 and I think it all is race baited and some people would say I believe that it is because of the attack that seems to happen on low income people every issue that I think it was ever develop was developed because of the poor people so they try to figure out what kind of way they can just rub for people's lives and interrupt them and make them feel like they're not a part of society and I think it's wrong so I don't know what you're going to do in the end, but I think the voices of the people are speaking out as far as what's going on and it takes a whole lot of Minds to come together and come up with offences towards people and I have. I think that's what they're saying. They're saying and why are you so involved in my life and you can't even like to say why don't you sweep around your own front door before you try to sweep around mine, so that it really trying to figure this out. Why? You're so hell-bent on disrupting other people's lives and some people would call it fascism. But I just call it life because anything can happen on Life's Highway if I one minute we're looking at one situation in the next minute. Like the fire in California of bringing people out of their houses and home so is a whole lot of stuff that you not going to be able to do nothing about anyway, because that's just what's going to happen. That's the way nature planned it and so I don't like I said, I don't know what you going to do that includes those who have signed up for Bella, Did I miss anybody need to speak? If not, I'm going to close the public comment section and we're going to move to our first agenda item. I do want to say for the record that counts. Remember her ball is under the weather and it wanted to send her regards and so we wish her a speedy recovery and kuzma Brian I could not also make it as well and we'll monitor this and I certainly feel engaged on the issue and he shared that with me yesterday, but just had a conflict so there we have it. So why don't you read the first record and retirement record. I've always asked you to join us and he's only against resolution 31886 a resolution revising certain general rules and procedures of the Seattle City council amending. Attach my One of a resolution 31806 chapter 11 clerk's office representing their good work on with the cows president's office to Amanda Council rules proposed changes to the rules generally would augment standards for Condon copper. Sorry for conduct at public meetings, I'll just briefly describe on what resolution 31886 I would do and also describe a proposed amendment solution. So I'm resolution 3188 sex with add a new rule related to abusive or harassing conduct. Is it roll? It's generally applicable to behavior and All City facilities how specifically that new rule would specify that engaging in abusive or harassing Behavior May subject a person to meet exclusion on from a council meeting for up to one year and will also defines abusive and harassing behavior is behavior that purposefully or recklessly Farms other people and that serves no legitimate. Advocacy purpose on the road goes on to give some examples of abusive and harassed Behavior including use of obscene language or gestures assaults were threatening behavior and also sexual misconduct such as indecent exposure offensive touching or sexual harassment proposed changes what also modify current standards for exclusion to La council members to exclude members of the public who have engaged in disruptive behavior at multiple beatings how the current standard allows for exclusion for disruptive behavior at consecutive meetings on meetings within the same 30 day. So, that's what resolution 31886 would do. There's a proposed amendment to the resolution on this is a virgin to attach the agenda platypus mammal to clarify that exclusion is not the only remedy for engaging in abusive or harassing behavior. And what if the behavior meets the elements of a crime the council may also pursue criminal sanctions. I got a pretty straightforward. Do you have any comments or customers Katie like to make up for advancing these policy changes over the last year year-and-a-half. We obviously know that when we get elected we sign up for being the target of public comment. We want people to come and share their Express their expressions of their interest in policy changed their frustrations with what they'd like to see changed in the city. This is all absolutely covered within First Amendment rights, but we didn't sign up for is to be the targets of sexual violence and the targets for harassment and intimidating language when we sat up here about two months ago and had to be subject to threats of sexual violence. I think that is where for me we really had the opportunity to draw a line in the sand. Yes. We want to hear from members of the public and absolutely I want to hear with those who disagree with me. I don't want anybody including myself or any of my staff members to be the subject of violence or intimate. Mission and I think that's true for anybody who's coming to testify in these council chambers as well. This is a place for public policy making ideally is a place for a Civic this court and ideally it's a place for us to disagree but not be attacking individuals are threatening individuals. I think that this document help us both protect individuals who've been elected our staff and members of the public who come and want to share their opinions and to do so in a way that's both heard and being respectful. So I appreciate this and I do think that this sends a message that intimidation harassment assault and threats of sexual violence will no longer be tolerated in these Chambers and I appreciate you advancing these efforts. Thank you and articulated, you know, we have nine different council members in a mayor and I suppose that in public meetings, they have different styles and I've always tried to err on the side of freedom of speech and freedom of opinion, but What is zero tolerance for threatening behavior and zero tolerance? And so I think these are well-placed policies of the Porta sporting them and swallow Advanced Imaging in for voting will bring it to full Council. I did want to say I asked my staff to look at the issue of what tools commission chairs and board chairs have at their disposal as well because one of my concerns and I talk to people on the women's commission as an example that as they continue their needs are volunteers often meeting in a public asset like this building their meeting that could be subject to the same kinds of a contact and tell her to make sure they had the tools until weather. We have to pass a resolution or FAS has a pass a Norton Door with password on Sony FES his behalf. I want to Find out so she can make sure they have the adequate tools to conduct their meetings appropriate and I'm just not sure of that issue. So so that's when we need some more work will look into okay if line because we did the ad the the concept based on some feedback that to alert the public that in addition to exclusion that there could be criminal sanctions. And so that is the amendment once I'm going to amend the resolution and I'll call it a minute one which describes a traditional language that's in the amendment talking about there could be criminal sanctions in addition to exclusion. So I'll move a minute one all those in favor. Say aye aye oppose the eyes have it. So now I moved past resolution 31886 as amended all those in favor. Say aye yai habit. And again, we just as a matter of policy we send Are these documents out to the ACLU and the Muny league in the Human Rights Commission and some other Human Rights Commission. So we try to even on something we think that should be well supported. We don't take that for granted try to do our Outreach and so we don't have any opposition this so I can thank you kiddo for your Stellar work as usual. Okay, now for the surveillance technology, please read it into the record and our guests can come for right now through the gate cancel the old one 19519 and ordinance relating to surveillance technology implementation authorizing approval of uses and accepting the 2018 surveillance impact reports for the Seattle Department of transportation's use of closed-circuit Television traffic cameras and license plate readers. Okay, I'll wait for everyone to get. settled I'm going to ask the two of you that if a council member does coming been asked you to move down because those are reserved for us. We have out more about tomorrow. But I think this is a full the full House. Why don't we start with that introductions? Greg Doss Council Central staff Armbruster to privacy officer for the city and Jason Cambridge and termites. Yes manager rest. Community Technology technology Advisory Board of the community surveillance working group and ACLU. I can't forget. So I do want to help violating the HIPAA issues by saying Gregor. Thank you for coming and I know you have a cold and so you are a trooper today. So thank you very much and Why are you sitting on this end of the table. initiative What is Dave and I told him I told him I was willing to I suppose phone if I know how loud to invest on us. Okay, so great. Why don't you see it up and then we'll just dive into the the ordinance 9519 is before you today pursuant to the surveillance word. It's that was passed about two years ago. It requires that any existing or new technology that could be considered surveillance come before the city council for approval we have before you today to Technologies s. Traffic cameras and S. Sale PR the license plate readers, both of which of the department will go into how they use the devices and it just some death about how data is maintained recorded and security is provided. You'll also here today from the working group chair who has some general concerns about the surveillance where did said that also has some specific concerns about the technology and with that Best way to step back and let Seattle i t tell you about the technology and so I think that's great introduction show with the process by these are the first two of many about so I would on a reserve that more overarching conversation chilili departments have presented the first two technologies and then let's talk about the process work and proven in the end just heard a free phone from there if that's acceptable. Magic of technology is just to review what went into building these so that you understand what we are doing to be compliant with the law. So I'm going to start off here telling you a little bit about what our team has been up to. So I'd like to start with the fact that the Privacy office was tasked with taking the ctOS requirements for the ordinance and get these completed privacy officer was created in 2015 to uphold the Privacy principles at this body. I voted in by a resolution. So that's part of what we do. Then we were tasked with this New Orleans itself took effect in September of 2017 and was amended last year to include external working group for all the way of that the council reviews and approves for continued use or acquisition. Anything deemed to be a surveillance technology. The definition is provided here any piece of Hardware software portal or other that observes are analyzes the movements Behavior or actions of identifiable individuals in a manner that is reasonably likely to raise concerns must have What is freedom of speech or Association racial Equity or social justice Minister must be created for each existing Repose technology on the other side of the slide is what we found we did you sense of audit yet. It was a self-taught it by all departments and then we help with the final few hundred technologies that we considered a could be possibly surveillance in this is what we landed on there's 29 of them 3in City Light three in Department of Transportation to avoid toll discuss today 3 fire department for N20 in Seattle Police Department and all those 20 1/2 are in special Investigation Unit slyke internet crimes against children. So really specified for certain uses. We grouped the presentation of these Technologies / cancel request the idea of putting one a month in seemed overwhelming for this body. So we were requested to group them in a logical grouping. This is what we landed on its changed a couple of times by other request specifically by the working group to start off as something kind of a little easier and smaller to digest as we get used to this. So the first two that are before us today or from s. There were two that were going to be from fire, but with help from the working group identified some holes in the policy and some dated material the very first of these surveys were supposed to be sent in last year. He's been sitting on a shelf for a while. We need to update to reflect a recent policy changes. So those will be later but this is basically what it looks like. This is the first round in may we have some more in July? We have some more in November that are planned and then from there the last group. So what is in a sir there long, is there long because of the requirements in the ordinance? We didn't do this to you to give you lots of night time reading and give you pounds of material to read there long because of the information required so the service required and we project managers West Apartments. It's their information. We help project managers to make sure you're getting out of repeatable process and a document that we believe is coherent and it's all the bases. So the first part of Is a privacy impact assessment to term of Art in the Privacy world. It's what we do for any technology that has serious privacy risk associated with it. It's a series of questions that are outlined in the ordinance. So everything about data that is collected manage shared noticed or not noticed all of the things that we would look at to see how is the date of managed around privacy principles. So that is the first part of this is probably wouldn't of the of the sir and ranges from 30 to 50 pages. So that's kind of what that is. It's documenting all the policies that regulate and all the use case information that is included. The next part is also required by the sir by the ordinance and as financial information on some of the difficult to get out for technologies that have been placed for a while. But we've done our best to give you an idea of what it cost him to maintain and to acquire the technology. It will probably easier when we have new things to bring to this. Body the next to something we added as a way to try try to get it at some of the racial Equity disparate impact of the other technology where We can we have a process at the city for looking at that through a tool kit and some of those questions we've adapted for this purpose the Nexus public engagement to go into that and a little bit of detail in a moment the Nexus of privacy civil liberties impact assessment. The working group has prepared and then the CTO response to that and finally the appendices and supporting documentation, which is really the bulk of this is over the policies live. This is where the detail this is for public comments live all the materials that we use in public engagement. So that's that's what all that is. So I'll just takes a long time to create and I wanted to make this point so that you understand that this is a process that we've been working on for almost 2 years. Now, the first part of this process to create a server is to draft the thing and it takes some more between two and three months working diligently in iteratively and collaboratively current collaboratively with departments to answer all of the questions required in the ordinance. So that's the first part and that is a back-and-forth processes. We realize policies are not present things are not clear. This doesn't work for me. Let's make it into English those kinds of things. Traditionally. This is a 30-day type thing and give the public an opportunity to comment with your public engagement, which is also required by ordinance series, or at least one meeting needs to be noticed and needs to be provide information provided in multiple languages needs to be accessible those kinds of things so that come into the comments can be gathered included in the in the body of the sir the next week. Are we going over multiple servers or one at a time? Can you see about that? We have conducted several of these now we find that individual if I just talked about one technology not very many people going to show up if I talk about surveillance in general and have several Technologies to discuss that seems to get more interest in the public. So we try to group them by let's get a couple of police. Let's get a couple of from Department of Transportation. We try to group them in some meaningful way also by which group is up next to be transmitted to this body for reconsideration try to get through those as well. So we just met and I'll talk more about what goes in all that just a moment public comment analysis. We trying to figure out what the themes are required by the ordinance to do that to give you an idea of what are some of the things that came up in the course of public, if we if we have some working group says their review that's a six-week by ordinance and they have the option to take an additional two. I think we've mostly seen a tweaks for this as they've gotten themselves up and going but that take some time for them to review You have an opportunity to have a CT of response. We sort of wedge that in at the end. We have just a few days to do that process. If we keep up to the to the master list that we've submitted to you all and finally that's all happens before it gets to you guys for your review. So good six to seven months not a lot of wiggle room in terms of making that much shorter. So I just want you to wear that and then public engagement want to spend a moment on I think one of the important parts of this ordinance was to provide transparency and an opportunity for the public to comment and and provide their their perception of these Technologies. So we are the first one up there yourself. The first one was a police Technologies and it spoke to a variety of Technology think this was at the Columbia Library. So we do public meetings and venues where we can try try to get out to folks. We hope will come and share their perspective in addition to that department to have standing meeting. So police us. Some of the Departments have Sustain Community meetings where we can make an opportunity to either get them to the public meeting for what we're having or get comment generator there a department of neighborhoods did some focus groups for us to try to get at some Community folks that we probably shouldn't have come to public engagement and go to them. We have a website where required to do so we can probably poster drafts. We also included video of departments discussing the use of the technology is so right below with that picture is that's a screenshot of our public facing website where we put coming events calendars and under that surveillance tab all kinds of resources in languages translated excetera for folks to access. We also have an opportunity for comment on surveillance Technologies and I'll say that that comment button probably gave us more public, then we got in any other way. So it's been a good Outreach and the videos on future I were available on YouTube channel channel help us out and we had thousands of hits own people really got a chance at least to see with Technologies worth it and comment social media advertising. We did Outreach that way. People for people to comment and to show up and we also have opportunities for email and an actual letters. We got a few letters from folks. So that's what public engagement looks like. It's it's it's a big time-consuming important part of this and we extended our public comment. By a month because of the snow in Seattle squeeze your friendly with everyone Nagina believe we'll be moving on to the be a space I made available to these are all the folks at now are contributing to the working group and I wanted to give you what have you been up to since 2017 not to toot our own horn, but for you to understand that we have been working hard in the background to get things done the first part of 27 or last part of 2017 as a surveillance ordinance, which I explained to you. What we went from hundreds of Technologies down to the 29 be determined. We submitted the first version of the master list of the city clerk at the end of October or November and then we created a certain point became a beginner project management with each department who had identified Technologies in 2018. We had our first quarterly reports. Does it mean going into the city clerk in available? Those are the surveillance determination reports required by the law that asked us to look at everything we've acquired that was not surveillance so that you have an opportunity to decide if you still wanted to be considered we created the public website. We started working group of men that happened. We had a lull in this as we were considering adding the working group. So we have few months out that were stalled but we had the first service completed for a beginning of review public comment review. I in September and then the first public engagement meeting was in October and in 2019. We had the working group added a comment. I in february-march for the group to Technologies, and then we're able to submit 1 and 2 part of two to the working group. We still have two more of that. We are waiting to submit to them and finally group one consisting of two technologies is ready to go to council. So this is what our activity has been to date and I'm happy to answer any questions or come to you later about detail that you may require. And without having to turn this over to colleagues. So I'm going to just spend a second to set the context and then Jason will dive into some of the technical details were very happy to be here as part of this. I think it's been a lot of work by staff as editor mentioned just a lot of work for the cross Seattle government to get to this point, but very happy to have gotten to that point. We're talking about two technologies today that are very focused on traffic management and Incident Management to keep Seattle moving we've seen where the fastest rate of growth of any city in the country wanting of the 50 largest cities without expanding our roadway capacity to handle that. And so we had to look for all the different ways that we can to manage traffic manage the the flow of people and goods throughout the city at the same time. We've had increasing expectations from the public about their ability to plan their trips and plan for Reliable. Transportation no matter how they're getting around. We've also seen and we will continue to see events that change our traffic patterns on a daily and on a on a longer-term basis. We managed through the viaduct closure bus is coming out of the downtown Transit tunnel. We also manage incidents on a daily basis and and coordinate our response to those with wash. So, we're trying to use technology in a responsible way that manages through these day-to-day challenges that we faced mean go to the next slide. So there's two technologies that we have here today for 4 review are traffic cameras and license plate readers. These are primarily to provide situational awareness to our staff and across Seattle government and be able to respond quickly and and transparently to these incidents as they come up. They've been very critical for us in providing us information, but also providing the general public with information about Day-to-day traffic management. Jason is really the technical expert on a lot of this stuff. And so I'm going to let him dive into the details, but look forward to questions about how we how does integrate into all the things that we're doing a test. Thanks am. So a test. We will have a dedicated staff for working twenty-four hours a day and 7 days a week and our transportation operations center to help keep the traffic in our city moving and they're using a variety of methods to understand the prevailing conditions on our streets are listening to the police scanners. They're seeing a feed from computer aided dispatch for both police and fire and working closely with the state. Traffic Management Center monitoring social and traditional media. Also, we can learn about the incidents are impacting our streets and participate in a coordinated effort to clear those incidents as quickly as possible. And one of our primary tools for reaching that objective is the use of traffic cameras are not alone using traffic cameras in this way virtually every. And every state use them and a similar fashion. We have 241 cameras and stop Rapid City On Our major corridors, which remotely controllable from are sent her. We also support additional users in other departments and other remote desktop facilities. We have a user A Special Operation Center for SPD in a fire alarm center for the fire department the executive protection unit in the mayor's office and our emergency Operation Center that's activated during large regionally impactful events. Answer the question. I have it. Let me just be clear in my question. Sure. So the 241 cameras were they have CCTV capability or not? There are other cameras in our rights of way in our streets not owned by us by the Sea the federal government as an example of correct, or well, let me just stop there there other cameras out there and check. Are you sure I'm into you looking at me with these are not that would not be a program that I would be involved with so I don't have and I know that's outside of the SI. I'm trying to get a lay of the land of what's out there in the real world. So I understand this SAR convert the 241 cameras, correct, correct? Okay. So let's talk about there are other cameras out their own by other governmental agencies that are still viewing is correct. Yes a present Harold. We had had a discussion about some of the federal cameras on I can't remember if it was this committee, but the issue. Should come up and you know, these cameras had appeared in an in the alley we did some investigation. It was clear that they were federal government cameras, but beyond that now it seemed as if the rules applying to the cameras were not clear and Beyond the control of this body and private. Commercial owners are free to install cameras facing outward. Of course long as it doesn't have I think recording capability audio recording as high as I understand that there's hundreds not thousands of private cameras out there to I take a crack in this world of cameras. Yes, that is that is correct present Carol, we would say that the the legal question of for example, whether you can simply face your ring camera out onto the street and record everybody who's there as opposed to someone approaching your door is is unsettled, but that's a good point. But but I think it's unsettled from a legal standpoint, but I think they're all those even the ring items. You can get at Costco hourly those record audio waffle by the way. So in any event and the port do we know if the Port of Seattle protecting their porch do they use camera technology as well and with inner-city does anyone know? A lot of surveillance cameras, those are outside of this ordinance security type cameras that are used to protect property and I'm sure the pork chops while we are looking at these 241 cameras and trying to protect privacy. We are doing it somewhat in the context of their I think there are thousands of cameras still out there that are not covered under this privacy work that we're doing and I think that's an important context to have as we look forward not to go back to what we have is this is a city of Seattle Jason you're saying you were saying the 241 where they have CCTV capability or not. I thought you were saying in there other cameras to buy a buyer Emergency Center summer or all those cameras were referring to covered under these two 4th to 241. All the cameras are covered license plate readers can also be defined technically is a camera. Okay, very good. Thank you. Please proceed sure that I was describing go through a training program and are provided. Policy which states that they must contact the Operation Center prior to moving any particular camera and we try and be completely transparent in are used to these cameras and we provide all of them to the public on our travel information map as live streaming video and during this past winter snow event. We saw a request for that video go up over a thousand percent which is evidence says that people are using these cameras to try try and make more informed and safer trip planning decisions. A cast iron skillet at the question little bit more on what the training looks like when we say training sometimes it's not sure if I'm fully inclusive or engaging in an effort the word undertaking here to re-evaluate the training that we have for sexual harassment prevention in our own legislative Department. The training is about 15 minutes online. That's not an actual training that I think send with folks. So what's your credit look like? So for the onboarding of a new operator in the TOC? It's a 30-day process. I have a list of all those requirements and kind of a daily outline of what they're learning learning each particular day. They're shadowing a senior operator during that time. He was also giving them the knowledge on how to conduct their day-to-day operations of a policy around the use of the cameras that they're trained on during that time and I was going to get into that later but there's simply trying to never zoom in to an extent for they can determine a person or a license plate while using the cameras are simply for used to Conduct traffic management the other users are we go and train them on how to use the system and provide them the same policy. It's not the same 30-day onboarding because they are working for other departments, but we try and stay in close contact with them if there's new software updates etcetera. We inform them about that. We all kind of collaborate to make sure we have an understanding of how the camera should be used. So we'll use them to detect incidence and verify their severity we can right size are response by determine if the short or long-term abandoned react appropriately we didn't start taking action. We put messages on signs communicate using social media and other communication tools and coordinating with a police department the fire department to stay and Metro at help clear the incident as quickly as possible and to inform Travelers. Upcoming congestion. We also use cameras to discover new detour route so we can then a great diversion plan to monitor those routes make sure they're behaving as we expect other also incredibly useful during large planned events like Monday night football games are we can use the camera to view traffic patterns around the stadiums to send an update messaging and also modify signal timing to help alleviate congestion in your pants. David Ishmael uses his ball for the Department. We can verify that the messages on our signs are displaying as we intended and also we work very closely with the traffic signal at team in s. So we can use them after we get notified the traffic signals are not functioning as expected at for example, we were informed it's an excuse me some traffic signals on East Marginal Way had gone dark real blood verify that with the traffic cameras and then dispatch electricians were armed with generators to get them up and functioning again to help mitigate that unsafe situation. And again, the traffic signal timing Engineers are responsible for making sure the timing on West Barbee primary quarters is functioning optimally and they could subsequently look after they'd Implement a new timing changes that the cameras to make sure that indeed their functioning as well as they can. It's a couple of quick examples of incidents that we've managed a one with visual verification capability and one without us. The first one here is the crab truck. It was kind of notorious event that happened in 2016. So we learn from computer aided dispatch at 2:39 p.m. That there was an incident on the viaduct so immediately using a camera wearable to verify that a semi truck heading Northbound head rolled over onto the barrier with two minutes were posting messages tweeting about the incident going through all of our protocol and updating the appropriate person Alan S. About the incident and because we visually confirm that it was severe we dispatched our Response Team immediately and they arrived at the scene at 2:50. So it's been 11 minutes. We had a team on the ground or able to make a full assessment of the scene and continue coordinating the response from there. The crab survive president did not make it and here's a situation where we didn't have the same visual verification. So late last year of semi truck hauling steel ball bearings last load on Southwest Genesee Street in West Seattle. Again, that incident appeared on computer aided dispatch feed at 4:16. But our Response Team doesn't prioritize incidents like this with no visuals because it can be difficult to determine the severity or the traffic impact simply by using the cat feed and they typically wait for SPD to request traffic control assistance. And so after receiving that request they ultimately arrived on scene at 5:04 p.m. And only then was it confirmed that the roadway was closed to traffic. We began sending messages and taking further action for this lack of visual confirmation delayed our response Akron nearly 50 minutes the black when comparing the two incidents So you have a couple of opportunities to ensure that people's privacy is protected through the use of the technology. The first thing we do is take advantage of a feature in the cameras call privacy masking so you can actually go into the software the cameras user interface and draw a polygon onto the view that will it skewer whatever is behind it. So in this slide shows the camera that's installed at the Madison. It's stalled near residential Tower and we've issued be a promising asking where it's appropriate and just gone to the exercise of looking at all of our cameras those that are installed in your private property. We just put in the Privacy masking. We also and most importantly just Train everybody. Like I said to never zoom in to an extent where they can identify a person or license plate while they're using the cameras to perform traffic management. I'm going to come back to that slide at when we have more of a conversation. Peace out. I'll share with you and the publica interesting piece of information that that years ago when we were sort of alarmed by the use of Technology on our porch and whether it rotated Send it residences. Yeah, I said that out literally outside of my office here at City Hall less than 10 feet outside of my window that's has no blind. Well blinds always up is a camera and it's on me every minute of the day and I asked well who's watching me everyday? Cuz it's it's one of these cameras and I was told that it's shaded like that and I said, well who controls that it could push up here. She could push a button in the sun shade the right eye me and and we had an interesting conversation interesting ly not the camera since been removed. I mean with the last seven seven or eight years since I think they but that's a very important intersection right here cuz you have the municipal Tower. Yeah police department at City Hall. So it's up except we waited warrants safety measures and so I wasn't complaining about the camera, but it is Italy reworking ten feet away from a camera on you twenty-four hours. I understand and I in some instances we have also put like a physical barrier like a blank sign. So just completely make it impossible for the camera to view Yelp beyond that point. That's why I'm asking questions right by your office to guidance for the Ami readers the advanced meter technology. We continue to hear examples like that. Don't do that in practice protection of place. And I think that's the Crux of the conversation what we do in practice versus what we putting in policy so that no matter who's in your positions as directors or in our positions the city council members in your positions as Community Advocates and subject matter experts that our policies are very clear. So I think that that sort of underscores my questions and concerns as we move forward. Yes, we have good practices in some cases, but the policy is I think our guiding document so that'll be the focus of my questions. Great Point Great Heights what happens with the camera data are cameras are not always being recorded. We have specific procedures which allow tests on employees to ask the traffic cameras a be recorded for to connect traffic studies and no other department can make similar request regain keeping a log of those requests late last year. And that's fine 2019. Only two recordings have been requested. So it's a fairly infrequent event. Those recordings are kept on a server. That's only accessible by S. Tsai t team they share a read-only link with the user informed them that the videos available and then they delete it after 10 days of being created in Speedos never shared with any other department or used for any type of legal enforcement you say is not recorded. I understand well as recorder for 10 days is caps for 10 days the ones that are recording. Yes. So what the ones that are not recording are they still on and just being watch live and not recording or they in the off so it's okay so Being is monitoring, but we're just not recording these that's right. Okay. and that camera they were talking about as an example. That is not recording. Why would it not be required are we did go there certain areas. We just say we're not recording the series or certain days of the week. And then when when is a decision made as to when it would record versus when it isn't is it always never recording because of that area. Can you talk a little bit about that the other always never recording this strictly for live viewing understand any traffic conditions managing traffic in real-time, but occasionally if requested by a somebody within the department we can use them to conduct a traffic study an example might be if they put a new traffic signal timing and they want to verify that functioning as well as they can they can request 10 days of work video. Whatever the study. Is that is viewable for them for only 10 days. We provide them a link to that video. We can watch them high speed and just see how the results and you know confirm the results of their analysis and I'm part of this is very educational. So thank you for your patience at least with me. So, where are we? The cameras the 241 cameras. Yep. I assume there's a science into that and can you talk a little little bit about are some of them in residential areas like with low traffic are they always in four-way? Stop signs? Can you just talk about the thought that goes behind where these are in Jimmy? Where are they? Sure, that's so we have a Citywide spanning network of intelligent Transportation devices including the traffic signal system cameras vehicle detectors just a variety of Technology that's out there. And so a lot of that kind of dictates where we can place cameras a lot of these cameras been placed Through The Years according to the objectives of various projects. That's her project might come through to add IDs, which is intelligent transportation system elements along Lake City Way, for example, then we would lay out the fiber optic cable, but the switches in the cabinets connected go through all the rigorous bring it back to our Operation Center. So that has dictated the location of many of our cameras and so it's been Since 2000 we began installing is Cameron. So it's been a multi your process. We just keep growing over time. And now we're to the point where you have a very good coverage over most the primary quarters in the city. So we wouldn't be in residential areas would strictly be on signalized corridors and we just did a spot analysis. So we compare Collision history with some blind spot so we can look use the camera see. Hey, we can't see this intersection. We can't see that intersections. We've identified 25 more locations for cameras. That should be suitable Alternatives in the coming years install this part of the move Seattle Levi objectives. And so that's another part of the process is just looking at Collision history, you know, it'd be very valuable for us to have a camera here. If you do the crash history and will in the next several years are we likely to as we had cameras just to add more cameras or do we take some of 241 LSA would take for 11:40 one of them down and relocate them. Was it just a short of an additional? Predigen but I would say that the point will meet a saturation point where we can see every primary arterial in that plane. We no longer need to add or removing and adding as we see the need for traffic management. Yes. carry on the license plate readers So we have them installed on 15 of our primary quarters in the city. You can see the map there those purple dots are the stations where they're located. So we have 35 of them. There's typically chew cameras pointing for each of the primary directions of travel and as you can see they're not installed at every intersection but a decision points when people receive the travel time information, they still have options for which ways to go when they're armed with that information and we partnered with the state. And this endeavor, they used LPR has an exact same way for several years prior to us adopting the same method. So our intent is that as Travelers move from s. Owned and managed facilities like the West Seattle Bridge and on the I-5 we provide them information using the same system and that way our data has more of a regional feel and its people move from the city streets amount of the highway don't have the same experience at least my travel time perspective. Spell who decided where these 35 locations were so that would again be part of what department is. Who is it a staatsolie or do they consult with SPD or fire or no question asked. Project describing. It would place a traffic camera license plate readers. How about I'm collecting Technologies would also be part of what we consider when outfitting a quarter with intelligent transportation systems and these particular typically length with a sign and so we could place the travel times over receiving from those license plate readers on the signs. When you come to it you say hey, these are the options for destinations from the starting point. And now I can take that into account when I'm considering I'm going to make this particular trip. And so if I were to walk down a street would I be able to visually see one of these on a sign are they pretty obscure? They are typically installed. On the master arm that supporting a traffic signal heads. So they are very tall and the camera that you're not you're blocking the box and try to cheat make that left turn and it flashes and you get a ticket that's not those cameras are outside of the 241. Those are not recording. Those are just what they are recording us cuz they catch him outside of both the traffic cameras that we were just talking about and outside of the license plate readers. The readers are solely feeding the real-time traffic display information that you see on the screens that Jason has a shot of Speeding cameras are outside of the 240 when I didn't know if those were still included the 241 cuz those I mean obviously they're watching people make the illegal left turns but I assumed they were there always on his well-being that they've been in. Those are those are traffic enforcement and outside of the ordinance. So we were careful to look at only the ones that are not included in. Okay, so sorry to have 3435 locations of the LPR. So why do we use them use them to put messages on the boards? Like I mentioned also, we update our travel information map with that same information. There also are primary measurement that indicate how well are quarters are performing and it lets us know where to focus our attention due to an unexpected increase in those values Russell produce and distribute a daily traffic report that includes travel times to create a congestion index and what it does is it looks at that previous 24 hours of travel time and compare is that the prior six months and so we can really get a view of how traffic is progressing through the city on those major corridors and soon we'll be implementing an automatic congestion management system that will use an increase in travel time to automatically change traffic signal timing. It's our ability to respond to you and alleviate congestion will become that much more fluid and dynamic as a result. That's why I have to ask this. How are we using this though to advance our commitment to Vision zero and to make sure that they're connected and protected bike lanes were talking a lot about monitoring traffic and vehicles but part of the things that were sitting especially on 35th as of the beginning or as in the last five days or so, is these vehicles hitting cars? So where are we using this to advance our commitments? In other areas of us. I'm to create protected bike Lanes pretty integrated with that with our overall efforts to manage traffic and and use the right-of-way efficiently. And then that means as we look to build out a multi-modal network. We're not winding roads to do that. We're building within the right of way and that means using technological tools to help us manage. The traffic that we have and then provide those other alternative. So I think some of that is providing information out to people inside of it responding when there are incidents that that affect our ability to remove people through corridors. Too and I think the places that we are the places that are outlined and where were where were tracking travel times and how we're doing. What would you think about with all of that? I think and we've heard feedback separate from this process on some of the Adaptive signals. That's an ongoing process which this links directly into of how we use that information to make sure we're managing multi-modal traffic and not just fake other traffic. Infinite Justice very helpful. Thank you for this is very educational show in your experience. And I guess you've worked in other jurisdictions are LPR a little jarring when you think about it if someone is actually tracking where we're going. I mean, I think we all can agree on that but is this all most common place in major cities now or can you talk a little bit about how long has it been around and one of our great speakers mentioned the abuse in New York City I heard about that, but I don't know much. Do you know of any other abuse I don't know that this is something that's pretty standard as Jason said in in. At a city and state level to provide this kind of information and management on major corridors. Jason's going to talk a little bit about exactly what is captured from the LPR and how were how were utilizing that because I think we want to make sure that people understand how how were you Realizing this information Howard not utilized more information. graduation rate So here's how they work when a license plate comes into view the LPR creates a digital record of that event and a fix for the timestamp to it and we've done analysis and by looking at general-purpose traffic volume, we recognize that only about five 10% of the plates that move to the view of a move past License Plate Reader actually ultimately used to create a travel time. We didn't send that information immediately to the states do all the processing on our behalf. What they do is they do plate matching. So they recognize when the same plate has a. Point a and again appear to point B, and then you have a travel time between those two points in 25 trips occur to take an average of that and that's what's provided back to the city. In fact, it's publicly available. This information is provided through a web service that's available for consumption by anybody wants to write a software application or anyting where does Consumers at the exact same type of data that the state provides at everybody? 10% because of the limitations on the technology or is that just to do just trying to get the samples to 5% 5 to 10% plates that are actually captured. I think that just it's probably a limitation of the technology. Maybe the geometry isn't right. Maybe there's a shadow over the license plate. I know they have some trouble with some of the specialized plates Etc is what I've learned from the the manufacturer. So I think that leads to that show that because when we receive the travel time back from the state, it says not specifically which plates but how many plates were used to create that travel time? It's given us a notion of how many people are making that trip. We compare that value to general purpose traffic that we used to collect half of volume. And that's how we determine that was about 5 to 10% capture rate and chunker. I'm aware of the lack of agreement with washed out the concerns your organization. I thank you for your patience Europe your patience, and I know you're chomping at the bit to thanks for your Indulgence. Let me just put that way. So is that the the The bounce back from West. Watch. Back to us. Is that a real-time basis that a month later or can you talk a little bit about how we capture the process by which we catch that information. I think I can get a fill in a write-up on that sure and that's something I probably should have highlighted more but it's kind of a technical explanation but essentially on the internet they provide a website that has explanations about all the different traffic related data that they have available and they provide instructions on how to access that data. And once you see that day today also provide a dictionary so I can see how this this is. This is what it's referring to in the datastream. And so travel time is just another one of those data streams available through the internet that were consuming. I just like anybody else would have the opportunity to so I'm hearing your answer to say that once a person's license plate falls into that 5 to 10% and they are monitors were going from A to B. Almost on a real-time basis. We can then access that database to determine that ate a bee travel time. That's a great question. So just to get it a bit deeper into the details after those plates are matched in the wash. Servers that meat that underlying Rod data is immediately deleted their never storing any of the plate information. We're not ever storing any of the plate information. It's not provided back to us and that data feed and that data feed there probably is about a five-minute lag in the time that these trips are being captured and turned into travel times to the point that we actually consumed and start putting it on a message reader boards Etc Inc. Okay. Thank you very much. What is my final slide just kind of overview of what I just said, we delete that we don't delete the plane information washed out the lease that played information immediately upon making those matches. We never receive that from the feed and although these systems are similar to those used by law enforcement agencies. This is a completely separate system and it's just never used for any type of legal enforcement. All right. Okay, I'm assuming that that's your last slide it is. Okay. So we pretty much gone through the technical explanations of the two technologies. And so why do we have just some discussion chunk? I'm just going to let you I know you have a lot of concerns. I try to read as much as I could this week Indians and so I shot her once you take the floor and talk about some of the concerns of the working group has had he has thank you present Harold. I appreciate this opportunity and I want to express my gratitude to the city departments and agencies. They've been working hard to implement this surveillance ordinance. I know that we're all sort of building the airplane as we're flying it. It's an imperfect process and we're all learning. So I want to acknowledge that you know before before getting into some of these concerns. I'm the coach here by the way, not not that sold share the working group the other coach Harris. Muhammad and I thought it would be helpful near wilford's the work the city is doing to implement the ordinance. I like to also highlights from the work that the working group has done around each of these Technologies. And then as you mentioned chair Harold also try to get into these two specific concerns one about the process which I think really integrates with this conversation about what to do with these two specific Technologies and then about the timeline as well. So, you know to take a step back, you know, when the Seattle first implemented this ordinance in 2013. This really was the first of its kind in the country and the fact that the council came back not once but twice to strengthen this ordinance, I think really shows this is a place where we believe we can have our civil liberties and the benefits of Technology as well. So I want to restate because I think it's always worth restating that the ordinance is really not about Saying don't use technology. I mean, there may be particular Technologies where we say that after having the discussion look for the ones that we've just discussed. You know, I think it's the working group assessment that it's not don't use them use them with the appropriate safeguards. And that's how to implement those safeguards is really the conversation. You know, we'd like two halves. Let's use the technology to manage traffic but have the right Protections in place. And of course, you know, I think 2 councilmember mosquitoes point the way to do that is is to figure out something that's clear and enforceable, you know, I believe that that was the original intent of the ordinance not just to give Clarity to the city agencies, but also Clarity to the public right so they know where to go to figure out how a given technology is being used. You know, that's clear enforceable policies the better way, you know litigation or or even That serve battling it out legislative provision by legislative probation is probably not the not the way to do it. So this is also our offer of partnership working group has been doing you know, we're really a unique body in this process. I think there's really not another city in the country that has a group that specifically designed to incorporate Community concerns into a process like the surveillance ordinance and I have been seeing you know, this process I did and more and more academic papers and more and more articles. There are a lot of eyes on Seattle as we build this airplane while we fly it and you know, we believe for that reason. It's very very important to get it right. I think the actual group that were working with on the working group, which I'll call to cswg because we love acronyms in Seattle is remarkable. They have engaged with these Technologies, even though I am actually the only person who proposed a job it is on this group to to look at surveillance Technologies, but they have they have dived in. You know, we were we were only appointed. Yeah, I think in February and since that time we've managed to actually review 14 Technologies, which is pretty remarkable given that says this is the size of one at 1 surveillance and back report. Right? So this group has managed to to look at 14 of these I think meaningfully engage with them and importantly to provide these privacy and civil liberties impact assessments to the council. We send each of those directly to the council as well as to the ctOS office when we produced and they are really intended to be to Reveille digested sort of condensed form of everything that we have learned when going through these Raelynn's impact reports including very importantly, I think you know the recommendations as to what's missing right? How do we protect civil liberties in addition to what's in the s? I r I think it's important to highlight that we did this as well by using a very specific template to apply to each technology where we asked, you know, I said her standard questions around a technology in the pirate. I can provide those to you but we had a very uniform and methodical way of looking at these Technologies starting with the key question of what is the purpose of the technology what enforceable mechanisms exist in policy to limit the technology to that purpose. Of course, what data is collected key question in any surveillance technology in what form is it aggregated? Is it personally identifiable information etcetera Etc and then you can really start to me. Patch weather data is collected that goes beyond the purpose right and going back to that the answer that first question. What is the purpose then you can start to develop policies that that match data collection questions about third parties, which third party access this data. How can they how are they allowed to use and disseminate that and what documents are contracts actually say that and we believe that these can actually serve as useful templates for the council as as you consider how to approve the Technologies and I think in this case we are talking about approval with some set of policies to specific concerns that that we had wanted to raise one is just a question of how the city can approve a set of policies that that make meaningful. The ways to address the civil liberties concerns have been raised in the privacy and civil liberties assessments the challenge 400-page document and we're really looking at three scenarios, right? I think law has stated that counsels approval of these 300 page or 400 page surveillance it back Sports gives these the force of Law and we are not sure that that's actually to put it differently. We are sure that's not a good idea. You know, we are either saying this is law or were saying part of this is law or we're saying none of this is law. If all of this is law it is very very difficult for the public to understand where the enforceable policies within the tsar and we raised a specific concerns around that end in discussing this unfortunately. Yeah, we did not have time. Is it working group 2 To have a meeting with Quorum where we could get a write a letter to the council, but the underlying concerns have been raised at the working group. And I think one of them is that there's a lot in these documents that isn't clearly policy or procedure. Some of it points to outside documents that can change. Some of it is just a lot of it is just a reflection of current agency practice as well. So there's a lot of questions if all of this is law, I think it's going to be extremely difficult for the public to be able to figure out I need to understand that point. And the surveillance ordinance? That we drafted in past. My interpretation was not to produce a document to say all of this is law. That would be a law my goal that lease was to most importantly daylight everything. We're doing such that we can open up the data open up the technology and surface everything. We're doing to best understand it. And then once we best understand and we can look at what safeguards need to be put in place and then after that process we can talk about changing the law but I saw it sort of sequential late. I didn't see in quite can I need I can take you offline or publicly about the length of these these 250-page sirs. I just think quite frankly. So wasted resources. I'm going to be candid when there's just a fundamental questions that need to be asked. What is it used for? How are we storing it in archiving who has access to it? What safeguards we have to protect us from a Just some core principles and front and I think one of the points shocker made that I would agree with is the top there could be an absence of clear policies in example being I'm going to make this one out. So this is not the best example. This is always dangerous and do this in example would be every Department must keep date published list of who has access to the data as an example or the specific archived time. Of retaining time. It could vary from departing Department of Courts being on the technological needs, but everyone must keep one and we look at them and they publish them things like that are clear policies that we need to articulate but Shanker to your point saying by proving just on a one-page ordent. We approve it. Michael's answer this that is the law that I sawed. Sequentially the first word a lighting and in quite candidly with s. And and information technology is two examples. I don't know what kind of I need to hear a little bit about the researchers you're putting into this six or seven of process because you have many pressing these and this is one of them but I didn't anticipate 150 page sir. I just began it with me. I can understand that. We followed the requirements in the ordinance. We looked at the questions that were asked how they are closed the answers that are requested and it is a lengthy process. Now that the meat of this is the Privacy impact assessment the first part the questions that ask about data handling data management best for policy is outlined the the bulk of this after that piece are documentation of public engagement excetera. So that that's documenting our process and what we did this what it How to build these things but that the meat of the of the data management the piece that speaks to the privacy concerns and the issues around policy except was really in the first part and that's where that's outlined we wherever possible include copies a policy or reference pieces of policy that we're referencing the document in your opinion is that appropriate is that just tested the necessary to get to the issues you're trying to raise or do you think we can expedite that some extent see that that perhaps you know are thinking maybe actually converging on this more more than more than you anticipate. What I will say is I think these are incredibly useful documents and I don't get all think that they're a waste of resources to spite their like all I'm really saying about them. Is that whatever you put into law in to make the force of law. Don't make it be this entire document. We're in agreement. I think that this is hugely useful simply because it documents existing agency practices. It talks about the capabilities of the technology. There is a place for community members to go to understand how it's being used. What that doesn't do is get us to the point where those civil liberties concerns are fully addressed because policy is sort of in different parts of this document. And as I mentioned your some of it may be outside of this document some of it may not be up to date. I mean, we found a number of those those instances. So what what kind I want to make clear ACLU in one America sent a letter the council suggesting a solution the working group will have an opportunity to discuss that as well and then see if they agree with it, but the idea really is that you know, we feel that we have actually done a lot of the work to pull out those specific policies that address the things that that we think are most pressing to address back and to your point. Councilmember Moscato. for example on cctvs funeral on page four of the privacy and Liberty civil liberties impact assessment that that we provided that the full one, you know, we we go through what's in the existing as ir and say an end to know the policy that's reference their end and you know to their credit I think as God has done a lot of work to do to try to put some policies in place, but we tried to figure out where it fell short in our view and I'm sorry for your memo or page for of of what of the the Privacy to working group problem is being Does not set forth clear use collection and retention rules So within that document, we actually then respond and say that there should be a policy that makes clear that no no data may be recorded or retained except for a specifically defined purpose is and what those purposes ought to be simple language all the policy in one place. And you know, we think that you know, whatever you do with the SI are you could perhaps move forward with finding some policy way to to include those as queer being in one place and enforceable worked with him on this. So this is largely you're working his and I think whoever was you were there as a member of Brian was there his interpretation was not that the entire surbhi comes along his and her Rotation was any representation that apartment makes about the handling of data server example data retention data access excetera, whatever representation they make becomes law. So if in the questions that you ask that are posed in answered in the sir about data retention, for example, if it's a department states are policy and our practices to retain the state of her no time at all except in the case of a traffic study that becomes codified when this series approved so I just want to clarify for you exactly what law is what I would I don't know why I'm agreeing with my say this but that kind of clear policy I think makes sense. Right and it should be delighted and we should know that that's not a hundred fifty pages. I can just like three sentences answers all the questions. But yes, I hear you saying it's not the entire document. It's the pieces where the the department represents the use of data and or sharing and whatever the question happens to be that becomes codified. Wanted to make a traffic camera as Sir so I think what we're both saying is that this document is not going to be digested by the general public nor frankly. Do I expect this document to be interpreted by any you know number of folks. We're working within each department for me. I think this is underscoring it. I believe what you're all saying, which is if this is not intended to be a law. What we need is like a 325 page summary document which I think the working group has begun to summarize some of the clear recommendations which actually talked about clear and enforceable guidelines what this is telling me is that you've done a very comprehensive analysis. You've answered all the questions that we've asked you to you've talked about existing agency practices, but we need to complement it with is a summary document that talks about the clear and enforceable. Policy practices. How is this going to how is a technology going to be used in the future? What protocols what procedures are we going to be putting into place to protect civil liberties how we going to ensure that future utilisation of whatever technology conforms to the policy guidelines that comes from this comprehensive analysis. So I would agree I think with what chakra said was what you said. This is in line with what the ordinance was asking. However, I think the missing element is what is that summary document that then we can say here is the guiding principle here is the for lack of a better term law that we expect you to comply with that actually needs our expectations as policymakers for how does new technology will be utilized for text of a Liberties and Advance the policy had with the use of the technology in the first place. I fully agree. And again when I talk about six sequential work Jason's presentation is exactly I mean, I don't know how that license plate readers really work. I wanted to Daylight the process first and in while he said as an example, I can remember what part you said is not retained. I'm or however many days is retained each department. We should know exactly what the what the retaining schedule is for for the technology. And so I fully agree that I want to get to that point where we had these clear articulable policies on the key areas weathers retaining who has access even quite candidly the training because when I talked about that masking technology I said, well who's who's pushing the button on mask? It isn't that just one is a one keystroke away from a I'll just send them on TV, right? So so so that's why I cool and what the training is, I think that's what those are all great points to have and should be a delight a process but I Think the city of Seattle cannot just have one that applies oil. How many depart Department in offices as well? So I'll see you all want to respond to Nature to and as compliant as we can possibly be this ordinance. And if you are looking for an additional piece of information, whether that's an executive summary or or something, I think we need to figure out what that looks like. We feel all the questions were answered adequately and representations from the department and an attestation about how they use the technology where appropriate we are not in agreement with some of the aspects of the report you came up with a surprise. That's not our normal operation. However, we are very dedicated to making sure that civil liberties all of the issues that this is ordinances designed to meet happen. So I we we need to talk about what questions you want to highlight with that is that Executive summary of policies or two stations about something. I don't know what that looks like for you and will probably need to ask some detail Austin it and the working group can work together to come up with what that format would look like that consistent format that you would expect to see every time there's a certain age to that executive summary. And that is the document to Shankar's point in everybody else's point would be the one that would be easily digestible could become law all of those things that we just talked about. So if there was another meeting of this committee coming up in the near future we could work in the meantime and come back with that executive summary and so sharp So to your first, but I know you have a second. Why do we haven't even allows you to get you by the way that the question of I think I was writing a note that all of this is law. I want to I want to get to that point. I don't want that to be lost because that's a bad law if it's a hundred fifty pages, but I have to tell you I know I'll just a cut to the chase on another issue that has chair the committee. I don't really have an appetite of passing 29 ordinances separate ordinances for each technology as well. I have a great appetite for really narrowing down those policies at Custer mosquito talks about 2, so well on exactly and if it's subjects us to a liability, that's the price we have to pay for using this technology, but I do want to drill those down. Understanding that it could be department-specific and last I really, you know the concept I just got to ask this question when we talked about the first couple of s i r s. I thought we're going to do some of the easy ones first to get the the wheels moving of it supposed to be there are these to conceive perceived as the easier ones or the more difficult ones had a couple easier ones. We had a couple of fired up cameras fire department cameras, when is used for a Hazmat response and the other is for when a fire truck gets in an accident or one of the fire vehicles gets in an accident. These folks very helpfully pointed out. These are a little old are servers were day that they had been prepared a year ago and had aspirations policy listed in them that we need to go out date did that policy happen did happen the way they said they were going to do it. So we had to pull those and those were supposed to be the easy one. So these are the next one's up. We actually had a group of six total for this first group to were police and they were police alpr which is Different uses of what we did our best to try to bring you using you noted earlier, you know what they're has. In fact been abusive License Plate Reader Technologies. I brought along, you know this. I mean, there are a lot of documentation including used by a company called vigilants that cooperated with ice for immigration enforcement purposes. This is the story of a gentleman who happens to be Oakland privacy commissioner who it was Brian Hoffer and him and his brother got pulled over cuz they were in a rental car that have been reported stolen and devices play pick it up match the to hotlist next thing, you know him and his brother are in handcuffs at gunpoint. I wish I was unfortunate and you know, this is just one documentation of what can happen. If you know that the data is not adequately protected. As we can today and appreciate the offer from the CEO's office to work together to try to figure out what what the policy looks like before us. I'll say two things one is approved the technology to approve the use of the technology only with those guidelines. Don't make it a separate process where you approve first because my fear is the council may never come back to approve the guidelines. We've gone 90% of the way the city has done all of this fantastic work. The working group has done its work and my hope is that that final step of just condensing down and I take very well your points to condense down the essential policies that need to become law make it very clear what those are those have the force of Law and within that the agencies are there they have clear guidelines as to how to operate their technology and bacon make Bear for the rules without worrying. Okay, if we're changing something that's a single sentence. You know that we said this was a practice in Yes, I are you know this also binds them if it becomes the force of law because then they can't change it and I don't think we want that. I think we want those boil down essential policies and the working group has made some suggestions to try to get us to that point Greg. Did you want the entire sir? So the sir has as as Seattle ideas put it out as a lot of requirements which is why it's so long. So I'm not to say that it can't be condensed. I just would require an amendment to the ornaments to say say that the sir summary would be approved by the council rather than idiot Tire thing. I'm getting a little confused which isn't the first time for me in a week. Go ahead conference keto be helpful. I think after the workroom and director have a chance to think about what that summary document looks like to then potentially have suggestions from Gregor Central staff about what potentially would need to change. I think that's like any piece of legislation. We always have to go back and make minor tweaks as we go forward the document itself. I think is still critical for the development the consolidation of it into a 5 page document that really points out. What are the key questions that we've answered. What are the key recommendations and how will this be used in the future? I think we can work on some language. I even think that we have a starting place at work groups a template questions that they've asked and anything because it's the beginning of it. So I would encourage us to see what the recommendations are from the conversation and then And then suggested edits to the ordinance of needed. Agreed to say what I'm hearing and soda at least my my strategy. I have no no appetite to rush the approval of a sir that the technology is already out there. So it's not like we have to approve the use of the technology for these social work. We're looking in the rear-view window and what we're doing. I have a great appetite again for a really daylighting what the heck we're doing now the schedule I have some flexibility, but I also quite can I want to get this body of work done? I don't want to. I really don't want 250 Page search for every one of the Technologies because I think we could really narrow down the core issues those principles account. Smyrna skate is talking about a talking about I do want to put a lot of energy into those but I also think that when we go through each sir in each technology is going to be somewhat unique. I mean it just stood there who has access and because there's going to be cross departmental access on a lot of these Technologies as well as particularly really get in the SPD stuff is going to be a little tricky layer on top of that the fact that we have passed some years ago or open data initiative. We're really trying to Daylight everything even allow the public to get it now. I have to tell you on these two fundamentally and I don't know if you talked about this working group and maybe see TED talks about this. We really haven't talked about the expectation of privacy when a person is in a vehicle or even the use of an orca card and use it. I always just quite frankly. I think my expectation of privacy is has been diminished unfortunately because I just assumed that with my phone being gps-enabled that with the Costco the ring cameras everywhere with not just e241 cameras at if a person goes from point A from their home to a mosque five days a week. I assumed that that issue that fact is not private and I know and I struggle with this because 20 years ago out of said that's very private person goes. No, but I just think that in today's date the technology is it wrote it that please So when you are moving about in public, you don't have an expectation of privacy. In public, however, there's sort of an open question about tracking that tracking your location overtime over an extended. Of time just because of the proliferation of data. There is a US Supreme Court case not I think it was United States vs Jones and which the Jesse's kind of talked about this question in the past. If I said you wanted to surveil someone it took a lot of people and a lot of time and a lot of tools to do so like cameras and things where is now we can use data a lot more easily. So there's a there's much less of an investment coming from the government to do that and you can get so much more information. So that's actually a kind of a policy question to look into maybe at the local and state levels about how does Washington want to view this kind of information because at least The federal level it's that tracking over time is open section 7 unlike the Fourth Amendment does not ratchet Down based on people's expectations of privacy, right? So the 4th amendments are there. I mean there is this debate on the Supreme Court, especially in light of this latest Carpenter case about what the expectation of privacy is in public. So I don't think we would agree I fate and speaking with my ACL you had on before you not we believe you do retain an expectation of privacy Supreme Court is is figuring out the parameters of that and they certainly have made clear that in terms of location privacy in particular that expectation persist now my When is based on the trajectory of the cases and the fact that they have actually often followed on previous Washington State cases that they will eventually get to the point of saying look because technology enables surveillance is so much more pervasive right? You don't have to follow me around with an officer and a vehicle or even stick anymore, you know an actual GPS tracker to my car. You can use license plate readers to to the point being made here to attract thousands of vehicles, right and that may change the game. So I'm more than happy and I think this isn't an offer is well from the working group to to sit down and speak about that. But coming back to you, you know, I think the issue at hand in front of the council one point. I'd like to reiterate is in this instance. At least. I think what the working group is proposing is very much in line with agency practice Pioneer. I think that I haven't heard that the Agency is wanting to use or disseminate this information or data in ways that that we would be uncomfortable with we just want to make sure that that makes it into policy and the suggestion of moving forward with this condensed version. That's the place where the public the agency and us to be able to go to figure out what part of this is law is a good way to do that. I will say that there are other serious we have reviewed where we just don't agree with the agency practice that we actually think, you know, the agency practice in using a given to Liz is too broad and I think that's a substantive policy debate for the council to have hopefully informed both by the sir and by would be an example of that possibly the license plate readers, right? So the the two police original, I'm sorry. To practice when we get to the SPD to Flavors of license plate readers. I think we you know, you'll see that we would like a much shorter data retention. Of 48 hours then is currently the practice. I read that I want to write ups in actually Fair debate. I read everything I can on expectation privacy, by the way. I don't want to slow play on that because that the area particular in private practice with the social media networks. It just it just fascinates me. So I'm not as good as I may seem great. He's going to see if it's still be called a sir and you wouldn't have to change the ordinance. So that's something I'd want to work with law on we also point this out in the letter that that was sent to the council this weekend. You know, we make the point that there is there are ways potentially to do this without the amendment and present her like wonder if we might get to that second time. Yes weekend. And Inn in Council are mosquitoes going to make appointment where to go to your second Point Counseling together. Are you sure? Okay. So the point is really about you know, what what is Tramadol Cadence if delivery of these different s IRS to both the working group and to the council, I wanted at the outset, you know, again recognize that there is a tremendous amount of work being done by the city to keep up with, you know, this massive information amount of information. I think it's again extremely useful because it is a documentation of the discussion around this and current practices the working group, you know also has our challenges because of course, you know, we we were behind the ball behind the eight-ball, you know, we actually were appointed a few months late. And so, you know since the time that that we've been on the job, I think you know if we've done a tremendous amount of But the challenge of the way, the timeline is currently structured is that two things one is some of the most concerning Technologies from a civil liberties perspective come to us at the very end that is a concern for us. And you know, I think if part of the original intent of the ordinance was to get rules around the most concerning technology sooner than that should really be reversed and some of those Technologies should be bumped up the other pieces just two groupings and I see from the PowerPoint that the group has changed but as I am currently understand that there are 12 Technologies proposed to be delivered to the working group 3 days before the deadline, so 2:28 or or maybe 225 and that is a challenge for us as well because we were To make sure that we have the ability as the working group to give each of these Technologies the full review. It deserves, you know, even reading one of the servers takes a lot of work lot of it falls to genlee in my office who has tirelessly poured through the details of these but we want to make sure that we have the ability to to meaningfully review Technologies, which is really the reason for our request to us. And you know, this is also reflected in the ACL. He won America letter which is to space them out to prioritize the technologies that that matter the most famous civil liberties perspective and if it's possible to do them at a Cadence where it gets us a smaller number but more steadily rather than waiting towards the end of the process that will give us a more meaningful opportunity to review, you know, when we get 12 at once we've we feel it's going to be extremely difficult for us to meet I mean it impossible for us to meet the 6-week turn around to eight week turnaround that's required in the ordinance. So all the way to say, you know, I think there's room for discussion here and we hope we can have that discussion. The other thing I'll say as well as that, you know, and now with my ACL you had on because of working group hasn't had an opportunity to have a meeting on this to to come to consensus. But in terms of the public comment in the public meetings one idea would simply be you know, if you had a specific time and place per month where the public is aware, right? This is the time and place when surveillance the surveillance ordinance technology off the month, whatever it is it going to be discussed that may get more people there because of course they will have it on the calendar as they will be able to it's more predictable than having meetings that bad jump around from time and place and also I think more manageable when you're just doing one. Time now we don't want to substitute, you know our expertise for the expertise of the folks in the city that are doing that but that is a suggestion from Boston around a way that might be that might make these meetings a little bit more accessible. I get more public comment as well. So I'll stop there. Okay, I hear you. I don't think there's even a remote and I do not alleging this at all that there's a Sinister motive in how we are either grouping or which Technologies we've chosen. I think we the council should have sent maybe makes messages on this because he wanted to the process going and get are some principles and play sand and once a process and we really tackle more maybe more the controversy once a week. We press the council is could take some ownership here, but I want to get the Department a chance to respond to the two concerns certain 122 concern to both the groupings and the the page of the timing of the Technologies the difficult ones front-loaded perhaps Give me a chance to respond respond to the harder questions the first ladies by thing that you were talking about witches having a more published calendar. So that public knows. When are we going to talk about surveillance technology lighting definitely innovate for the working group? You can do a better job in lining up the various out public Outreach for the rest of the year that something that I'll commit to do work with woodworking group is well, thank you love to be able to do that. This has been difficult only because we've had starts and stops and in completing these documents. So if we can get to a degree to grouping I would love it because then we can publish and schedule public meetings in advance. We've also been asked to work with Department of neighborhoods for them to do some of this work and so it's not all our decision. We work with the Department's to determine what's appropriate in terms of the conversations. And now we're moving on to primarily police car police Technologies pretty soon. It'll be up to police to help figure out are there other community meeting standing meetings or Appropriate but we can figure out the details of all that in terms of of of getting a monthly sir or changing the groupings. It takes six to seven months to complete these there's just no way to get around that between, you know, a month of public engagement 8 weeks for you guys to review creating a server itself. I couldn't bring you something in June if I wanted to which I do but I couldn't bring you something in June July maybe even on August we're looking right now at completing group 3, we're working on that right now some of the technologies that exist in her before are they were grouped together because they're really invasive those of those of the investigative police technologies that are going to take time to get all the information required. So I've been there. So it's it's it's we just don't have it when we've been talking to that Kayden since you guys first formed we really can only deliver these things if we know how when were when were trying to deliver them. We can't can't cherry-pick we had groups 1 and 2 ready for you because of the late timing and getting working group going. So we were able to look at it a little cherry picking we have to add a trip to that. We're ready to deliver to you right now. We sort of wanted to ship them last week, but we want to have a conversation before we landed them on you, but we just don't have a lot of flexibility that way we will do the candidates. It is a long road to get these complete. Nothing's coming in June. I just couldn't if I even had 20 people helping me and I want to acknowledge the work of the city and in accommodating the working group and making sure that we you were sending us things that we had the capacity to respond to. So, we really appreciate that. I think one thing that would be helpful in terms of the potential RI prioritizing is just understanding how much Of the challenge is from creating the S IRS themselves vs. How much of it is around the public Outreach and hey guys, that wasn't English. Hey. Didn't it didn't give me a policy that was not coherent. That's not a good enough answer those kinds of things. We worked apartments on they were fabulous. I'm not I'm not casting aspersions. So there's that creation part 7 until that's done. We can't hold public comment because we don't have anything to publish to say. This is the draft of all the information about this technology. So that's sequential. So we can't do anything about about when we can do public engagements. We could have some stuff off to you in that draft for but it doesn't have the public comment, which I think is an important part of determining is there civil liberty concerned that is widely recognized by members of the public. I think that's important. So some of this is sequential and doesn't matter how many people we put on and it just it's going to take time to do it some other sort of practical aspect to changing timelines is because Ginger and her team are solely dependent on Apartments to bring back to us their knowledge their subject matter expertise and because the calendar has been published in terms of the sequence thing. We have to go and check with the Department's to understand what their capabilities are as well to make those meals available to us so that we can then do the work that we need to do on our end. And so it's a bit of a question for the clients of it that we have to work with us completely understand. You know, I think the question on how close some of these srrs are would really help write particularly if the if there is a reordering possible that that really brings down the number so we're not talking about completing a group of 12s IRS, you know to a particular day, but you're really talking about focusing on one at a time to you know, and I understand it's it's a derivative but the SI ours as well ride. My assumption is that in the two nearly two years since the ordinance was passed at these? Agencies have known that an s i r would be needed right for each of these technology since they were on the list and so my hope is that you know, we're not literally saying finish. This has IR then start working on the next with that they're actually all 2009 have been in process. They are in process and if we go to one a month, you know that the hope is that God blesses the pressure to get these large groups of SRS. Unfortunately it is a that's usually when public comment is starting on the first group, but we have a limited number of people that are available to be Smith a public engagement to rewrite and write the this Earth. So group 3 has started news release Technologies at this point group for is not and they've done some work on them. But they're with their father Longenecker three-part. It needs take we have about one and a half people and police to write on these right now. So more people really doesn't help because we have to Find the find the find the information and it take some digging. I was hoping that you would worked out in negotiate the schedule when I left but I see you had a not so so I hear you loud and clear. I don't think you are dumb and reasonable and I also hear the Departments and under his leadership coordinating this the challenges you have. This is a lot of work important working a lot of work. Maybe there's a middle ground and what I'm going to ask you offline is to tell me just I think we could cherry-pick a little bits on on occasion. So maybe tell me some of the really challenging ones that you think maybe to hold some earlier attention to as well and a particular point. I included the one America and ACLU letter includes a timeline that has and yellow highlights and I can can I show you this it looks like it is except this is black and white, but I lied. I'm sorry the highlighter. Technologies on that list are the ones that we think I should be elevated and we've actually said yesterday an order for them. Now again, I want to be very clear that the working group has not had a chance to formally vote on that. Ordering but but certainly informally told so I'm going to respect my hand it back to you then and I cuz I don't want to I know there's and there shouldn't they might be some diversity of opinion on their work and provide in Owenton infused with your with C Tab and then Joe is from seat as while in the working group is on both and see tab Hazard of a privacy subgroup if you and you share that when I believe so anyway, what what what I'm going to say is I'm not suggesting. I don't have a lot of interesting and rearranging the whole schedule, but there could be some negotiation were cuz I don't want to Again, we're not trying to get out of the hard work of some of the difficult ones as well. So maybe you could give me a few that I can negotiate with a sit and see if we can rearrange the schedule. We're going to just talk more publicly but offline on some of the scheduling issues as we enter into the budget Year. I hope to hear from from you all about how this man packs you because his and that's where I have to advocate for. We have two strong Advocates on this committee actually for 5 that that are best in the situation of customer horrible than customer Briner all over these issues that if there's budget implications we need to know so we can make sure we make the adjustment Ginger put on the table. There is a deadline of March of 2022 complete all this work. I think we're all started recognizing that that is something I want to dress at some point. They can we get this all done by then that's for us to deliver to you all that stuff for you to make decisions, but we got to complete this work by then. So a lot of the concern we have about changing schedules comes down. We just don't see how we can get this done in that time frame. So just information about as well the ordinance also contemplates an extension is a possible six month extension Which Wich Greg I'm sure can address, you know, which is which doesn't necessarily address the prioritization but it does hopefully allow some wiggle room for time to make sure the agencies can do what they need to do and that we can do what we need to do. It's very clear right if we get you know 12 Technologies on the 20th of February that at least from our standpoint, you know where theoretically required to look at all of those in 2 months. At 8 weeks. And that's just not feasible for us so that you know, I think we we have some conversation tab try to figure out if it makes you feel slightly better to those are reduce the to fire cameras are going to come or two of those which Stockman's coming your way in addition. Well, I'm not accusing any Apartments of doing this. I just think even that kind of information we could share with working group. Just what our thoughts are with her plans are so should they are continued continued Elyria sure. They were again, we're not trying to set them up to fail what we want them to do their jobs and they're doing it very well and I think you fully understand the resource issue as well and and it again on something else. For for being a first guinea pigs. So to speak on getting through this now, I'm these two I haven't not as far as next steps. I have to sort of think offline and talk to my colleagues about the approval process unless I did say publicly we weren't going to vote on this as well work with Central shaft. I heard everyone's concerns and I think we're really not far apart at all. So so let me work for you to come up with some ideas on how we can still get there. Again. These are technologies that are already in place until I sure want to do it right as well come to room schedule. I'm sure I think that what you've outlined in terms of the process really helps us get away from the start of trust us mentality. Trust us were working on a trust us we heard you trust us. Our current practices is X and trust us that the changes that we need are in this hundred $50 150 page document. So I appreciate that cuz I think that sends a clear message both internally to our departments and two s's policymakers and the public that we are doing more than just saying just trust us and with the summary document that you're talking about creating. Jointly. And again, I want to underscore appreciation for that summary document with recommendations and policies and protocols. I think that gives us also something to look at when we're proving. I hear what you're saying that we're not going to potentially be able to go through, you know X number of Votes on each one but I think if each policy document, I'm sorry. If each siir had a summary document in hand. That was that short summary memo. We as policymakers can quickly look through that so can the public so can I have the kids and those who work at the city to fully understand what it is that we're voting on. It would be very challenging to vote. I'm yay or nay on a document like what the f i r is currently and so when we treat that summary document I think it will help then go to also really help to underscore the urgency and which were undertaking the implementation of the ordinance as you all come up with your priorities and the groupings to look at those issues that are the most concerning that do raise the most questions around civil liberties that give us the most heartburn when we think about technology to put those at the Forefront. I think that could help us. I really understand how we're advancing these Conversations with urgency. So I look forward to that future conversation. And then with those summer documents in hand in a revised timeline. I think we're well on track to meet the intent of the ordinance for the great. That's great. Just certain closing to I do want to say that and I don't want to cuz I actually like conflict of time this write-up. Be somewhere else. We didn't get to the issue of whether we have actual Contracting with third parties, but I'm very aware of the issue. And I'm glad you flagged it also want to do some positive feedback to work and get some positive feedback that I think they've really done their job. Well there a few SRS I think that they gave feedback on and they Department said, okay, maybe I could have put a few more hours behind this product. I think that that part is working. I do sort of want it in this works quite candidly get to the point where we just disagree. I mean I want sometimes it's hard to even tell where we are at the weather should be 48 hours or 90 days and let's put that issue on the table. Just had to make some tough decisions in and we'll figure that out. So I sure like doing the work that gets us even to the point of disagreement and try to avoid that of course, but that's the challenge you in a while after an interview Theory elancyl. Okay, so we'll work on a schedule. I'll talk to both of you offline. Thank you so much both of you for being here in in s. Thank. Again for a probably work. Okay, because I'll have a great rest of the day with that will stand adjourned.", "end_time": 6722.7}]}