{"format": "raw", "annotations": [], "confidence": 0.9312865447628406, "data": [{"start_time": 0, "text": "Good morning, everyone. Good morning. Good Morning America packs House of the housing Health Energy and workers rights committee on time. It is Thursday, July 11th to introduce them when they get here. I also want to know I usually talk very fast and I'm going to try to slow it down. And let's see we have Jordan Guffey and Molly Maguires will be providing interpretation of the women's advocacy services will be attending the meeting and has requested American Sign Language services. So we want to make sure to have this being inclusive meeting and if I need a reminder 5 Down a little bit if everybody can remember to do the same as well today. The 1st is the last appointment to the domestic workers Standards Board. We have a briefing and discussion of the notice of intent to sell legislation. We have two pieces of the hotel workers legislation, which is related to the retention and workload sections. I want to remind folks. There's no vote on that. We have extended the conversation on that as well. We will have another meeting on the other two pieces of legislation next week. We'll have a briefing and possible vote on the provider wage issue, which is the human service provider inflationary adjustment bill. This is the only Bill that we will potentially have a vote on today. Just want to remind folks of that if you come to testify on something else, there's not going to be to vote in committee today on that just a human service provider inflationary adjustment potential legislation. Will have an office of labor standards presentation on the race and social justice initiative report. We are scheduled to go to noon today. And if there's no objection there is none will be adopted. At this time, we're going to take public comment and due to the high volume of folks who signed up to testify. I was going to do a minute and a half and you have one person who's the first item on our agenda who needs to leave by 10:30 if it looks like we're going to run a little bit late. We may take a break to do that appointment. So the first people and I'm going to read three names in order. If you could come in line up at the microphones, that would be great. The first person that is here is an swanley from Hilton and then an benden and as always, please feel free to correct my pronunciation welcome. Good morning. Let me know I don't think it is it one more second. Okay, go ahead. Hello. Thank you. My name is Kian Lawley an HR Manager at the Hilton Seattle. I work in the hospitality industry my entire life. I started my career back in 1985 as a room attendant and work my way up to where I am. Now, I can say that everyone in this room deeply cares about the Healthcare Safety of their Associates and provides not only safety training for them. But also the panic button which require for all hotels in Seattle. I wish I could say that all my associates use but sometimes don't own their own accord. Although we are union property and our Associates have good level insurance at a very low cost of $40 a month for their entire family Channel cast expenditures of are not as social non-union Associates from information taken from the exchange which ways are not negotiated more accurate for the cost of gold level insurance. This is unfair to our industry. Continue overtime requirements proposed or unreasonable if an associate exceeds the mandatory workload by a single square footage, which requires us to pay overtime for the entire hours work that day. There is no other industries that nor I or anybody else knows that pays overtime for the entire days worked by passing Us registration. You are debilitating the hospitality industry. Especially are small businesses. Thank you. Thank you. Good morning. Council members. You're going to Oswald. I work at the Hilton and hotels, but thanks, but no thanks in Psy Fortune Magazine list a list of the best 100 companies to work for in 2019 Hilton West 1st hospitality company at what's the best company to work for in the US but besides the Cheesecake Factory number 25 number 31 Hyatt 32 Four Seasons 89 some of the top 10 companies well-known companies Salesforce workday Cisco Edward Jones some of the Washington State companies listed between like the rag 46274 REI Salomon slalom T-Mobile Zillow Since Cory, I quote according to the great place to work Institute Hilton outperformance when it comes to satisfaction and I typically more disenfranchised lion level workers such as cleaning and kitchen staff. So UPS, we are an employer of choice and it appears we have certainly capable of running our hotels without the influence of others Outsiders, especially unions that represent a handful of hotels in Seattle out of hotels. Thank you. I'm sorry and I'm sure I'm not saying your last name is Amanda Parsons Shannon Sheeran and Shawn O'Rourke. Hi Amanda, and I am the director of sales and marketing at the Hilton Seattle. I've worked in the hospitality industry for 35 years. I've been in hourly positions as well as management, like almost everyone I've ever worked with in hotels. I work my way up at the Hilton Seattle. Our management team is a composite of diversity gender ethnicity and LGBT. We're not unique I'm here to tell you that I think that there is some homework at to be done and you have a responsibility to understand more about hotels and our relationship to the community and to this legislation. For example Hotel companies. I'll provide reverse mandatory training on diversity respect in the workplace and harassment Hotel companies provide mandatory mandatory training on work working safely. Did you know that hotels are not owned by the brands with few exceptions how many hotels are owned by owner management companies or Real Estate Investment Trust for sure the vast majority of hotels out there are family owned and family rent. Just take to run a particular flag. Shirts at significantly lower cost than could be obtained on the exchange and that I work at workers compensation plans covered it on the job injuries. The panic button button legislation was a real win for everyone yesterday as I walk to work. I was struck literally by deranged man who hurled a large bottle of liquid at me hitting me on the side and dousing need I guess there was some consolation and his pal telling me that it probably wasn't urine since it didn't smell but considering the recent incidents downtown. This week is only a matter of time that people will stop coming to downtown Seattle companies will move to nisource a four places conventions will go to cities that are safer cruise ships are going to dock out of Vancouver when that happens and the billions of dollars are gone. All of the discussion of healthcare costs will be moved without Travelers there. No hours or hours or no benefit Amanda Parsons Insurance, Sean O'Rourke I think we're going to have to do a minute after this since you don't have a second to edit on your marks go ahead and take them in and a half and if so could take a look at the remarks. That way we can get everyone in and do our business today to thank you. Good morning. My name is Amanda Parsons. I'm with the Thompson Hotel. I wanted to take a moment and say thank you for hearing our concerns that the expenditure amounts in the legislation far exceed what it actually cost to provide high-quality Healthcare to our employees. I hope they're holding it from today's agenda means you're spending the right time and the correct amount of time to get it right as careful thought so far the discussion here at City Hall in the news is focused on Hotel employees. And that's not just what this legislation is about. It's also about businesses you happen to lease space and hotels and impact small businesses and non Hotel employees. Why are you treating a business to run space and a hotel different from a business who rents space in an office building or an apartment building when we're making decisions for our citizens, we need to consider all and I hope you will continue to take a long hard. Look at this. Thank you very much appreciated Shannon. Lullaby Shawn O'Rourke and then there's a group from SEIU 1199. Hi. Hi. Good morning. My name is Shannon Sharon and I am here representing And discussing the hotel map. I have testified over the last 3 years many times and continue to seek and hope for balance and there are many unattended consequences that have been labeled into this legislation that we continue to ask for understanding in and have great concerns about this is about making sure that we represent an understanding needs of hotel workers at which we have great understanding and experience in as well as understanding the unintended consequences and the heavyweight that this puts on small and large businesses. One of the items that was not included in the discussion today was the items that speak to the health care and that is an area that we thank you for slowing down on and giving an additional consideration to the number that was arbitrarily considered and created. Assembly is not consistent with what hotel companies can pay for the cost Associated. Thank you. Thank you very much. At the end of the time my name is Sean O'Rourke president Seattle hotel association of work for this industry for 34 years starting at the hotel shuttle driver various positions food and beverage housekeeping front desk through my 34 year career until now which I am the general manager at the Seattle Marriott Waterfront. I would like to say that every hotel is different and every approach tailored to suit the employees and unique characteristics of the property while this legislation is challenging and that it applies a one-size-fits-all approach in a situation with no singular solution. We are committed to ensuring that we have a safe workloads for our employees and that either request that they the requester voluntarily consent to any additional cleaning assignments and are paid appropriately for doing so I'd like to ask you to take a closer look at the overtime payment requirements for additional cleaning. We are happy to pay overtime for work but is unprecedented to ask an industry to pay overtime for an entire day's work this legislation requires overtime for All Hours worked if the employee exceeds the mandatory minimum work clothes by a single square foot. Welcome. And because you're a group we will do as free minutes for the total if there's the old folks with speaking. Alright, my name is Justin you 1199 Northwest. I believe that I do crucial work to keeping the city alive and housing are most vulnerable neighbors, and I would like to turn it over now to my comrades at SEIU 1199 Northwest to talk about why it is that we support this adjustment for inflation. Thank you. My name is Bethany Simpson. I work at Community Psychiatric clinic as a residential counselor. And I'm a proud member of SEIU 1199 Northwest as much city funding but we work with other providers that day will in my job. We work with Housing Services to help our clients transition to lower levels of care 90% of my residence rely on neighborcare health for their primary care and many of them utilize other services for therapy and community centers all kinds of vital services that help them survive and succeed in the recovery of the lack of funding has impacted my co-workers myself and our clients. I've over the five years that I've worked at CPC. I've watched people leave. I've watched clients drop out of services and I watch people die from lack of access to care. So the fact that funding does. Not keep Pace with inflation is not just unjust. It's immoral and inhumane. Thank you. Hi, my name is Natalie Dreyfuss and I'm a clinical support specialist at dese Sprinter Scott house the work that we do brings people directly off of the streets and into a stable environment, which directly believes a massive burden on the Emergency Services System additional. He leaves a lot of release a lot of the complaints that your constituents have about homeless encampments, but this requires stable Staffing in order to develop the kind of trust and Rapport that is necessary to develop connections with people who are rightfully mistrustful of the system there for Health and Human Services Workers need an annual automatic cost-of-living adjustment every single year. Thank you. Thank you footprint that we we have that made is pretty clear to everyone in the work we do and I believe in my heart that the cost of living increases not like a privilege. It's the right and Seems like the right thing to do and we'd like to be the Haves and not to have nots anymore. Thank you for your time. someone else Okay. Well, thank you very much as the guy you. Volcom Garden I'm alone. And then Denise Perez Lolly. Good morning. My name is Gordon McHenry Junior. I'm president and CEO of Solid Ground. We start with the belief that poverty is solvable which is necessary to help our entire Community reach its full potential our approach come by and semen services to meet basic needs to be nurtured success with advocacy and we spread changed we work with over 75,000 people each year in our ability to deliver a positive outcomes for our neighbors is ground and effectiveness of our smart skilled and dedicated staff many an Arty Mebane Masala ground or in the field of Human Services for years and some four decades. We ask a lot of our staff every day and every day they deliver we need to invest in infrastructure in the Seattle area, and we need to invest in the people that provide Human Services. We Aspire for social justice as does the city of Seattle. This is a matter of equity and fairness. Please take action now and indoors in a firm counsel build one. 9542 thank you for everything you do. Council member is my name is Katie Guerra on the deputy director at MLK labor. We represent a hundred thousand unionized workers here in Kane County and 150th Philly it unions. I'm also a member of Laborers Local 242 a Building Trades Union, one of the things I want to share this morning it is that in the labor movement were very familiar with the concept of building power. That is what we do. We build power for workers and working family. And I'm what I love about what SEIU 1199 and opeiu Local 8 are doing with this legislation is that they're building power for themselves and for their clients, but using the vehicle of the Union to elevate the situation and the resources for their clients cuz I think we in the labor movement can learn a lot about how to better serve our community with the vehicle of the Union from the work that you all are doing. So, thank you so much for standing up today. Also wanted a friend for the council that we did pass a resolution at the labor Council supporting this legislation, and I'd like to just read one quick excerpt Seattle's ability to thrive now and Future is dependent on our ability to Foster economic emotional physical Developmental and social well-being for all of our community members. Thank you. Good morning. My name is my name is Daniel Malone on Executive Director of DSC downtown emergency service center. DSC is proud to contract with the city of Seattle to provide vital services for the most vulnerable community members that we have and we do this by hiring a dedicated professionals with the skills that are needed to do this vital public service work. We partner with the city to open things like Lemon plays the newest Supportive Housing program for chronically homeless people in the community, which council member War as Grace Grace. Just lie helped us open just a few months ago. Our cost of is a cost of doing business however continues to increase and we need the resources to not lose ground in being able to deliver these vital services in a community. So when we lose ground, we have to consider cutting those vital services and that's the last thing that anybody in the community needs. So we urge you to. Yes on this bill and make sure that we can Thrive. Thank you. Hi, welcome to nice Turman Elementary. Thank you for over 45 years organization has been working to surf the Latino Community as well as communities of color here in Seattle the city of Seattle recognizes the we and others in the room today as community-based organizations are the experts who directly invest and vulnerable populations and says contracts us to provide Human Services on their behalf. However, the rise in the cost of living in the actual General operating expenses of providing Services outpaced the inflation rate at the start of the New Year employees receive a 3% cost-of-living increase City. Funding does not cover this cost and by not doing so an ultimately impacts who can and cannot afford to work for a nonprofit and possibly live in Seattle. We are asking you to include in annual adjustment to all HST contracts to keep Pace with inflation. Thank you to everyone. Sing as a group 2 or just one person. Okay. Thank you for being here South Park Senior Center. Good morning lady and gentleman. My name John politan. I am an immigrant from Cambodia. I participated in the Cambodian alcohol at the South Park Senior Center. I owe you to assure that that is social submissive contracts in the human services department received in fractional Reserve increases every year. Behavior Cambodian cook and I were dinners Cambodian cuisine. We sing karaoke and dance after dinners. We hold a special event to make a Cambodian New Year and National real busy day. Go on trips and participate in physical activities. Lasalle Park Senior Center, help me to stay here in United States. Let me celebrate my marriage. I volunteer including to translate in interpret between English and Khmer. I'll wear sensor say when 60% people of color the homeless refugees and immigrants. Please answer to dr. Support program. Do not demand. The money is due to impress impression. Thank you so much for your pay attention. Thank you very much. volume four Community Center welcome Spell clarify the best final I'll answer anything on so they can live in health safety and dignity in our communities. I'm calling upon you to pass permanent legislation to ensure that City contracted Services. Keep up with inflation Wallingford Community. Senior Center is an independent nonprofit organization. We got about a quarter for Budget from 80s were able to support our lowest-income participants. Those were the most reliant on our core services such as social work because of this funding our biggest expense, of course is for the people who make our programs possible as it stands now, I already have staff that work on weekends doing extra jobs because we just don't pay enough. We need to be able to offer cost of living adjustments. So they don't slip even further when city funding is contracted and doesn't go up with him if I should a sequel of a cut for us for a staffing for a service. So, so please do past this permanent legislation to ensure that social services can keep up with inflation. Thank you. Good morning. My Name is Earl Holliman on the director of Catholic community services of King County. I went to the city of Seattle job opportunity page this morning there 92 open jobs, and I was glad to see that 91 of the 92 jobs paid at least $22.59 an hour. I work at Catholic community services. We have 502 employees in King County 75% of our staff are below $22.59 an hour. I want to be clear. I'm glad that the city of Seattle is trying to pay folks a living wage. That is a really good thing. But let's not kid ourselves either. I think that this City's homelessness and Social Service response is built on the backs of workers and nonprofits that work for under living wage often times. So I say that every penny that you folks can give will try to get us to the same standard that you apparently hold your own employees to so in closing I would just say Please you know our staffs here are working more and more with harder and harder folks to serve. They're doing it with compassion. They're doing it with competence. They're doing it with a cost of themselves and their family the frankly I find inspirational. So please help us by granting the information at the end of the adjustment. Names of shiza Don Cherry singer South Park Stephanie Anderson from y w c a and Jessica Horton from Pan Pacific. Sorry about the pronunciation of thank you in Northgate. We are a small business and I sit on the small business advisory Council Seattle hoteliers including myself have supported Progressive legislation. So does a minimum wage increases paid family leave at the state level and panic buttons for hotel employees as an immigrant business owner. I'm fully vested in making this city and region of vibrant committee for a community for all. I'm also a member of the Asian American Hotel owners of Alliance known as a national organization called The Witch has written letters to each of the city council members and the mayor's office regarding the proposed hotel workers registration. Numbers are primarily 1st and 2nd generation small business owners with a strong appreciation for the opportunities that are offered by a community that is supposed to be welcoming towards immigrant in family businesses. The reason I always was founded was because they face because Asian Rock Hotel Las Olas a toner throughout the country were facing discrimination from Banks and insurance companies and other challenges associated with the rigors of Entrepreneurship. That's why they were founded today. What they're finding is it people like an unintended consequence? I would say at the Seattle City council's hotel workers legislation or proposed legislation is going to disenfranchise disproportionately the small and family owned and immigrant-owned hotel and related businesses in the city of Seattle. Thank you, and feel free to leave your remarks to see a resolution to thank you. Thank you for leading. Sorry about that. We next have Can I get the right clock out? Okay, maybe I mispronounce that I'm sorry if there's anybody here whose name is HOA. I'm going to keep going Michael Quinn. Good morning. My name is Stephanie Anderson, and I'm a program manager with the YWCA of Seattle King and Snohomish. I want to thank the council for your time and attention on behalf of myself and the YWCA of Seattle King. And Snohomish. We are due to automatically adjust the Human Services contracts for inflation so that we can maintain the Human Services infrastructure that we've built together. We all understand that inflation is part of daily economics. That is why in 1975 Congress recognized that the cost of living adjustments were critical. Specifically in financial situations where institutions and people are working with a fixed amount of income are current services are facing steadily increasing operating costs like light heat water. And other maintenance cost to maintain facilities, unfortunately, not all the hsd contacts provide the capacity to cover safety for those Weser or the cost to serve. Thank you. Welcome. Good morning. My name is Jessica Horton and I am the director of people support for the Pan Pacific Hotel in South Lake Union. Thank you for allowing our hotel and the opportunity to speak and be heard again, as I mentioned to you last week. I worked in various different Industries to include law enforcement Social Services nonprofit and supply-chain. We care deeply for the Health and Welfare and safety of our Associates. And we have an understanding that taking the best possible care of our associate is Key to Our Success something that every owner GM and hotel personnel in this room can attest to its enlightening and ironic at the same time to hear from the nonprofits that have testified this morning in regards to what they get paid in the dedication and what they're bringing to this city. We're focused on hospitality and overtime when maybe we should be focused on nonprofits and paying them appropriately. Thank you. Michael Myers, and then David pedal. Thank you. I'm Michael Quinn from Plymouth Housing group in for too long. Even as the crisis of homelessness in our community has grown due due to insufficient resources Human Service Providers are asked to do more with less as if you'll the road to success passed only through efficiency landmarks as someone who's worked in the Human Services field in Seattle for 29 years. I've seen the challenges increase the provider to try to valiantly treat a deep and hemorrhaging wound with Band-Aids and Purell and sleepless nights. I want to thank the OPI you employees of our agency that are here today for the sacrifices they make to do this work. It's as if the provider just tried hard enough for collaborated not Ford added enough this wound would heal through triage rather intensive care today permanent Supportive Housing providers or actually holding on to individuals that that really need to be a nursing homes or assisted-living but due to complex behavioral health issues. They actually Everett maintaining permanent Supportive Housing and closing. I'd like to say that the mayor of Austin is touring our city. Did I over the next couple days to learn what mistakes we've made and put in our work and I would say the first thing I would tell the mayor of Austin to do is make sure that you have an adjusted for inflation in all human services contract and hoped it would support the same thing. And folks can line up behind David and then Mary Lou Dickerson. Hi, my name is Toby homeyer. I'm one of the code 2nd of directors of gender justice league where an advocacy organization fighting for civil and human rights for transgender people. You're good at what we do but vastly outpaces our ability a marginalized communities disproportionately face this burden facing discrimination job loss greater risk of violence. Then have a harder time accessing Services. There is zero shelters in Seattle design for Trans people and existing shelter struggle to prevent anti-trans harassment gender justice league was not created for Direct Services, but we started providing emergency housing out of our office because we see the need in our community as so great housing cost not to mention office rent are rising much faster than inflation and our community needs better service has the least that you could Play services not fall behind. Thank you. Steve Dashiell and I'm speaking on behalf of the Seattle Human Services Coalition this morning shsc members centers gender-based violence response and prevention to and prevention to community clinics Human Services build well-being in Seattle automatically adjusting Human Services contracts for inflation would allow you to keep up those services and maintain the Human Services infrastructure. We built together in some years the city has made inflation adjustments on some contracts, but even though sporadic adjustments amount to less than the actual cost of inflation effectively reducing the reach of services, simply put you undermine our capacity to reach our goals when cost to provide services rise, but your investment does not consistently adjusting for inflation isn't effective Common Sense business practice weird you to implement Thank you. Hello, my name is David hilde. I'm a housing case manager at dese and a union Delegate for SEIU 1199. I work very closely with some of Seattle's most vulnerable homeless, and I also helped to represent all of the sc's union-represented employees and I have done so for 4 years now and I can tell you that. We simply don't have the resources to do what we need to do right now. And I thank you very much for introducing. This bill the inflation-adjusted contracts would It would absolutely help. We we simply need more the number one complaint I hear from the other employees is why aren't we getting paid more? The number one complaint I hear from clients is why can't you give me the things I need in order to live? Why can't I have clean underwear? Why can't I have food? Thank you. Thank you very much, David. And I apologize. I didn't say your name earlier. This is The Honorable representative for your service to the state. Thank you and good morning Dickerson and I'm here on behalf of the Youth Care board of directors in support of the inflation legislation. And I'm also here as a former member of the legislature and chair of Appropriations for Health and Human Services. So I really do know how difficult it can be to balance all these things when you're doing a budget, but I also want to say that we have a history in government including the city of putting Human Services off and on the chopping block when it comes to balancing things and that's been happening way too long. Ended up in the field of Human Services here in the city being literally at a Breaking Point. You're going to hear today about the lack of inflation adjustment and how it impacts agencies ability to recruit and retain staff and that's provide quality services. But what I'm here to talk about is impact on infrastructure of the Human Services agencies infrastructure that includes crumbling buildings broken elevators, 15 year old computers, etc. It's time that we treat human services as we treat our public infrastructure. Our roads are bridges are seawalls Etc. They keep us safe. So does Human Services? Ensuring that providers can keep up with the cost of doing business is an essential for step and stabilizing our human services and bring us closer to realizing the city's division of adjust and thriving Community. It's time it's past time. Let's do this now. Thank you very much. Names of Simone Simone. Good morning, members on my name is human on do and I'm here today on behalf of used as a Writing Center to support are there any inflation adjustment for Human Services? And the last two years the rising sun has had to fix a broken oven laundry machines showers bathrooms and a heating system the cost of basic maintenance. It's about a budget for example for everyday that our laundry was broken. We pay 250 at night to clean the shelter sheets of money that could have been spent on staff and programming years. I witnessed a turnover of over 45 staff members have the Ryan Center as a manager. I invested time and money and staff development for high paying jobs. As soon as they got the necessary experience every time this happens young people's bassline drops because of the separation and retraumatization. Which makes it that much harder for the next staff member to build trust with a youth. The difference between the staff and youth is one paycheck as a leader. It is painful to see my staff struggle in the same way as our use just to survive. So I'm asking you to help everyone here to maintain our buildings and Implement quality programming is because our youth and staff deserve not to just survive but the brave thanks so much. Good morning council members. My name is R Kelly Malone and I'm a program manager at Youth Care of testifying today in support of an annual inflation adjustment for Human Services contracts. No one comes into this work looking to make money, but I fought tooth-and-nail to get this job because I saw that youthcare was one of the only agencies in the country to help us under 18 years and over 18 young adults. This was important to me because turning 18 doesn't mean you suddenly no longer need support or guidance or access to resources. How do I know this? Because it was me. I was homeless at the age of 15 and placement of foster care, but when I turned eighteen was like DSHS wipes his hands of me as completely on my own. I was one of the lucky ones when I turn 17 I was connected with a non-profit where I met a woman named Kim. She only receive a scholarship that help me go to college. Timberlands that I was worth something and that made all the difference so I know personally the importance of this work because when done well it changes lives. My biggest fear working at Youth Care. Is that what we can't keep up with us when we can't pay staff enough to do their job well because harm so I'm asking that you give agencies the resources. They need to create long-lasting positive change. Thank you for your time. My name is Liz Angie and I am here representing International Community Health Services. Thank you for the opportunity to speak in support of the annual inflation adjustments established in 1973. Ichs is a federally qualified Health Center that provides culturally and linguistically appropriate comprehensive and affordable health and wellness services at 11 sites throughout King County are facilities and providers offer patients the very best in Primary Care Quality and our programs give community members the opportunities they need to live healthier and more fulfilled lives at every stage of development Health Centers, like ichs are crucial access points for people seeking high quality and affordable health care that they cannot get anywhere else. One of our patients has described seeking treatment for chronic kidney disease condition worsened by the combined stress is a financial burden and societies lack of awareness around trans issues, but ichs provides this patient with a place where they feel cared for. And where they are finally starting to trust Doctors Without stable funding streams. It is very difficult for health centers, like ichs to make long-term program and Staffing plans that allow us to best serve our patients and communities. Thank you for your leadership on this issue. Good morning. My name is Jenny Burton and I work for Catholic community services. I'm also a single parent of three children and a victim of domestic violence years ago. My husband beat me terribly in our home and he was incarcerated at that time. I was getting ready to transfer positions in Catholic community services to supervise a case management program with Saint Martin de Porres shelter and Lazarus day Center. Oh my good transition into that position. I didn't have a lot of time to think about mental health. I'm it was really important for me to be able to independently support my children and to pay the bills so that I did not also become homeless. I've been in that position for 3 years and about a year-and-a-half ago. I made the decision to return to school because Catholic community services was unable to give me the race that was necessary for me to continue to support myself and my children I will be vacating that position in on September 13th, and it's very concerning for me that we are as Social Service workers were here. To help support people that are in positions to not be able to take care of themselves. However, as a supervisor of a program, I too cannot afford that and I'm susceptible to be coming home with myself. So I really hope that you support the adjustment for inflation. Thank you. Thank you very much. Good morning, My name is Angela. I could have dragged her at the domestic abuse women's Network. I'm here to request the passing of inflation adjustment across the Human Services contract for providers at dawn. We support Empower and shelter survivors of domestic abuse by staff worked tirelessly around the clock to serve survivors in the last year who spoke 17 different primary languages. We also saw an average of 109% increase in client need our crisis support line took over 5,700 calls in our shelter provided services for a hundred and five women and 107 children. However currently for everyone Survivor family in need in King County 57 or turned away. It is imperative to pass this legislation to continue to provide and grow our services by staff work 24/7 on a crisis line and we see the growing need And the ability to provide my staff the resources and support inconsistency to provide services for this vulnerable population. Thank you. Thank you very much. No, we really appreciate you coming to testify this morning and sorry to cut it down to one minute. We do have six more people signed up. But at this point we've been doing public testimony for 45 minutes. I do need to transition to the domestic workers Standards Board appointment cuz we got some folks that need to get to work and I hate that feeling when you got to get to work and you're running late. If we do have time, we'll come back and we'll do all we can do that as well. So I'm going to leave the public comment period open just in case we have additional time that we can squeeze it in but I would like us to go ahead and read into the agenda item number one. Can we please have Jasmine Victor and Brianna join us at the table on the agenda item one appointment of Victor M Lozada as member of the domestic workers Standards Board for turn to February 28th 2022 for briefing discussion impossible vote. The Ben is so today. We have our last appointment to the domestic workers Standards Board. This appointment is the ninth position. I was selected by the board. We're going to have each of you introduce yourself for the record and Victor. I know you have to go a little bit early for work. So my experience Yes, please. My name is Jasmine marijuana with the Seattle office of labor standards. Lazada and member of the Casa Latina labor works in your new role as well as the labor standards. Would you like to start with some comments. Thank you so much. It's great to be here. So as you know last year Council passed a domestic workers Bill of Rights granting increase labor protections for right up. Here it is. So I used to tell people that granting increase labor protections for domestic workers including the Annie's house cleaners. Tux Gardner's home care workers and household managers who work in a private home in the city of Seattle domestic workers ordinance. Also created the domestic workers Standards Board to provide a forum for hiring entities domestic workers worker organism. Jones and the public to consider analyze and make recommendations to the city on greater legal protections benefits and working conditions for domestic workers. I should actually pause and say that I will just continue with my my Spiel my in English and interpreters here primarily for when Victor if that's alright, so that's that's why I'm just going to keep going if that's all right. That was my understanding. muchas gracias por Standards Board for worker representatives to workers in particular and to work organization representatives for hiring entity representatives and the board has met five times including a day long. I'm Retreat and to get prepared for the the work plan that we will be submitting to you later this year and that we are here today because the domestic workers Standards Board has selected as nice as member of Victor Lozada and we are asking for counseling confirmation on his appointment. I'll let Victor talk a little bit more about himself that I wanted to say that the board was very impressed with his application and in particular is very excited for the organizing experience that picture brings as well as his experience as a gardener in the city that was sort of a gap in the industry. Represented on the board and so the board really feels that they are ready to go with the with Victor's knowledge and experience and now I will turn it over to him. Thanks. You can also trust receipt for Arkansas braces. What is the what is the movie mode Evolve game? I am very much motivated for the fact that this new code has been accepted by the city of Seattle a participar call me Speedy in Seattle, and I feel compelled to participate due to my experience. Lagunitas Yandel Como in Como La Cardenas Both as my experience with as a gardener and also with the citizens. You don't know saying centimos. contentos no sentimos We all feel happy and we feel relaxed when we are in a garden salad para mantenerse en la cancion que lo que no te gusta in order to keep the car then in the condition that would like it to be. e mistletoe sintoma de los trabajadores still bringing the voice of The Gardener's and all the garden workers to this meeting to this place now. It's okay. It's on Grand Avenue. Seattle Seattle is doing a great thing that is giving us the rights that other workers have. beautiful math game and I think also that the city like our society in general like any other living organism. No solo SE trata. I promise this organization directed is soliciting. Sino tambien una plataforma para trabajo adults are platform that this working force with a purpose and passion alized window. For example than Vancouver. BC has very beautiful gardens weather as uncle versie, and we know that we can have the best Gardens in America. Estonian bokito consolidate leche I'm a little bit tired about that crochet. Localizer. Gardening is a low-class job. You can order cure inteligencia intelligence or operates banking. Are all the notes that the garden is more complex that simply go and taking all the Arabs. Mills-Peninsula and Mexico waste into organized and O A Las personas que participan en el trabajo my experience in Mexico West organizing people that work for the elections many years ago. satisfaccion could try to improve Society Young kasim play System Song Miss Multiverse Jonas in his reflection is over the state. So what is the reflections about this job? Gracias, thank you so much for being here. Thank you for your support and advocacy for other workers. Council president just want to say thank you for serving and gardening in my opinion is an arch and he described it beautifully yellow pinion the Garden area as soon as critical born and look for it. I think you'll be a outstanding Edition. Okay. Thank you. I just want to say that it's real. It's really important that we have on this board with lived experiences like yours, and we as council members count on you to push us so that we can pass better laws for workers in our city, and we could be a leader in this country. Thank you. Okay, no more questions. Turn off a lot of energy around this team. And I know that you're going to be a great addition to the table. You say que pasa SI necesito Mas experiencia, and we need your experience. So without any further Ado, I'd like to go ahead and move the committee recommends confirmation of Victor Lozada as member of domestic workers Standards Board universally pass. Did I say for example a dressing for a turkey and we will bring the motion to the full committee on July 15th. You don't have to be there, but you're welcome to be there. Stop being a second agenda item. And before we do that. I just want to thank our full table here. Our committee members come from ever Bagshaw vice-chair Juarez president Harold. Thank you all for being here today. Please welcome to the table Emily Alvarado and Tracy Radcliffe and if you can read agenda item number two. Diadem to cancel bell one 19537 and Ordnance relating to the sale of low income housing for briefing and discussion. Welcome and Tracy Russell Council Central staff Emily Alvarado off housing. Excellent. So I want to remind folks there is not a vote on this today. This is one of the bills that we will be discussing again next committee meeting. We did have a chance to talk about this bill at once already asked folks know this is an opportunity for us to provide an additional to Lynn Turtle belt. When were looking for how we level the playing field so that more tennis themselves a non-profit developers have a chance to access multi-family units as they come on the market right now. There's a lot of people who are coming with cash in hand to buy some of these multi-family units. So what we're trying to do is provide more opportunities for folks to have a chance to make an offer either as tenants or nonprofit developers, and I'll hold some of our comments around the Amendments as we walk through the Tracy. Thank you for so much for the presentation that you've Provided for us and we will jump right into it again. As a reminder of this is a discussion purpose only a meeting and we will have a potential vote next week. Thank you, first discussion of the proposed legislation on the 13th of June committee today. I just went out for small kind of Briefly summarize what's in the proposed substitute and then go to the four amendments that are being proposed for discussion today. So just to remind you in the proposed legislation, it would expand the notice requirement to include multack eye buildings with two or more housing units. Currently. The nose requirement is only applicable to buildings with 5 or more units. The notice. Would be increased from 60 days to 90 days. It would require the building owner to submit a signed declaration to the city stating that they are complying with the notice requirements included in this legislation. It would require the building owners to promptly post notice in the building and that's going to be sold in this is to alert the tenants to Reality that that building maybe in bed sold. It would require building owners who receive an unsolicited offer to issue the notice to the city and also to the tenants within two days of receiving that offer. It would prohibit the building owner from executing a purchase-and-sale agreement until 90 days after the required notices are issued. And then finally what increased the penalty for non-compliance from $500 to $2,000. Tumbling to the proposed amendments amendments. The first is a tiered notice requirement II has to do with an evaluation of the notice populations by the city auto the third has to do with workshops to facilitate Building Sales and the fourth has to do with strategies to monitor enforcement compliance and provide ongoing stakeholders group. So the First Amendment which is the most complex of the four makes changes to the notice requirement and what it does is it would establish a tier 2 process and it would have a process for small buildings which are the two to four buildings sized unit buildings or duplexes triplexes fourplexes. And then there be a separate notice process for buildings with five minutes. I'm just so you know, we didn't pick this up out of the air. We actually look at San Francisco and DC who have a similar tiered notice requirement. So we really looked at what they did we had conversations with About this and what we have come up with I think is kind of what reflects a lot of those conversations and input from other jurisdictions. So the first I will look first at the two to four units, so I'm after the order issued a notice whether it's because they're getting ready to list the property or because I got an offer. 15 days after that owner issues that notice a tenant tenant group non-profit housing developer Seattle Housing Authority, right ABS also added a relation to this would have the ability to issue a statement of interest to the owner to building owner. And that would be a written statement via email. I think we all the various ways that you can transmit that if I got first 15 days nobody let the building owner know that they have an interest in purchasing the building. The building owner would be free at that point to move forward with a sale of the property. If you had one of those entities raise our hands Apprentice, did you move on to the next tier which is 15 days after that statement of Interest was submitted. They would have to add the tag with in this case and explain why we don't require it of the others or the tenant group would have to submit documentation that demonstrates their financial ability to purchase the building and the legislation we Define the documentation as being something from a financial institution or mortgage loan officer or lender that shows that the tenant or the tenant group has the financial ability to purchase the building. We also give away to the ability to establish other forms of documentation, which example could be a liar from a wage that says somebody is eligible for a home ownership needed to buy the building is one example, we can think of but they would have the ability to look at some alternatives. Find something in the context of this amendment without the amendment the concept that a person sell agreement cannot be entered into within that 90-day window. The thought being of course, you give nonprofit developers of course and opportunity and give the tenants an opportunity to relocate which is behind an 8-ball if they just get 30 days notice that particular the lower-income read that stuff the concept behind the correct information for them. If I don't think it's necessarily idea that we're going to be stinking the tents are all going to decide to relocate because of building frankly may not sell or may not sell for months, but it's just to give the tennis notice of that potential about to become the concept of the 90-day wait. Will. It's not driven because of the needs of the tenant. I thought it was driven because then he's a 10 because they have two particular in 80% of Ami person has it. It's going to be hard for them to relocate quickly. Not that we're trying to give them more time. So that's not a policy consideration is to give a tenant a nonprofit organization the city or sha the opportunity to actually submit an offer to the owner. It may be secondary thing might be that you give tenants notice that might enable them to move. That would I don't know if that was really the primary that things that we're going to give them the information that's going to make them want to move us to give them notice of a potential sale of the building. You're right. There's some really great programs that are office of Housing and others offer to tenants for relocation assistance. This was really intended to make sure that those who are living in multi-family units, especially those At least one unit at 80% Ami or below that they have the same opportunity that we had provided to those living in apartment buildings with five or more units. We currently have in statue that you if you have a 5 or more unit multi family structure. You are supposed to notify the city before those buildings are sold and what we found is that many of the nonprofit developers have said a 60-day window was just too short for them to get all the materials together. And what we also decided is that many of our tattoos we can for unit structures. Those have a lot of really affordable unit. Sometimes that I can get picked up on the market very quickly and we are not giving our chance for the tenants or the nonprofit developers to help make an offer. So it doesn't change any of the tenant notification requirements and terms of relocation. It also doesn't change the cost of the building were not messing with the market in any way there. Seller cannot sign a document or can they sign a document but not close it within the 90 days. I could not sign a purchase and sale agreement until the 90 days have elapsed to be clear. There is no requirement for the antennas to be noticed underneath the current Provisions the current policy. So that is a new piece. But again, I think the intent was to give the Tennessee opportunity, but also just to let them know that there could be a change and then the situation is with a sitter building ability to purchase the building if they cannot Provide that documentation the owner is and fat-free at that point again to move forward with listing and or selling a property. We don't require we are not requiring. Sha the Austin housing or a qualified nonprofit housing developer who has raised their hand and said we're interested in purchasing. We are not requiring them to meet that Financial ability to because we presume they have the financial ability to do that. It's the tenant or the tenant group that may be the ones that we would have wondered whether they have a financial. Is he so he cornered me coming into my office and we had a good chat about his concern around nonprofits and the impact this would have on an individual non-profits ability to purchase and I was just wanted I think you just answered the question Tracy well, but I just wanted to reiterate that if Catholic community services are Punnett housing or any of the Bellwether or others. Do they have to be pre-approved by the office of housing. How does that work? If so much they John Fox's nonprofit wanted to buy so we Define a qualified nonprofit is a housing developer who has done an affordable housing project in the city of Seattle think three projects maybe and is in good standing with the office of housing as defined in a housing funding policies. And basically what that good standing requirement is that they are in compliance with all of their management plan require. You know operations that they're building. So it's getting at 1 they've had experience developing housing and doing that well in the city and also that they're operating their buildings well and so we have to find them and said that those will be are qualified nonprofits who we will presume have the financial ability and frankly the operational bility to take on a potential purchase. So just paid backing on what council president of here I'll head ask the way that this amendment would work is that if it's a 10 and a tenant group first they do razor hand as they were interested then within 15 days. They have to come up with something that says we've got the resources to do this. But if there is no tenant group that does that then it's 30 days later the seller could enter into a contract with someone else. How does the nonprofit fit in there under those circumstances first? 15 days would have to raise her hand and say I have an interest and if they do Then they have an additional thirty day actually have 15 R2 to The Cellar and try to reach agreement on the sale of the building. But I think part of the question that came up and I want to thank John for raising this is that some nonprofits. I mean most of them Emily. I mean you're the star here on this they leveraged funds they apply for Grants. They're working on tax credits in order to bring that package together. So what Assurance are we giving the nonprofit by this that they will actually have the time that they need to accomplish what we're trying to do. So one of the conversations that we have had about I think this proposal is that we we don't have resources to buy every potential building that might come up for sale in the city of Seattle. So we should not be thinking that we're making promises hear that. Going to be able to tour the nonprofit are going to be able to step every and every one of these buildings and purchase. I especially think that's true and you can correct me if I'm wrong on these smaller projects a duplex or Triplex and fourplex. We have a different notice requirement for the five are larger unit has a longer. In terms of putting together a purchase and sale agreement but as it relates to the smaller units, it's hard for me to imagine ever going to have a lot of nonprofit or. Take advantage of those units. I think that's where I see more likely the tennis Resort in a group with step in to say we want to purchase those buildings and you can tell me if I might be wrong for past just a few weeks ago are administrative and financial plan. And in that plan is our acquisition and preservation fund. It's now a revolving 30 million dollar funds that uses other money that have long-term needs for short-term purposes. And if someone were to apply to funds for either preservation acquisition loans for multifamily or for home ownership. It would be through that fund and and those are very limited resources in places like San Francisco. For example, where they have these kinds of notice requirements. They also actually tend to have stand-alone preservation funds like the small sites program in San Francisco that then can create the resources to effectuate the outcomes that are identified in the notice ordinance. I'm counting the problem. Thank you. I'm can you just remind me for the sake of my bad memory these three steps as described in the bill before us are all three of them collapsed with 90 days. Is that is that what it needs to be demonstrated within 90 days? No, the current bill was in place of it obvious. There's nothing about these to your notice requirement 90 days non-profit own volition. We say nothing about their ability to go to a potential seller and submit a purchase-and-sale agreement. There is nothing that says anything about this ability to show that you have interest or show that you have Financial liability. None of that is in the existing bill to make it known that The property is for sale for 90 days the red no obligation to demonstrate anything to the owner with on the part of the nonprofit with him at night. I would add what we had heard from a number of folks both. Can you organizations and some folks who are in this industry has you know, there is a real interest in making sure that the folks who are saying I would be interested in this property. I'd like this, you know, they're raising the hand that Tracy talks about do have the viability to make the offer or not including nonprofits developers in that and in fact of the tenants we are also including in the posting that if they are interested we're going to give them the information for where to go to reach our office of housing. Sha and nonprofit developers. The concept here was though we often recognized that we don't want folks necessarily raising their hand and then putting us stay on a potential sale for 90 days if there really is no ability to do that. And so we wanted to put it in a reasonable time. For the raising of the hand and recognize that our nonprofit developers are not going to have to verify they've already been verified in many ways. But if there's tenants were interested, let's say it's a fourplex and those 410 is were really interested in creating a co-op developer to show that they have not just interest but they have also potential viability then they have that additional 90 days to say additional 34 unit structure. And then what we've heard from others is that many of the five plus unit structures are much different animal when it comes to purchasing. So this helps us, I think recognize that some of these opportunities to purchase are not going to be acted upon and then freeze up the sail a little bit quicker, but also I think it gives us the ability to then hand-in-hand work with some of the tenants who I want to be interested and know that they need to show action by certain date to ask us to keep going through the presentation because I know we have other items on the agenda. And I want to let her Council colleagues know as well. I've asked our friends at the office of labor standards if they would be willing to come back a different day for the recent social justice report. And that way we can have a robust discussion on the next two agenda items. And sure if I can ask and first of all, thank you for allowing me to come in late. I had to acquire the Retirement Board committee this morning. Councilmember Warriors and I have a 12 no problem. And I'm wondering whether I'm one of the items that you are intending to have a possible vote on should be discussed at exactly what I have mentioned the council president. We're going to go to Beach SC inflation adjustment right after this great. Thank you. So that first statement of statement of interest for that type of building would not be doin 2 until 30 days after the owner had issues than those of intent to sell and this is again in recognition that these are and that typically larger buildings the due diligence the financial need to kind of pool resources together is all the more complex. And so this is actually an alignment what we heard from the industry about how long these buildings can take it as well to to actually move through the process of the sale. So that first Avengers with you do 30 days after the notice issued the next tier I would be another 15 days if there was a tenant or tenant group that was interested in purchasing. They would have to in fact show their financial ability at that next 15 day. And then finally submittal of an offer would be due 90 days after that first three days when the statement of Interest was issued by the owner. Would you like to talk about some of the conversations that you and I have had with the industry with folks that sell commercial real estate. I know that initially when I had asked about a hundred and twenty days what kind of an impact that would have that it was a major concern, but then I think that some things have been ironed out love to have you bring that I really want to appreciate and say thank you to your support for the First Amendment because that was one that was there was a lot of concern among smaller owners that if they couldn't sell when they were prepared. That could put them in an interview and a problem with the market. So I think the fact that we have reached a compromise with 15 days notice in another 15 days where I attended attend a group can demonstrate their financial abilities is I think that that's a compromise that at least from what I've heard from the sellers Representatives that they can live with so I thank you for that. So I don't want to really dive into deeply but I think with this idea about the hundred and twenty days in the commercial Market before the final decision can be made on to whom they're going to make an award. I just would like to have further conversation about that and I know maybe Emily you've got something you can weigh in on as well. So I will add to that. I think what we've heard about the existing ordinance. And remember you will pass this with consumer Clark and come from originally which was focused on that last column four units of five or more but we heard in conversations with many of the nonprofit developers. Is that what they exist Inc. 60-day requirement was just not enough time to do exactly what you talked about a few moments ago, which was to confirm that they had that leveraging funds that they had two matching funds that they had all of the ability to make a competitive offer and they ask for a little bit additional time. So what we've done here is basically you say if you are interested if you've raised her hand and said, yes, then you have 90 days to act to get your offer together and submitted this really also I think in some ways freeze up some of the sellers and your point if any of the nun Developers are not interested in the purchase of a unit with our I've actually give notification much earlier now and the seller of the the need to hold onto the building. So in some ways it's a little bit of an ask for longer time for the nonprofit developers if potential purchaser is interested, but it's also a little bit of a relief to put an item back on to the market if there is no one who stepped forward and asked for it and right now we know that there's a concern that people are At being asked to hold onto property property when there's not going to actually be a non-profit developer who comes forward this gives them more relief and then I'm putting this from the perspective of a stellar that they can then put the item back on the market. So in some ways it's a little bit additional generous time for the potential purchaser. But if no one's interested is a lot more relief for the seller and it's going to put those items back on the market faster. So in this case with the size of a builder's that lets you so we've got a 5 unit building if nobody steps up within the first 30 days raises her hand and said I'm interested then. the remainder the it goes back on the market, right? We're not doing cheer. We don't have the two two and three here is a shorter. Of time than under our current legislation as he has and it's how many does raise their hand then they have essentially 120 days from when the first statement of Interest 90 days after I get the resources to do so, that's true. But it's only for those who are truly interested. Want to go back? I'm sorry. I'm I know we're trying to move forward. But I have a question for Emily Alvarado as it relates to the two to four unit properties because we have a case study right now the duwamish valley affordable housing Coalition has identified a fourplex and they're working with the office of housing submitting an application for some Bridge funding and my question would be do we know whether or not the tenants in the bility indicated their interest within 15 days of that building becoming going on the market and do we know if they then Indicated a statement of interest within that time frame. I think I'm screwing up the tears, but you get what you get what I'm saying and and will office of housing be able to respond to the application for bridge funding within 30 days. Is that realistic? I'm not asking you whether or not you intend to word it, but is it possible that you could turn around and application for for a bridge law within 30 days of receiving a request? Because that's the standard that were asking tenants more nonprofit to to me. So all good questions. I actually don't know the specifics about this property as a as a reminder or an under the current law. The smaller buildings do not have to provide notice. So they would not be covered under the existing law with a fourplex and also as a reminder for folks we have existence. We should provide notice providing notice. So as you consider this issue part of the question is what's the balancing and how we actually get compliance and get the outcomes that we're looking for. In this case. You have an example where a tenant nonprofit organization was able to identify an opportunity absent this law and we do want to be able to support people who are able to build that. Wishon ship with property owners so that we can actually have the outcomes were looking for I think that it's possible for us to underwriting acquisition Loan in 30 days. I do believe depending on the scale are present acquisition loans are a revolving fund. So someone would put in an application and we can consider that we consider that if there's an increase in applications, however, right. So the question is how much of this is going to create an additional Demand on both resources and staff capacity. If that's the case then we have other considerations about how do we support this work administrative leave because we do not have dedicated staff to be supporting this work at this time. I think a lot of us and he's Paula. We all generally agree. There's nobody here or snow. Certainly. No one on the second floor that doesn't agree that this isn't a good thing. But what I get concerned about just common sense of breakout and I know you can't close a deal in 30 days. I just that just doesn't happen if it's never happened in my life at 32 years of doing stuff but putting that aside you get two or three people who want to buy the property. You're not going to close in 30 days you going to use it more resources? And so I want those son. Close by I'm sorry in your experience. Have you done that? As of now in real time? I'll need to go back and check on what it looks like. You know, we are almost not closing any acquisition loans on properties of this size and the size and scope of the problem. Let me clarify something. Let me clarify something difference between the More of the 90 days plus because what we hear directly from the nonprofit developers Seattle Housing Authority office of housing is that it is a longer. Of time for those multi-family units. The reason we've actually Shrunk the time to 30 days is precisely because what you said, we have her a difference between large units and smaller units and what we heard from the sellers of two three and four unit buildings is that they can close within 30 days. There. Are there normal. Foreclosing not closing price to have an offer is with him and within a 30 day. Originally I was saying let's make it easy for the smaller units as well and they were saying you don't understand different in terms of who's making an offer on how fast The Hobbit buyers were waiting on getting funding approvals from the city of Seattle. That's what I'm talking about. I'm talking about people who are waiting to get approved for a loan. From the city of Seattle office of housing submit documentation that they have the financial the latest posts are more likely to be in the 90 day... Fits into this column. So I will get back to you on what it looks like to underwrite one of the smaller buildings and how long it takes to consider a loan application just as an approximate get back to all of you, but again to the extent that it's hypothesize that all of these deals come to fruition by virtue of our funding that's really unrealistic given our resources and given our staff capacity. And so as we expand policies, we just want to consider the extent to which we can actually achieve the outcome. You're going to have to be these different indications of Interest. Okay. Yes, please notice of intent to sale when a seller is triggering that process can the seller still just it and move forward without accepting anything and putting on social justice almost just an internal processor. They can't even list it until this is complied with Mike. Why can't they because trigger more inquiries and put the nonprofit at a disadvantage for the nonprofit status groups the city sha the opportunity to work with a seller tape to put an offer in policy is well, I'm 60 days. So I did pass out for the committee's reference this brand-new report that folks probably saw his post all about on Monday on this is from the national league of cities and this is a report that talks about various strategies at the national and local level for addressing the housing crisis, and I wanted to call out on 29 and 30 23 and 24 when I was reading through the report. It really did highlights a strategy that we're talking about here, which is increasing the ability for people to come to agreement reserving existing housing on existing multi-family structures. And then she counts then we need to do more to make sure that there's technical assistance and I know that we can talk a little bit more about some potential amendments around that but really helping to make sure people have the financing to come together that's part of what the notice and Developer so I thought this was an exciting keys to lift up because I think it's a component of the overall strategy and Seattle is highlighted in here. We got a chance to be a case study in their report and really proud of all the work that Seattle has done and then we'll use that we're incorporating what other cities have done as well around this notice legislation, obviously San Francisco and others have had something similar but it gives us a chance to say that this is one additional item. That's really a highly recommended best practice that we're putting forward. I'm do you want to talk about 5 more minutes. Nobody has any more questions for the moment about obviously I can feel more questions afterwards. So moving to an amendment number to it would actually request the city Auditor in cooperation with the office of housing to evaluate the multifamily building owners compliance with the nose requirements may be requested the evaluation occur in approximately August 20-21 or two years after adoption and requirements on the report that the other would do would be submitted to the city council by December to 30th 2021 and when include any kind of recommended policy changes this has to do with workshops to facilitate building sales at he was getting a little bit at the technical assistance fee is here. So I'm this amendment would request the office of housing to facilitate workshops to discuss supporting sales of buildings to interested parties participants in the workshops would include 10 groups nonprofit housing developers Community organization Housing Finance her is because there are other folks who actually provide a position funding Housing Finance commission is one such entity are there are others Realtors and Brokers and then owners of rental housing in the purpose of these workshops would be for there. In fact to be conversations about what is it? What would it take for a tenant or can I group or organization to buy a building whether it's a specific building the people have in mind or just generally what the process might be to help facilitate those sales in a way that is beneficial to the tenants in organizations interested in buying as well as to the sellers. Councilmember Bagshaw for the work on him at number two with us. I think it was a really good idea to have a look back and an analysis of whether or not this tool is really helping and so thank you for working with us on that Amendment as well. I come from were hurled. I know you had some ideas around technical assistance and education. So when I go onto amendment number for witches council member herbalism complimentary plan happens and to provide a report to the city council by September 30th 2019 that would include those strategies and the cost to implement those strategies the second piece would request. Oh2 convene and ongoing stakeholders group to create an inventory of a potential buildings that could be sold and to develop broader systems of resources to support tenet purchase of the building set. CB up for sale of the language that I just referenced in the National League of cities housing report in the desire to make sure that there is a technical assistance in education and also with office of housing that there is clearly additional resources that you all are still trying to Grapple with with existing mattress that you're doing. I would love to keep working with you on this. I think the way that we crafted it initially was to say about the office of housing would would host convening and so maybe we can get a little bit more specific about what kind of convening should include and the type of language and stuff. But if we can work with you over the next week or so on some of the language, I think there is a potential hybrid between 3 and 4 so that there's the robust education that we want and that were maybe not overly asking too much of a child and I haven't had a chance to talk to office of housing yet, but I'm just going to block that number back. I just want to clarify that I agree that these are definitely complementary. But before I think does have a unique goal from amendment 3 all those goals against their complementary. This is about creating a group that works to Monett identify and monitor buildings that might be subject to this new law. So it's a monitoring and enforcement roll. Whereas I think the workshops are about facilitating building sells. I think once with groups of tenants who are already interested in in in purchasing property, so I think it's way too, next time the other but we'll keep working with you for bringing that forward. I want to thank you for your work with the national league of cities. I know you were back in Washington this week when this was presented. There's some really good things in here. And I know that in the mayor's office were looking at increasing ways that we can make more housing affordable on a big scale and a big jump and I'm just looking through here and seeing that there are a lot of things that have been identified that the city of Seattle is either doing now or we'll be doing so I just I think this report is great preciate all of your help on this and your leadership in this area. Thank you very much, I really am pleased with where the package is coming together both with the Amendments and with some collaboration that it's coming together nicely for the benefits of affordable housing. My question is it seems like at the end of the day that the seller whether to two or four or five plus unit their their goal generally is The maximize the sale and at the end of the day if we're particular for trying to preserve affordable housing for tenants or nonprofit organizations that may be able to step in its just give me a question of money and my question in the housing is much like the Equitable Equitable development initiative and the other sort of dedicated Revenue sources toward preserving affordable housing. You all just have your general fund. You don't have a dedicated Source. I mean, can we just quite candidly just match supplement the purchase price if it comes to that for the small Consortium coming into we have a pot of money for that cuz I think at the end of the day they can get together all they want. They could set up a real estate investment trust or a LLC or a corporation and compete but can they compete cell against a stronger? Buyer and if we try to if that's our intent at the end of the day, it also just might be a question of money. So I'm wondering if we as we evaluate this weather. We just have to get your department more money to be able to intervene so to speak and whether that would be a tool that I'm not insured legally whether we can do that quite candidly. So because you don't have a dedicated source for this, right, you're just tapping into your your budget. Yes, how much it how much do we have in there? So the housing Levi Capital portion is about 210 million dollars / 7 years for the purposes of rental housing production. And in the event that the acquisition program, which is short-term money was then needed to stay in the project permanently as permanent. It would be competing against all of the other projects that are seeking funding including new construction of which we have a significant intend to apply list. So we do not have a specific part of money specifically for preservation. Although preservation is certainly an allowable use of our existing housing Levi Capital funds appreciate the mayor has an interest in preservation as well on this part of I think what she's talking to folks about and I know you guys you and the mayor just did a release recently about preserving affordable units as well. I'm so boring to get back to Genesis is making a notice available for non-profit developers and tenants to potentially purchase these properties. So we're not asking to use your own money. Great opportunity we would love for you to do that. But that's not what we're asking for in this legislation. This is about notifying both nonprofits and tenants and and we've included our resources in funding is meaningless quite candidly. So it's got to fit into notice is fine. But if it's doesn't result an actual to save me and preservation, I think you can have one discussion about the other that's correct. And I think we do have language in there that talks about looking back to make sure that this works. We have language that becomes a member her bold and I are working on in terms of educating and getting the word out and we've heard from the office of housing the concept of having these convenings and workshops. Her folks is something that they've already talked about doing that they've held convenings in the past and will continue to do so, so we are going to move on to item number to okay, go ahead and we have a revolving Loan Fund that is throughout the year for Acquisitions like this. I'm outside of the regular Nova process. Exactly. We have a 30 million-dollar revolving acquisition and preservation fund. However reminder that those loans need to be returned within 3 to 5 years because the funding is actually otherwise used for long-term operation and maintenance. So it's not its own Standalone each but hit that already depleted it's Bridge money and that's why I to the extent that it implicates permanent financing. It is just competing against the broader bucket, right? So people are likely which finding but then they're going to apply in the regular annual dosa. Okay, so we will take all of your questions if folks have questions. Why don't why don't you do a deadline of Monday is that way we can turn around some questions for our conversation next Thursday. So do let us know and I think we have a handful of questions that will be getting back to you all on today. I want to thank you again for working with us on those two amendments come from Ember bagshot and customer will look forward to working with you on yours as well. Okay crate for today. Why don't you go ahead and read into the agenda item number 5 and we're going to skip 3 and 4 right now and we are going to move to item number 5, which is the Human Service Providers inflationary adjustment and councilmember O'Brien. Thank you so much for joining us at here. I know you came from psrc and that you've been working on for a long time. So excited that you could join us today Amy Gore. Thanks for being here with us at the table jinda item number 5 CastleVille 11950421 ordinance relating to contacting by the Human Services. Are pissing in discussion and possible vote? Excellent. You want to introduce yourself? And then I'll say a few words and my name is Amy Gore with Council Central staff. Wonderful. Also, thanks everybody for being here. I wanted to take a few seconds to the council member O'Brien if you wanted to say anything. I know you've been working on this for a while and I had the chance to join a number of the human service provider organizations this morning. Hello everybody. Thank you for considering amendments to the human service provider inflationary adjustment legislation and very excited to be bringing the Star Wars thing store a chair council member Bagshaw for helping to include a big priority last year for us was making sure that both general fund and non-gender phone contracts got a 2% inflationary adjustment. That was definitely a win for many of the organizations that have been asking for an inflationary adjustment over the years. We also know that in every year there's an increase in an increase in the CPI and we have included in other policies. That wages and payment should also increase that's what we've done with the minimum wage at the state level and frankly. That's what we do with our own work for a living increases. These are organizations that provide some of the most critical functions to our city. We're talking about prevention of domestic violence were talking about assistance for seniors at senior centers in food banks community health clinics and making sure that people have sexual assault prevention and response efforts fully funded and making sure that there's meal program served and that Homeless Shelter stay open and what we heard from the providers over the last six months or so has been said better than any of us could the importance of having the stability at those organizations cannot be understated. We heard folks talkin about overstated heard from Sac about 40 to 50% turnover rates having case managers not be able to be on site for longer than 12 months because of the turnover being so high. And we heard directly from those who receive Services people who are used to seniors folks who are exiting housing saying that the most important element for them with getting stabilized to a stable case manager and they name their case managers by name. If we don't have the ability to stabilize his organization's they're not going to have those case managers in this is truly. I think the backbone of what helps to the backbone of the services that help to make sure that our organizations are funded when we saw the charts from some of the organization's about why the cost of living is increasing it's not just labor increases that they have they have the need to make sure that they're paying City Light that they're paying water that they're paying rent all of the cost of housing continue Dart cost of operations continue to go up. So I know that this is an issue that we all are passionate about many of gravel with this for years, but I'm hoping that we can do is walk through some of the Amendments that were included in the legislation and to talk about The very reasonable approach of making sure that inflationary adjustment is tied to CPI. That means you're not going to have an inflation adjustment because CPI will remain stagnant just like we've done at the state level with minimum wage when there's not a CPI increase the minimum wage doesn't go out. So we also recognize that we have to work within the budget can vines that are good budget chair has reminded us us. We also recognize that especially in those downturn years. It's important for us to have stable funding for these organizations because there's going to be more people who need food banks and assistance and are dealing with moments of Crisis, especially when we have economic downturn. So to keep those organization stable throughout this time is really critical and I hope I hope that we have hit the right balance here with our Council colleagues. I'm so I will go ahead and turn over to Amy's to walk us through the Amendments and to have some questions and comments from folks here today. I'm here for the second discussion. Just Bounce by council member mosquito our first discussion of this Council bill was at the June 13th meeting at this committee as you work all this legislation would have been the Seattle municipal code to require that the human services department include annual inflation adjustments for renewed or negotiated contracts, I did want to mention that there were several questions at the June 13th meeting which I responded to and a memo dated June 24th and circulated the council members that memo provided answers to questions about comparison between inflationary indices methods for calculating inflationary adjustments provided some measures of increase the operating cost as well as provided new estimates for budgetary impacts of this legislation in the memo is available online at the clerk's website is part of the c b 11954 in addition the submarine physical note is being updated to reflect the budgetary estimates. Do we want a brief reminder of the bill currently hsd fund Services through a competitive process that Awards funding to organizations for multiple years usually for 40 years. Have some interpreters here a little bit. Okay, though. The award is for multiple years funds are dispersed through success successive single year contracts and each year of the award. The contract is renegotiated or renewed increases in contract amount or changes to Schoo can be made during the awards process ordering contract renegotiations, but are not required during either the award process or the contract renegotiations over the past several years. The city has included inflationary adjustment in the adopted budget to apply to HST contacts from 2014 to 2018 the budget included an inflationary judge adjustment ranging from 6% I'm sorry .6% to 2.3% to be applied only to general fund contract. The 2019 and 2020 mayor's budget proposal also included a 2% inflationary adjustment for general fund contracts counsel amended the budget to apply a 2% increase to nanshan open contacts in 2019 at a cost of $903,000 council added the same amount to The 20/20 endorse budget to maintain the 2019 increase, but did not find an additional increase for 2029 General phone contracts. Council Bill 11954 to what am in the Seattle municipal code to require that hsd contracts both those funded by general fund and non General plant sources include an annual inflation adjustment. When were new to renegotiated the bill would apply to contract issues under the authority granted ahsd in the Seattle Municipal Code with four exceptions. It would not apply when the city is solely acting as a pass-through Agency for services that are not provided in the city limits. It would not apply when the contract is solely supported by State Medicaid funds or by funds appropriated by Title XIX of the Social Security Act. It would not apply when the services are provided by a consultant as defined by the SMC and it is it would not apply if it is explicitly prohibited or otherwise incompatible with requirements of the funding source. The proposed Bill states that the annual adjustment will be based on the change in the Seattle-Tacoma Bellevue consumer price index for urban wage earners and clerical workers, which we refer to as cpi-w. The proposal is currently agnostic about how exactly the cpi-w would be used to calculate the annual adjustment. If the annual adjustment for cpi-w is negative the annual inflation adjustment for the contracts would be 0% Cancel the one 19542 requires that new Awards consider previous contracts when determining what would be an accurate and fair assessment of the cost of a building a new contract additional a section 2 of the proposed Council Bill makes a technical code correction requested by law to clarify that hsd Contracting is governed by section 3.2 of the SMC rather than section 20.60 which governs City contracts granted and administered by FAS by finance and administrative Services. The current code is contradictory and this change would clarify the code and make sure that it reflects current practice. I was going to discuss briefly budgetary impacts as discussed previously The 20/20 endorse budget includes an additional 2% contract increase for General phone contacts and maintains the 2019 Super Cent increase for non General van contracts because there were more contracts awarded in 2019 than expected the cost of a 2% increase for both general fund and non Channel fun. Sources is now estimated to be $758,000 the June 24th. Memo. I'm also presents budgetary impacts for 2020 based on the more recent cpi-w data, which we asked me to be 2.9% based on the 12-month average from April 2018 to April 2019 to fund a 2.9% increase for General find a non turn off on contracts in 2020 would require an additional 1.9 million than what is currently in the twenty20 endorse budget for contract adjustments. As we discussed previously. There's an underspend of about $270,000 from the 2019 adjustment for non general fund contracts, which could be applied to a 2020 contract increase if applied to a 20/20 increase of 2.9% that would reduce the shortfall to about 1.6 million dollars 1.7 million. I also want to know if these increases reflect only the cost increase for existing services and if Council wants an increase in Services provided that would not be reflected in these budget estimates. It would only cover on the increased cost of providing existing services. And that was what I wanted to say about the proposed Council Bill. Are there any questions about that? I was just going to say one of your opening paragraphs. I think you said something about the at renegotiation time that we could add in a 2% or whatever the CPI or whatever the other percentage we might want to add what happens between now and negotiations for particular contract under this proposed legislation under this proposed legislation. Let's say an award occurs during this year. They would enter into a contract for 2020 at a particular amount. Let's say $100,000 next year during the budget process. We would look at what the CPI increase was what the general fund increase was and there will be a directors rule that says our renegotiate contract. Will need to be increased by X percent. Let's say again. We've been talkin about 2.9% So if the budget funds are appropriated to cover that then in the next year's renegotiation of their contract, the contract amount would go up by 2.9% Does that answer your question between now and the time a renegotiation there would be the 2.9% then when he get to renegotiation depending upon what the funding what did the general fun part is or whatever grants we might have then there would be decisions made whether to renegotiate a continent contract or whether that entity if we didn't have sufficient funds what their contract would be issued it all to that place. Again. This is a requirement for HSV in their contract renegotiations and would need to be funded appropriately if there was a year for whatever reason that I'm that was not funded than HST would need to make decisions about either reducing the scope of their contracts or reducing the number of the contracts. So I want to first thing come from a response for joining us. Thank you. And I know you were here in the evening when we had the presentation as well and another number of other communicating. So thank you for joining us today. Again, I'm just a reminder for phones I think in our previous conversation when we were talking about the amount that the increase was in our last year's budget. I think it was 7% of the overall budget is do you have that stat in your memory? I was just looking for my notes. I believe that is correct. And I can double-check that. I believe that's correct. I just wanted to remind folks of the the magnitude of the amount that were talking about in relation to the overall budget. I know that it's important for us to be physically wise and that you are a council member bag child's chair of the budget committee right now. I'm have her mind if we do need to be physically wise as we think about these Investments when we're talking about it, for example last year with a 2% increase the increase over the amount that was currently being proposed with 7% and thinking about will it was that was for 2% And then we're talking about maybe three or 3.5% in future years recognizing that the CPI is not always going to go up. Sometimes it's going to be smaller. I think have an opportunity for us to make an important investment into the human service provider organizations the workers the services that they provide especially at those moments of crisis when downturns are happening in people need additional assistance. I just wanted to remind folks of the amount of funding that we're talking about because 3% confound or 3.5% can sound like a potentially large number but retro end in the perspective of the overall budget is relatively small and others that we heard from today is going to be very critical for the stabilisation of those organization. So I just thought that was an important statistic that we've shared at the last meeting that I wanted to elevate. additional comments Council council president What assurances that any increase? In the contract goes directly to the employees. How do we monster that is supposed to just going into the organization. It doesn't have a requirement about how those funds are used. So it leaves it up to the organization whether it needs to cover an increase in rent and utility bills. There is a reporting back mechanism proposed in one of the Amendments that would require a report back to say how the how the money was used. I think it's believed that in some of our contracts for recycling when they were rfp's establish. I think I don't want to miss State the situation but I think there were specific references to the wages paid to the employees, I believe and it gave The competitors of the RFP an indication of What kinds of wages we pretty much demanded issue will through an RFP be paid to the employees in particular many of these employees were very diverse working in some of that torture. My place isn't so that was our way of trying to protect the employees rights it is it just our policy not to go that granular to say, okay. We're going to increase it. I'm all for that. I'm all for making sure there's where we're close to a living wage for these jobs, but I'm a little reluctant to just I mean, it could just go to the light bill. I guess it all is that they all needed the resources, but but I thought the threats of this is to help the employees which I fully support. So is it just our decision or maybe that the legislation is just designed not to be that granular. The legislation does not have any requirements about how the money is used. So as a reminder of for last year, we included a report back to us on how does dollars are being used. Human Service organizations are currently in the process of collecting that information with hsd and they will be submitting that will have a better understanding of how that 2% was apply for last year going forward though. You're right. We don't specifically say it has to go for X percent increase in wages precisely because we saw that PowerPoint presentation, which I'm hoping we can pull out if it's available on our amazing device here and we'll get that sent to you. It was a PowerPoint that showed where the cost of increased had occurred. I believe from youthcare that showed rent utilities and end all of the issues. In addition to wages & is important for us to recognize many of these organizations are also making impossible decisions about where to make the cuts when they don't get an inflationary adjustment because really the only thing that is flexible in that scenario is wages for workers. They really can't cut or make adjustments to their rent or City Light or water. And so they're ending up taking it out of the actual workers who provide the direct service so for us It's important to recognize we want these workers to be made whole and as we stabilize organizations, the the workers then are not the first item on The Chopping Block UVA require the funds go to the employees. So when you look at the cost increase from 2015 to 2018 what we see is that they're the highest increases were in electric utilities and water and sewer Services were also talking about an internet and the cost of rent. Right? So it's not just that the worker needs the money, but when we say to them you have to put the money directly into wages, which is what where we want the money to go as well. They don't have the option than saying I'm going to just not pay my water or utility bill, but I think it's a it's a really important underscoring of where we do. Hope the dollars go so that we can stabilize organizations. I think you were looking like you want to say something to appreciate the questioning and I know that as I've worked on this over the years the conversation has largely been driven around wages for the workers. And so I think that I agree with the point. I think you're trying to make and what I've also heard as I've dug in is overtime without the inflation rate adjustments. What has happened is that as council member on the skater boy saying is they take their finite amount of resources and they have to pay more for utilities. They have to be more for electric and so what is left to squeeze out of that often ends up being the wages. So when they don't have money for paying the increasing electric rates are paying the increase in rent that falls on the backs of the workers. And so I think it's important when we have this inflationary adjustment. We're doing it driven largely by our attention to these workers, but if we don't provide some resources to pay the Rent or utilities or whatever their other costs are that are also going up that will ultimately fall in the workers too. And so I think you know my conversation with the folks in there in the room here in the community. Their commitment is as much a greater than ours to their workers. I think that if it's going to be important for us as we go forward to figure out how we tracked it's a measure this the same time we have lots of tracking and measuring mechanisms for all the people get contracts and I'm not looking for hiring another FTE to report back to us on this but I do hope that the Human Service Department can help us understand what's going on and figure out what the right kind of dashboard is with existing data if there's a few other pieces, we need going forward because you know, he's our nonprofit organization. So if the money just goes into the organization, it doesn't like going to someone's corporate jet it's going to something than meets their services. We're going to want to make sure that they're being you know prudent with her. Now there's nothing of money and so we want to see that so probably represented 50. Nonprofits is a lawyer. So I'm quite I'm very experienced in the mechanics in the governance of the nonprofit. What's driving my support of this legislation is the employee peace in and I was actually thinking in the week that we don't have to or not going to the band with the look at what other things we can do for the nonprofit's weather with its utility discounts or some kind of special rate for these kinds of organizations were trying to just increase the money goes into General afraid. I just get that. I was just seeing to be driving both of our test one in these were the employees themselves and I've wanted that was my primary concern is legislations. Just how we you take a larger. I don't want to name an organization but not very large nonprofit. That will be a beneficiary this that my fear is that none of it is Real Eyes by the employees none of it and it will go toward these fixed costs that are expensive I get that. Yeah, I was going to just make the point that come from bro Brian made and I know he made it much more eloquently than I this this These funds are supposed to provide for the cost of living adjustments across all of the costs associated with running a nonprofit. But I'd also just like to say to the extent that you mention large nonprofits 6. Some of them. Maybe their workers are represented Workforce. I think we can count on that unions in their negotiations with their with their management using these funds for for addressing wages. And thank you for making that point that also don't have Union representation. We've heard from some of their executive director is we've heard from the folks or managing these organizations that they are having two. Lansing 40 to 50% turnover rates because they have to pay the rent and utilities and the additional cost of operating business has continued to increase their the ones were saying does if we don't have the stabilisation to at least recognize the cost of inflation then they're making these really tough decisions to not feel positions or to cut to cut workers and that's I think directly to your concern they are making as the leaders of those organizations in decisions that do implicate the workers and we need to help stabilize them so that they're not in that impossible decision. I appreciate you bringing that up because ultimately the dollars will go to workers when we stabilized to ask you to walk us through the Amendments because I think we have three four possible consideration today if that sounds good to folks and I recognize that we have heart stops at noon. If we don't get back to that today, we can always come with our conversations coming off if that sounds okay. Does everybody have a copy of the July 9th memo with the Amendments attached to it? Okay. So the first proposed amendment is sponsored by council member mosquito and and councilmember Bagshaw as I mentioned that the council bill as currently written is somewhat agnostic about the way that the cpi-w will be converted into a inflationary adjustment on there a few ways of doing that I distributed in the mall with some examples of how that would be done. This memo does a it specifies that the calculation will be a year-over-year change in the CPI W 12 month average for April in 2019. And for June and following years. I'm the reason why we made it the 12-month average changes because that is how we do our Seattle minimum wage moderate some of the fluctuation. A little bit while still representing changes and cost the reason why it would be April for this year. And June for following years is because April was the date of that we had when we did the budgetary and packs and we didn't want to confuse the issue by having a brand new number yesterday for budgetary impacts if we move to the June, but then to move into June and following years that we have the most recent data available as the budget is being formulated. Any comments or does anybody want to repeat that for the cameras? Would anybody like to move the amendment or I don't know what you just let's let's do this one. OK I don't have a script for one at a time. But I'm going to do this on the Fly cuz I know I can do this. Yes. I would like to move Council bill when I'm sorry number one to cancel bill when 19542? any other discussion All those in favor of a 5-4 to okay. Amendment 2 is sponsored by council member Bagshaw as we as I mentioned earlier the current Council the proposed Council Bill includes a minimum adjustment of 0% So that if cpi-w is negative there would not be a decrease in the contract amounts. This amendment would add a maximum adjustment which would be equal to the change in the general fund resources over the previous year so that the contract adjustments would be proportionate to the change in budget resources available. Is there would you like to speak to that? Absolutely, so this amendment is coming from your cranky budget chair and I of course I've talked with Paul and Melinda and Nicole and flow and half the people in this room about this so I don't want you to think that at the end of the day that I think what we're doing is a bad idea. We've got to get there my recommendation here similar to the debate that we had. The sweetened beverage tax yesterday is to give the council sufficient flexibility to make decisions when we have to make tough decisions. And in this case this what this amendment would do is to say if the general of if our general fund did not have sufficient money is proportionate to what we are trying to do that we would actually look and take take the cpi-w consider what the general fund is and then make our decisions so that we were not overspending in this particular category now that said The council can always add so it's not something that would preclude us from increasing if that was the highest priority for the year. But I am concerned that as we are looking at general fund expenses are making tough decisions. Like what we did yesterday again with a sweetened beverage tax what we're trying to do. There isn't a single one of us at this table that doesn't agree with the priority. But we are I am arguing to give ourselves flexibility both for the fairness to all of the non prophets who have the contracts but also that we are physically responsible in relationship to the other budget resources in choices will have to make and again to give priorities to future councils. Thank you very much for us. And I see customer Juarez in the queue. I will just say that there's a few things I want to underscore one is I really appreciate working with you come from ever Bagshaw and the efforts that you've brought forward to make sure that we are working within the budget can find that we have. In fact, I think it's really critical that we recognize that we know that there's not going to always be potentially an impact on the budget. I was interested in trying to find that sweet spot with you on this amendment. And really I think the thing that has encouraged me or convince me that I'm not able to support this amendment at this time is the fact that we know that especially during those toughest times when our general fund does decrease or and I'm sorry doesn't have as much of an increase. That's exactly when we need these folks to be able to do their job to help those who are potentially on the cusp of becoming homeless are actually experiencing homelessness or have other crises do Economic circumstances such as potential for increased abuse a domestic violence abuse and other types and that's when we need folks to be able to be in Community Helping the most vulnerable argument that I would put out there for a constant Council colleagues respectfully is there is situations in which are general fund amount could potentially change. Sometimes you'd arbitrary decisions and I had the opportunity to start a think through this a little bit more and thinking through that serve aggressive nature of the funding that comes into our tax fun, Bro. Brian mention. We don't know what's going to happen. For example with their sugary sweetened beverage tax or the tax on rental units EDD short-term rental units and that decision in the future could potentially affect our budget as a whole and I wouldn't want the folks who are our Human Service Providers to be affected by a future council's decision to change to arbitrarily are not related there. Tangent to these workers and have that affect their amount of the contract increased. So for those two reasons both the need to make sure that we're keeping these workers whole especially in downturn and to make sure that organizations are not arbitrarily affected by policy decisions that don't have anything to do with them. I unfortunately not able to support this amendment today, but I appreciate you bringing it up council member of Juarez and then comes number. I have a few follow-up questions and what my concern is. So this this this this I support counselor badge house and I'll tell you why but I do have some follow-up questions for you madam chair. So what we're trying to do we all agree about building in a 2.9% increase for rhsd workers. And I think we can be very careful with their language here using the language that we're keeping our workers who makes the assumption that somehow we're at fault for taking it away and we're not what we're looking at our basic. Economics about how we can do an address in pay people there need in their Worth's particularly in light of our homelessness crisis and that we need to retain and stabilize organizations in employee. That being said, I think everybody here agrees that yes in a perfect world. It would be great to build in a 2.9 increase what my concern is is how are we always going to protect that line item in the future if the general fund can't provide for that? So that means we're going to take money from other places. And so what one question that if I can Madam chair to direct to council member Bagshaw, how does this give the council flexibility this Council and future councils when we have to deal with when we had like our recession in 2008. And also how does this impact other organizations or other groups that have contracts Beyond hsd with the city of Seattle? They don't get a 2.9% raise that is built in and protected. I see some equal protection and some some issues here that quite fairly I think or unfair I'm not taking away from the fact that there should be and we should honor and pay HST workers in those contract workers what they deserve and I don't think that this is what that debate is about. What I'm concerned about is making promises and expectations about a pot of money that we don't always know how much is going to be there. So just to clarify before council member are backshots answer the question and please let me correct me if I'm wrong on this is an inflationary adjustment tied to CPI for the year. So as you see on the chart up there of cpi-w fluctuates each year, that will be what in what is our driver for how much each contract would get that you're so it's not always going to be 2.9% especially if it goes down in certain years. So that's I think that's an important point to make in as you can see up there. There's a sandwich rcpi. W is much lower than the increase in the total budget that we have available, but we don't ask that question when it comes to our current contract that we have at the city and we every opportunity we can we offer an inflationary adjustment. We don't talk about, you know, if there's a certain pool or where the funding comes from potentially for that we make that decision because those are the best thing that the fabric of what helps provide our services. So I'm just saying I agree with you when when it comes to making sure that our workers at the city are whole we've intentionally contracted with the folks who have the most trusted relationships and expertise on the ground to do this work. And so we're trying to level that we're trying to equalize how we treat both contracted provider organizations and those in the city cuz I don't think we ask that question during this recession near it's so sinful being transparent. So what do we do when other Groups that have contracts with the city that don't work at hsd feel that they want a 2.9% that they're providing good service isn't as you say, they're not being made hold and how do how are we going to address that next wave if we set this precedent Amy if you have comments on other contract, I think that's important. The reason that were important to hear the reason that were specifically talking about these contracts. It's not like we're talking about contracts for folks to our keeping our windows clean. For example were talking about contracts for folks who are providing the services to our very very most. Yeah, it's less of a present. I'm more of a value statement that we haven't been able to do this because we're back. Did you have some additional answers? Well, I don't have much more to add to this. I'm just looking at this from again and that very tight fiscal responsibility to provide us the the breath that we may need to make some tough decisions yesterday with our sweetened beverage tax as an example of what we decided to do and I must say that I really concur with the analysis both council member Bryan council president Carol articulated very well is that we went to the voters. I'm with some very specific things. We were going to invest in then last year. We decided to take a certain percentage of that money and put it into the nurse Family Partnership some children's programs, even some food banks that we felt were very very important to be funded that was money that was available that could be supplanted by the general fund the downside of that particular argument was that we had made prom List of the community that we were going to invest it differently. So I am happy to support that but what happened is is that then the general fund where we're going to have to go back and get general fund money to put back into these programs like nurse Family Partnership and things that we also feel very strongly about I am looking at this more for the standpoint of not time counsel counsels hands when there are other really wonderful competing things that we want to invest in but that said, I mean if your lining up priorities we want to invest in these nonprofits we want to invest in these folks that are doing this incredible work. So I understand that we have competing values, but I would put forward to say we still can do all that but we just are giving ourselves and future Council some flexibility to say we're going to have a maximum adjustment that's equal to the percentage change in the general fund strikes me as being strong smart physical fall. Thank you for that. I'm councilmember. It's the one and then comes number her bowl and then customer Brian and we have one more minute to consider. Thank you guys were mosquito. I wonder do I had my remarks with this amendment. But before saying that I wanted to say just do re inside the overall perspective that we are looking at before we look at the amendment is we're talking about a contact where there is being a chronic underfunding of Human Services and that includes both the living standards of the workers in the sector, but also the services that they provide to the most vulnerable have been under assault chronically over over many years perhaps over decades and offering an inflation adjustment to the workers in the sector is the bare minimum that the city of Seattle should be doing in order to address this problem. So we're not talking about lavish wage increases in any way whatsoever were talking about the bare minimum and city council member and mayor salary. Keep up with inflation executive salaries go up your alley but the salaries of the most underpaid workers aren't keeping up and we're talking about the most underpaid workers. And we're talking about this cruel. Irony where the people who are serving. The most underserved are also on on the brink of becoming some of those underserved themselves, especially if you found in the cost of housing the rent that many of the workers pay how many of the workers are being now being forced to commute long distances because they can no longer afford to live in the city who is homeless people they're serving. So that's a contact looking at this and so I don't I don't believe that the driving argument here should be what should we do if general fund goes down. The reality is recessions happen on a regular basis and their capitals. And on a regular basis the recession the burden of recessions is put on working people and some of the most underpaid working people everybody remembers in the 2008 2009 crash who took the in the buttock on the burden of the crisis. That wasn't the big bang that caused a crisis. They were made whole to the bailout the Millionaires and billionaires. They returned they may be lost a few Millions here and there but they were not you know what it about whether they would be able to pay their rent. But city of Seattle workers took for Lowe's in a workers made sacrifices in many cases willingly because they believe that we are in this together, but at the end of the day, they weren't the ones, you know, when the economy recovered they didn't get their share back either. So when the economy is doing well again, the wealthiest benefit the most of an economy doesn't do well and there's a dissection to burden falls on the workers again. So we we just cannot accept that... Is the you know, the mechanics Status quo and the the other point, I think that is really really important. You are as far as the argument about how do we do this? How the general fund goes down? How do we make sure that the city council ordinance tax big business going to raise the progressive Revenue source of the city in order to make this viable not continue to talk about robbing funds from one deserving program to another I think the best way to do this is to attack big business. If not, then reduce executive salaries and then there's some Executives in the city that nearly three hundred thousand dollars of salary. I think there are Executives who could have a living wage and yet make some sacrifices in order to make sure that these workers are paid and there are many legal mechanisms that we can do this in the budget and I don't accept that this amendment is necessary. And anyway, I think their argument is based on the lowest paid workers making the most sacrifices. Thank you. I'm going to say I would really love this if we could focus it for workers salaries. My understanding is we aren't and we can't and based upon what I'm hearing at the table. I'm going to withdraw amendment number to I will be supporting this but unfortunately, I have to pick up you got five minutes. I'm going to withdraw my man that I will support the underlined legislation when we vote up at the full diet, but I'm going to have to excuse myself. Okay? Well, thank you for putting it forward. Thank you for allowing this conversation and thank you for withdrawing it as well. We do have one more moment. And I know folks may need to take off. I'd like to try to get you that one additional Amendment and then see if we can vote in the next 5 minutes and it would add a report requirement in 2022 to include information about the impact of the required annual adjustments on both contracted partner organizations including Financial stability and wages and services provided as and the city and then also require a response from the council outlining their response to the report and any additional next number three has been moved any additional comments. I will say thank you because council members of that shot and both cousin Harold have talked about the need for getting this data back to thank you for raising this for us no more coming all those in favor of amendment number three to cancel Bill 11954 to please raise your hand over your post. Thank you met very much calcium are backshot time today. And that is all of the arguments that I hear again particular on this amendment that was withdrawn goes to the same thing over and over. Employee wages employee wages in play waitress. That's why we're doing this or tying it at this 60wi, but but that's not what this legislation does if it doesn't do that and so I think what I'm missing is again, why don't we tied directly into the wages piece? Why don't we say specifically that the money goes to which I understand a concept of fixed costs understand that what we're doing is sort of Just saying to the to these this that the Marriott of nonprofits here's the increase and we hope you do the right thing as a saying. Here's the increase do the right thing. So between now and well, I'll just let it rest of that. Cuz all of it speechifying has to do with the employee wages get this legislation doesn't get to that smile penny. Yes, and with the council's consideration, we can also potentially give it another week if folks are interested. So maybe we'll leave that open for discussion. Thank you council member where I was thinking becomes more bags. I'm singing no additional comments. I will also a underscore one of the things that I'm hoping that the folks who are in the audience can help us with this to help directly answer council president Harold line of questioning. I think we've heard it before in previous committee is about the importance of this inflationary adjustment across the board for organization knowing that the consequence is resulting in potential Cuts or underfunding and understaffing an organization. So I'm hoping that folks could come together and help help us directly answer the question. Will this help will this be a help to those wages and to get that information out there more clearly than Harold. I have no problem with holding this over for an extra week to make sure that we do get the chance that have that full discussion and get a chance to hear from folks. Happy to do that. I'll just talk to constituents by the way about it and maybe we can keep that open. I would love to just say thank you again for all of your work on this and people have been working on this for years prior to me coming here. Thank you again councilmember O'Brien for a constantly bringing this up when folks came to me a year ago to talk about this. It talks about the work that you have done on this. So please if you have any openelec closing comments the work you've done in the last few months on this has been amazing. They work the community is done really powerful MTG. I don't know was that about a month ago with so many folks here in the community providers in our community of doing some amazing work under really nearly impossible circumstances and the workers that work for you all. Is it a here today? I know are bearing the brunt of really challenging situation. I've said it before the we expect some of the lowest paid people in our community to be doing the most essential and hardest most complex work that there is a nurse's iety in the work that we need more than anything right now. It's another example of how our economy is upside down, you know, not to take anything away from programmers who make video games but we should be paying our Human Service workers more than people are making really awesome video games in OurWorld Winnie Pooh deprioritized it the right way and in our economy is a big thing that we don't get a change but this staff comes in or scared of the Year leading on is a huge step IL just say for the record that I did not support the Amendments that I'm canceling a sharp eye out for it. I think her intention is very good. I think it's really complicated to try and prescribe when something kicks in and kicks out. And so but the reality is We've seen in the past. We likely seen the future assuming this doesn't pass each budget. We will still be in the thick of things that future Council can decide to undo what we did or change it and so it will hopefully set an expectation that we're not going to do that except under extreme circumstances. They will need to continue to be vigilant and this is just to keep people where they are based on where we are today and we know the position that the organization's rain today is 10 or 20 years behind where they need to be so I know there's a lot more work that needs to be amazing. I'm excited. Thanks for your work on us before I move final passage. Any additional questions are coming. I just want to say that this is an important value statement. It's setting a bar and I think it's actually an extension of what this council is done in conjunction with our Human Services providers and workers in past years during the reception when we leave at the beginning of the budget process said that our priority was no cuts to humans. This is this is taking this to that next up. So thank you for bringing this word. Thank you counselor Amber O'Brien for working so hard on this amendment suggesting that the money goes toward the wages of employees for discussion. I don't see a reason why we shipped at this point if we're being asked as a city to prioritize the wages of people that are under earners or low income earners even during bad times. Why wouldn't a non-profit still prioritize their workers during tough times as well as he seems to be that and I'll be very honest with you. I just want to see the reactions to both the public of citrus my college, but I don't see a strong policy argument why we wouldn't require your nonprofit to pay that I will say I'm happy to explore that. I think when I took this a piece of legislation on it was a policy choice at that time to leave it open to how the money was being spent. So at this point, I haven't done a lot of research into a kind of legal or contractual issues around being that specific and I need to we had wage specificity in the RFP such that the responders were required to pay a certain wage. And again, I don't want to learn many nonprofits that are saying hey that What does my good polish workers a big raise your interest in making sure that the workers are can look forward to working with you over the next few days and happy to have your transparency on that issue so that we can look into that. I really appreciate you black enough for us both agree that you're referring to. I think I require prevailing wages, which I don't think they look out for the garbage. I don't think we're that that's what we're requiring. Oh no, I was saying no no, no, no, no. No, I wasn't clear. I was saying that our ability to do that just to look at how we did that instruction other art piece. I quit cuz I thought I had a question whether we can do that. I was going to look at those as an example. Those weren't high paying jobs. By the way. In fact, some of those are below minimum wage is Mary called that we were requiring. Some of our recyclers to pay below minimum wage never brought that issue of is Wegmans, you're trying to drive down the cost of utility cost. I get that but you're requiring our employees within City to be below minimum wage. And so we had to change that that was several years ago. So that's so that those were not high paying jobs by any stretch of the imagination. They were 14 $14 an hour jobs look into it and bring Grammy information and options to everybody. Excellent. Thank you, president for the heads up on that. I think we are ready to vote. It's been years in the making and I think we can do this today. We are only a few minutes over. So if they committed Collins well entertained. I mean I would like to vote. I'd like to move Council Bill 11954 to as amended with amendment number one an amendment number three. It's the movement 2nd endings are in the other discussion. Sing then all those in favor of council Bill 11954 to as amended. Please raise your hand. Although I suppose none of it is unanimously passed as we discussed at the table. We will continue to assume that this will come up on Monday, July 15th and continue to work with folks to make sure the bed schedule does worth of can always hold it over if needed but I'm very excited to have this in front of us on Monday and I just want to thank a few people Allison Hillary Julia Lauren Nicole Evelyn Alexis and Jeff Sims of our Central staff Jesse from your staff council member O'Brien as well as less Zona from neighborhood care Katie Nicole from MLK sejal Parikh, if she's here Chief of Staff who's been working very closely. I'm to try to get this over the finish line and our Communications team on I didn't even have a chance to say everybody's organization, but we'll do that a final passage. I want to thank our Council colleagues customers to Juan obrion whereas Bagshaw herbold and How's you been here since the very beginning of this meeting today. So I so appreciate it. Thank you, very fast. Thank you to the translators for being here today. We will hold over items number three and four, which are related to the hotel worker legislation. We have time on our agenda for next week to discuss those and we also will get the office of labor standards presentation in a future meeting. So apologies to OLS for the delay on that very happy that you could be here again till the bitter and it's a great great job ensuring the meeting a lot of complex issues with more homework, but we really appreciate it. Thank you for congratulations.", "end_time": 9426.4}]}