{"format": "raw", "annotations": [], "confidence": 0.9563687104050831, "data": [{"start_time": 0, "text": "Good morning. Thank you for being here for a regular schedules Council briefing. I expect council members to trickle in here doing my council members want him ask a to thank you for being here. I will give the three presents for it after will do the state legislative session updates. So why don't we bring the team forward and dive into our legislative agenda things are possibly winding down. Never know. Morning, Lily Wilson codega office of intergovernmental relations Cheryl swab just dive in we have passed the opposite house floor cut off as of last week and now legislators have turned our attention to focusing on budget negotiations in the final week. This final week of the regularly scheduled legislative session. There are high volume of Bill signings right now. So we'll continue to update you all about signs that you may be interested in attending and if you let us know we're happy to make arrangements for you as well. We appreciate having had council president Harrell in Olympia with us last week testify in support of my 1002 Port from the Council on the various priorities where we've been asking you to weigh in with legislators late in the evening in front of the weekend. So I'm with that I will turn it over to Karen Cargill who will give our final legislative session updates of the regularly scheduled session. Good morning. I forgot the last Monday before Sunday Daiso schedule towards are in this Sunday. We're still hearing a lot of back-and-forth really running the budget. I mentioned last week that there's quite the discrepancy between the two budgets that there are two differences in Revenue. You want some spending items. So just kind of want to brace everyone that the likelihood of a special session is high and there's still a lot of unknowns about what will be funded. We know that the several of our priorities aren't you know, including one but not the other so working through what that might look like. Are they going to bed sheet negotiations? It gets a little bit more complicated because it's just go to like the traditional Bill process. So we're continuing to engage in those conversations and will keep you guys updated as those conversations to occur, but just want everyone to be aware that this kind of becomes a a little bit of a weird time when Babe, are you trying to think I went to the special and then had a multi focus on the budget negotiations. So will let you know if they do not have a full sunny day or they do have any. But then we anticipate a special session will prepare kind of a light update to give you a rundown of the bills that moved and wonder still potentially up in the air and then we'll hold giving the full funny that report until the budget has been wrapped up whenever that may be so any questions on processor. I'm just moving to the bills answering on page 2 on education a lot of good progress still on a lot of the Early Learning in that child care legislation that is being considered right now on top of page two how to spell 1303 that was the child care higher education bill that will be signed by the governor tomorrow to other bills related to beavers and the child care access workgroup how to spell 1344 and has Bill 1391 started the house converted to send MMS last week. I'm so at that point. Once the opposite chamber has concurred with any of them that it happened in the opposite house. It will now head over to the governor's desk after signature from the speaker and the Senate President. I'm over on page 3 to the Senate bills related to ecap the Senate bill 5089. That was the one for the year old takes mansion on that beat up for the three year olds and then he kept eligibility 5437 moving the income threshold up to 200% of those are still waiting to be concurred with or if they need to go to call Brett Somers still waiting to get that information but has passed both Chambers and what this last week is forward to let them work for the different says we still don't have the whole conversation that school district levy conversation that still has a lot of the budget negotiations and while it's not tied to the budget. There's a lot of the legislation that has been that is being considered had some butter pieces put into the legislation is on the Senate side and with the special education components. So unfortunately, there hasn't been much of an update on that. A lot of those developments will happen when the bed. We will keep you posted on that as well on page for under environment. I wanted to flag House Bill 1257 of the Energy Efficiency. And that's for a commercial building. There's been quite a bit of work on figuring out different ways to help commercial buildings be more energy efficient. So we've been involved in this book quite a bit and the house concurred with the Amendments made it a center on April 18th. So now heading to the governor's desk and now I know I said this is going to be my last time bring up last week, but 15-12 electrification of Transportation. I was being signed by the governor tomorrow. So I'm very excited about that one channel steps implements regulations that are authorized the original version the concept that was actually pulled out an earlier version because there was quite a bit of contention. Happy to connect gas lines. Can I give you a little bit more until about what happened with that? We anticipated coming up in a different version and coming years. But in this form there was not the appetite to allow for the stretch codes. And then the last bill for the environment Senate bill 5993 that's on top of page seven. That's the bill so that moved out of its committee last weekend of the Senate Ways and Means Committee. There was some adjustments and the the the fee associated with that so it had been I think less about 250 in the original proposal and they dropped it down to a dollar thirty-nine per barrel and then I would be the adjustment for the hazardous substance tax had to cheat but after summer in view of what projects they wanted to make sure we're funded by it. They were able to see that they could have a much smaller fee is attached to it. So I'm currently a second reading in the sentence. And again, this is one of those big concept that's very much tied to the budget conversation. So this concept hasn't been run to the house at all at the stage. So a couple years ago that you had a similar proposal for this but there's still quite a bit of back-and-forth that's going to need to happen to have the significance go forward for General government I feel good that's going to happen now or is it like anything's going to happen in the next 6 days. I'm always at least if maybe there's conference or something that needs to happen that that will happen. But that is close to a gas is a general government also on page 7. I just wanted to know if the senator Carlyle privacy bill is not listed on here. I mentioned last week that it while it was in Committee in the house that they were having some difficulties moving it out of committee. So ended up stripping the content of the bill and just moved it out as a title only an intense Bill and they were not able to come to agreement with the language for the cut off last week. So it's technically consider diagnosis a pretty received quite a bit of media attention and public interest. So it's one of those bells To watch just in case something happens with it, but at this stage it is no longer active. How to spell 1403 that's his Debbie nof apportionment formula adjustments is bill has gone through relatively easy and is actually I waiting signature for the governor that's happening tomorrow as well. So FAS will be there to pick amends for that great work that they did on that fill this year and on the big deal. I wanted to highlight for you. All is the wrongful death last week. They were able to move out of the house. I want to thank everyone for all their work. So she comes summer Gonzalo Gonzalez for reaching out to us all that house members and organizing the letter from the council. I know that this was very well received and Ed. Are you inside of the speaker in the Senate President? So off to the governor's desk I will let you know as soon as we once it arrives and Elsa just a kind of a flag at this at this stage. I want to build a hexagon or sex it has five days to for Signature, but the prom when it's actually signed to instill a bird that can be a variable in terms of length of time. So it's not when it's Actually hits the governor's desk at 5 J Martinez want to thank you all for your advocacy in that space and I was able to connect with a couple different folks from The Trial Lawyers Association over the span of last week and really just want to express my gratitude and appreciation for all of the good work that you all have been doing over several years of this is a very successful effort really excited to hear that. It's headed to the governor's desk huge regulations to Twin River Casino. So moving into Healthcare on page 10 Couple goals want to highlight for you page 10 1593. This is that is it establish a new psychiatric teaching Hospital OB affiliated with the University of Washington. So this bill was a quote-unquote 5 bill in the Senate on opposite house cut off and it passed unanimously off the senate floor because this bill is amended by the Senate that will have to go back to the house for concurrence dispute or conference that will be tracking that closely. It was a very enthusiastic vote on that one moving down the page to vaccines this 1638. It would kill the personal belief exemption for the measles mumps and rubella vaccine. So there were several procedural moves that were made by some Republicans to block the bill from coming to the floor for debate and vote and the bill was brought to the Center for less than 15 minutes before opposite house cut off. Yeah, it was tense couple hours then it was set aside to do the 5 Bel but then it was brought up again for debate and vote later on in the evening. And the bill ultimately did pass out the senate floor the vote of 20 to 220 Oakside 25 222 the version that pass out. What's in a florist the same as of the bill was introduced was originally introduced. So I'm in the passage of spell was national news. It was covered National including by The Washington Post as the bill pass against me off the house floor in April 12th, and the Senate unanimously can cardano house amendments. The bill now goes to the governor for his signature. And then also I'm going to switch to page 2 questions before you leave Healthcare on page 12 moving forward a little bit here. So we're looking at 1523 5526 who's the governor has requested public option bills, which including establishing a public option would call Cascade care, set of 2 standard plan design for health insurance plans sold in the exchange and looking at other options to control costs such as cost-sharing reductions the house version failed to pass by opposite house cut off. So it is considered that the Senate version is going to is going into a conference committee following the Senate's refusal to concur on the house amendments. So they're still working on it over there. I will keep close tabs on that a happy to fill you in as it moves. That was the last Miss pudding cover. So please ask your question. Thank you. Thank you is so I know that this is something that we have. You would think that we wouldn't have to be legislating that those who are taking care of our most vulnerable in moments of Crisis also need to have a few moments to rest so that they can take care of themselves without having to make medical errors House Bill 1155. Is that the part of the bills that were also supporting this year and I've got that one in my section that I'll give an update on but I think many of you probably saw there was some controversy over the weekend around some statements that were made but the bill passes house 63234 on March 6th and the Senate on April 16th 3218. So that is still moving forward great. And that's in your section review regarding safety. I think we stuck it in the safety civil rights. Peso anyone else we're moving on to housing we wanted so I'm page 14. We wanted to touch on Thunder Critters Bella 55600 which is provides that attended as guilty of unlawful detainer when it notice to pay rent or vacate has remained. I'm complied with for a. Of 14 days rather than 3 after service. This bill passed the full house floor on a 51-46 so bit of a tight boat there because the bill was amended by the house that we need to go back to the senate for concurrence dispute. Our conference will continue to track that one as well. I do want to deliver some sad news. So at the CFL that we've been that we've been really excited about it's been my favorite bill. It did fail to make it past the cutoff deadline. So a lot of really good work. That was the one that provides cheap exemptions for City sanction shelter and encampments will continue do a lot of good work with thunder wins office. Going into Nana Ramen come back strong and ready to go next year, but he had really was a good champion on that bill and we really appreciate all that he and his team were able to do to move out as far as it did and then I also wanted to touch base on 1406 which is on the top of page 13 again. This bill is deem necessary to implement the budget. It's continually going through rounds of discussions about funding levels and how to make the Billa bit more simple to administer from the state level. We are in those discussions right now and will they're moving very quickly. We really hope to see this Sunday. The full amount as it's been proposed and stick with the plan as though it were sticking with right now. There was a great Coalition group that was together working on this over the inner when we've remained together strong on this pill during session. We'd really like to see it come out of the Senate with the funding levels at the same rate that we are discussing the house. So we'll keep you posted on that. We still have great high hopes. The spell used to make sure it's funded at a level that is actually beneficial to the communities without them. Yes. Senate House, Bill. I'm sorry it sent Bill 5600. There. Were there were amendments. Correct? Yeah, I don't have those on top of right in front of me. But I am happy to show the I apologize. I just got to print those. All right. And I'm sorry moving on to the public safety section begin on the bottom of page 14 starting with sexual assault kit notice that is representative Caldera proposal requiring that hospitals. Do not perform evaluations notify anyone who presented an ER and the house has refused to confer with the amendments in the Senate has asked for a conference. So at this point some of the concerns that you all have raised around the elimination of the $2,000 penalty for non-compliance may be added back and will continue to keep you updated as that goes forward sexual assault House Bill 1166 towards the bottom of page 15 that would fund the backlog of untested sexual assault kits in Washington state. Pass. Both Chambers unanimously and is scheduled to be signed by the governor tomorrow at 3:30. So congratulations there. I'll move into domestic violence law enforcement on the top of page 16 House Bill 1225. That's the Representative Jenkins bill that would require Law Enforcement Officers secure Firearms when responding to domestic violence incidents that passed the house 6238 and off the senate floor Thursday, April 11th. And then finally, I will touch on Native American women on the bottom of page 16 House Bill 1713 sponsored by representative mosbrucker that would create training and liaison positions to improve best practices to address the issue of missing and murdered indigenous women that has also currently past excuse me, both Chambers and has been delivered to the governor for Signature. So we'll be watching out when closely and will let you know as soon as that scheduled and then I'm going to move over to the middle of page 18 under safety net and civil rights beginning with certificates of discharge or representative Hanson's New Hope on the bottom of page 18. That is House Bill 1041 that would address challenges and Employment housing other obstacles by expanding the eligibility to vacate certain non violent criminal offenses that passed the house 90520 on March 1st and the Senate unanimously on April 3rd moving to a wage and salary information on the upper middle part of page 20 house bill 1696. This is the representative Dolan bill that would expand on last year's Equal Pay Act by providing prohibiting employers from asking MN tracking folks into their wage history. The house did not confer with changes made in the Senate has asked them to recede on those issues. I'm so those may be worked out in conference and will continue to monitor monitor those discussions as they move forward and then the final to highlight are in the middle of page 21 of the lgbtq commission pass the Senate 34 to 14 on March 6th and off the house floor with a vote of 67 228 Friday. April 12th, and then finally, I'd like to thank the office of immigrant and Refugee Affairs who has done a tremendous amount of work on immigrants in the workplace and Senate Bill 54 97 or the keep watch Washington working at that would put limitations on data sharing for various public agencies. Unless they are served with a Judicial warrant that passed the Senate excuse made the passes in at 3216 on March 7th and off the house floor Friday, April 12th with a vote of 57 to 38 and if there aren't any questions will move on to Transportation, but I think I may have one about the meal and rest break Bill. I just want to confirm given the rolling support. This bill's received anticipate any concerns of getting heads to the governor's desk at this point. I think I will have to continue to monitor that closely. I do know that the the most controversial amendments has Senator King proposed that I believe she Protections from overtime tax did fail to move forward and then it did move out of the Senate 3218. So I'd still think they're strong support for that legislation moving forward OK background, you know, this is an issue that we tried to address probably for 12-15 years. Now the concept of intermittent was argued at one point that people were able to take their breaks. They took 3 minutes here to go to the bathroom. They took a sip of water here. That was 1 minute and they were trying to add that up as if it was a full break. I'll know that that's not a full brake and when we're talking about protecting our most vulnerable folks who are in the Healthcare System these folks absolutely need uninterrupted break. So if there's anything that we can do in the city of Seattle to support this time, I'm very disappointed in my in the remarks that I'm I heard from Sara Walsh. I had the chance to work with her in the past and found her to be very reasonable. I think as she wrote in her subsequent message as an apology. It was a long day and she was tired and she made an error which is exactly the point when you're tired you make errors and you need to be able to have brakes to make sure that you are doing your job correctly. So, I think I'm paraphrasing what she wrote exactly but that is the context in which we all think that we we do better when we have our uninterrupted break. So if there's anything that we can do a city of Seattle ever make sure that folks know we're fully supportive of getting this across the Finish Line. We will be in touch if there any next steps we may need your help with And then moving on to our last section transportation starting on the bottom of page 21 the motorized foot scooter Bill the house did concur with the Senate amendments last week. So now it is in route to the governor's desk for Signature. So congratulations. And then possible 1793 our automated automated Traffic Safety cameras. We were able to move this bill off of the house floor last week, which was a huge thanks to all of you all of your work on that. We appreciate you all engaging very directly in that effort. Moved out bipartisan there were four Democrats that fell off of the final vote count in and through publicans that actually signed on including representative Irwin which we were very very thrilled to see he's a Seattle police officer. Send it, but hopefully we'll get there and I'll have the opportunity to vote Yes for this Spell anticipating and we're hopeful that we'll see a public hearing and in the Senate Transportation committee. This coming week us has been scheduled but an agenda has not been posted for it yet. So we're working to secure a hearing for the bill in the Senate Senator pops, correct? Again don't want to speculate too, but we are encouraged and we will let you know when it is finalized. So there were a couple of moments that were attached to that. So if anyone has any questions about the state of the Bell have to talk about what it looks like. I'm offline. Okay. Well, we appreciate this is our last formal briefing before this before that he died. So depending on what happens in the final stages where they're at with the budget and whatnot will provide a report next week, but we will not be reporting to you guys in person. But letting let you know where things were things landed in my. Come Sunday night the potential Spencer schedule torturing on Friday night. So I get you an update. Thank you present when we could get those dates. So we've been checking the website two or three times a day should I run has been pulling those signings and monitoring give you as much notice as possible? Not that I would break the speed of an automated enforcement following a three governors lock Gregoire and Evans and I spoke on a panel of the commissioner Bowman King County council member gossip as well and it was jam-packed to say that's at least but I want to thank you for all of the preparation other literary people. I was told that were there at like 5 a.m. To get in line and the opposition of course, but I want to thank you for all the preparation on the notes and I was prepared for the Q&A because of your work. So thank you very much. Okay, we'll support and attention during this that legislative session. It's thanks for all your work on the death penalty Bill, and I'm so sorry that that died. I was I mean Sick to my stomach really so I hope you all will carry on for me next year making sure that that gets passed giving those support in the Senate were you know, very hopeful for the future and will continue to do as much work as possible to advance that luckily. We have the Supreme Court ruling behind us, but eliminating that statue understand that the high priority and will continue to work towards that goal. Go get them. Okay, very quickly just to remind you. We do have at 10:30 a select committee on homelessness and housing affordability that will take place a few notes about this afternoon. If there are three items for vote for the governor has equity and Technology committee. The first one is a reappointment of the hearing examiner Ryan vancil that password committee last week and two appointments to the international special review District board Tanya Wu and Sergio Max leg on palimony. Who's actually Sergio's a little note about the format this afternoon? I think many of you understand it. It's a simple format and that will be at the conclusion of our agenda during the adoption of other business. I will open up the floor for nominations for the vacancy. It's expected that you may nominate a person and there will be a second and then I will close nominations when you are nominated out service speak. And then from that point we will call for the vote and he's council member will simply say a name as to the candidate of their choice and we will continue that until we reach a a vote of five for that person. If it looks in my opinion that that is unlikely. I'll conclude the agenda and we will reconvene at the appropriate time. So that serve the format should work done it before any questions on that good. Let's move on. Order Alpha order. No, I'm just going to open up the floor cuz they the order of nominations doesn't make any difference because each nominate each nominee could be considered. So the order number one. There is already established. The roll-call is the order of roll call for that particular meeting and I haven't even looked at it yet. So we'll just go through the regular roll call and go through there. Alright, okay council member of Minden renters rights committee. The next meeting of the committee is scheduled for his regular time tomorrow Tuesday, April 23rd at 2 p.m. At that meeting. We will be discussing with community members from baar baar place and the Central Area Senior Center about the delays from executive and following through with the property tax transfer that have been promised for years at this point to be lazy or calling tangible harm a because I'm one of the things that happen is so it's very likely that Byrd Barr Place could lose a 1.5 million dollar State Grand that Oh, yeah, it's at least partially contingent on the Property Transfers. I will be discussing those issues and we will also have the renters commission at the community able to present their Brooklyn for the Earth the issue of place preciate you bring this forward in your committee. We were told last week that it is going to be appropriated in the in the state budget. So the emergency stall but it is an ongoing issue. It's been languishing for a long time. So it really appreciate your attention to it and just what it said that there was a really important community meeting last week that my staff member Jonathan Rosenblum and I were at we're about a hundred fifty to two hundred senior members of the community. Who use the Center Senior Center Central on a regular basis were there and it was a very engaged community meeting and many of them are planning to come you're on Tuesday. So today I have a couple items on the full Council agenda. They are not form a committee. They're from the plug committee. We have a vote on the vacant building monitoring program legislative update. This is the planned update from our discussions during the budget process during the budget process. We adopted some modifications to the existing vacant building monitoring program that will not take effect until June 1st with the understanding that there were some additional changes that we needed to make to the legislation. And so that's going to be that moved out of the Pug committee last week and hopefully before us today at full Council. Also, we have a boat on the North Delridge action plan resolution in this is a resolution that memorializes many years of work by the members of North Delridge to develop their neighborhood plan. And it also identifies some changes that they would like the office of planning fee development to consider making to the comp plan as part of our 2035 comp plan update and I do have a small Amendment. It's on the back of the page and passing out now to the north Delridge action plan priority actions and it just refers specifically to the Delridge neighborhood Development Association work around Wetland and agricultural education project and calls out the need that they're really it has to be some coordinated efforts with City departments on that project then as far as our committee meeting this week the Civil Rights utilities Economic Development Arts committee is meeting tomorrow. We are having our second discussion on the appointment of America Lockhart is director of the Seattle office for civil rights in our last meeting. We discussed the responses to the council member and Community member commission member questions that we had sent to her. If you haven't seen the responses, I'm happy to share them with you. In addition. We will have a briefing from the for Civil Rights Commission. The Seattle women's commission the Human Rights Commission the lgbtq commission and the commission for people with disabilities on their 2019. Plan, and then finally, I will be having a briefing on an ordinance that will be coming to us later related to the Cedar River Watershed specifically related to do a application of the herbicide and appear to treat invasive knotweed. As far as items coming up this week on Wednesday the 24th. We have denim jacket. So folks can remember to wear their denim that would be great denim day Wednesday and denim day is the international day that is to raise awareness around victim-blaming for survivors of sexual assault as we know April is Sexual Assault Awareness Month and we are all invited to wear jeans and solidarity. They'll be a photo of the legend apartment at 1:30 on Wednesday, and as an indication of our of our solidarity with the planners of this event, specifically the Seattle women's commission, and there are a couple of specific Gatherings related to denim day on Wednesday Thursday at 8:30 to 11. They that is specifically to honor indigenous women with focus on Provisions to strengthen the violence against women act four members of tribal Nations to prosecute non-indians for domestic violence child abuse sexual assault and trafficking and then in the evening from 5:30 to 7. The women's commission is hosting a commemoration event and myself in customer Gonzalez full be there to participate lastly on Friday. I'll be participating in the YWCA stand Against Racism panel shout out for West Seattle helpline, which turns 30 this year and they'll have an event on Friday. And then finally the Woodland Park Zoo is doing a fantastic Outreach event at the South Park Community Center on Saturday between 1 p.m. And 3 p.m. They have a hope American can join us. Thank you. Thank you. Good morning. Thank you cancel president the Civic. I'm laughing because it live in D5 last year. What was it a baby goat and they put a collar on a little heavy. So it would be at the zoo cuz I don't I think Little Debbie's alive and well the native communities committee moved in Ordnance last Wednesday on the King County Conservation Futures Levi, the proposed ordinance will significantly streamline the conservation Futures Levi the CFL the interlocal agreement the amendment process the Streamline process was love faster reimbursement for Seattle's CFL projects that have been awarded funding by the King County Council and this passed out of committee second item as you all know is a select committee on the library Levy last Thursday the select committee on the library Levy meant to hold another round of discussions for potential amendments essential staff provided us with a chart to compare Implications of each Amendment on the residence as well as the proposed Levi. The amended proposal on will be up for a vote in this afternoon's full council meeting. Obviously. It passed out of committee. I want to thank customers skater customer O'Brien and Castro Gonzalez for offering and we accepted our past are critical and important amendments and a particular big thanks to Asha essential staff in the game in my office who work really well together and getting these amendments together and getting us over the Finish Line as you know, since it's passed out of committee will go to full Council and then hopefully if it passes today, which I'm hoping it will then it will be placed on the August ballot, and then the amount will be I believe I totally now with the Amendments 219 million. Thank you. Good morning. Mr. President today at the council meeting. We will have resolution 318796 the resolution that passed out of our committee last week after 3 weeks of Engagement with folks across the legislative Department advice and feedback as we create a group that will help us identify improvements to our Personnel policies to support a safe and responsive workplace in the city of Seattle legislative Department. As a reminder for this resolution. We are outlining our expectations for contact for all legislative branch members and with all legislative branch members this reaffirms our commitment that our staff should be treated with respect and should treat others with respect obviously in addition to us as electives being held responsible to do the same code of conduct requirements, and we're also making sure that folks are free from harassment intimidation assault or other threatening behaviors in the workplace. We're going to be creating a work crew. To advise the department on policies and those policy recommendations will come back to us by the end of August that will give us a better chance to understand how we will update our Personnel policies to ensure a safe workplace. Make sure that are all workers here including elected are free from harassment and intimidation and that we are being responsible to our employees and we are acting as responsible Employers in this new era. So I want to thank everybody including Monica Simmons and the council president and all of you as electives for a leading by example and showing that we can we can Implement exactly what we hold our values to be true. And this also follows the model that we see from the State Legislative Department that did something very similar. So thank you for that. It will be on full Council agenda today with a unanimous recommendation for passage. The second thing that's happening. Today is our select committee on homelessness and housing affordability. Handing out packets which are now online and want to hand this out to you. So you have at least a few minutes to take a look at it our apologies for not being able to post this earlier. We did get some of the materials I'm over the weekend and I'm frankly this morning. So I'd this includes our presentations from HSV on the request that we had to provide a benchmark or dashboard status Unfortunately, they were not able to pull that together. So thank you count the members who want for your previous committee meeting you requested. I think something very similar and this is an end-of-year report. They've included some flies. I will note that this is a placeholder. This is not if a filling the request that we had for a dashboard to be presented with I'll talk a little bit more about that. So in case folks didn't have a chance to watch come from a response Committee hearing are some of that information again, this is not intended to be a repeat and I apologize but we didn't want to have this is a baseline understanding for the dashboard or Benchmark presentation. That was not forthcoming, but we At some point we'll also have a panel presentation from three of our Community Partners that say basically yes, we are being judged by this criteria in the ideal world if we had a magic wand we will be judged by X Y and Z criteria how many people were able to stay with a case manager? How many people are able to stay on their medication? How many kiddos were able to stay in the same school? Those are some indicators that we're going to do some brainstorming today with our friends at HSB as well. I will also have a presentation on how folks then in responding to the Seattle Storm or I guess I should say the Seattle freeze when we had the really big snow storms in February. We want to know how we did as a city with getting folks into not just a warm place to stay inside butt into resources in the long-term. I think you count summer bags on it for making that request and I think council member Herbalife you had made a similar request when we were getting conflicting data earlier. So we're going to get clarification on that and then lastly will get an update from Mark Jones and Tess in the office. The implementation of this cross governmental entity between Seattle and King County that we are working towards building to address homelessness again. Hope you guys can stay will have that meeting as soon as we finish the morning next on the housing Health Energy and workers rights committee. We will be meeting on Thursday May 2nd that day after are big on International Day of solidarity with workers on May 1st that we will have a appointments to the labor standards advisory committee. We will have appointments to the Seattle City Light review panel will also have a confirmation process that we will be beginning with. Dr. Khan who has been nominated to lead the new office of the employee on Vine. She has submitted her the mayor has submitted all of the recommended requirements Ariel's for Haruka packet confirmation and thanks to all of you. We submitted 13 questions to her on Friday. We incorporated many of the questions then, You will have for her consideration and report back to us. We should be able to get that to you by next Thursday or Friday at the very latest and then you'll have almost a week to review those and then we'll also have the hotel workers and an industry standards discussion continuation that this meeting will have at the table folks from the hotel the hotel industry themselves to talk about some of the issues and challenges their face and lastly. I will begin our conversation in more detail on the Fort Lawton land-use will have a full briefing and discussion. We began this conversation and I want you to know that this will be the meeting where we get into some of the heart of the details so will be Distributing materials. I'm sorry, we have distributed materials to all offices and will be hosting a public hearing again just for your calendars. Hope you can all come on May 21st at 5 p.m. Here in council chambers. Lastly. I do have one more announcement. So we have the folks who are at the Seattle planning. Who have taken their recommendations that you all heard us applied? I think across-the-board the recommendations from the Seattle Planning Commission for reference quite frequently in our discussions around Man 3 housing affordability. They put out a report in late 2018 that basically talks about what it would look like to change single-family zoning to a more family-friendly neighborhood friendly approach. That would be a residential housing. They're having two forms coming up. Thank U council member of War as for pointing that out. There's two of ents one is on May 4th at 10 a.m. And one is on April 27th at 10 a.m. To different locations of the May fourth. One is at the South side, and the April 24th event is on at North Seattle college. So we've retreated this on our Twitter this morning in Caseville can help get the information out. This is really helping us talk about what the next step is the week. That we had the mha hearing Wells had a lunch and learn that they say thank you cancel president Harrell a few things to discuss here on this afternoon's agenda. We will start off with the resolution providing an honorary designation of 22nd Avenue Northwest between Northwest 56th. And 57th streets is Rob Matteson way. So that is the street that fronts the Ballard Branch the Seattle Public Library Rob Mattson work for the city Seattle. I believe for 40 years before retiring Mac in 2013. He passed away last year. And so he's often referred to as the mayor of Ballard. We will take up a couple items from the planning land-use and zoning committee of the first is an ordinance related to a monitoring inspecting vacant buildings. Compliance with the building code this follow this legislation follows up on legislation that was passed previously and trying to establish a protocol for how we move forward with this bill would do would be to require buildings that are subject to monitoring inspecting to have ongoing monitoring inspection anticipated about 1 month intervals and a buildings have successfully achieve compliance for 3 for 3 inspections in a row. They would then be removed from the list requiring ongoing monitoring. There's a caveat that the department want to be clear with there's a backlog of buildings and they may not be able to hold two of an inspection once a month the beginning as they were to that backlog the hoping that over of the relatively near future buildings will will come to intercom Answer maintain compliance so that with existing staff. He'll be able to keep up with an action plan from the sustainability Transportation committee. We will take up appointments to the urban forestry commission and the Seattle pedestrian Advisory Board. That is all for this afternoon. There's no meeting this week for the sustainability and transportation committee ignores their meeting for the planning land-use and zoning committee, but I will mention that the elected leadership group is meeting on Friday to set a reminder to publicly elected leadership group is a group of council members Seattle City council members King County council member Seattle mayor King County Executives and representative the Southport commission serving an advisory role to the board of Sound Transit making recommendations on alignment and station location of for the environmental impact statement that is about to be commenced for the West Seattle in Ballard extensions of Light Rail to part of st32. This is our final meeting Friday morning at 9:30. I will be meeting at the roof Fisher boardroom. It sound transit headquarters the expectation. Is that that Will make a recommendation to the board the the citizens advisory committee have their last meeting last week. And so they have a suite of recommendations that we will be briefed on and consider as we move forward towards making a recommendation from a group does the LG meetings are noticed as special committee meetings for the sustainability and transportation committee because we have a quorum of council members on the elected leadership group. That is all for me. Very good. Thanks customer communities new Americans in education committee. All three items are related to the implementation and evaluation plan for the families education preschool and promise Levy that was passed by voters this last fall. The first bill is Council Bill 11948 0 which will approve the implementation and evaluation plan for the Levee and appropriate Levi dollars to the Department of Education and early learning in accordance with the lobby that was passed. There were several amendments considered in my committee and 9 amendments to be specific to the mayor's originally introduced plan and I just wanted to give folks a quick little rundown of those amendments the 1st Amendment was to prioritize students who would be invested in as a result of these Levi dollars. There was a few categories left out of the original implementation plan is transmitted by the mayor's office and weary inserted those student populations back into the language of the implementation and evaluation plan specifically weary integrated Refugee and immigrant students homeless students English language Learners and lgbtq students. The Second Amendment is with regard. The K through 12 investment area goal the original proposal had focused pretty squarely on only college and job Readiness experiences that promote High School graduation. We reinserted the language that would that would also recognized that the K through 12 investment area goal should include academic preparation expanded learning opportunities and social emotional skills building in addition to college and job Readiness experiences. Our third Amendment reinserted requirements, that would permit the city council to continue to have oversight as the oversight entity of the various Investments through the Fab Levi. We created three different categories. The first category is a a set list of things that the city council expects to need to both get notice and approved. For modification Sakura that includes funding levels tuition requirements with Seattle preschool promise and any modifications to eligibility for the Seattle promise program. The second category is a notice only requirement which would require that deal provide the city council a 60-day notification of certain changes that they are making as they are implementing the Seth Levy dollars that includes any that includes notification of proposed modifications to Seattle preschool promise child selection prioritization or any proposed changes to the eligibility requirements for child care subsidies through or Seattle preschool promise, but not being that after this through the 60-day notification. That would provide city council an opportunity to provide the department with different direction if we disagree with that proposed modification, but we wanted to make sure that deal had the flexibility. They needed to have in order to make sure that they continue to be Innovative and Nimble as they evaluate the success of his daughters are being implemented and rolled out with our partners. The last is a category of various topics. That would be required that deal would be required to provide the city council with annual reporting and that's just the reporting requirements. Only the fourth amendment was a modification to the Seattle preschool promise tuition scale. This meant a few things one is that we increase the steps in the tuition scale from 25 steps to 30 steps the goal. There was to try to make it a little less burdensome for families who are jumping from one income bracket to the next income bracket and to make sure that the tuition that they were going to be paying a per month was not felt as significantly to those families were moving from one in. Bracket to the next so this is a I think I'm much more Equitable way for us to require an increase in tuition for those families who have seen an increase in their income. So at the end of the day the minimum tuition subsidy will be 5% million that the high-income family owners who participate in our Seattle preschool promise. We'll be the ones who are paying the most into the program and his crops cross subsidization model and really excited about being able to to have a little bit more of an equitable approach are still the Fifth Amendment is with regard to Seattle promised. This would require the department to evaluate. Excuse me to do you document clearly that part-time attendance is horrible under the Seattle promise program one of the statistics that we heard in a briefing. Is it an incredibly large? What percentage of high school students were graduating and thus would be qualified for sale promise actually attend Seattle colleges on a part-time basis. And so we the original implementation plan was crafted in such a way that certainly seemed to imply that you had to attend full time at Seattle colleges full time in order to qualify for Seattle promise. And we want to make sure that students who needed to attend part-time are able to at to do so under certain requirements. The sixth amendment is to require a racial Equity toolkit on various aspects of the Seattle promise program in particular expanding to serve students who wish to enroll exclusively on part-time status as a picture of the students who might slip in and out of full-time to part-time status and the last piece would be around and making sure we monitor a term of art that the colleges use that is Refer to a satisfactory academic progress requirements in really wanted to make sure the end of the day that there aren't any unintended consequences as a result of this the structure of the Seattle promise program, which is the last dollars in type of model. The seventh amendment is a tiny really closely through the Seattle promise program a requirement that the college advisors that we are a pain for through the levy are actually regularly and systematically connecting students who might need additional wraparound services that the City offers outside of the levy at to actually connect those students with those services. So things like the utility discount program or Orca lift and requiring that Seattle promise monitor those referrals and then also Monitor and report to us that take up rate of those monitors again acknowledging that are lowest income students are going to receive the least amount of tuition assistance. It's important for us to make sure that we are being very intentional. Britton connecting those low income students to other services at the city currently offers two different programs. The eighth amendment is labor Harmony provision and the request for proposal and RFI responses. So this is in a really important value to the city council and has continued to be in so what we want to make sure that we do moving forward is that are partners that we are asking to that we are funding through this program that they make a stated commitment to labor Harmony and labor peace agreement and labor laws. And so that's important amendment that we made and I want to thank Hills Moscato for working with my office on amending revisement language the Ninth Amendment are a bunch of technical changes that I won't bore you with but we're super important for consistency and language purposes. So that is the amended version of council bill when 19480 that we will vote on this afternoon in full cancel the second and third items on the full cast. Redundant are resolutions 31881031882 which would approve the partnership agreements with Seattle colleges in Seattle Public Schools District number one the partnership agreements as introduced and passed out of committee were already considered an approved by the Seattle school board. So now it's our turn to consider the resolutions that would approve both of those partnership agreements. Okay, I have an answer any questions about that if any folks have any OKC none, I will move along so my committee will have our regularly scheduled meeting this Wednesday, April 24th at 9:30 a.m. Here in council chambers. We will consider five items. We will hear three additional CPC Community police commission appointment nominations. This includes two new appointments and one reappointment to the community police commission as proposed by the mayor. Secondly, we will hear a presentation from her office of police accountability. They will be supporting out on their 2018 annual report and then lastly during committee. We will receive a presentation on the executives response to Sly 382 A1 2019 by satellite e s p d and the mayor's office this lie was sponsored by budget airbag shot during last year's budget deliberations. It directed the Seattle and information technology department and the Seattle Police Department to identify a recommended database for the law enforcement assisted diversion or lead program and estimate the cost of acquiring and utilizing that database will have representatives from the exhaust executive along with Lisa daugaard of the public defender Association at the committee table to represent on the executives response to a particular slice of this is a really important part of continuing to monitor through an evidence based strategy the data and the work that the LEAP program is doing so that we have a better sense of how to evaluate the quality of the program as we continue to pursue. What I think is a very strong interest to take the program to a larger scale across the city. Consumer herbo. Thank you. I just want a flag that in addition to the database needs for for lead. There's also in order to enable their expansion that this Council funded into the Southwest Precinct. We need to work to get them some space. I'm just flagging that has an issue a little a little another little flag of you have anything else to space you in the office space or time space office? So we're looking forward to receiving the response. We don't have the actual response to this lie yet we anticipate and I have received a commitment from the city budget office that I will receive that response today by noon. And that is my expectation is that I will have it by noon today. We will get it circulated to fix as soon as possible. I'll fly it for you all as soon as possible. So, you know that it's come in at but really excited about having that first initial conversation in my committee this Wednesday at 9:30 a.m. Just really quickly wanted to provide folks a quick update on matters related to the consent decree over the Seattle Police Department. We received early this morning a notification from the court ordering the city of Seattle to make an appearance in his courtroom and judge Robards courtroom at for a status conference that status conference will occur. Wednesday May 15th at 11 a.m. And it will be to address the issues that the court raised in its order to show cause as to why the city of Seattle is not out of Flynn effect of compliance with his prior order related to the sustainment. And the consent decree. So it's a important hearing for the city. We will hear it have an opportunity here from the judge his opinion as it relates to whether or not the city should remain in for an effective compliance with the consent decree as a result of the city's agreement with the Seattle police officers killed in relation to the collective bargaining agreement. So for those of you who might be interested in attending feel free to reach out to me happy to provide you details of where you need to be in order to listen to the hearing but I certainly will be attending on behalf of the city council and will be Back to the rest of you happens at that status conference and I'm working closely with both the mayor's office and a CPC and the city attorney's office on making sure that we know exactly what to expect and then lastly I'll just talk about a lunch and learn event that I am going to be hosting here in council chambers this Friday April 26th at at 12 p.m. I will be hosting Puget Sound Regional Council of Transportation a choices Coalition and other Community Partners here in Chambers to have a conversation around incorporating Equity into our regional growth strategy. So many of us and Regional Council committees throughout RS pan here on the city council and and I'm excited to be able to host them to have them come in and have a conversation with us about their Vision 2050, which is one of the reasons version of what plan if you will but it will focus on a transportation and housing and economic development throughout our entire region, and I'm really excited about being able to host them in council chambers this Friday at noon and to be able to provide the public little bit more information about how this impacts our regional growth throughout the Tri-County region. So a lot of folks may not be aware that they actually have a dress up with mental environmental impact statement,. That is currently underway and the comment. Closes on April 29th. And so we'll talk a little bit more about how people can become engaged in it and I'll go ahead and hand out. Some a flyer for this Friday's event. You're all welcome to join us. We have we have noticed it as a special committee meeting of my a committee to allow additional council members who may wish to attend to attend and would certainly welcome you all and I know that I said that that was the last thing but I wanted to mention one other thing, which is that this Tuesday at 6 p.m. The King County sexual assault Resource Center is part of the as part of Sexual Assault. Awareness Month will be hosting a really interesting panel at the mopop museum at that is free and open to the public. It is a conversation with a slate of journalist to really talk about the role that media plays in Shifting the culture around sexual assault how the general public talks about sexual assaults. And again, this event is open to the public and they will Discussing from a media journalist perspectives their observations and their conversations around how to report on sexual assault. So former our former colleague Timber Just will actually be introducing the evening and the panelists will include Sara Jean Green from the Seattle Times Deedee Sun from Paris 7 news and Erica Barnett from the C is for crank again free and open to the public registration is required. However, and you can go to kaiser.org to register a program begins at 6 p.m. And it will be at the JBL theater in the museum of pop culture. We've noted for 10:30, which says we cannot start before 10:30, but certainly we can start after 10:30. So between us and the start of the meeting we have nothing this afternoon for the financing neighborhood committee and I would stop there except for the fact that our next scheduled meeting is Wednesday May 8th. We've got a couple of appointments in Pioneer Square preservation board, but mostly we've got a number of big report items one council member herbold. I know you will be especially interested in the fourth quarter CIP monitoring report. I will also have the first quarter 2019 employment ordinance and an f r f a s department will have its race and social justice initiative presentation and councilmember Ms. Skating. You mentioned that today during our special meeting will be hearing from Mark Jones and the others also want to acknowledge that our next Regional Governors clients group. I believe it's at noon, but that leads sent to all of the things that have been happening the last couple of weeks and I want to really highlight the fact that in the media. We are seeing if I think a real obvious understanding about homelessness being not simply a problem related to drug addiction by recognizing that we do need more housing that the mental health behavioral health money that we're seeing from the legislature is especially critical now and then working on our Criminal Justice Reform that intersection of those three things. I believe that the community is beginning to see you in a different light and I want to thank many who have been working on that and to acknowledge in the mayor's office something that we really emphasized during our last budget cycle. And that was to have the low Acuity program get up and operational the first quarter. I understand we'll have a report thanks to Leslie Brinson. I'm into John ehrenfeld and she Scoggins from are fire are fire department that we will Be able to get this underway this year which was the request we made so that the First Responders have an option rather than sending out to ladder trucks and two ambulances to deal with one person on the sidewalk. We will have this low Acuity response with places for people to go. So I want to acknowledge and say thanks to all who been working on that. And then also another thing we had put money in the budget for hand washing stations in and around downtown and that was to avoid the problems that we saw in San Diego with hepatitis A. We now have our first confirmed case of hepatitis A here in the city and it's all the more important that we get either the Portland lose with the hand washing stations on the outside or the hand washing stations. We've been talking about from a public health standpoint. So I'm going to be really pushing hard on that to make sure that we have available to all of us. These kind of hand-washing station is great if you've got money and you can go into a coffee shop. Buy a cup of coffee, but if you don't we need to have these available and accessible to everybody. So I just want to acknowledge the good work that people are doing and once again that intersection of more housing mental health and Behavioral Health funding and the Criminal Justice Reform. We got the time to do it now and the focus and I think the wheel so looking forward to continuing to work with the executive on that and thanks for the parks department. Thanks for the good work. You've been doing around City Hall park with M. And with our friends in the King County Courthouse. Everybody's very thankful for your help and work on that done. Thank you customer Bradshaw Michael Phelps 5 minutes to get to go to take a break and if you have not signed in yet, there is a sign in sheet for public testimony up there. I'm just really quickly wanted to touch on that on that public safety issue that I just brought up a moment ago. We are seeing a lot of activity within our media Outlets reporting on what the city is or isn't doing as it relates to Public Safety. I wanted to just let folks know a couple of that that my office is or three things about this has been doing one as we continue our work around the criminal justice realignment work. That's an action that the city council took almost almost a year ago. Now at this point and we continue to work with her Partners within the Seattle municipal court system and with other organizations that understand what needs to take harm reduction approaches to really make sure that we are addressing the realities around the disproportionality in terms of who comes into contact with the criminal justice system. And of course that work Is never as easy or as simple as or as fast as we'd like it to be but it is incredibly important and we continue to work on that particular issue out of my office. The second thing is is that several weeks ago the mayor and I had a conversation around at organizing and Regional task force. That would look at both King County systems and the city of Seattle criminal systems to really begin the process of identifying where the public safety issues are real and where other responses that are more harm reduction and more about diversion to Mental Health Systems is appropriate and really excited to be able to partner with the mayor's office in terms of that body of work an aerostat are executive director for Central Council Central staff will be the point on that particular group. And so she she and I have had good. When's about how to continue to advance council's priorities to that area? And I just want to make really clear that I think we all on the city council share concerns that we hear from her community members around being able to address legitimate reasonable public safety issues that are creating on safety concerns. Not just for people who are house but also for folks who are experiencing homelessness and night and I take those concerns very seriously and will continue to work on those issues in partnership with the mayor's office and with King County around addressing some some hopefully short-term and long-term strategies to address some of these safety concerns that we're seeing play out in in a lot of neighborhoods, including downtown throughout the city of Seattle. And then lastly some of you may have seen a report that was effectively a Yakima County officials releasing inmates near in Camp. It's here in the city of Seattle. That was obviously concerning for many many reasons and I wanted to advise folks that I have asked Council Central staff to begin the process of collecting items that different types of information to to truth test some of the things that I have seen in the media reports around this particular practice as a as a sort of first point of fact, I want to make sure that council members know for a fact that the city of Seattle does not currently contract or have a jail contract with Yakima County that contract was discontinued in 2010, which makes the report that there are inmates being dropped off in downtown Seattle. Much more. Concerning and questionable in terms of the practice that is being reported by Yakima County officials. So we will continue to work on that issue and identify information and I'm happy to share that with you all in the general public as I receive it. Thanks for clarifying some of that misinformation that comes from Gonzales. Okay, so we have now one minute since you starts at 10:45, but I'm anticipating you may want to give us a few more minutes. I think that's the reason your discretion. Okay.", "end_time": 4388.0}]}