{"format": "raw", "annotations": [], "confidence": 0.9239501703678249, "data": [{"start_time": 0, "text": "I am doing by councilmember O'Brien. Moving on to the chairs report we have four items on the agenda today a briefing and public hearing on CB1 19471, which clarifies the definition of a vessel in the shoreline master program to an annual update from the office of planning and Community Development 3 + annual update from the Seattle Department of construction and inspections and for an O B C D & S T C. I join 2018 race and social justice initiative report. The next regularly-scheduled Pleasant meeting is on Wednesday, May 15th starting at 9:30 a.m. Here in council chambers. We will not be moving on a public comment at this time. We will take all the common items that appear on today's agenda. We have 10 minutes a day for public comment. Just 4 speakers are limited to 10 up to two minutes of public comment. It was speakers comic season 2 minutes. The microphone will be turned off speakers are asked to begin their comments by identifying themselves and the agenda item if they wish to address is reminder other common is limited to items that are on the agenda or within the purview of the committee. We have first first on our public comment on our list is John Chaney. Oh, sorry. First we have Margaret Richard. Yes, Miss Richard here and I'm here today because we have some unfinished business with this office of planning and development and I noticed you was talking about race and social justice and I'm a real stickler when it comes to race and social justice, which I feel that we as a people I'm black. We're not getting it and it's because of the corruption and conspiracy and racketeering that is going on at that time. So I'm demanding that you doing the investigation just pull up my name. I'm a Google Now all the way to the justice department for fighting against all this stuff that you took a job to do. I don't know what this little hand is cuz I can raise my hand and it could be the other one hands up. Don't shoot. Okay, I'm talking about the conspiracy all you co-conspirators about what you have done to me as an individual and we still have Racism going on and discrimination. So what's wrong with me fighting against it do you fight against it? So that's what I'm talkin about this kind of stuff have to come to an end just like that mess in Washington DC. You can be held accountable to for obstruction of justice. So I'm demanding you and it's no coincidence that they crane went down on the head of somebody that was working for planning and development and I don't have no mercy for either. Okay until you fix it fix it fix it fix it fix it. 21-22. Oh, yeah. Okay. So what else can I say all those people that are up under Nathan and what not. You need to check them out to? Okay, cuz that's called collusion. You know, when you go up and then you take files and you shred them just like they said where's all that stuff you were adapted on the President Trump? We want to see it. We want to see what you can find out. Can you miss Richard? Next on our list apologize. There's Is it can read this second name on the list? Who's the second person after this Richard? Up The Honorable Michael Fuller. Thank you. For the disabled George, Washington, June 6th of 1944 and sunrises served in the United States during World War II, June 6th and 1944 United States 11210. Audi TT 2.0 4.08 24.020 meaning activity president I'm tired of being sick and tired. I'm trying to send all the federal penitentiary for violating your oath of office, and I'm not new to this. I'm True to this in your Labor Ready worker on the job training George, Washington the president 1789-1797 from 1889. Thank you. Nexus Megan Cruz Hi sis working. Okay, great. Thanks. Welcome table. I want to talk about design review issues today since it's on the menu and two things that are going to come up later are specifically the early outreach program that was instituted this year and also Isela. So first of all, my issues aren't with the people of DC. I think the planners are amazing, especially those downtown. They have a huge workload and a lot of complex projects. So it's about the processing of the people with respect to the early Outreach. It was intended to broaden participation and focus on Equity area as an allowing design review meetings to focus on design. I think it was intended Vanessa. But it's not happening that early Outreach meetings are not regulated in any way designers that are presenting their projects for the client the public can speak but there's no real obligation on their behalf to take these suggestions into consideration and it's not done. It's just checking a box. So what happens if the public gets to design review and then design review board thinks it's already been taken care of and they don't want to deal with this so it gets passed to somebody's desk and it goes on for quite a while and if the public doesn't like what comes out at the end, their option is to go to the hearing examiner or to the appeals court and increasingly worst thing that happen and that's not Equity. We really need better participation. So we need to fix that. The second thing is excela. I think that was also intended as a an efficiency but it hasn't really worked out that way after a year. Now. There are two project portals that you have to check. If as a member of the public if you want to know what's happening on a project and they don't always jibe, and sometimes the info you wanted is not on either of the portal. So it's it's something that's got to be fixed and I hope that you could turn your attention to reforming this. Thanks. Next is Steve Costello. We still don't have a tree ordinance in Seattle. We are a very very Green City that doesn't care about trees or at least to do anything legislatively that Mike reserved trees. I'm sure that you'll pass a tree ordinance after the last tree has fallen in front of the development Community because when it will be meaning less you will be able to act till then it appears you have been unable to actor certainly unwilling to act we have carbon problem, but we are willing to spend great deals with money on big Heritage trees do it very efficiently, but it takes a long time to get them there. And as you knock them down for the mighty mighty stakeholders, which of course are far more important than the citizens because planning in this city doesn't really involve citizens anymore. I'm so old. I remember when a lot of developers used to have to come to land use meetings because the committee did its business in public now, we very seldom ever see a developer or pro-development people because they've already made the bargains with you lined up the vote and then we get two minutes at the end of the long process to say we've been excluded again big shocking surprise. It doesn't seem to bother you that much but it does bother some of us in the city. I've actually for democracy. I think that land use like all the other things should be bottom up. And I haven't seen much of that in the last four or five years in the city now glad yours is always been special and money is always had a bigger place. I think that I should have, but I see absolutely no fear the citizens whether it's process or otherwise, and I think it's time to change. Thank you. Who did not speak like to speak? Since we have no additional speakers, we move on to the next agenda item. Our first business today is a briefing in public hearing on Council Bill 11947 one clarifying that the definition of us know I would you please read the abbreviated title into the record agenda item one Council Bell 11947 one in ordinance relating to land-use and Zoning clarifying the definition of a vessel and consistently using the term vessel in the shoreline master program Independence sections of the Seattle municipal code. I will Missy Blair Department of ecology, please join us as well. Thank you. I will now open to the public hearing on Council Bill 11947. 1 sneakers are limited to two minutes of public, never speak of, Nick season 2 minutes and microphone will be turned off. First on our list is John Chaney. Thank you. My name is my name is John Chaney. I am the vice president of the lake in the Living Word Association. I'm a little surprised that as an organization where limited to two minutes, is that correct? Correct? Really? Okay, we're extremely concerned about the proposed legislation. This was truly we think is in keeping with what we try to do. The last time we were here which was talked about saving our house boats except that the shark that was down here then was dpd now DCI. We're hopeful that you will continue this public hearing to another meeting. So that more members of the public can participate in this. This is a joint public hearing with the Department of ecology. We believe that it was not fully noticed both to our members and to those people most affected. There's a tiny group of people in the city, which will be affected perhaps 200 verified house barges and floating on water residences. The city of Seattle has every one of our contact names phone numbers everything else because we're verified and the questions of the sea is did you notify all of the people that would be affected by this? We're hoping that that is a that's pretty possible to do. We're not talking about thousands or not talking about hundreds system 200. If I was to sit at the table today, I have some questions I would ask for dclu DCI. Sorry. How many have been verified and legally established as flowers? How many dead engine vessels have been verified as flowers or are pending as flowers? Why does the department continue to quote chapter 173 26 of the wac, which is the Department of ecology statement regarding over water residences when the legislature change that in change the SMA to include floating on water residences, we think there are serious issues with this and we would look forward to briefing the council members on this and briefing you as the new chair on this since it's my understanding. This is your first meeting on this. And we're a little concerned that as an organization. You keep us at 2 minutes. Next on our list is Steve Brooks. Hello. Here we go again with something that comes out. Where the city and spent a lot of time and the citizens get there 2 minutes and it looks like right now you're only committed. This is it and you have a public hearing, but what about the notice to the people who are most involved let alone the rest of the city the city has not done a good job of communicating. It's not done a good job of publicly doing business in this is just another example of land use is not between you and the development Community. The citizens should actually be involved. This is a democracy. This is not a stakeholder dumb, although it has been functioning as such for the last few years, and especially in this in this committee, which is done a great deal to increase homelessness in Seattle by raising the cost of living in Seattle when you up Cost of the ground state law is highest and best use you raise the cost. Someone has a one or two story apartment house. It suddenly becomes unviable because you've put up for 10 stories or more and there you just can't raise enough money to make it work. So we're seeing a lot quicker movement of destruction of what is the affordable housing in Seattle, but notice is the main reason on this. I think that the floating homes Community has been treated like everybody else and I think it's about time you gave them a chance to explain their situation Seattle advertisers floating home. They're really wonderful. It's part of you needs to Seattle, but you know, if somebody can make it back let's think of you. Thank you. Next on our list is rain ottoman. Good morning. Rain ottoman Washington environmental Council here in front of you today to thank you for your offer the opportunity to provide public comments on a proposed amendments that would clarify the definition of vessel. And you said vessel in Seattle SMP. WC has involved in passing. The shoreline master act in 1972 and has remained engagement SNP updates throughout the region. We consider these Statewide programs important tools for me to the sea palette Eastern Shore environmental safeguards for shorelines Wildlife human health and clean water wec supports his proposed code revision that immense several sections of chapter 23 .6 DEA of the Seattle municipal code in order to clarify that the definition of vessel includes inoperable ships boats and barges desire understanding that this is also necessary to help avoid missing identification of vessels as floating on water residences. This is good policy that will eliminate the existing loophole that allows boats with broken engines are boats that haven't been used in love. Time for navigational purposes to call themselves floating on water residences which means that they get quote preferred use unquote status or water-dependent Maritime use under the SMA. This makes them difficult to regulate in order to meet the objectives of the Seattle SMP for protecting water quality water dependent uses public access to shorelines and the shoreline help Discover Vision will ensure that floating on water is residences will be referred to as vessels and will be subject to the regulations for non water-dependent uses. So thank you for your work on clarifying this very important element in S&P and how are public comments? Thank you. What anyone else who did not sign up like to speak? Seems we have no additional speakers. I will now close the public hearing on CB1 19471 think it's our presenters and to everyone who came out to the public hearing. This time will be likely be back before the + community in June for a possible vote depending on the time of the necessary Department of ecology work today is oh, sorry. I apologize Central staff. Misty Blair Washington State Department of ecology glow I gave Department of construction and inspections councilmember Pacheco mentioned I'm today is at an initial briefing and Council Rd health committee already hold a public hearing a joint public hearing with the Department of ecology. This is to honor the city of Shoreline master program to clarify the definition of vessel. Procedurally. This is a little bit of a different approach for the council aware and using limited amendment process that's authorized under the Washington Administrative Code. So there's a hearing today responses to, still follow and I just kept Pacheco mentioned at the end of this process will be a committee vote sometime and in June with a full Council about to follow after feedback from the Department of ecology. Morning, Council chair and council members. Thank you for having us at your committee this morning. I'm going to start with M reminding everyone of us tci's purpose and values and I'll leave this up here for everybody take a look at. In my presentation is going to cover an overview. I'll talk a little bit about the background of the shoreline master program the purpose and intent of the amendment that's before you and the update process for this amendment. So back in 1971, the state shoreline management Act was enacted and in 1972 Was Won Seattle had its first Shoreline master program and then back in 19 or in back in 2015 is when Seattle comprehensively updated the shoreline master program. So the shoreline master program is a result of the Department of ecology Shoreline master program guidelines, and these guidelines established the rules that the local Shoreline are the local jurisdictions used to create their Shoreline Master programs bows for I'm writing. I'm an implementation of the regulations. It also establishes a balance of authority between the local and the state government cities and counties are the primary implementers and Regulators of the shoreline master program. And the department of ecology has the authority to both review local Shoreline programs. They have the authority and the requirement to to do that and they can review review individual decisions as well at the local level. So within the storms are within the city of Seattle or Shoreline includes the water bodies of Puget Sound shellfish obey Elliott Bay the duwamish river ship canal in Lake Union Lake Washington and Green Lake and then the land that the adjacent to those water bodies and the land that extends 200 feet from the ordinary high-water Mark as well as Associated floodplains and wetlands and river deltas of those water bodies So that the ordinance before you a men's the definition of vessel within the shoreline master program. And the reason for this amendment is to address the unintended consequences of a 2016 Seattle hearing examiner decision that ruled that an existing convect conventional recreational vessel with a broken engine was not a vessel and then as a result of that instead, it could be considered a structure and potentially be verified as a floating on water residence and so back on prior to the cities 2015 Shoreline master program update the state legislators to find a category of new overwater residences, and these were called floating on water residences and they limited the category of you floating on water residences to those that existed prior to July 1st 2014. The state also defined a floating water residence as a floating structure and that its design And use primarily as a residence. So therefore as a result of the state legislation legislation the cities 2015 S&P update included Provisions for floating on water residences, but as a result of the 2016 Shoreline hearings examiner this led to the potential of many more floating on water residences, then we're contemplated both at the state level and at a city council level when the shoreline master program was adopted. Given that the definition of a flower includes the requirement that it must have been in her Marina prior to 2014. How how is it that were worried about? New vessels that are broken so coming flowers. So if I'm flying to be flowers, so if a vessel can demonstrate that was broken prior to July 1st 2014 as in this case, so it had a broken engine then it was ruled not a vessel. So so there a lot of examples of that there are several. I mean, we've got more about hats that have been in the water since before 2014 and have we have lots of vessels that happened in the water before before 2014. I mean, we just we just had three more last week three more that have broken engines and are trying to certify as flowers there verified is that Just so I understand the was it a city hearing examiner ruling or was it a State Hearing examiner ruining the cities and so did the hearing examiner ruled that these were flowers or somebody said these are no longer have assholes and they have to be something and so this is what they're trying to certify an ounce from 2015. But can you remind me the different categories of types of live aboard residences that we regulate turn on water residences. There's the liveaboards on conventional recreational vessels that we don't regulate and then there's the Calculate the leftover category of house barges that were grandfathered in in the early 80s that as part of the 2015 update. They had the option to either stay as a house fire or get verified. So get verified as a house fires are verified as a floating out of one of the residences. There's very little dipper. There's actually no difference in the regulations between so basic about semantics. Essentially. There were a couple dozen barges is at 38 Is a 34 and then the what are the houses with sewer hookup and everything? Those are those are completely different to those are different and do not fall under to this a minute. So we are floating homes. We have vessels. So that's the sailboat that you go on sale. That's a live-aboard say load or but obviously any more than just a sailboat. Then we have the floating on water residences and the barges which is smaller. We treat them sounds like identical you're almost identically to those the four categories of of things that are on the water the people living in and there is also a like a vessel with a dwelling unit which is much smaller category that it but it was the result of potentially those vessels that didn't End up in any category that came into existence between July 1st 2014. And when we passed the 2015 Chevrolet master program, so we have it'll probably less than $5 register. What does the new construction things that were being created? Like they see houses with a steering wheel kind of thing or is that a different category? So as to describe the proposed legislation it clarifies the terms designed for navigation and used for navigation in the definition of vessel in the shoreline master program. So there's a reference to the SMC and what this does is that it says that if a vessel has been used for navigation in the past and can be used for navigation in the in the future that it's still a vessel. So basically if there are things wrong non-operable. On the vessel and a bad the result of the current owner that's fixable such as a broken engine that can be fixed or you know, even with a sailboat if the sales have been removed or if there is damage to the hull that that doesn't take it out of the category of a vessel that those are those are conditions that can be fixed or in the case of the ruling by the hearing examiner. If you get a potentially if you just haven't used your vessel that it would be no longer that's also say you take an extended leave in another country and could demonstrate that you never use your vessel that could be a potential way to demonstrate that you haven't used Your Vessel therefore therefore. It doesn't meet the literal definition of used for navigation. And then the other two Amendments have more to do with that house barge category if it's kind of a bits left over from our prior Shoreline master program where we did the color house barge of vassal, but now with the update on the new category of floating on water residence and the state legislator defining those as structures. We wanted to remove the term vessel when it was used with house parts to remove remove any confusion around that so that's what the last two amendments do with the amendment. So then on to the amendment process, so as I stated earlier, this is a joint review process with the Department of ecology ecology. So right now we're in the 30-day public comment period with the Department of ecology. This is a joint public hearing with the Department of ecology. And then after after the close of the 30 days at CCI will review the comments and make any appropriate changes to the amendment and then submit the proposed amendment to the Department of ecology ecology will provide their initial determination. I'm within 30 days and then STC I will work with ecology on any needed changes and then ecology will provide a written determination on consistent C. And at that point that's when we can bring it to a full Council for a vote and then it goes back to ecology for their final review and approval. I'm as an ordinance. Emperor O'Brien, so there's a lot of back-and-forth here and I imagine that the timeline is maybe not totally clear. But are we talking like 3 months or 6 months for this process? Samantha John on June the hope is that we would pass out by June. Those timelines are maximums. And so the city has 30 days to review and respond to their comments, but that could happen unless amount of time and then once it's initially submitted we have 30 days could ask for an extension of 245 not likely in this scenario cuz it's two days after the common sir responded to to have a back and we don't expect it to take long on our end because of the size of the ordinance because it is small for shortening their The Joint 30-day come in. A public hearing today. Is this the beginning or the end of the middle of the 30-day coming. This is the end of the third account. So I appreciate the formal process seeing some friends in the audience today that haven't seen in awhile. It's nice to have you back. I imagine that the city council will be engaging in conversations and depending on what we learn as we get re-educated on this issue and understand it as we if we if we have things we want to consider is amendments to the Amendments it we're proposing. I recognize this process isn't something that we can really well. I guess I can't do it. You know how to live with in ecology has a right to say sorry. That's not consistent with the law and send it back to us. And in the spirit of not wanting to take too much back and forth. What is the timeline for us to get informed and discuss we heard a couple different viewpoints in public, today and to get up to speed on those different views and see if there is a path or understand it or misunderstanding or whatever. Whatever can be going on to his I think what we are envisioning here is a little bit a typical of course cuz we usually process but normally a bill after it's thawed out of committee is almost immediately taken up by full Council. So I'm in order for Ecology to have some certainty about what they would be commenting on for the purposes of consistency. We're imagining that a June vote. I'm contingent on a maggot ability to look at the comments that we received have received and made it here just like comments from you all in from other folks as well. The June boat would be A vote on the audit committee recommendation that could be informed by the comment that the council has heard and ecology would opine on that would make a consistency determination on that prior to a full Council. Which would happened after africology has reviewed the committee's recommendation. So so in that scenario, we certainly wouldn't want to bring new amendments to the full Council. We want to finish our work when it comes out of committee, correct. Otherwise, we would that start that and so one of the comments and public hearing was was about like a question about whether some people that are living on these vessels actually know that this is going on until even if the public comment period is closed. I assume it's okay that the council continue to engage with with folks in receive their feedback on this. Yeah. Like, you know the variety things that maybe that there's just some uncertainty and fear about what might happen in so we can talk about interpretations. But there may be specific things you want to address. Those are the things that we want to do that in advance of a committee meeting turn up in June by sewer pipe makes more sense. It makes sense for us to be engaging with with Megan ecology throughout all of this to be wedding this as we go to see if we're on a path it's viable or not. as my helper, I was just going to offer some clarity that this amendment does not affect any floating on water residences that have been verified or any of any floating on water residence or house barge or any of the residential uses that have been verified if that's the case may be a matter of just convening some folks and having some conversations or maybe that this difference of opinions there until just a little bit more of an understanding of who received the notice of the public comment period did did the folks who are registered as as flowers received notice of the said it sounded to me like this is seeing this on the agenda was the first that they had learned of this so we have a listserv Find master program. I do not know who's on it. It's it's people that who have engaged in the past, but we did not go into my records and I don't even think we've got email for every verified floating on water residence. So we did not. Look for additional people to add to the list of sign up for the shoreline master plan Lula was notified of this. Thank you. the comment question Well, thank you. I'm going to give him a little bit of a sneak peek potentially, but I appreciate your time and consideration. Our next item of business today is our annual update presentation from the office of planning and Community Development know it. Would you please read this item into the record agenda item number to Office of planning and Community Development 2018 annual update. we're doing will be joined table today by director of opcd Sam. Asafa directors have a tail. Please take a look at you, and welcome to close committee and I am Sam a certified director of office of planning and Community Development. I will give you the full report on opcd. Nathan Torkelson is here with me as well. We will co-present the rsji part of the reports after my initial presentation. Let me see if I can get Isn't that right? Thank you. So just briefly office of planning and community community development. We celebrated our 3rd year January of this year. The office was created in January 2016 since then as a new office, we've done a lot of work internally to build a set of the grounds up mission and vision as you can see on the screen. This was developed by staff consistent to the purpose of the creation of the the office primarily to help coordinate City Citywide on planning growth and development issues to address equity and how the office could help support our findings to address the the girls that we are facing over the next 20 years. The department is organized around three primary work areas and supporting to commission's the organization. So the three primary areas Citywide initiative Reserve policies that affect the city Citywide such as comprehensive plans lined use policies recently adopted mandatory housing affordability program, which again infects a Citywide and then we also this group supports research and data including a Democrat demographic data housing data. Annually quarterly in different areas as second area is community planning an action reserve a specific community area planning work. The new initiatives such as the Equitable development initiative, which is primarily Geographic based and some localized planning stationery a transit-oriented development on Baker. These are specific areas specific neighborhood neighborhood planning practice and then a third group that focuses primarily what we are calling placemaking. This is focused on how the built environment it is is built from a design perspective including the public realm two spaces be in buildings public spaces that also a member of design guidelines that been a company neighborhood plants and Community plants that we develop. And then the lpcb supports two commissions that design commission which is responsible to advising Council and the mayor on any public projects. I bet also sweet vacation issues the Planning Commission on the other hand advises against both the council and the mayor on Citywide polish to specifically policies such as the comprehensive plan the Planning Commission as technical as an independent body that it is housed joined with LP CD to share Staffing in the Planning Commission director is hired by the commission and reports are primarily to the commission. So are 2019 stopping has about 44 ft e or full-time equivalency to cover the four of the five areas that are outlined earlier the Planning Commission and the design commission each have 3 and 1/2 ft e the rest of the staff supports the various activities activity. So that department I just want you to know if I mentioned it's a new departments part of I will talk about RS racing social justice issues on the next presentation bed. One of the objectives for the Department was from the beginning that we worked to Advanced race and Workforce equity and throughout the last 3 years and I joined in June of 2016. We've met a deliberate efforts to make our departments more diverse and and gender and race wise what you see on that is sort of the reflection of where we are today about 30% of staff are identified as people of color 60% of our Workforce are female and women last year. We are the seven new employees about 43% of them identified as people of color and almost 70% over 70% as women. We do that in promotions as well to wheelie advance. Gender and race Equity within within our Workforce one thing you don't see their we've also made an effort to actually have that pay Equity as well in the last two three years two and a half years wherever the director has discretion with use that opportunity to advance and make a pay equity and Departments of for example about 28 of our stuff or what are cold strategic advisers or managerial positions where I have discretion and we've reached pay Equity between them and gender and I pretty much stay men and women are paid equally in fact women slightly a job, but that was a deliberate deliberate action consistent with our vision and Mission within the department. The next I'll talk about our 2019 adopted budget and endorsed a 2020 budget currently. We're just about 13.3 million for the for the city for 2019 to Born to know that between 2018 and 2019. There was a significant increase closer to 6 million or more or obesity budget. This is specifically for the Equitable development initiatives because of the initial D the one-time funding that came up from the sale of the Civic square inches across and then to get the Equitable development development initiative going that was a significant increase you can see on the 20/20 endorse budget. You see some reduction that has specifically to do with the council had put and $1000000 additional for one time for 2019 for High for Equitable development initiative that was a one-time increase. So that's what is reflected there. We also have some budget reduction that minimal amount that when you see the discrepancy, that is primarily why has Maria Bryan him so I'm clear the 13 million dollar and total budget includes the $5000000 of grants. That would go DTI exactly that I'm only 4 million in the endorsed budget in 2020. Correct until we get our hands on it the right. This is just a snapshot an overview of our work plan on the left column. You'd see 2018 accomplishments on the right and number of ongoing projects either started this year or continuing from last year at the list is not exhaustive. I just know highlighted all the key project some of the projects that you see on the right condom or 2019 project started in 2018 bed power on going as well. And then on the right side, there's again, it's not exhausted that I highlighted some of the key a project and highlighted as a 2019 work program. I recall that in the CD Sly response 13051 A1A And my phone is if I texted it a couple years ago. We had also asked about the stationary of planning and in West Seattle as well. And I believe the response that you gave us some said that you would be start planning in Earnest in 2020, but that you would be beginning some initial steps towards planning specifically for The Junction in Delridge in 2019. And I know we're not getting too much into the weeds his high ilvl over you but I would very much like to learn more about and I know your staff has been out to talk to folks m in the junction and that have another meeting coming up plant plan, but would love to get a more of a handle on what the work plan looks like four. Those engagements for this year will be scoping that work this year and I will be working on that injunction in other areas of station area planning in 2019-2020. Sorry. I just about there compliments. Of course, the biggest work has being focused on the mandatory housing affordability. And thank you counsel members voted 902 pass that at this year but a lot of the bulk of the work was completed after my office in 2018, the Equitable development initiative the second round funding was completed in in 2018 through that process about approximately 16 million dollars were spoken for 4:15 different organizations with different levels of capacity and funding program that includes so those 15 projects and organizations with working with them managing their contract. So staff is working with each one of them. All of them are in different stages. Some of them are for capacity-building others for a property acquisition or Capital an example is that Refugee and immigrant Family Center which recently acquired its own property? So this is an organization in Delray Beach that has been supporting the neighborhood for over three decades. They were threatened by displacement last year. The owner of the property was had put the property up for sale that group applied for the EDI funding and they got I believe $850,000 to be able to purchase the building that they were operating in now they have a permanent home and that's a good examples of where that he d i program has been affected. And then another project the duwamish valley action plan which we completed last year. But this is also an ongoing project. It's a multi departmental coordinated project working with a community groups of this is one of the example that Pilots that we used when opcd started and to demonstrate how we work across departments. This was a pilot for the capital cabinets structuring that started late 2016, but now under marriage Jenny durkan it continues as part of this capitals have cabinet at process. So the drama action plan is I want to complish Benz last year, which will continue Now go so quickly on 2019 work plan. The comprehensive plan is the key projects over the next few years. We are required to adopt the next updates by June of 2023 at we are going to begin early scoping of out that work initially looking at engagement ret rights racial Equity toolkit process and racial Equity analysis this year as part of the precursor to some of the policy issues will I identify starting 20/20 where the full-blown compressor Plan update process will be started and There's also some comprehensive plan Amendment work will be. Getting by I guess this year and that will also Engage The comprehend a process. Another forecast this year and a priority has been looking at housing choices issues. This is putting together a data intensive analysis in background reports that we will complete in May to inform. You know, how the market rates housing is doing and what is missing and what is the market providing that we should start thinking about to address gaps in and housing choices. This is a background information that's going to inform mayor. Durkan Durkins affordable middle income housing advisory committee that is working to identify ways. We can fill the Gap where the affordable housing program or the market is not providing to the housing choices reports will help inform. Conversation in and policy that would come out of that. And 2019 will be having an EDI funding and at the third round we announced last April 5 million dollars for this year. We expect anywhere from four to six organizations to be supported through that program. We have a June 5th deadline for applications. That work would be a significant this year. But we also have a required monitoring program as part of the Equitable development initiative implementation plan. So by third quarter of 2019 will be developing the Equitable development outcome indicators indicators that reports this is a phase 1 of a two-phased report the second phase schedule for 29, 20, 20, 20 20, it will highlights displacement risk indicators are those are kind of key project items for this year. We also be putting together a permanent Advisory board for the Heat Die by the end of the year. Councilmember Harbor hard-boiled you asked about stationery at significant amount of work and Community planning in the hundred 30th and 145th station area that started this year and it will continue through that. This looks at station access station planning and land-use issues with working with Scott on mobile T planning for the area and then some potential relevant infrastructure Investments there. Another work that was initiated this year. If you recall us part of the Washington State Convention Center approval process entitlement process. That was at one point five million dollars identified to conduct a technical feasibility study for a potential leading or putting a lid over the I-5 somewhere between Danny all the way to Madison Street. This is a study that we have already initiated. We've hired a local consultant firm at wsp as a bridge project consultant, and there's a big Community Advisory Group. It was put together at to help steer and direct a lot of the options and evaluation. The purpose of the study used to have visibility mostly structural and engineering and to a certain extent potential Park versus Land Development potential so we know What it would cost a lot of it would take to actually lid on the I-5. That study is expected to be completed by the end of the year or hourly 20/20. Can you outline who's in the community Advisory Group? I can send you the list of federal representatives from different a wide variety of different both technical, but also Community Representatives. I'll be happy to send you the list. Thank you. Serta broader station area planning as part of st3. We've been working with multiple departments primarily as. And sound transit to scope out for teen potential new stations from West Seattle to Ballard by far. This is probably going to be the most significant investment in the city of Seattle. Probably ever that's going to impact and transform the city significantly over the next several years. So we're working very closely with multiple agencies specifically St & N City departments to start scoping and outlining the work plan around station area planning. Our work SD is responsible. Transit is responsible for the station itself that in the immediate surrounding the transit-oriented development opportunities, including Equitable Transit development opportunities. Land use all of the things that line music related diseases that affect how the station functions and how we take advantage of that is a critical component of that study starting from Junction to any number of station areas throughout the city. Quickly as part of the mandatory housing affordability as follow-up. We have to kind of areas of a potential significant work items council's companion resolution for mha has a number of requirements that we have that effect. Opcd. Of course. This is not exhaustive things such as monitoring changes in housing developments tree canopy planning and some specific neighborhood areas and a number of other companion resolutions that would follow up on mha the mayor has also been very much focused on a true executive order on displacement bed. Also a number of other actions that she wants to address relevant to mha that would be a significant work plan for 2019 primarily that will continue in 2020 probably. As well for some of them. So that's kind of a high-level overview of lpcd and and 2018 and 2019 and 2020. So I'll be happy to take any questions. About Hubble So Yesterday incidentally. I met with the residents of the house and manufactured home Association and they were doing the rounds with council members to find out where things were at with the development of the legislation that Council search sketched out a work plan for when Council passed the moratorium and I'm looking at both of you because the war plan that was in the legislation identified rules for both departments and specifically what's do right about now in order to do all that sleep a review and determination of environmental impacts and all that so that we have a bill before us before the moratorium rolls out. And what should I think? Is sometime in the fall is that right about now? We're supposed to have an analysis of the current land uses development Trends draft legislation and have conducted super review on proposed regulations. And so that was that was in the war plan that accompany the ordinance the mayor sent us a letter ride at Schlitterbahn decline to sign letter for folks. Information in a refreshing of memory the letter referred to that work plan in the in the ordinances advisory in nature. And I don't see reference to it in your proposed work plans. So can you just talk to us a little bit about what what it is that you are looking to do? It looks like the mayor is considering this work plan advisory, but she referred in her decline to sign letter to some other work that was happening that nobody that involves residents that residents are unaware of any other Alternatives being developed. So it would be great to learn a little bit more. There's a lot this is a elderly Community is a lot of anxiety a lot of concern that people are exhibiting mental health issues because of the housing insecurity that they're experiencing. So we have started some of the preliminary work to understand what Lundy's options exist and what other set of mechanisms exist to address that issue. We haven't reviewed it with the mayor yet. We're preparing that as we speak and once I know and types of the day Directions she wants to go I'll be happy to tell you but the work has started in this work exploring stuff is looking at what are the issues in the Mets are definitely is concerned about that as well. And I know some of her stuff for exploring it as well, but my office has started so they're looking at the site issues in what options what is what are the guard rails in and what leverage do we have or don't have and what are the possibilities for? Imha versus current lines on it. So that early analysis has started but we haven't reviewed it with executive yet and is is the Opposing of a new zoning designation to protect the existing use is that is that among the options that your clothes there? We are very preliminary analysis of what is there currently and then asking the question of is that you know, can you put that as a way to restrict I have no ideas list of options stop publishing determination in June. And as you guys know there's their timelines legal timelines with all of these different stops, and we don't do them. Then we run up against the moratorium and we won't have time to take final action if we haven't taken the stuff. So I'm sharing with you the anxiety of committee members that I met with extra day. I'll get back to you with timeline. Star by fish ate your attention to this council member herbold. The intervention we did a few months ago was was a great step and it was just an intervention. Answer the questions. I'll just mentioned you guys got a lot of work over there. I really appreciate the Good passion and dedication of your team salmon just the the single topic of stationary planning with light rail like to so many neighborhoods alone could keep 44 people. I'm overwhelmed and and the EDI work, you know, there's an amazing amazing opportunities that that provides any got an amazing team there too. And so I'm just a thank you and thanks for your team to be doing that work, and I know they're probably overwork, but I really appreciate the medication. Thank you. Thank you. Search person. Nathan Harrelson director of the Seattle Department of construction and inspections welcome and congratulations councilmember Pacheco great to have you onboard. I just wanted to start out. Sansa technology expert as well. Do you mind driving? So just remind that plays Committee of SDC eyes purpose and values. next slide Everyday, we come to work and adhere to this purpose and values is in this is something really important to our work next slide. We have 375 current employees and six divisions and I really want to thank staff staff are working under unprecedented permitting levels and unprecedented code compliance issues and you know, depending on who you're talking to were making decisions too quickly or not making decisions nearly quickly enough or there's too much regulation or not enough regulations. So I think staff do a remarkable job balancing those demands every day on the job. Like Mr. Assefa highlighted. We have a commitment to diversity and equity in our department. Just looking at the stats for 2018 new hires 50% identified as people of color and 52% as women and promotions 45% people of color and 32% women. Overview of our department. We have a budget of almost 85 million and again a reminder that 91% of that budget is funded by permits and other revenues. It's not general fund we issued over 51,000 permits and 2018. We reviewed over 9800 enforcement complaints. We've registered over 31,000 rental properties comprised of 159000 units. Again, this is a very important fairly new component of our work and we responded to over 1,700 tenant assistance enquiries and that resulted in the lot of cases for our landlord tenant unit and for our tenant relocation assistant ordinance program. So what we do everyday, obviously, we review an issue permits. We're implementing 17 city codes. We run the city's design review program. We do inspection we do code enforcement. We run the tenant protection and Rental inspection program. We working it out of variety of land use code revisions in addition to the great work that opcd does and we're out in the community everyday engaging especially in our tenant landlord unit. In 2018, we issued almost 700 Master use permits 6600 building permits almost 24,000 electrical permits and last year. We permitted about 7,800 net new residential units and we are just as a comparison. We are a smaller city than our city to the South San Francisco and they're issuing about 3,000 new building units a year. So we're doing a little faster on production and as we know we desperately need new housing units. And you been at this pace for a number of years, correct? At what we do again / 195000 inspections in 2018 and you can see the breakdown of the different types of inspections. And as I mentioned earlier we responded to about 9800 complaints in 2018 and a variety of areas everything from illegal construction to weeds to vacant buildings, which is taken on more importance in the past couple years to trees. I guess councilmember O'Brien referred to permits. Intakes actually increased from 2018 / 2017 that intake value increased our tissue issuance value is actually it down just a little bit and that permit count 11000 that includes building permits mechanical permits in tenant Improvement permits. So here is that a graph that just shows the number of residential units that we permitted? You know, we're thinking that most of these units are getting belt given the robust housing market again. We are a little bit down in 2018, but the last four years of the highest in the city's history. And then again looking at building permits and take the last 3 years over 7,000 building permits coming in every year. Nathan's on the grass you show 8353 I'll just maybe this some of both and then previously said 7821 is the drive to redline their the demolitions or something. Correct? Yeah. So then that number 7800 the total number of new units is a T300 but there are some demos as part of those new permits but as you can see that in the number of units that have been demolished is a very small percentage of the overall number of new units. Is a lot more blue than red on that man, right? Probably about 85% of that blue is unaffordable cuz I think I saw a stat in the X recently realtytrac analyzed housing production in the region of the last 10 years and 85% of it is defined as luxury housing. We know that market rate in the city is beyond the reach of so many folks extract. We are producing more affordable units than ever given the increased affordable housing Levy amounts. The Mets are certainly now focused on the affordable middle income range, but a lot of the units that are being produced are at the higher income levels. Can you speak briefly about the permit review times? Yes, I will get to that and I'll explain what we're doing to address that that's a really important question. So I just want to really thank the city council for last year's part of the budget process of adopting our new fee ordinance. We did raise and restart your building permit land use hourly fees of this help support are term-limited positions so we can have staff on board to respond to the levels of permits and it also helps us fully find Core Staffing Reserve. So what are Department experienced in the past is when the economy cooled off because over 90% of our budget is feed drove in that we're in a position where we have to lay off a lot of staff and then when the economy comes roaring back which it always does we are always behind because we have to Go to the hiring process and then we have to train staff and we're always behind so with these feed changes will be in a position in the next downturn where we don't have to lay off as many staff and will be able to retain a Core Staffing Reserve. So those employees who are trained and have the knowledge will be ready when the economy comes running back. So I guess I just want to really thank Council for supporting us on that. It's just it's a huge investment for the future for our department just briefly that from 2000 to 2016 are land-use hourly billing rate was unchanged. So we slowly started to change that and last fall cancel. You voted to raise that rate at $386 an hour which Foley catches up to the rate of inflation. And then a building permit fees we did raise the fees for projects of valuation of over $1000000. We did not touch those projects under $1000000. It's just recognizing the smaller Builders. And we also sir to reset the building valuation data table Sophie's are based on the value of the project and we had not course corrected the values of Project based on construction costs in this region. So that was an important adjustment as well tomorrow truly affect what's going on in the markets in the Seattle metropolitan area. So I just wanted to recognize that it was actually a year ago yesterday that we rolled out our new permitting system. Excela the previous system Hansen, which a lot of people forget was actually out-of-date unsupported and was failing daily. So it was crucial that we migrated to a new system. Excela does allow for a Citywide platform s. And the office of sustainability in the environment are using this platform, as they make improvements and excela will result in better process efficiencies, as I mentioned increase coordination with other departments and better automation. However, we did have a really Rocky rollout that negatively impacted our customers and also people who live and work in Seattle who are trying to track permits. We have worked really hard over the past year to continue to make improvements to excela. I'm very sorry about the challenges that we've had. We have invested over three million dollars with Seattle it to continue to make improvements and so we're getting there but if we're going to need a little bit more time. Cuz we're Hubbell. What are the top level improvements that you feel that is really important for us to see eye to focus on we just need to make the platform more customer-friendly. I will say sort of addressing council member pacheco's concerns. We are hiring additional staff our mess use permit land-use times are way behind we've had some major retirement and land use this year. We're currently hiring additional staff. We do have some additional steps as a result of the incentive zoning audit and the mandatory housing affordability. We need to make sure that we're capturing the correct number of dollars is part of that. I'm so we're working to better streamline that process as well and we are using contingent budget authority to hire additional temporary staff for up to two years and we've extended that so when we do have turn over, Or when people retire those people who are in the contingent budget Authority positions are well-positioned to be competitive for those permanent positions tomorrow. I just want to like to get a little bit more of a flavor of what you define as making a cell a more customer-friendly what it was. What are those what is that look like? So we have created short videos online to help people to the process. We find that people respond much better to videos then to information online. We have a help center that helps people get through that process in the beginning when things were so complicated. We had a direct phone line that people could call in and get feedback immediately that day to help them to the process. There's a drop-down menu that we just added to excela so people can zoom in on the exact type of permit that they're looking for and I'll be happy to give you there's been a ton of a very some permits. I'd be happy to pass that on moving forward. It's primarily hiring additional staff has issues and Seattle it. You be willing to report back to the committee just in terms of permit statuses and customer service. I'd be happy to do that. The city's design review program that was updated in 2017 went into effect on July 1st and just as a reminder, the primary changes were to simplify and raise the threshold for design review and to focus the board on larger more complex projects. We added the requirement for early community outreach. That's a process that the department of neighborhoods overseas and we did include some technology improvements and additional training for design review board members all the design review board members go through RCI training, for example The early Outreach process again is with the Department of neighborhoods. It requires developers to notify residents and businesses projects coming up in their neighborhood. If you can see that map on the PowerPoint slide, we have Equity areas where we do require some additional steps for the developers far as providing information and other languages and reaching out to underrepresented populations. Our neighborhood are a list of neighborhood councils given to developers yellow. Absolutely. One of the things that we heard and public comment is that there's a perception that the early Outreach component isn't functioning as people had hoped it would I know this is this was the possession or testimony of a single person but the feeling was is that during early Outreach. It's it's it's not perceived that there are actually changes to the project during during that component. And so when design review begins, its work in their mines all of those issues that may have come up in design review have been been address. And so, you know, one of the one of your bullets is that allows design review meeting to focus on design which I believe was the with the intent, but I think the perception was that there was going to be more happening that would actually affect a proposal during the early out. Peace, so I would recommend that stci and the department of neighborhoods would come back to your committee and talk a little bit more about that was I think one of the I don't want to say experiments, but one of the things cancel thought was worth trying as part of the design review legislation when you amended the legislation, I'm sure there's room for improvement and we're letting to that process. I'm sure there are examples where it hasn't been satisfactory to the neighborhood and other examples were perhaps it has been helpful the ideas when the developer reaches out initially to the neighborhood. The project is still very conceptual and so it'd be interesting to talk to some developers to to see how they see the process. Is it helping them in their ultimate design of the project or do they just see it as a box they have to check. The term that was used in public comment. I appreciate the opportunity to have a conversation. I just commented anecdotally in conversations with community members in developers. My senses. The frustration is less about any minute, today is less about the the process necessarily in and about the outcomes and I think there's a policy choice that we intentionally make which says things like parking are not subject to design review. You know, when when we Zone something and says you can build a 4-story apartment building here. You can build a 4-story apartment building and they're narrow things that we say, we would like Community feedback on this would like this volunteer board to review that and I think a lot of folks are frustrated the constraints it which they can do that. And I think that's a fair policy question of their other jurisdictions in San Francisco, maybe being one who's doing better start as much housing as we are as a lot. Longer process that often results in projects not happening and I think we've intentionally not done that and so there's that I think would be good ton. Try to understand the concerns are like they are not getting notified or when I show up it's too early in the process versus I just want a different thing built and they're not listening to me and changing in the city is not trying to build something different and so it's all along the Spectrum. And so I appreciate that. Tell us your cancel past the neighborhood parking legislation to provide more flexibility. One of the great things about this legislation is that it allows owners of existing multi-family buildings who have unused parking which we found there were quite a few to be able to lease out that parking to people who live in the surrounding neighborhood that legislation also requires that parking leases are separate from the leases for housing unit. So we do have a lot of people in Seattle now that don't own cars. They should be paying for a parking space that they're not going to use. Renting and Seattle around that we had talked about and I thought there was something more coming back to us was the experiment that is going on up in Capitol Hill about public use of underutilized building parking and there's like a Capitol Hill housing was working on that will check on that. Sunex renting and Seattle again really want to thank council members for championing this program. Can't remember her bolts in particular and other council members of the idea here is that there are a lot of departments involved in tenants rights and tenants regulations and assisting tenants. So late last year. We launched for the One-Stop dedicated website for tenants and for landlords and established a dedicated helpline, and so we are working hard to get the word out about this website, and we're seeing through increased traffic on the phone line. I'm and on the website, and I encourage you all to check out the website. I think we did a great job and nice graphics and pretty easy to navigate. So a great new tool and thank you to council members. I'm we continue to do a lot of Outreach to our tenant and our landlord communities we did over 30 events in 2018 and we have over 50 plans in 2019 when the year will be done. We have a great partnership with our office of civil rights and a joint training curriculum for landlords. We do quarterly landlord workshops were working with the Seattle Housing Authority at their voucher orientation. When we've done targeted Outreach. I'm in various neighborhoods such as South Park at a new Holly and we've done quite a bit of advertising about these resource in various ethnic media Publications in the city. So looking forward to 2019 some of the legislation the electrical vehicle charging legislation that come to mobile or Brian has been helping helping Champion. I believe just passed through full council elections The Vessel definition legislation that you just heard about will also be bringing to you some zoning changes for Seattle Pacific University is they want to expand some of the issues that were working with this year. We were awarded our tenant Outreach grants. This was money that Council gave to the Seattle Department of construction and inspections and mha implementation again, we're working on that. The program is in effect. Are the vacant building monitoring program implementation under counter council member her bold leadership. I taking a more proactive role looking at vacant buildings in Seattle. I just wanted to highlight two huge complex projects that have been going through our permitting process. And I want is obviously the Seattle Center Arena the Demolition and site work has started on that project for the NHL facility. And then finally Northgate has been somewhat under the radar screen, but Northgate is going to radically change over the next 15 years Light Rail opening in 2021. Simon properties is proposing over 1,500 units of housing. How much is pretty significant? But that's exactly where we want housing next to the Light Rail station and the NHL practice facility, which at this point is proposed to be three ranks and will have public. Access so that'll be a great amenity in North Seattle on the Light Rail trains in addition to the bike racks like a hockey gear rack practice. So I know some of the universities across and colleges across the city with regards to outreach for proactive Outreach for students or for somebody young people are moving to Seattle. That's not the renting tool. That's an excellent question. I'll have to get back to you on that like what Outreach were doing for students. I know we have get engage members on our various boards. I believe you have a good engagement burner design review board starts Outreach to students at our community colleges and our institutions of Higher Learning. I don't know we'll get back to you on that. To the right in peace, and I know it's the fact that one of our universities has a program certainly is sufficient, but I know of one in particular there's that there's a program at the University of Washington that is focused on making sure that people who are becoming new tenants know what their rights are. But again, this is really as you say important information for new tenants to have Institute of Higher Learning. great question small up. Given some of the delays that I think that the backlog of permits give me recommendations that you report back to the committee with the guards were involved in a lot of discussions with the mayor's office about this. It's something of great interest to the affordable middle-income advisory committee right now. So we're working hard on that got the report back to this committee, but just add another work plan related question in 2018 after receiving a similar briefing before the floods committee members of the committee including are alternate routes to Mira darken about are concerned that a really high priority issue was not called out on STC is a work plan and that's muttation of recommendations related to unreinforced masonry. So I just wanting to bring that out again. There are 77 built buildings with critical vulnerability. The recommendations are to Stage our responses by focusing first on those 77 buildings, which means we can't get to the other. The other two hundred or so buildings that are less vulnerable until we start moving on those that sits at estimated to to get through the the the list of buildings between 7 and 13 years, but the clock is we can't get to a seven-year time frame until until we start it. Thank you for bringing up on rainforest masonry buildings a very complex and difficult issue and really the one issue that keeps me up at night. If you recall last year the city hire the national Development Council, which is our national not-for-profit Community Development organization to come up with a financing strategy for how to address these buildings in Seattle. We are just completing my report and we look forward to hopefully to coming back to cancel soon with the results of that analysis. Thank you. directions to Porters and I know I speak to the weekend just as well as I'm going to be learned that one of the biggest was a former staff member and deputy director of a department. And I know what while I know that we have the information at this point. I wanted to give you a moment to speak to the role that sdci played in the aftermath of the incident. Thank you. So I just wanted to recognize that one of the victims was Alan just add who is the former deputy director of the Department of planning and development? She works for the city for 31 years is survived by three daughters. I'm in contact with the family will let you know when the memorial service is. It's just he was also a media spokesperson. So it's just a tragic irony. So about the office planning and Community Development and the Seattle Department of construction and inspections are really grieving through this loss. Who is responsible for certifying inspecting the tower cranes? Is that sdci or a different entity under state law state Labor & Industries is responsible for Tower cranes. So they have a very rigorous process for certifying the cranes and the setup and the removal of those cranes. Soy sgci has no regulatory Authority Under the current the current policy construct that exist. That's correct. Could we I mean one of the things that's been suggested is that we might want to look at additional regulations above and beyond what state law requires one. One thing that was it has been suggested is that we could have our own regulation that would require that a technician accompany the worker who's taking apart the crane there's been speculation that the the pins were pulled going up into coming down at the end in order to save time, but there is a right way to do it and wrong way to do it and having a technician accompany the worker to make sure that it's being done the correct way is What is one thing that's been suggested another has been suggested that we could potentially require via a Seattle ordinance that there be a flagger on the street when the crane is being taken apart itself. Is that is that something that we have the authority to do or is it somehow preempted so I don't want to speculate on what happened on so I think we need to wait for the investigation of State Labor & Industries. I would recommend finding out what happened there before the city looks at additional regulations. I don't know if we have the authority or not. I I think that's that's that's good advice. We should find out exactly what happened before trying to. To make make any sort of regulatory correction here. I was more giving that as an example to see whether or not we had the Authority or not, but I just can't. That's something we probably should have to take a look at internally to see whether or not that's there is very has pre-empted. Thank you. Again, our condolences go to the family and those impacted like you lost a number of folks and it's definitely Hillary Drive. I just want to stress that I have been out to the site. One of her senior building inspectors has been out. There are whenever I leave Structural Engineers has been out to the site. We will begin working very carefully with the engineer of record and the building owner developer and the contractor on the path forward that they will need several permits from our department. Well our final item a business day is the 2018 race social justice Initiative for both opcd and STC. I listen to the record for office of planning and Community Development and Seattle Department of construction and inspections 2018 race and social justice initiative report. I'd record stores in South and we have additional stop coming up as well. Thank you. Could you please introduce yourselves in kicks off? Hi, my name is I end up going on with the office of planning and Community Development. I'm Jared Bigelow. I'm with sdci. Great. Well, thank you for having us here. Again. We're going to give you some of an overview of our rsji collaboration and where we are with our team just to notes on test e c i n o b c d consistently collaborates to advance the rights and social justice and Nathan and I work closely as well as our staff. So we're going to give you some of a general updates where we are before we do that. I just want to say on behalf of a c c i n o b c d that we would like to recognize toxic lead recognize that we live and enjoy land at the indigenous people who lived here before us thousands of years ago and continue to do specifically the traditional and currents territories of the Coast Salish people. This is very important, especially for our function as a kind of custodians of civil on policy. It is important that we know the past in order to plan for the future and we have been making a lot of efforts in that area. And the first point of starting for us is recognized that the people who lived here before and we as we talked through this will also ensure examples of how we roll operationalizing that part and idea where it becomes a very effective act and by-and-by heart departments. So with that and I just want to emphasize that we obviously used to be the department of Planning and Development. We're two different departments, but we have decided to keep a joint change team, which I think it's been really effective and we work together every day is two different departments and it just made sense to us to keep one change team as we do a lot of the current planning and opcd does a lot of the implementation of policy. Comment so a council members. I know you're familiar with our home fairs. We're focusing on 2018 accomplishments. We had a South Seattle home fair in 2018 about one-third of the attendees were people of color and do we had 150 + attendees. I know I'm kind of jumping into 2019 and that's supposed to be part of my presentation next year. But this year we expanded we had bouts at home fair in South Seattle and one indoor Seattle and I know it comes my bro Brian. I just want to thank you. I know you were able to attend at home fair that was in your district and I now staff and the people who attended really appreciated having you there. Thank you. I appreciate you being there blown away at the attendance at the fair and I really I can tell that you have committed to doing this work and you know, it was a winter week. Is a sunny day and there are hundreds of folks that came through their packed into the community center all sorts of information being shared and just you know, the Great Taste of the city to come into community. So thanks for your work on that. So just for the benefit of people watching on TV at the home Fair. There are a lot of sdci Staff but there are staff from any other agencies both from within the city and outside of the city. It's a relaxed environment where homeowners and renters can talk to staff and we also have presentations for example and landslides awareness and earthquake retrofitting your home and various topics like that. So it's I think we put a lot of work into it, but I think it's a really important service that we provide to the community. And also as I mentioned in my previous presentation, we continue to do more and more 10 an Outreach Tavares tenant groups and individual tenants. So that's an important part of our work. And then we also opcd continues to advance rsji issues in community planning and in each of the areas of just some examples imagine greater downtown. We've been working on that in the last several months. We made extra efforts to actually get the voices of people of color who don't normally I feel like they can come to downtown just to ask the right questions to really understand what we need to do as we plan for the downtown. We reached out to respond to some of the issues that we have heard already through that process. A lot of people don't feel comfortable to come to downtown. We reached out to indigenous groups to really understand their perspective as well and how that then could help inform the future either the Waterfront planning and a lot of the focus in the downtown area to be affected by that kind of Engagement and we so we continue to do that and increase our efforts. Recording with Department of neighborhoods currently going through major transformation to advance and improve our engagement specially and how to reach to people. We don't normally engage. For the Equitable development initiative. We assembled a 15-member Advisory Board to help determine criteria for projects receiving EDI funding and they're also going to help us review stories that will be in the EDI monitoring monitoring report. We had two great events last year AGI many conference at the Seattle design festival and a convening event at El Centro De La Raza in November. Another accomplishment are indigenous Seattle initiative. So this was created last year early last year to educate our department in our community is about indigenous people their culture histories and how they can influence our work in a meaningful way. We had for trainings events last year as you can see on the screen in addition in the office. We have a indigenous Seattle intern by the name of Owen Oliver husband, excellent. He recently organized a conversation circle at the University of Washington between opcd and First Nations, and he also co-wrote the land acknowledgement that Sam read earlier. So when are the programs we started a couple of years ago at opcd this Urban Innovation speakers serious, we do we hold about three events a year around topical issues that affect Seattle lights on 2018. We focus the themes around race and social justice issues in the role of planning zoning and policies about line to use and how that effects that people of color last in February. We launched the central vision. It's a documentary in the Central District in the central area that we worked with local artists and local activists and we funded the program to have them tell their stories about the impact. The neighborhood is going through as a result of displacement risks in may we have any events and Equitable development investment focused brought speakers from Outside the city from other cities as well as local and we held it at the Ethiopian community of Seattle. We started taking out the urban Innovation speaker series 2 neighborhoods as well. And then last December we held at color of law Richard. Rostin is a seminal book that he recently wrote about the history of zoning and its impact on hot race-based. It is throughout the country and Seattle is one of them. It was a very informative discussion with on other panelists as well and it's a requirement for stuff to read it as well internally and it is helping us inform our work in times of the again the history of it and then what do we need to do to mitigate that as we were crafting policies as a you know City departments Had the urban Innovation speaker series would continue this year. I'm encouraging Nathan to create one like that if DCI eat soften wings. As I mentioned earlier late last year are renting in Seattle website when live the information the website is available in 13 languages that we also include voter registration information as part of that website, and we have a central phone number and we're getting about $100 a month right now, but I am expecting that as we get the word out that number is going to pick up pretty significantly. Chopper 2018, sdci Focus mostly in internal training on DeSoto rebuild our rsj commitment how we started out by getting about 75% of our executive Home Security advisor and management teams into a more comprehensive implicit bias training. Additionally. We made some revamps to are hiring process. Now, we allow potential candidates to have access to interview questions 15 minutes before would be found is a big help to African said don't speak English as a first language additionally while requiring fewer cover letters for a certain positions on which is also a barrier for Access and then finally out. We're also withholding the names and resumes prior to the start of the interviews for a certain positions, which is also helped us reduce the bias in hiring process. Finally. We also a How do you say central vision showings? We didn't want committee showing back in February with opcd. Then we had for internal staff showings. I think it October 2018. I kind of got the starstuff thinking about the impact of her work. I appreciate in the the range of things that you talking about here in the the specific one about allowing energies to have access to the questions 50 minutes before is something that my office recently. Did someone picked it up from someone else doing this in the city. So and like a lot of things when we focus on you know, how to make sure that everyone has an equal access. It makes the whole process better for everyone so great to hear that and I'm happy to have stolen it from somebody the city of thanks. making design review boards as I mentioned early the design review boards are going through rsji training and especially with all the new board members. Come on Sam over for two at Sam's Department oversees the design commission and the Planning Commission the EDI Advisory Board, and of course, the dawn has dark review boards are all going to that are Cai training. Things like it's like will the Northeast review board go through it together, or is it more there's a city to trainings and there's an expectation that members from these various committees. I think Derek and correct me but I think we have multiple training opportunities and board members go to the one that they're available to go to so you would probably have numbers from north south east and west Seattle going to the same training for example of Civic training sporting commission sent themselves as well. And then we hope you said you've been collaborating with that department of neighborhoods PACE program peoples Academy for Community engagement. And we did kind of a land-use 101 urban planning a settler colonialism training involved graduate students from u-dub Master planning program as part of that training one more piece there that that I didn't mention is that the the real program does allow landlords to hire private inspectors and those private inspectors. Also go through the Arts GI training. Dr. Torkelson jump back up to the bullet that I was going to return to taking care of stuff. What is the split that we're staying right now on the radio program between landlord is using private inspectors versus yours. I don't know if I'll get that information to you. Sun turns over by your work for cycling we had RCL Youth Employment Program as we have in years past I'll last year we had four people join us. It was three young men and one woman of color. They said they spent I think is about a week and a half going to different departments within the city seating within our work groups within our departments using seeing sort of the full scope of work that we do they win with the inspection team review teams. I'm the one of the communications team and then at the end of that they did produce a video Capstone project which allowed them to get some video editing skills as well. Additionally we expanded we also expanded the job shadowing program for fcci employees are this allows employees to sit with subject matter experts for about to go up to eight hours a piece and kind of see the sorts of jobs. They'd like to in the ensign. So both of our departments are engaged in racial Equity toolkits, but opcd nscc. I are going to highlight one of those tool kits in the next lights. So we're undertaking a pretty comprehensive Communications plan with an RCI filter and we are providing train training for work groups that don't necessarily interact with people of color were talking to historically underrepresented populations to figure out how they can better access our department providing more materials in different languages, you know in 2017 and 2018 that we did have some unfortunate circumstances where some of our inspectors went out into the fields and there were immigrant Refugee groups who thought our employees were from the ins. So we made up cards and different languages to give to those populations going nowhere from the city of Seattle. We're here to help you with tendon issues. So we experienced those types of issues when we're out in the field. And similarly with lpcd this year and actually started last year would be focusing on three racial toolkit areas one in Chinatown International District in collaboration with OCR and Department of neighborhoods as part of the st3, scoping and planning work and then imagine greater downtown as I mentioned earlier. We also using ret for that project. You go to the next line. So I imagine greater downtown as I mentioned that can talk about the specifics, but this is We haven't we been focusing a lot about the public Crown in the downtown and how it is used in for that. So the equity outcomes are an important components and Outreach and engagement. We've heard a lot of responses from multiple groups who felt what their needs are in terms of for them to be comfortable and coming to to downtown so that we could take that into consideration as part of her to the policy recommendations. All right for fcci the main thing. We're looking at 4 to 19 is to initiate the staff training plan that we had developed in 2017 and had approved for executive team in 2018. I'll just focus on our team members just making sure that we get more training and implicit bias things like that. Additionally we look to increase the amount of required rsj courses for all staff. We are planning on rolling out on Equity Innovation Workshop, which is basically What group workshops to look at rsj issues on a smaller scale than would require a race and Equity toolkit? And finally are we looking at updating our combined change team charter Teraflex scope of the work they were trying to do now as well as better to find the commitments from staff that we require. Or BCD side strengthening our work practices and team building. I think putting our our work to our plan and planning our work putting everything into practice is important to continue to support are in indigenous in turn and then we hope to take a field trip to the Wing lyrics redlining exhibit. So we're looking forward to that. Concludes our update. Thank you and thank you for providing an update on very important work. And thank you my colleagues for being great allies in this work. I can just I really I appreciate how you started off with the how we design our city has a huge impact on how we design the city over. The last hundred years has a huge impact on who benefits and who continues to struggle in the city and I really appreciate the recognition of the importance of the work that you and your teams do on a day-in day-out basis host of things that your department cover but it's critically important working is great to see it's great to see the commitment to the thank you for your leadership as well on this is just This concludes our May 1st 2019 meeting at the planning land-use and zoning committee as a reminder. Our next meeting will be on May 15th 2019 star in at 9:30 and here in council chambers. Thank you all for attending we are adjourned.", "end_time": 6994.5}]}