{"format": "raw", "annotations": [], "confidence": 0.9416660002605644, "data": [{"start_time": 0, "text": "Good morning. Today is Thursday, March 21st, 2019 the housing Health Energy and workers rights committee will come to order. My name is Teresa Mosqueda chair of the committee. We did hear from our vice chair Debora Juarez that she is on her way battling traffic somebody to do something about that. We're working on it perfect timing on her way. So she let us know. Thank you for joining us items on the agenda. There are appointments to the domestic workers Standards Board. There are my appointments for the Seattle City Light review panel initiative 124. Is that going to be any policy action today? But we wanted to T up sort of a baseline understanding of the initiative that had passed previously and sort of where we're at. Now and then there's going to be a resolution on the Skagit environmental endowment commission. And that's our full agenda for today. We're going to get started with comments and ask for usually we have Alex Zimmerman with us Alex. Welcome to the microphone. You have two minutes, please and please keep your comments focus on today's agenda. Ezekiel my lovely sweet today to people for City Light commission member something like spaceships appointment CT Light review panel meeting. So I think I'm in every two minutes. What is making absolutely unique is exactly what is the wind speed is about confusion about his car because it's critical first hundred people. Most people from City Light is approximately $300,000 since my calculations, so they probably even though it's only from one department and I talked about this for many times. Can you try coming more than 2,000 time? I thought guys we spend approximately bathroom coasters every year on the loose of celery is very important. Number one number two is a good You posed to become are very much meeting with every Department in every day that the first to be City. Listen to see people guys. I'm sorry. We pay you two hundred $350,000. Salary management. Is this management? Like all business civilized businesses? What is not in Seattle government can sit you can listen to people to new ID. So right now bring my two new idea. Is this Idea Quest a million and billion dollars. Thank you, Alex. The next person to speak is dumb. I'm really sorry if I mispronounce your name. Thank you for joining us. And that's all the folks. I have signed up after this. If you are here to testify at public comment, please feel free to sign ups you sound like you but I love that poem testimonial in the same moment though almond Mesquita and Hosmer Bagshaw and any other council members who are going to arrive eminently. My name is chai Sai dham. She with this hotel Nexus located in District 5 in the Northgate neighborhood, and I'm also a member of mere directions small business advisory Council, but this morning I'm testifying on behalf of the Seattle hotel association in connection with the proposed discussion or update of The hotel employees health and safety initiative, which I understand that. This committee will be considering going forward. I just want to express that Seattle hotels are very concerned and committed to the Health and Welfare of our employees including ensuring that each employee has faced in the workplace and specifically we actively support providing Panic buttons to our employees and that's just one important component to our commitment to employee safety but also includes policies procedures and trainings and we are committed to preventing sexual harassment and assault in the workplace. And asked we would like to request as the committee and the city council discuss the hotel employees health and safety initiative. We look forward to being at the table especially to help address the unintended consequences in various provisions of the law in order to ensure that the outcomes further the intentions of the law and the best interest of the employees. So we look forward to being part of the solution. Thank you very much for your time. Thank you. Say I love really nice to meet you and I look forward to seeing you at the next small business advisory committee meeting anybody else in this moment. Oh, okay. Well that will close our public testimony for this morning. Thank you very much for that at this point. We're going to move to the first sign of my business and that will be the domestic workers Standards Board appointment Aaron house. Welcome to the clerking for us for the first time in the her committee excited to have you I could you please read into the items on the agenda items one through four. Agenda items one through four appointments of Sylvia Gonzalez Teresa Hillis Elizabeth hunter-keller and Lani Todd as members of the domestic workers Standards Board for a briefing and discussion. Wonderful. Could we please be joined at the table by Karina bowl and Janine Jan? From Office of labor standards will also have Antonio roof and who will be doing interpretation for us for one of our appointees. If you could join us as well to get us as bad as and also invite up the appointees Sylvia Gonzalez that I said Hills Elizabeth hunter-keller and Lonnie Todd cemetery on domestic workers Standards Board in La Mesa. So thank you so much all for joining us as great to see so many faces again as we're coming together to talk about the domestic workers standards and to all of you were heavily involved in helping to craft the domestic workers Standards Board. I'm sorry the domestic workers legislation which included the standard bore sighted to see the mayor of send your names down for appointment. And before we go around if you guys could introduce yourself for the record that be great and let's start here with money. The record Lonnie Todd. Thank you. I'm Elizabeth hunter-keller high on Karina balanda policy manager at the office of labor standards Times-Union Jan from the office of labor standards. Marsalis from Casa Latina domestic worker. I'm Antonio Roofing and interpreting for Syria and the council in shorter than turn it over to Janae who is Ben working extraordinary Li hard on bringing this all together simply. I'll say that we're very excited and that we are officially launching of the board in the public process within the next couple of weeks and Janae can provide more detail on that. Yes, sir. We are very excited to have the last four members here before you we will be if everything goes smoothly. We will have our first meeting on Monday. If anything changes, of course, we'll reschedule our room. We can process for the domestic workers ordinance will start the first week of April. So we'll have the final schedule out hopefully within the next several business days. So look out for the RCP. If you're interested in participating in that please do contact us and back to you. The reason why we're here is to greet these wonderful folks and I'll head back to you. Wonderful. Thank you. I'm I think we'll go in the order that we had folks introduced himself my old friend and good friend. She's from District legislative and public policy director at SEIU had the opportunity to work with her on a number of labor standards related policies and Healthcare policies over the years. I'm excited about your name coming down. I know that you have personal experiences was also needing childcare. Thailand so looking forward to having that experience on the council are on the board. Would you like to talk a little bit about what is motivating you to want to participate in the domestic workers Standards Board course, it's good to see you again too. Very excited. I think the things that yes as a parent with a toddler dealing with childcare in the area. I also turned back on and child care policy for the previous position and in the current position spend a lot of time thing is working on long-term care issues and and home care and granted we the members I represent are in the Medicaid Ramen have a certain different Dynamic a lot of the issues that we're seeing their pertain to workers here in the In-Home Care world and some of the issues. I'm very excited about working out on the board other than the current mandate is thinking about responses to discrimination and sexual harassment and how we can address them up those as well as making sure that The job people signed up for is the job for us to do when they get their thank you. If it's okay with it. I see here that you are also an employer of domestic workers as a housekeeper in a nanny you work at u-dub in the school of nursing my passion want to be Public Health Advocate full-time job, and I wanted to ensure dignity and respect in the workplace are some of the things that we heard from your previous application has little bit more about what's interesting to you about serving on this board actually, so I'm not working right now because I have an 8 week old baby and believe it or not. We were not meant to care for our youngest alone or at least with one other person. And so that's why I feel very strongly about domestic workers. I employ both a nanny and a housekeeper. They're like family and the The opportunity I see on this board is to provide better for them and to help other women understand like me that they are employers and that they have a responsibility of the people that they employ things like portable benefits making sure that they're only there to do the job and they're paid for whatever they're doing lots of stories about domestic workers that end up doing a lot more than what they're paid for. Plus I think of these women like they're my family and I would want to take care of them as I would my own thank you. Thank you very much and Teresa Hills from District to I believe thank you for your ongoing work with us to help dig into the policy details as we crafted this policy, especially from the employer prospective member of moms Rising understand looking forward to hearing more about what you're interested in doing all this for absolutely. Thank you for having me. I was a part of the stakeholders group that helps cross the the ordinance last spring and was really thrilled to be a part of that and excited. Potentially join as a member of the board. I am a working mom of two children. So I have a 5 1/2 year old and a two-and-a-half-year-old at home and or the past almost six years, we've employed several part-time nanny is and numerous babysitters. We currently have an au pair living with us Isabella who's from Brazil and I also employee part-time housekeeper who I met through Casa Latina Maria Duarte, and I'm I I really believe that people like Maria and our Nanny's deserve to have access to many benefits that they currently don't have access to and especially freedom from Verizon network access to a living wage and access to benefits like sick leave and retirement. And so that's what motivates me to be here. I look forward to working alongside others to address the challenge of reaching over thirty thousand households in Seattle and I do believe that many if not, most of them cared deeply about those who work in the Holmes and just a matter of a sort of rolling this out and making sure that people are able to access the information. They need to help out those that are working in their homes. Thank you very much. Is Sylvia Bienvenidos and Sylvia? Thank you so much for your help and assistance in last year throughout the year as we crafted the policy for workers since 2003 and I supposed to see his companions kiss tonight. Muchos song problemente victimas tambien I afford calculator Los trabajadores what? I don't know what I'd be finding that time. She was a victim of wage theft and and she she feels that a lot of her colleagues were present here today as well. I probably have experienced. I wish that unfortunately not on employers are as good as Liz and and some of the other people who are here present ideas of Cinco puntos en una Carta de derechos in Ocala most Mass employment and resource cuatro puntos principalis. She's looking forward to having the same endpoint five main points of the workers rights implemented at least four four four most important ones and a number of other important points as well. As Los cocineros is an employee Roseanne is Two Amigo's area. Mucho La Casa. Latina is on hardynet assistant that is ours is inclusion my size. Carter by the yard work or landscape workers as well as cooks and other people to do similar work to also be covered by this kind of legislation and regulations say is I'm here or on my behalf. And especially there's Gracias, thank you so much. I'm very very good. You guys are all very impressive. I want to come and sit on this board with you as you talk through the policy details and implementation strategies Outreach and education is going to be really critical. So one thing I just want a flag for folks and I think this is something we should be really proud of when I was in DC last week. I had the chance to meet with congresswoman. Jayapal who is co-sponsoring the National Domestic workers Bill of Rights and the with the folks from the National Domestic workers Alliance who had told us they're really taking our legislation and they are putting it into federal policy and they're going to do things that we weren't able to do. Hopefully related to unemployment insurance Health Care retirement and some paid leave policies. These are released items that I think at the state level. We'd love to see but at the federal level can do it great and you guys are going to help us figure out if there is a city level solution as well. So I'm just in Credibly proud that this work has not only inspired other cities, but hopefully will be applied at our national level. I do want to let folks know that we are not going to vote today. What we would be doing instead of voting on March 25th. I'm just because of the timing of the introduction referral calendar, but we want to make sure the all of your questions get answered here today. So that as we go into Monday, we still fully confident express our support for the candidates and open it up to our colleagues to ask questions. I would like to start with some of those of you who are working on child care and what you see that the city can do to maybe help support financially families that are hiring domestic workers the city and the state clearly. My my experience is now at 12 years old in this field, but I had my dad who is living with us. We hire domestic help to come in and we paid I think it even at that. I'm about $20 an hour. We were fortunate because we were able to do that. But I know a lot of other families that's a giant stretch. And in addition to the the hourly pay we were I'm paying I think it was unemployment tax and then to the Department of Labor for another requirement and it was pretty amazing how difficult it was even for people that are two lawyers in the family to figure out what is what you have to pay. What is it you have to record. Who do you pay and when so I'd like to hear a little bit more about your thinking in the childcare Arena and then as a global bored, what can we do to simplify that so people actually have a checklist of what they're going to be required to pay and then are there ways that we can find some supplemental help. I know that I'm not an expert in this at all. I mean, I think it's part of the challenge that we're going to face has many people in the home don't even consider themselves employers and who have somebody working, you know, 10 or 12 hours a week or a housekeeper coming in two days a month and but I agree with you my my friends and colleagues and I are facing the challenge right now of trying to figure out how to afford childcare in this current atmosphere and that's part of the reason that I have in a pair of living with us right now and we adore having her there but the biggest reason we chose it because it was the most economical solution for us and also It Was Made Easy by an agency who is spelled out every detail of how we go through the process of it and that could be an example for us of how we could utilize some of the ways that those morph Childcare Rena's that have taken place on the federal level have rolled out something that simple for people to participate in but I think it is certainly going to be a challenge for us and one that I'm excited to take on when you have thirty thousand individual households who are all sort of doing something different. It does take a lot of work to bring together something that would be simple enough and easy enough for them to utilize and also compelling for people to to want to participate in and and voluntarily join on so that we can sort of have a wave by think there's there's ways to do that. There's a lot of online communities right now that people are very active in. I don't know if the two of you are not participate in any of them, but it's a way that people find childcare it's a way that people I'm sure that they're interested in participating in the system and an I think there are ways to utilize some of that to to be able to roll this out effectively. I'm happy to speak in a more Universal level that I think the care World whether its long-term care world or the child care world have come from a certain amount of systemic discrimination based on the fact that it's women doing the work and that for the last 50 years women have been willing to do the work regardless of pay because of the discriminatory nature of the system. And so what we had is a system where you have the workers not being able to make do and you have the actual consumers not being able to pay for it is because we've treated what is potentially a government utility school as a private market end today and funded it accordingly. And so I think that there's a lot we can do at the city level but I do think we have to recognize that the care world is a utility in something that goes along with a strong community and start investing in it at the state and federal levels adequately. So I'd love to talk to you more when is things that can swim with Kate and I are working on of course is trying to get a childcare facility here in City Hall. So we would love to have your expertise advising us on what you've learned what you know, what what requirements are we know there's requirements are changing but I think Lonnie we have reached out to SEIU. We're trying to schedule some time and I hope you'll participate in the SEIU 925. I'm happy to be a liaison in that chair. So this is a nine-member board and we we have filled eight already. We love for mayoral for City Council in the board itself will pick one day all women. I was just writing that down speaker as well. Is Elijah I think it's a point well taken because as we talked about undoing institutional racism or sexism we often also talked about how those who oppress should not be the responsible ones for making the corrections and always speaking up. We also talked about making sure that those who've been directly affected by policy or an action should be at the table to create those policy solutions to get raising a really important point. We want to have those who have the most knowledge and lived experience at the table, which I think is what you all represent and I also think that it's critical that we don't just assume that you know, if this is one additional thing that we can expect our friends to pick up because they've already also said they've got three or four full time jobs Grapevine the other point I wanted to raise with I'm looking forward to working with you folks is kasimir badshah and I brought up one issue. I'm more interested in the more I mistrust and all the issues, but one thing I'm going to be Looking forward to your for your guidance is going to be on the worker retention worker safety wage theft and in some of the questions that we raised and we're putting the committee together that we are actually going to be punting a lot of stuff to you folks because we weren't we just weren't we don't do what you do? And so I understand the childcare piece, but I'm also really going to drill down on the domestic workers and workers with an hotels. I'm really concerned about that and recent legislation and recent court hearings in court opinions, and I really want this to be a collaborative effort will we work with industry and we were with you folks on how we address that so we actually passed legislation that withstands legal scrutiny and not only first and foremost protects our workers the second of all our respects and promotes the business itself, cuz I'm interested in hearing all sides and having something that actually is good law. That's fair and Equitable has two Process and like I said with Stan's not only legal scrutiny, but where we can be again. Seattle can be again Cutting Edge and actually passing a law. That's right. And that's what I want to do. It's it's a little bit tiring when we sometimes pass laws and that's our job, but when we get another opportunity as we would say another bite at the Apple, I want to do it right so that's what I'm looking forward to. Also add that working together is important on that and because I know a lot of the housekeepers at work in our homes also work in hotels. It's kind of like you notes on the days that they're not at our homes. They're at hotels. There's some overlap and you just mentioning that again just brings up that overlap. That's something I would not have thought of right away. I was more focused on, you know hotels, but you're right they are they working home today working in the senior centers. They work in facilities that have children group homes. And so, you know, those are the kind of categories that we're going to be looking for your expertise and how we craft this new this new law that we hope to take another run at Gracias por Traer ese punto a la mesa. No tiene Casa de proteccion annoying witches protecciones para Nosotros, Los productos quimicos. No sin Tanto Tanto external, internal Santos SPC. Thank you for bringing. This important question is pointing out that at the federal level does not. Really cover domestic workers and their emphasis has been historically and construction work and domestic workers are routinely exposed to dangerous chemical products that have an impact negative impact on health. So she would like to see how this agency focuses more and any more generally that legislation focuses more on domestic worker safety and the natural to extend to landscape workers who are equally exposed to dangerous chemicals in my colleagues. Thank you so much. Thanks for bringing that point up. It'll tie in nicely to item later on our agenda as well as we think specifically about industry standards in for hotels. I love that you brought up as well that the individuals were talking about are also in a maybe supplementing income because we still have a lot to do to raise the wages in senior centers and hotels and things like that. So Tanner Fox having good living wage job. We want the work as domestic work to be full-time work. That's a good living wage as well. And I think that your example of dope are that's definitely full-time work. So, thank you so much for your interest in serving on this committee for your password to make this bill possible and while we're not taking a formal vote today. Your names are going to be on the agenda on Monday the 25th at 2 p.m. We'll go take a final vote there, and it sounds like you have a meeting coming up on Monday if you could also transmitted to us, if we haven't yet seen it the full list of when the committee meetings are coming up. Maybe we'd like to come in and check in with folks and say hello and just thank you again for your work. So with that no good asking for something simple reciprocity and thank you so much for your time, and we will talk about you on Monday. Thank you all so let's move into our second item of business agenda items 5 and 6 and we will get started with our Seattle City Light review panel. Agenda items five and six appointments of Mikel Hansen and Chris mefford as members of the City Light review panel for briefing in discussion. Thank you so much, City Light Liam, and anybody else coming up? Thank you so much for joining us as we understand that the two City Light of Mine check this out. Show Fighters well done Seattle City Light. Thank you. And I should know it says build Fighters for our viewing audience at home, especially in the Seattle freeze to keep the lights on and turn the lights back on for folks in council member of the committee of unfortunate events on Friday. We're going to have a report back as well on the response during the the the storm plural cuz they lasted for more than 2 weeks going to want to just I like that. It's not just the folks who are doing the navigation work, but it was also your incredible team that was out there. So thank you for bringing these hats. I know you all got the outage report because council member bags I responded on that and I think we had some conversation about it. But anyway, if you ride that you saw that it was kind of extraordinary the number of amendments that were at Excluded in calculating the outage information because of the storm. So very and that it happened over a number of days. So it wasn't just a one and done deal. It was 3 days, I think so. Anyway. Justin. Thank you for that. I know right? I got to. We have you guys introduce yourself for the record and then we'll go and get started in Gas City Light Debra Smith, Seattle City Light, excellent and so today to long-awaited appointments and I know you're waiting for one more from us. We want to make sure that our volunteers at the City Light review board get a chance. Sorry review panel get a chance to have a full team. And today we're talking about Miguel. Michael Hance My Hands Chris mefford and Chris mefford both from district 6 and since they are not able to make it today we do. We usually like to have our first time appointees be present. However, given that these positions have been vacant for a while and you guys highly recommended them a little bit more from your perspective on their qualifications and we will take your word as as their word is that they were here and look forward to hearing more about their activities and they weren't they had pre-planned business trip self. But I do have they each submitted a letter of interest to participate on the panel and I have excerpts from those letters that I can share with you and those have been shared with your staff of Chris mefford is a nominee for position one, which is the economist position. Chris is an independent partner and economic development two cities counties governments and businesses as a consultant who serves all clients with economic and fiscal impact analysis facilitation and strategic planning leadership for communities and economic development. Over the course of his nearly 25-year career in Seattle his work with elected officials and leaders to some of the Region's most transformative businesses. He strives to provide an objective transparent and balanced Viewpoint that Services the Region's economic social and environmental needs and interest. He's committed to bringing the same critical and support of considerations to support decision-making for Seattle City Light and the Region's energy resources. Chris thank you. Michael. Hansen is an omni for position 5 which is our commercial customer representative. Mike is the Chief Operating Officer for sabey corporation, which is a longtime Puget Sound family owned and operated business with a long history of community engagement. Sebi has a wide range of businesses in the Seattle City Light Church service territory, including the development and operation of data centers medical office spaces warehouses in general office space in his role. Mike manages more than 4 million square feet of commercial and data center properties primarily of those properties are primarily in our franchise City territory of Tukwila. Over his past 15 plus years. Mike has been actively involved with City Light with our management and has participated in numerous strategic planning and rate design sessions. Mike is looking forward to using his background and interest in City Light to be a productive engaged engaged participant in fulfilling the review panel's mission on think you both of these individuals are confirmed on Monday the 25th of March. I'm will they be able to join the review panel right away to our next meeting which is the 6th grade questions have only one comment. I don't know mr. Hanson, but I have worked with Chris mefford for many years and he is an excellent candidate and delighted that he's willing to do this. His involvement has been with us and Regional Council for years and I'm most impressed that he's willing to do this. So I don't know Chris, but I know Mike and he's a Great guy. And so I think he'll do I think they'll both be from what I understand. I think they'll both be great contributors to the growth. Last thing I want to say is thank you. I understand that. The review panel has been intense work from last year 6 months to 8 months, especially but it does sound like you guys are on track to submit the April 1st report, which is in just about 10 days. So thank you for that any other comments on the wharf that's coming up next to the review panel. Once that peace has completed already overlapping for instance and we did have a meeting some of us met yesterday. We're working on a pilot project for working with the energy project to 2 to look at a map of potential pilot for The Limited income underserved population. And so we're already really working on the next piece which has the Strategic initiative around rate to sign and what kinds Pilots we could experiment with between now and then and so I think partnering with folks in the community who've had a lot of success than they've looked at models that are already in place with a Vista and others were looking at a high percentage of income program so apep. Anyway, I think it's exciting and we're going to be putting together a group for that piece that will include stakeholders and and community members so that we can make sure we designed something that's really responsive to that community. So yeah, I would just say we're already moving ahead on the next piece and so excited to get the policy peace and play so that we can go. I had excellent well, and then I said that Mr. Hansen and Mr. Medford for serving on this panel, and we will be following up with one more additional appointment for you to complete the review panel. Vote formally today, but you can rest assure that these names will be consideration. Everybody was working in the snow lovely. She had some appreciation for our cruise one at the South Service Center in one of the North Service Center. And so they got hats nice. It was really nice and burritos delicious. Thank you so much for 7 and set the agenda and thank you so much Dan for joining us at the table. Then Helder has well for the committee staff if you fart after the committee members if you haven't yet had a chance to look at it and for the viewing audience for putting it on the screen for you as well, please and status of initiative 124 related to protections of hotel workers for breathing in discussion. Turn on this there's a lot of interest in this discussion many of us are well aware, but I just want to reiterate for the viewing public that in 2016 the Seattle voters overwhelmingly overwhelmingly passed initiative 124 by 77% this extended on the job protections for hotel workers, but it isn't exactly widely known that the protections included that were included initiative 124 are not currently in effect due to Legal challenges. This leaves a really vulnerable population that was similar to the population. We talked about this morning out without these protections for right now. So I'm really interested in engaging with this full Council and specifically through this committee and number of our colleagues good for example, councilmember Gonzalez and councilmember her both are also very interested in this topic who may be joining us for future discussions interested in making sure that we have a Cooperative conversation engagement with the mayor's office with council member. Colleagues with the folks that you heard from the hotel industry. And with Hotel worker is to evaluate what it will take to put in into place Common Sense protections that 124 had envisioned and I think this approach is consistent with the clear intent of Seattle's voters. The first step is for the committee's to have a baseline understanding of what initiative 124 includes what the current status is of the pending legal challenges and we've really appreciated working with Dan in the past. Thank you for providing us with this comprehensive memo to walk us through the initiative and an upcoming meetings. I just want to fly for our Council colleagues. We expect to dive into deeper discussions about policy details and potentially what the city could do can do and we'll do with partnership with folks in the community to address the current situation. So today. I was just a baseline understanding I will probably repeat some of these Baseline understandings going forward for our Council colleagues who couldn't be here with us today, but seems like a great opportunity to sort of level the playing field and set the stage for Mascoutah council members as the chair mentioned initiative 124 provided protections for Seattle's hotel workers. I'm going to spend a few minutes walking through essential staff memo that is attached to your agenda. The memo describes the current status of the initiative and it also summarizes the initiatives key provisions. So person terms of current status and Hyde summary level the initiative was approved as the chair mentioned by Seattle voters on November 6th 2016, but it is currently not in effect. The city attorney's office is defending the initiative in both state and the federal court system at the state level in association of Hotel owners challenge the validity of the initiative on multiple grounds in County Superior Court initially sided with a city, but subsequently the court of appeal agreed with Hotel owners that the initiative violated the requirement that a valid initiative may only address one subject. The city has filed a petition for review that is currently pending at the state supreme court, but in the meantime, the law is not an effect. At the federal level there's a separate Federal District Court challenge that is currently on hold pending a decision at the state supreme court about whether review the case and if so what the ruling will be if the Supreme Court doesn't take up a case where takes up the case and determines sides with the court of appeal a ruling than the initiative is effectively invalidated and there's no need for the federal court case to proceed La department, but I know that we're all very we're of multiple subjects in an initiative. So what what did the court the appeals court find was a problem cuz I thought it was one subject domestic workers and I'm sorry the hotel workers and making sure that they were protected Ford has the most receptive. I'm not I'm not really in the bed. Position to give you the summary of the the lawsuit specifics, but you know any any initiative is necessarily going to have more than literally one section that deals with their definitions and there is enforcement of the main Provisions. Then there are the substantiv parts and the court of appeals made a decision that the substantiv parts exceeded the scope of the single-subject rule. I can't tell you chapter and verse about why they came to that conclusion, but it is the subject of a pending petition for a supreme court review and we hope that that decision will be overturned. I was going to add that counts are backshots. I had an opportunity to read the court of appeals decision and the city's brief to the Washington state supreme court. So you're right. It is much more sophisticated. I learned more than I need to know about the one subject Rule and log-rolling and writing but it did take apart all seven parts and I think some of the most Troublesome part was probably part 1 on the hotel guest registry and due process issues. But all that aside I did have a chance to read the city attorney's brief to the Washington state supreme court and of course they are going to be paved appealing this but the reason why I'm saying all this is not because I want to show that I'm smart but not together is because I really am interested just like councilmember skating customer Gonzalez is that this issue has been now in three different courtrooms since 2016, so It is been reviewed. It's been they got past it went to State Superior Court and went to court of appeals. It went to watch the state supreme court then went back to the court of appeals. And so when you look at the two opinion just for this is just my opinion. I think that there's a way that we can really craft a phenomenal law that addresses the deficiencies that were called out in the court of appeals that addresses and highlights some of the great arguments at the city made and I that's why I think it's more than just a lesser Dave, It's the law and it's good when you read a court case, I think the court of appeals cases only like 20 Pages or something. But my point is they're very systematic and taken apart all sections, but also talking about why all seven Parts don't necessarily work together that whether I agree with that that's a different issue, but the city's brief is very straightforward as well and addresses those issues. So there is a way R Us to remedy the single subject rule, I think there is a way to discuss the other six parts and work with our domestic workers and the people that were the table here today and what the chairwoman and also to have our industry Folks at the table having the hotel people there to explain to us how they can have a safe button how they can work with chemicals how the industry actually works on the floor with a 5000 square feet. All of those issues. We can solve if we just sit around the table and work through them. So that's what I'm hoping we can thank you so much, Star Wars and thank you for your research as well. And the memo that you provided. I know that the end you have about a ten-minute window sheer. So I'm going to ask that you go ahead and unlock Aster your memo and I also want to flag for the committee. We have talked to the legal team in La Dept who are happy to come eat with us. And I think will be scheduling something for our committee has. But thank you for that and then go ahead and walk us through the details here parts of the agenda of the legislation initiative all of the provisions of the initiative apply to workers in hotels with more than 60 guest rooms. There are a lot some Provisions that apply only to so-called large hotels and those are defined as hotels that have a hundred or more than a hundred guestrooms show part 1 a protects Hotel employees from being attacked while working alone in guest rooms as a council member mentioned that one of the provisions has to do with panic buttons. So safe safe buttons hotels required to provide each worker who enters a guest room. Unaccompanied are with a so-called panic button allowing the employee to alert other staff when they need immediate aid hotels are also required to post signs and gas trimmers alerting gas that employees are equipped with the soapies a panic buttons. This part also includes a provision that I described as a list of accused guests hotels are required to maintain a list of all gas who have been accused of any act of violence against an employee of the hotel within a 5-year. Hotels must ban gas from the hotel for three years from the date of any allegation of assault sexual assault or sexual harassment that is accompanied either by a sworn statement or corroborating evidence during the fourth and fifty years after the initial allegation hotels are no longer required to ban a guest who remains on the list but hotels are required to alert employees who are assigned to work alone in such a guest's room. There are some circumstances in which I guess maybe accused of an act of violence but not be immediately required to check out of the hotel in such a Circumstance the hotel must either. I'm sorry at the hotel must reassign the employee who made the accusation to work on another floor or if there isn't another floor in the hotel and another area. For the duration of the accused guest stay. And the last provision in this part is a paid time off in the event that a hotel worker reports and act of violence the hotel must pay that employee at the employee's regular rate of pay for the time spent filing a police report and Consulting with a counselor of the employees choosing the second part protects workers from on-the-job injuries. The initiative requires hotels to use reasonable safety practices and to control chemical hazards the initiative also limits how large hotel is again. These are hotels with more than 100 guest rooms how these large hotels can assign housekeeping work specifically. No housekeeper can be required to clean more than 5000 square feet during a single 8-hour shift large hotels must pay time-and-a-half for the entire shift in the event that a hotel housekeeper voluntarily accept an assignment of more than 5000 square feet during a single shift. Part 3 is intended to improve access to Affordable Healthcare today. What I'm really interested in is is it possible and from an economic standpoint as well to assign two workers per room. So there's a 5000 limitation square feet to clean during an 8-hour shift. I mean any of us who clean houses know that two people can make a bed way faster than one person can make a bed on the same thing is true. If you split up the work, what do you know? We were we working really hard for like our firefighters as an example to make sure that they have multiple people doing whatever they need to do to respond. I would really like to see some sort of an economic analysis about why you couldn't and shouldn't have two people going into a room particularly if there's someone there you know that I have not seen studies on this I would really be interested in it. I know that that's something that was explored during rulemaking. So the office of labor standards issued rules that went into effect July one believed of 2018. Those rules are also on hold pending the outcome of the litigation, but I know that that was one of the things that they grappled with and and the hotel owners have also explored and and shot clarification on what happens if there are more than one house cleaner assigned to a room does that how does the 5000 square feet rule apply to that gets split between the two is it is there no discussion where each person also is assumed to be working on 5,000 sq ft even with assistance. Well for those who have done this work, I will be interested to get more time It just strikes me as something that seems like a simple fix and I'm sure there's economic reasons. Why not but you know, I really question that Okay, again part 3 is about access to Affordable Healthcare. This applies only to the large Hotel employers large Hotel employers are required to provide additional compensation to low-wage workers, which is defined in the initiative as those living in households with incomes below 40. I'm sorry 400% of the federal poverty line. There is a formula for determining the amount of the additional compensation as described in the memo, but I'd summarize it by saying that it's intended to ensure that low-wage workers can afford a gold Level Health Plan. Large large Hotel employers are not required to provide such a digital compensation in the event that they directly provide a qualifying employer-sponsored Health Plan. The focus of question about gold silver platinum and bronze I can help answer those two. too much information about that man part for protects the jobs of workers when Hotel ownership changes Hants the initiative provides that a new hotel owner must offer jobs to the existing workers at the hotel before replacing them with new staff unless the new owner either employees overall fewer workers or discharge has one or more existing employees for cause The last section that I'll address is enforcement the initiative provides Hotel employees with a private right of action to bring suit against their employer in the event that they alleged that there has been an action that is not in keeping with initiative Provisions. This is unlike our or something that is unlike other City labor laws for instance minimum wage secure scheduling and others the city does not have a direct role in enforcing most of the protections of initiative 124 the office of labor standards can investigate and enforce allegations of wage theft under it separate Municipal law, but the city cannot directly enforce instances when a hotel does not live up to other requirements of initiative 124 as an example. If Peyton at the hotel did not provide required Panic buttons, that would be something which the city has the ability to investigate. Not to enforce or take action to rectify. quick question We're still on five. I thought that the city or the state already addressed that hotels cannot ask workers about their citizenship or immigration status. I thought we thought was that with Motel 6 or hotel a Toro they're called when they were doing that. I thought we address it on the state level. I'm not aware of that but we will down a southern you cannot but some of the stuff is is solid and we can find it in state law. I think the issue on this single issue rule is where it got hung up in the hotel registry, but some of these standing alone or good law. It's the combination of all seven that hurt us. Not going to say I told you so but I did say so, but I'm going to leave it at that. So did you but I'm just leave it at that parts 5 and 6 and 7 are I would say a series of technical Provisions that have definitions and some miscellaneous Provisions like severability and I'm not going to walk through the details unless there are any questions on those. Thank you. questions about the enforcement in the rulemaking that the labor standards is done the rulemaking that they've done thus far is it only related to their ability to investigate wage theft under this ordinance or is it that they made rules about other parts of the ordinance and if they've made rules about the other parts of the ordinance, I have a little difficulty understanding the legal framework for that because it's my understand the rules are about a department administration and enforcement of of a of a lie, and if they're not Administering or enforcing it. I'm not quite sure why they would need to make rules about it Jhene John's from from the office of labor standards is in the audience. She is willing to come up and answer that question. She can answer it correctly. I think generally rulemaking is intended to provide some clarification of what the city understands to be how to how to apply the law and it is a little bit unusual that we are not in enforcement roll for this particular law, but I still think the rule-makers intended to again clarify how how to apply the the the broad Strokes of of law. Welcome to come and join us. If you have something to add an old do as well for the council's benefit is will print out the ordinance. I'm sorry, the initiative will print out there all the rules that have been created so far will include on the memo from Danny Turner and I will begin a little binder for the entire committee counsel. I should say so only one piece of clarifying information is the the initiative itself granted us through making for the entirety of the organs. So not just throw that we could enforce under which theft Understood what is the purpose of rulemaking about parts of the ordinance that you're neither administering nor enforcing. I just I just have an idea of what rulemaking is about until I'm having a hard time understanding what the function of those rules would be in that instant Sarandon typically, but then mentioned before as it provides Clarity, of course on what the hell that you can see who interpret the law it also provides Court some guidance investigatory Authority we would clarify that as well, even though we weren't allowed enforcement. So thank you. Thank you for following up with us when the courts were going through this and take it apart all seven parts. And I would kind of touched on this like one of the fixes is it in part 6 it states that the ordinance didn't Define sexual assault or sexual harassment. I mean that's an easy fix right? So that would put us back with having the definition. I don't know why it wasn't put in there but I'm guessing you can just I don't know if you have a legal standard that you would pull from the sale code what the definition would be. I'm guessing maybe not but will baby. Well, I should say that I don't know but my point is that said that to me seems like an easy fix even though Dan. Thanks again for bringing up the sections but like on Section 7 that is labeled. Miscellaneous. It does have the severability Clause but it also talks about that employees and protects employees is that they can't waive the issue about employee can't an employer can't make an employee way the issue about maintaining hotels maintain a list of accused guests that that's not waiverable know that to me makes sense that that stands as is so so I guess In this is little bit of my frustration, but it would happen the first time as I just I just felt like we didn't have the industry folks here to kind of guide us and answer some of these some of them just like some accounts or just raised just basic meat and potato questions. You know, how does an industry clean a room? How big is 5000 feet due to people go in just basic stuff because as I was reading this and then reading the brief that this city file to the Washington state supreme court some of the text itself about the law, but just putting that aside just real world. How does it work in the industry? And how do we Taylor a law like we did with scheduling remember when we did secure scheduling it was helpful for me when I met with Subway and Target and Ross and Starbucks as well as as well as the people that we With the law was intended for I didn't I didn't feel that the first time around that we had those type of discussions that we actually I mean I guess for me, I don't know why I can't speak for everybody else. I was always concerned about that registry. I think that there should be something but the way that that got drafted I I knew that that was going to get struck down. I have real concerns about anyone maintain a registry and what somebody doesn't know they're on a list for five years with no due process no standard of criminality and I'm not saying that I was guilty or Innocent, but I had a I had a real issue with that because that's something you could actually pull out and the city attorney's office could work on to have a special class classification for workers in a hotel that it can be a misdemeanor and I just think that there are a lot of issues that we could have done better. And this is why we get another opportunity to do it. So I'm looking forward to working with you folks on those issues. So in part of our packet, we will also include the city's legal brief as well. I'm just want to reiterate we are going to have a chance to go into the policy details and talked about each one of these elements a little bit more and as we've done with domestic workers Standards Board or domestic workers Bill of Rights for example will be bringing in various voices as well as in the little packet were in a crate. I'm did you have any specific comments in response to any of the rulemaking process or anything like that, but you needed to add OK the next steps. What do you see, Okay about the the content. It's about the multiple subjects in the title. Is that correct? I think it's important to In court in the future that the courts have not taken a position on any of the elements of their focus very much on the multiple subjects in the in the title of us for our vacation that that's true. But with what they do talk about which is important is how certain subjects don't they don't compliment each other and how they don't further the intent of the law if they're not all working together that they're disconnected so it weather and I don't it doesn't mean I agree or don't agree but when it talks about this is rational Unity how all seven of these parts are supposed to work together. So in that sense they do touch upon the the the text is substance of the law. My opinion has been they did not say that there were due process issues with the registry they bring that up but it's clear from reading it just has a season lawyer. That's what they're getting at. That's my opinion. And that I think that's been a lawyer for 33 years. I have a little bit of sense of what's going on here in as a former chance of former judge and trial lawyer. So and I'm just trying to offer that experience and wisdom that I don't want to get caught up in. Well, they didn't go to each 7 issues and say all of these were bad and go it right into the substance, but it's pretty clear and is extremely the way the city responded in their brief that did they did. They are talking about them together in a way of that. They are not in this rationale Unity piece. It isn't as sterile as oh you violated the single subject cruel and that's all they stuck to because it was twenty-eight if that were the case, they could have written an opinion and three pages instead of 28. So I'm what you'll see from us what you'll see from us. Is that a full outline of the next meeting that we have scheduled to talk about this topic? We will include that full out line in a memo as a cover sheet to the materials that were going to provide for folks Dan. Your memory will be at the top of that stack because we really appreciate that over you you provided today again, we're going to get it to get a chance to get briefed by the legal team so that we can ask some of these specific questions and our next meeting on April 4th. We will have a chance to hear from some of the folks in the industry. I should say you are working in the industry and then we'll also have more staplers at the table on the May 13th date & More in discussion on June 3rd, so you can expect basically I like we did last year for this to be a reoccurring so that we don't we don't rush any conversations that we really have a chance to understand both the legal analysis after talking to the legal team and then have more conversation round policy today again was intended to be very high-level just Play some level setting there was one individual from the Nexus Host Hotel near District that was here. I hope that we can have some of the hotel managers as well to talk to us so we can have some very direct questions of them. I think that'll disappoint. I think you were going at council member was we need to have everybody at the table so we can begin to look at Solutions and not just make assumptions about what's going to work to be a joint effort between Council and the mayor and just like we have with every opportunity multiple chances for folks to way and then provide feedback and looking forward to working with you to schedule the legal briefing Center my makeup. Anna's going to ask you when you come back to us with more information. Like when I asked about the Wen Motel 6 whatever was asked if he was immigration status we responded can you when you go through that we can talk a little bit more. But when you go to the seven Parts in the dressing what counseling her brought was a good point in some of it is Nuance in those opinions those other six parts where you can say we've done this before and it's been fine or we've got other places and we've been good that kind of thing. I'm not real detailed, but you know what I'm saying? So we have some kind of guidelines about where where we have some room to to say, okay, we're solid on this one, but how do we build on it? That doesn't violate state law, that would be real helpful. Thank you. Thank you both very much. Thank you Dan for your memo. And again, thanks for joining us customer horrible that will get that information out to folks work with the exact as well on timing and make sure that people have the full overview of when we hope to bring this discussion forward memos. Well. So, we do have one more from Seattle City Light for sticking with us here. We are going to join us at the table and Aaron item number 8. Agenda item eight resolution 3187 to a resolution approving the proposed budget framework of the Skagit environmental endowment commission for its fiscal years 2019 through 2023 for preteen discussion and possible vote. Thank you so much. Let's go ahead and have you introduced yourself for the record and then we'll get started. And I'm cute and Golan the science policy manager with Seattle City Light and I'll also the US Secretary for the Skagit environmental endowment commission Smith was Seattle City Light a liter. We have a possible resolution for the committee's consideration today are do you want to get us kicked off here with an overview or did you prefer a late have some introductory comments? Of course, I prefer the city light headed and sick introductory comments because there are the experts and then they live in RI this so I think I will just go and do that. Okay, that sounds good. So sure I'm really just here for moral support in to advance the slide so I know that exactly so I know the cable do an excellent job. So excellent a good morning. So as I mentioned to you, I'm I have two hats on when I sit at this table today. I am the size policy manager at Seattle taillight. I've been with Seattle City Light about three and a half years. US Secretary for the Skagit environmental endowment commission for about six months is very very interesting story behind the commission will get into a little bit of that to give you some sense of context. So is the US Secretary I might point out to you that my main role is to provide administrative support to the Commission in doing their business. So my role is not to develop budget surf approved budgets things like that. Mine is to help support the work of the commission. So today I'm pleased to present this budget framework hard work of the commission and the framework is the allocation of their budget that they approved for the next five years of just about 3 months ago. We launched into the presentation Eric. Did you want to mention it in your memo that you provided for us on March 18th history. Totah week come to be here today five years ago the council did approve of a similar measure for the budget on at the time of that. I just be coming from Decatur from the from see cuz I may say I say that cuz I've heard City Light folks call the Skagit environmental endowment commission seek, is that appropriate and and I'd end in in my run down through that turn the random. I noted that it is consistent with our budgets that I can be cancelled before and are consistent with the mission. So those probably about the highlights. It's a it's a really fascinating topic. It goes back really deep into the history of for City Light it goes back to the What's it like to work on creating? The the Harrah's Dam on the Skagit River controversy that involved? What culture talk to receive it involved whether or not the damn should be taller and what were they mean to the to the lands that would be Upstream of that damn activists in 1970 in a very famous incident paddle the river to pray a lot of attention to it. I noted that date cuz that's the year that I was born. So, there you go. And I'm sweating right so that this is just my way of Sir touching a few the highlights in the memorandum to say that the history is deep the commission's been doing this for quite a while of the initial endowment by British Columbia and the city of Seattle to to the budget for Sika happened in the early 80s is well managed since then and I'm up listen to look at that. You see here that is being the next five years comes out of the proceeds from that endowment with the smallest people in each year from from City Light as well as from my BC Hydro. donut place in 70 I-70 on Hills like 107 that my sister and I were I got a twin. All right, we can go through the presentation. Thank you very much for that over to you as well. So following up on what Eric said. I'm going to be presenting a little bit of a struggle context for this which goes back to the construction of Ross Dam back in 1937 how that leads into the high Rost treaty in agreement a description of how that ties to the commission and to the environmental endowment fun for which this budget framework that you're going to be looking at today is Tide, so that's life. So just to give you a bit of context on the landscape the area that were talking about is up on the BC Washington state border this area here falls under the purview of responsibility the Skagit Bramble endowment commission to ensure the environmental Integrity of this area. What you see up there is this I don't have a pointer bed. You see Diablo and right above Diablo. UCI Orange Line there right about there is where the Ross Dam currently sits above. That is Ross Lake which heading further on up into Canada is the main stem upper Skagit River. I surrounded by Parkland currently and down on the US side. That's also surprised by a lot of Parkland protected areas something that might point out about this area the upper Skagit up in BC. There is one of the primary has four of the threatened. Really threaten bull trout to spawn. It's got the highest density of rainbow trout and bull trout a concentrated spawning up there concentrated in the entire Watershed and regionally, it has the highest densities of bull trout spawning in British, Columbia, Oregon and Washington and that's part of what makes this area very special and protected there also grizzly bears in here that are protected as well as Northern spotted owls and so on. I think that's it for that map. Okay, so historical context. So as I mentioned this ties way back to the construction of the Ross damn it began Construction in 1937 had a 1940. It was completed in the height of the dam was at 1380 feet above sea level the way the dam was designed. You can see on these pictures on the left here. There's some old pictures to give you a sense of how old this is, but also you can see on the bottom left. There's these brackets and lattice work going up the side of the dam here. I'm no damn construction expert but what I can say about this it was designed from the beginning to be stepped up and height over time. So in 1949, the dam was raised up to 16 15 feet above sea level and know that this was above the elevation of the River on the BC side. So there was some flooding of the Skagit River up in 2 BC by about a half a mile. On the right there. That's just you give a sense of the perimeter of Ross Reservoir. It's dry down there, but you can see, the the footprint of it. That's the looks like that. There was there was an update to the the slide deck. So I think that maybe was part of it. I can give you my coffee. If you'd like to tell me a hard copy. Thank you. I'm sorry. We'll make a note as well. If we get updated flight school things also that they have the email in their inbox of PowerPoint. So then a 19-7 city light up plaid to raise the damn once again, but this time to 1725 feet above sea level. This would have flooded an additional five thousand acres into British Columbia and it raised a lot of alarm among British Columbia government and environmental groups in Canada and tribes. Yes. And so after years of controversy, we can flip to the next side in 1984. I'm skipping over a lot of interesting history there to get to the point that in 1984 the high-rise treaty between the US and Canada came to be and the agreement was between Seattle City Light at between the city of Seattle and the BC government. That's tied to that settled the controversy as part of the agreement the establishment of the Skagit environmental endowment fund and the commission to administer this fund and the purposes of this was to ensure the environmental Integrity primarily of that area that I showed you in the map previously. So the Skagit environmental endowment commission as I mentioned it administers is the endowment fund it cuz it's an international commission that consists of eight Commissioners that are appointed by the mayor of Seattle on 8th by the premier of British Columbia commissioner serves a four-year term and they're on a staggered basis and I want you to know so that ate Commissioners appointed by the mayor of Seattle 8 who are the eight. By the city of Seattle. Let's see. We've got Jim Davis, This won't you just give me the names offline on that one. Now. This is been under discussion with the commission as a side point. I mentioned in the last meeting that I was at the first priority. Can we get a list of the eight Commissioners in weather? Terms are yes, I'm just on my way Surfer heir to that the link to the webpage Anderson bio Street to the Commissioners that are not their bios. We just a link. It's a it's in the foot. Just just a footnote about a footnote really scoring points with you today. I can swear I can tell What year were they born? What the reason why I ask is cuz I'm going to get asked so I would just like to know and also is really been important to you and drives have been involved in this but not recognized. So I think that it's something that we all can be mine tonight in the county and the state and everybody else and their brother. So as soon as I just like to know who makes the decisions, so anyway, thank you. Cancel. Thank you share one. So another point that might bring about the commission that is that does not manage land directly, but it works through cooperating agencies government landed management agencies on both sides of the Border. Onyx slime So the endowment fund it's got several main purposes that are listed here. And it's all ran around conservation and protection of the of that area that I mentioned in the Skagit as well as education and supporting recreational purposes as to conserve and protect Wilderness and wildlife habitat and has recreational opportunities acquire mineral and Timber rights consistent with a conservation and recreational purposes conduct studies of needing feasibility and a plan for and construct hiking trails footbridges in interpretive displays Etc. Okay, so the commission organize the budget into four main program specific areas who spends historically it's been organized this way. There's Watershed project to fall onto in Watershed Integrity education Recreation and ecosystem science. And then they are prop cross program goals that aren't tied to a specific progress project that are Triss of the commission to try to integrate indigenous engagement and all projects that they're working on and to work towards getting more diversity and addressing climate change as well, which is recently added. Some next and here are a list of the partners what they call partners that the commission works with the partners are basically the organizations that the commissioned provides funding to and you see a list of them there. There's a combination of us partners and Canada partners with primarily with the government and with a nonprofit organization that they work with. So before you you have the 5-year budget allocation that the commission developed over a laborious strategic planning process this year. I might mention that the commission meet several times a year to administer this phone by reviewing project proposals monitoring contracts and addressing environmental issues in the upper Skagit. The another point is that this fund is managed separately from the city budget. It's not not the city budget the commission's budget framework was approved. But even though it's not the city budget the budget needs to be approved by the province of British Columbia as well as this Seattle City council as such the budget framework has been presented to the council each time has been revised in the past used to a corker annually for Council until 2014 and then it was extended to a 5-year process. How to decrease temp labor intensity of doing it every year so this is the second time we're seeking approval for the budget framework for a 5-year budget. So you have ammo listed where the money goes. So what it what it is you have over a million little more million for Education. What what does that mean? What does that look like education? Education funding is typically used in the decision has historically how they've done it that I've been getting them familiarize within my role but there's funding that goes to like the student Conservation Association North Cascades Institute and a like to support their programs. They also support development of interpretive displays things like that. I think we talked about this last year when you were here about the how the hell this ties in with climate change and the efforts that were were trying to make Statewide dive into that a little bit. So the commission has a program goals that I mentioned is to address climate change. So they've been doing some water quality monitoring water quality including temperature monitoring and the reservoirs. They've also been paying attention to the sedimentation that's going into the area from surrounding areas think those are probably the two primary things. I can think of off the top of my head that they currently fun, but address that Let's see. Where was I and the other cheap points here? So this distribution of funds I might point out closely matches the the percentage distribution that they've had in the past. They tend to do their business in a way that kind of kind of follows a pattern of what they've done in the past that they modify each year and it's worked for them. But the commission also maintains the flexibility to adjust the distribution of these plans throughout the life of the Strategic plan. So the dollar amounts you see there by the by the end of the process will likely shift around at the end of five years how it's been spent based on perhaps lack of performance by a project partner their ability to come up with matching funds or government shutdown the like that could interfere with their ability to execute the work. Also, there's opportunity funds available in here for items that the Commission hadn't anticipated that meet the meet the commission's needs that they want to have an opportunity to go after the water should Integrity contingency fund of a million dollars at the end. There is particularly notable. That's a large contingency. That's a set aside for big items. Like mineral rights act was mission opportunities. For example, if they if they get the opportunity that they have money set aside to do that framework approval door to prove it. What in the past has the water should Integrity contagious and has it been used? I haven't I can't answer that question off the top of my head whether they've actually use that Watershed contingency fund. I haven't been recently picked up this role with the commission. I can't speak to that but I can find out. Okay. So this is just my concern is not knowing where the educational and some of that goes with something where you just rolling over $1000000 every 5 years and I don't know where it's going and we have to prove this and I don't have a lot of information because we have to prove the Sioux Council especially in light of what cuz we were bad. She'll just raised with issues that we get addressed about climate change and all the bills that are pending an Olympian the stuff that were trying to deal with with the budget. I just heard an interesting term this morning on NPR about the water property. So those are the kind of things I'm thinking about. So when I see you this list, I mean, that's fine, but it doesn't tell me It doesn't tell me where everything's going. And when we look at budgets and when we allocate and we approve usually have something that tells us where it's going every time I see a contingency fund. I always ask what when's the last time you used it and so is it always a million dollars that you just roll it over and it would be helpful to know that that information. I'm not trying to put you on the spot. I'm just trying to say is the person has to vote on this a little bit more information would be helpful. How do you spend money? I might point out. So so the commission is responsible for allocating the budget and that they ensure that the budget is the international commission. So they they gathered together at least quarterly to develop plans for how they're going to spend the money. So the money is allocated in this General way at the beginning of the strategic planning process, but then they receive proposals and work with Partners to use these funds and in the manner that Slade out here to support the work of the commission so you won't get Specific projects at this date that tied to these amounts of money. I think I think Floyd council member war is asking and I think we could probably get this and yeah, I think I know who had your roll before cuz you've only been in that. Healthiest. Oh, there's a change which you know, it's only been in this world for 6 months. So but I do think we could probably go back and see if those allegations are consistent with what's been in the past. Did the million dollars. Are there about from the last five year cycle? How was how are those monies used? I think that's really what you're asking. Thank you. And thank you teacher woman Smith only because even if it's just I don't know how but that's just helpful and knowing who the board members are. No one who's making the decisions and then how that aligns with how we are handling environmental and he's Watershed issues at this. Table or what you're looking for. I don't know cuz it doesn't tell me just as we're going to we need four million dollars and we want you to prove it. This is what we've been doing. I have no back story or narrative in which to say education and here's a pie chart worth going to 40% went to you know, climate change or I mean, I don't know so that's my point. So do you think we could get like a put together a pie chart from the five years ago? I mean, it may not be fully complete but that the kind of shows OK based on the amount of the 2014 budget how have those funds been spent roughly? Yes, we can there should have been an annual report that I'm not sure who ends up receiving the annual report. Did Council received that in a report that describes what the budget was spent on the past year. Well, I'll tell you right now we won't read the annual report, but I will look at a pie chart. Yes. It will get you a pie chart together with a list of the the list of the the mayor appointees from the US side to the sea. Was there a third item? I think the pie chart will kind of talk about outcomes because if it's in the same kind of buckets, then does unallocated funds should show in in some War a descriptive way is right is love the history. That's great. But if we're spending this money. What WhatsApp getting improved projects projects, but I don't know if they're used to be six or eight or ten or what it used to be there. If this is an expansion or did you add more? I don't know any of that is that they've had historically and they've had historically maybe there's some of the issues that we would like to see addressed or a new a new that you said bucket or something instead of what we've been using these seven subjects for the last 18 years. Can confirm also so the amount of money that we're talking about here. These are not City dollars. That's correct. OK over approving the budget. Yeah, the treaty provided that beat BC and the city council would would review and approve these projects and Norfolk even though we might not have apples and then we're coming to coming right now with the appointee list. So we should be able to see that just a question on timing for you. If we don't take action today is their time if we had two more weeks to take a look at this if we put this on the agenda for vote on April 4th or next committee meeting. How would that timing workout for? The end of the fiscal year for the commission is the end of this month so that we need approval by the end of the month for partners to begin the work that they need to start with their fiscal year in on April 1st and might be helpful for Kate to to just share some information about how this budget is funded by the by the partners under the treaty. Can you do that? So under the treaty? This isn't the decision that we make every year if this is something that was established in 1984 the the US Side Seattle City Light contributes money into the endowment fund this past year is about $130,000. I believe there's a formula associate with that that I would need some of that to come up here and explain which is walkthrough. 10 11 million dollars in this fund is kept in a bank in Canada and the principal is not tapped into for expenditures towards supporting the work of the commission comes off of the interest gained the fund has done very well has been managed. Well by the bank and were I think we're about 6% interest rate right now on that phone. So this is all interest from that endowment fund that was established in 1984 and then BC and Seattle contributes to as I described each year. This is just hypothetical. I'm not trying to scare you. What if what if we voted? No? We haven't seen that happen since the time the started so I can't explain about the details of what the implications would be to the commission's work. If Seattle stepped out and said no, they would not approve the budget allocation that the commission had them decided upon. You know, I don't know and I think probably what we need to take a look at it. Some of the questions you've asked may be covered and that the agreement itself in the tri-d. So, you know in terms of the discussion that approving bodies have over how funds are distributed or used as well as kind of what happens if the budget isn't approved by March 31. I'm guessing that those are probably the items that are covered in the treaty. So I think Eric would probably need to go back in and take a look at that and we can also provide that information because I'm just not sure so the funding that were actually City Life perspective which you already proved via the City Light budget process was this hundred and $35,000. So it's not end. Well, you would have approved it to your budget. So you would disapprove the two-year version of that. So it's not a significant amount of funds. So this is a it is not I don't believe it's intended by any means to be a rubber stamping exercise, but it's not a funding decision that you're making today because the funding happened separately and it's by the Sea existing long-standing agreement. So why do you need your approval then? It's part of the treaty process. We were talking about it on the way over here and I was saying that when I worked at a tea while there was a weird thing like that that had to do with Trojan nuclear plant in every year the council had to approve a budget and yet they were no physical impacts for the utility and it was always, you know, it was somehow, you know a relic but I think it's worth digging into and understand. What are in a what is the authority that we have to help direct funds particularly as things change? I'm guessing that I'm just making this up but I'm guessing that the authority is in the appointment of the eight people not in the particular. So those eight folks that are appointed by the mayor and I assume comes through this body of I don't know if there's a confirmation. Okay. So the 8th people that are appointed by the mayor are setting the the funding priorities for the Sikh together with RBC counterparts. And so that's that would be my assumption so that I can't remember the title, but it's kind of the same we had the same issue come up and I want to say it's the Clean Air commission something something that the mayor sits on her has an appointee that makes decisions when we are looking at the match. Gas plant in Tacoma on the tide flats and that came up about will who's on the commission will who represents the city of Seattle World who's making the decisions about putting the plant there who's on the board that makes these decisions. Where do we get that money who who decides that so we found all that stuff out and I'm think I'm kind of going down the same Rabbit Hole here, but the other issue is I'm guessing there other cities in municipality is better parties in signatories to this treaty in which you they would have to be seeking the same Municipal approval. No, I don't believe so the the interesting about this treaty is that it's pinned on this idea of the harassed am not going higher so that this I think way back when a negotiating the city of Seattle City Light power and how we going to get there forgive me for I don't mean to sound Flip about any of this Sumptuous was a ton of work, right? And so the idea was that cable BC Hydro power will have it appropriate rate that Consistent your time and then a percentage of that power that City Light will purchase from bchydro that percentage in no more than a certain amount per year will be some of them will be set aside and that's that under $30,000. We talked about this a little bit of money to supplement each year. So I think it's and it sticks this whole thing together are the three parties are involved bchydro. Just a corporation that is answerable to a British Columbia in the city of Seattle City Lights Apartments of city of Seattle and I think the commission is set up just to finish installing, please correct me if I'm being too General the Commission in the fund was set up to say what this is all about the environment right? You didn't raise the damn to preserve the environment. So we ought to have some say in a budget. We have some say in appointing those folks. Screaming is tied to the treaty. It is a piece of the treaty and it is signed by the city of Seattle and the premier of British Columbia. Is that okay? Got that and I noticed she is being a Native American and represent rise for 30 years. I get that what I'm getting then is I guess I'm feeling like the why do we why are we bothering if it doesn't matter? Michigan. Going to do it. Anyway. I don't know what a deadline is 4 because they're going to do it anyway, but it's not required by the treaty that is a budget framework be approved by the BC government and by the Seattle City council. I don't care what the consequences if that's my point right? Nothing's going to happen. The treaties silent well agreement silent on that piece if someone doesn't approve what happened, so that's why I can't answer that question for me here to do is take responsibility for not having anticipated that question cast member and it's so let's let me dig into that work was to be light and we will find a way to answer that question. My guess is that it hasn't happened yet and probably the response to the commission. If the if this counsel said formation, we don't like that whatever it is that they would have to roll up your sleeves and take another crack at it. I think practically speaking the I don't think they would Forge ahead but because it hasn't happened in history there so we can look at and see what it says. Can they do anything is this really isn't it? Did the Treaty of the agreement build in kind of just. Or is there something more meaningful there? And we also answer some of the other questions that you brought up and everybody here. I am sorry that I didn't anticipate those things to help help Propel this conversation forward. I just want to underscore I think I'll remember where is his points are really well taken. I'm you know, for example and we know that it's part of our process here as the committee that has oversight of a Seattle City Light to look at your strategic plan and you're spending plan for five years. We also know that we have the opportunity to ask questions add things to that provide are input and and ideally direction if there's something that we see that looks like it might be missing an element I get that. We're not the full purse string holders on this but given that we do have some element of oversight. It appears it would be helpful to have a better understanding of what responsibilities this body does have in the future. I'd actually don't remember getting briefed on this last year and that's was five years ago, but we don't have an annual you are to be receiving an annual report every year from the commission that better. That are produced by the commission. You probably would like to have a briefing on that other report, but we can take that up later. Okay, that sounds good. I'll be at least the photos that were provided on the link that you provided a nice. Can I guess we're we're we're going to see a glaring Gap in the terms and the type of representation that we would desire to see on such a board. I do think first of all, we should note that sit there appears to be at least one commissioner. That is the weekends on the US side to side as well. I think the council member or where is this point? What we don't see is specifically Native American representation. We don't see communities of color well-represented. It looks like at least on the Canadian side. We see it. Is the few more women actually equal balance between women and men gender balance, but I think that this is something that now that it's been on put on our radar we're going to definitely want to know more about the expiration of the terms are the requirements for these positions and potentially I would suggest working with the mayor's office on this final appointments spot. I want to be on there I would like for you to be on there. I know where they're from. So what what does the committee you desire here? I guess I understand that your physical a year ends on for 1 however, I'm wondering if there's a huge difference between a for 1 and 1/4 for date to dive into the next year's activities. If there isn't a three-day crisis that is created by us waiting. I'm wondering what the committee Desires in terms of these questions, but I think that even when we have those answers to the questions were going to move forward with this and maybe what we could do just to make sure that Seattle City Light can move forward with this that we can move the resolution forward, but with the understanding that we're going to have a want to report back after cure involved in that would that make sense because rather than bringing this up and going through all the elements again next time She said we're not budging additional funds that I would just suggest that we move forward with this today and a lot of questions that we've made clear and we'll come back a grade is alright with you. I'm comfortable with that if my committee callings are and I'm sure that that would make your life easier in the next 10 days here is what a violate international law is everything going to work at Columbia River treaty that we've been trying to reopen with Canada on the power side. Anyway, appreciate your Indulgence and your response questions and look forward to getting more information from you. And I think we'll be following up with executive as well about the final appointment and then the expiring terms but any additional information you have will be great with your approval. Then I moved the committee recommends passage of resolution 31872 on the 2019-2020 3 budget for the Skagit environmental endowment commission selling an easement to Snohomish county. Is that What are this? 20/20 23 22023 I don't think we want to sell any. Let me let me just say that again for the record so that there's not a recommended resolution budget for the Skagit environmental endowment commission. Are there any comments? Doesn't favor recommending passage of 31872 vote on March 25th at 2 p.m. For she ate all your answers to your questions. Amazing Seattle Channel viewing audience to Housing Development anti displacement strategies discussion. I like to call this. Mha We're celebrating this week still if pass on Monday here. We are on Thursday. We're not skipping a beat for saying that was the tip of the iceberg. Now. What do we do? We want more community-oriented development. We want more child care centers in senior centers and Community cultural centers and we want Open Spaces initiative efforts. We want to braid the funding from EDI with office of housing funding so we can create more mixed to use the centers and we also want to make sure that we're creating affordable housing and not displacing folks. So I'm it's a large conversation a larger conversation about the right ingredients. I keep saying the right ingredients to the cake that were trying to bake hear Maj was just one of those 10 protections is just one I'm ensuring that people have a place to go back to you if development is occurring is just one element. We're going to be talking about the community oriented development and getting additional funding to the hands of organizations who are really focused on Affordable housing and housing those who might be at risk of displacement. I'm not only in this conversation, but in the future conversations through the intestines coming up this year and our disposition implementation strategies building off flashers efforts owe the lunch and learn I will have bagels and cream cheese and coffee and all that sounds like a lunch and learn and learn next meeting on April 4th. As I mentioned. We will again have folks talking again about the initiative 124 this today at the folks can come and I'm Sorry by that time. We should have a little binder for you all about what the expected time line is and Bar Council colleagues as well. Thanks again to councilmember herbold for joining us in council member Gonzalez for her interest in this and I working with our office on timelines and next steps. So we expect to have a full committee. Yes committee has adjourned.", "end_time": 6577.2}]}