{"format": "raw", "annotations": [], "confidence": 0.9373397275875431, "data": [{"start_time": 0, "text": "Good afternoon, everybody. Welcome to the same building and transportation committee. My name is Mike O'Brien and chair of the committee. Today is July 2nd 2019. It's 2:05 p.m. I'm being staff. They like my office. Thank you for being here. I want to I'll just walk over the agenda really quickly. And then I wanted to do a charger for it stays meeting. We're going to consider an appointment to the sweetened beverage tax Advisory Board and also the urban forestry commission. We have a couple ordinances related to accepting grants funding for transportation projects. Then we have a presentation on commuter benefits and a presentation on congestion pricing. Before I jump into that I wanted to just share publicly a video of something that's continue to cause safety concerns up on 35th Avenue Northeast. Folks Miracle a little over a month ago after a redesign. There's a video shared that showed. some concerns the design app here used to be a two-lane road with a limited parking to make it a three-lane road with the hopes that that would allow for I understand traffic to move more smoothly and I guess the more space to make it safer for folks that are bicycling and what we saw a few weeks ago was a video of cyclist with multiple car is making a legal high-speed passes in the center turn lane. My understanding is that s. Has placed some barriers to that Center turn lane to prevent people from passing in the center turn lane. And with his video showed is someone making it also appears to be an illegal pass and then switching back into the lane at a very close clip to the bicyclist to avoid those bollards. And now I'm I'm concerned that the attempt to make this safer has actually made it more dangerous and I'm I'm considering we wrote take the committee wrote a letter to ask. At the last time this and I would love will likely do something similar because I feel like this is the second generation of trying to make the safer and it just keeps getting what appears to be less safe in each iteration and I'm not sure how much further we're going to go before you just go back to a design that has been proven to be safe and multiple court or throughout the city and around the country, which is actually making a protection for protected bike lane for the bicyclist so that the car by conflicts are no longer an issue. I want to show that just it's not on the agenda today, but I wanted the public to know that we are tracking us and they're aware of it. And well, I don't have any colleagues here at the table the moment. I know that's on my colleagues are those concerned. So with that since I'm the only one here, I am going to go ahead and move to approve the agenda and I will second that and I will vote Yes on approving the agenda. So it's a fun activity and with that we're going to switch to public comment. So tell if you don't mind bringing me, the sign-in sheet folks will have up to 2 minutes to comment and come to you that microphone. I only have three folks signed up Megan Cruise's first followed by Meghan Murphy and then Kelsey measure. Great, good afternoon. Like today we're going to be talking about congestion pricing and overall just trying to solve traffic issues downtown and across the rest of the city. But when we do that, we really need to look at all the elements and we're not doing that right now. We're looking just at sov single-occupancy Vehicles across the city that might be a big problem but downtown it's not the fastest growing traffic problem at Sauvie's only make up 23% of all the traffic downtown. The biggest growing part of traffic downtown is delivery trucks and Tents. He's better known as Ubers and lyft's and right now that's nowhere on anybody's radar not with the county or the city and its really got to be considered or we're not going to make a dent in this at all. Just a few facts for every mile a single car and driver put on the road a TNC an Uber or Lyft. What's 2.3 miles if it doesn't matter if the ride is Cher? There are seventeen thousand daily rides of Ubers and lyft's write in the 98101 zip code and the increase is 30% annually, so it's a problem with trucks and deliveries. The rate is going to double by 2022, and we're not even counting. These trucks annual e-commerce deliveries are going up by 15% and again, the city has the stats, but it's grappling. It's it's not even discussing how to get this on the map how to deal with it. So my point is if we're going to ration traffic or Prius instead of us or charges to two vehicles. We need to include all the vehicles in this and specifically I'd like this committee to address today where trucks and she sees fit into the traffic planning for the city on a on a daily basis and specifically whether these modes are going to be considered in the congestion pricing proposal. Thank you. Megan to Megan's really good to walk to adus pass yesterday and then and Dad news about I don't it's not enough housing and I think I have a lot of compassion for people who are responsible for vehicle here because I I would not be able to and I can understand when they have rage and they get angry because they're responsible for this thing. That's really I think you've called it like four thousand pounds. It's it's a lot to be responsible for it so I could only hope that we could develop more. Like I said Community more public transportation cuz it's you can talk on the phone. You can do so much on public transportation plan and it seems like peoples identity are like I want to go here now and I want to butt in If it was public transportation, it takes more planning and I just think it's better because of global warming is getting really serious other so much oil going in the atmosphere. And then I also wonder where do cars go when people are done with them. I don't know. It's just crazy. So with housing I was just looking at the Karl Marx boss and Vienna. It's like this big huge structure that started a long time ago and people actually get more benefits of housing when they plan together as communities. It's there so many benefits to that living situation cuz I saw a presentation about it and I could only hope that Seattle we could just doesn't like everyone could plan more together about communities to save resources and I've my mom that has been seen my son and I only think well if I had my own place, they might even let him come stay with me, you know, but I just have to be Patient and work really really hard to get there and it's it seems I have some upward mobility and it's getting harder to have upward Mobility. So thank you. I copy. House is the last one who signed up if there's anyone else in the audience who didn't sign up I would like to ride public, you can come forward when calcium is finished. Well, thanks Kelsey mascher and with transportation choices Coalition here to speak in support of the workaround congestion pricing We Believe congestion pricing is the type of Bolt policy our city needs to implement to reach goals around how sustainability and opportunity. We are continuing to grow and we know that managing and heavily investing in non driving options are the only way to proven way to keep us moving on so we want to say thank you to study you're going to hear about today and as well as to marry gherkin for her vocal support moving forward with policy development. Here's what we want to see if you consider next steps first and Equitable engagement process with the broad Coalition, the only path to an equitable congestion pricing policy is an inclusive process. So we want to see best practices using the red and reaching out to the community to be most impacted by this policy. We want to see robust transportation choices in place on day one to provide real alternatives to driving downtown. We need a richer set of Regional Transportation Investments and services. We want to see Progressive pricing Progressive pricing system. So we want to not just mitigate harm but really to design a pricing system. I'm an Explorer how Revenue could be Progressive and potentially replace other aggressive forms of transportation funding and finally want to see that Revenue reinvested in sustainable Transportation. That's Viking Transit and walking that works. We know that initially pricing can be unpopular but the true cost of a car Focus transportation system need to be made clear people who drive lose 138 hours to traffic every single year collectively. We use lose 5 billion dollars in productivity to traffic congestion and two-thirds of our City's greenhouse gas emissions come from Red pollution. We believe it's done right congestion pricing can help address all of these issues. Thank you Cathy. All right, see none. No clothes public comment and move into a gen item number one. Oscar presenters want to come on forward. And then I'll tell you read into the record. Yes, your agenda and once I have an appointment of Tanika Thompson bird as member of the sweetened beverage tax Community Advisory board for term to August 31st 2023. Well, and once you get settled if you want to just do a quick introduction. Great. Thank you. Good afternoon. I break a tie go with the office of sustainability and environment and I provide administrative support to the sweetened beverage tax Community Advisory Board. As you know, very well the board was established by the same ordinance that created the tax and the role of the board is to develop recommendations for the mayor and City Council on the programs and services to support with beverage tax revenue and that align with the ordinance are the Oregon State sat spt, Revenue shall be used for healthy food access programs and programs and services that improve child health development and Readiness for school and additionally the attend intent of the ordinances to benefit communities that experience the greatest health and education in equities. The board consists of 11 members who are residents of the city of Seattle or work within the boundaries of City Seattle. And today we're here for the confirmation hearing of Tanika Thompson for one of the board positions were reserved for a community representative. So, it's my pleasure to introduce Tanika Thompson. Miss Thompson is a community organizer an activist who has lived in Seattle her whole life. She's a food access organizer for got green where she's a leader and a campaign and movement to close the food security Gap. So Working Families can put healthy food on the table before joining. Green Wisconsin was a member organizer and executive board member at Union 775 which represents more than 45,000 long-term care workers. She was a key supporter of the city of Seattle's efforts to pass a sweetened beverage tax and she by the Grassroots coalition to ensure that the beverage tax revenue is invested back in low-income communities and communities of color that are most impacted by health and education and equity. Thanks. I'll turn it over to you nice to meet you, but it's nice that there's a potential for the public about your interest in the average tax and being on the cab and some of the things you hope to accomplish. right When I got green found out that the city council is going to protect the city of Seattle is going to pass a sugary beverage tax. We thought well, this is a wonderful opportunity to close the food security Gap. We were told that there were no funds to close a food security gap before so of course, this was a good opportunity to take money. Actually what we realize was that communities of color and low-income communities would be impacted the most and we wanted to give that money back to the US communities in a positive way. There's no better way than giving them healthy food. And so providing access to healthy food is just such a wonderful thing to do for my community. It makes me feel really good. They're so grateful and they're always so happy and it always seems like they make me feel like I've come to them right on time. And they look for me every month to get their vouchers or fresh bucks and it's just a wonderful thing to do for the community that I love so much we worked really hard with the city to put a plan together to make sure that the funds would go back to the community and we fought really hard. We fought the American Beverage Association. I did a lot of trying to tell people the significance of the text and that it wasn't such a regressive tax because the money was going to come back to them and I'd like to continue this fight by being on a community Advisory Board and making decisions to ensure that the revenue gets to the right place, which is the communities of color and low-income. Think you've been an amazing Advocate and I've had the pleasure of working with you for a few years. So I'm thrilled that you're willing to serve on the community Advisory Board. I'm going to see what they described for the Republican the camera just the food security Gap and what that looks like in the communities you're working with families in King County who are making what is considered a living wage. But because the cost of living has gone up so high and Seattle lately like rent is ridiculous and they cannot pay their rent their bills and afford healthy food healthy food is you know kind of pricey and so they're not eligible for EBT or SNAP benefits because I make too much money. So these are families are overlooked often and they really do need help. They're struggling to put healthy food on the table and Seattle's are First city to the address of food security cap. Well, it's an amazing program, and I know there's a lot of work to do too many feels like we've taken some good steps into closing my account, but I know there's a lot more than an II to make sure everyone our community has access to healthy nutritious food. So thanks for your work on that. I'm really thrilled you're going to serve as I mentioned and I look forward to the opportunity. I know that this is a big Commitment Community Advisory Board is in some really amazing work. Obviously. It's really important work easier recommendations. I take very seriously on how to be investing the revenue from the sweetened beverage tax and in so I know it's no small commitment. So thank you for your willingness to serve on the board to do that to thank you and thank you for all of your work as well. Quite welcome. So I'm going to go ahead and move approval of appointment 01372 and I will second that also and then I will vote Yes on it. So just like that. Thanks so much for your work. This will go to the full Council on next Monday and but you can start work immediately. Alright Kelly doing reading the gender and number two. So we have another appointment appointment 01378 appointment of Steven fry as a member of the urban forestry commission for a term to March 31st 2022. Welcome folks, when whenever you are ready, we can to Quick attractions appointment to the urban forestry Commission in a little bit of background. They commission was established to advise City Council in the mayor on police is plants in a regulations having to do with your grandpa rest and the commission is comprised of 13 positions at 6 or appointed by the mayor 6 by City Council in wahneta position that you selected among the members in the mayor is recommending Stevens appointment to position 8 development Community or non City utility representative. Stephen is a program director for Seattle 20-30 District where he works with developer San facility managers to oversee programs focused on reducing energy and water use intensity as well as Transportation emissions in commercial buildings throughout Seattle and neighboring communities. Stevens experience spanning the public private and nonprofit sectors. He's understanding of code requirements around development specifically green factor in his creative ideas on balancing development. Entry preservation would be an asset to the urban forestry commission. He is being appointed to a three-year term ending March 31st of 2022. Hoboken Steven, thanks for your service. And thanks for your willingness to be on labor force commission when to take a few minutes and tell us a little bit about your background and why this position is of interest to you and maybe what you hope to accomplish. Yeah, thank you for having me. I've spent the last year-and-a-half focusing mainly on Green Storm are issues within the city and I'm trees are a huge proponent of that and I hope to really push for the updates the tree ordinance which has been kind of an ongoing effort for a number of years as I'm sure you're aware kind of what I hope to land way towards that discussion is natural Capital accounting of trees making sure that we're acknowledging the true benefits if they're providing to our communities namely Urban heat island effect air quality habitat for species and stormwater. These are all things that contribute greatly to our communities that aren't necessarily factored into their value. I also hope to Push forward the true value of mature trees if you chop down a mature tree and replace it with a sapling defects are necessarily the same and that's not really taking into account currently. And then I also would like to prioritize green investment in neighborhoods have traditionally not been recipients of it and connected Greenways that connect public spaces of people feel safe and comfortable to walk with these wayfinders which trees can serve as a great example of that. Wayfinder mean like go to the Douglas fir on the corner and turn left or more of like this is the path. We don't have feet of concrete trees in a row. Like you will can follow the path but you mentioned the update to the urban or to the tree ordinance in the city, which is something that threw fits and starts. We've kind of been working on but without any relief deliverables yet. I know my colleague counselor or big shot is more we both have about six months left on the council that she is working on that right now, and I know my goal is to work with her so that we can have some legislation. I'm hopefully through the council process before the end of the year. Have you been involved in that process a little bit to date I have been aware of it and I have been engaged with the urban forestry commission kind of in the mood just an interested roll. So I've been familiar with kind of what the New Orleans is shaping up to look like And I have like red. Through early, but I haven't been on the commission to sell so I haven't really drafted language up. Well, I appreciate your background. I appreciate your participation in this look forward to your service anything else you want to add? Not today. Thanks. I know that this is also has a lot of work in front of us. You know, we are obviously a growing city. There's a lot of pressure development pressure which often results too often results in US losing some of our chairs trees and I think we can do a better job of protecting those while still allowing, you know to create more housing opportunities for people live in a city to and so someone with your background if he could be a great addition to the commission, so I'm so I'm going to go ahead and move appointment 01378 and I will second that and I will go to buy So you will be up before the full Council on Monday, and but thanks again for showing up that I appreciate. All right, you want to read genetic number three that I had at for business nodes along Delridge Way Southwest as part of the Delridge Way Southwest Rapid ride H line. The Welcome Inn when you get settled to energize yourself, thank you. Let me actually get to the right person to have it on my pillow board from the Seattle Department of Transportation director's office. Welcome. Thank you. So so this is Bill that allows us to accept a gift of about $6,000 up to up to $6,632.52 for some plantings on the Delridge rapidride H project. And this is a gift from the Delridge neighborhood Development Association. They've been working with LED for several years off of economic development for several years on trying to better establish some small business know it's a lot of the corridor. And these plantings are just a small part of their effort to provide some greater identity for those notes. Not jump to the next Slide the four locations for these nodes are Andover Youngstown Brandon and Orchard and you could see in the 30% drawings up there the locations of the medians and purple tips were the plantings would go another a cross-section on the lower left at Andover and the kind of typical planning to really see on the right and there's just more of a unique set of plantains that would be paid for by these dollars. And so we're asking you to allow us to accept that gift. To I'm curious why and how did this come about? Normally? I think the city would just be providing funding to do plan things on her own so we are doing planting but these are little bit. Look at Marks Art of custom plantings, I guess even Beyond like I'm beyond Community collaboration with off of spectroniq development the only in Seattle program and they have hired a landscape architect to make sure that these plantings fit within our standards. So they're there their little bit more unique rather than then even enhanced but they fit our standards for how we maintain vegetation in the right of way. When I appreciate that and I assume even modest gifts. We are required to approve so all the way down to $0.52. So I appreciate you getting a specific their summer related question. Then you may not know the answer for this bill. So feel free to Take me to someone else my understanding is that the design for the rapper record or is it is it at 60% now? It's 60% It's probably getting close to 100% at this point. Okay, I'm curious as I can for structure along or Jason's like order to and so probably not here unless you have anything you want to come in on but I'll get a very high-level there is protected bike lane in one direction for a good segment of it. I think they'd be in parts of parts of the the quarter are there it's two way and then another segments who relies more on the 26th Avenue and Greenway, which is just a couple blocks to the east I think I think it was a month or so ago. We had a little bit of a presentation that showed some of that alignment and making her feel I was here something I just read privately but here I am interested just to see if there's a opportunity to make that quart or a little more robust when it comes to it and have less in and out, but I'll I'll follow up with the folks on that team as a brief you on the project the correct steps sign anything else. I need to know that this is the timeline for the project and we would be putting these planting sand along with the rest of the plantings probably near the end of the project to 2021 super well go ahead and move Council Bill one 19560 and I will second that and I will vote Yes on it. So that'll go to the full Council on Monday thinks you're working. I feel like you and I think you were here for the next presentation to Cancel one 19563 and ordinance relating to the grant funds from these sources authorizing the director of Seattle of Department of Transportation to accept a specified Grant to execute silver and perform corresponding agreements for and on behalf of the city amending ordinance 12572 for Wichita did the 2019 budget including the 2019 to 2024 Capital Improvement program changing the Appropriations to the Seattle Department of Transportation revising project allocations and spending plans for certain projects in the 2019 to 2024 safety and ratifying the confirming certain prior Acts. Great, and for the record, we still have billboard from s. With us and Bill if I recall correctly from my recent committee meeting at the Puget Sound Regional Council and I'll ask grad acceptance. We accepted a whole host of things and then contingently accepted an additional Grant on. What is it in the East marginal analysis marching over there and sure enough there to Sandra Council dipped into the kitchen to see less but it's even further and so this is an additional project that moved up into the funny faces that right. That's exactly right. And this is some this is for the cabin park seismic Bridge Project, which was I love you funded project. We are already going forward on construction with at the summer but this allows us to better meet are leveraging targets for the whole seismic bridge program. This is one of 16 project civil. And I think most people are familiar with this project connects on 15th Avenue between the U District in Ravenna Park area it is. It was built. So I believe in 19 26 and 36, excuse me and said this is our seismic bridge program doesn't replace Bridges. What it does is it that's a lot of things like wrapping beams and structural fiber at reinforces support beams, and it's really just designed to make sure that that structure with Stan's an earthquake so that no one is severely hurt her or killed the bridge doesn't collapse. Well, it's a good project that we've obviously voters and I'll have supported in the past and so the ability to leverage some Puget Sound Regional Council Federal funding is great else needs to know and I think that's that's it for the project by the end of the year. So it's moving pretty cool things with the Pew temperature for the Puget Sound Regional Council requirements. We do need to obligate $2 by July 15th, and I'm so we have a ratifying confirm Claus in in in the ordinance longer. I'm going to go ahead and move Council Bill one 19563. I was also second that and Vaught eye on it. So that goes the full Council on Monday and allows project to move forward quickly. Thank you very much. All right, You want me to join them number 5 the presentation on commuter benefits? invite prisoners Ford got a long list of some challenging questions. I'm going to throw their way. All right, cuz y'all get settled when we start with around of introductions. items Nicole belong with commute, Seattle Taylor Swift Seattle Jasmine marijuana with after labor standards. I can start jumping. I just like to introduce the pre-tax work that we collectively at the table have been coordinating on we had s. Have contracted with commute Seattle about a year-and-a-half ago to investigate the use of pre-tax Transit benefits by employers throughout the city of their scope of work has included some research Outreach and support to businesses around the city to understand the current use of pre-tax Transportation benefits and understand what some of the barriers are to to implementing those programs around the city. And now that we have an ordinance on the books to require the use of pre-tax Transit benefits in Seattle is planning to continue in a supportive role and has been coordinating with us. And office of labor standards. To continue that works over here today to offer you an update on their work Following last year. I can remember the exact date the commuter benefits ordinance requires employers to offer a pre-tax deduction from the employee's paycheck. I'm to cover Transit vanpool expensive each year the Internal Revenue Service. That's the total allowable amount that an employee can deduct and this year. It's $265. So that one is requires at that deduction be offered to an employee 65 per month their obligation by either allowing does pre-tax deduction or by subsidizing all or part of the purchase of a transit pass like the Orca card, for example this ordinance applies. Two businesses who employ at least 20 employees worldwide that includes part-time or full-time as long as they've worked an average of 10 hours a month a 10 hours a week in the previous month and and it is ordinance goes into effect in January 1st of 2020 and it enforcement starts on January 1st of 2021 to what that essentially means. Is that for a year after it goes into effect. The businesses will not incur penalties for not complying with the law, but they'll be expected to comply essentially is there red wolves will be developed later this year and will maybe clarify a few things that are in the law. For example, you know, what exactly will will an employer need to do to be to be in compliance with the law if they subsidize their past there. We've got some questions that where we might need a little bit of clarification. So will be developing rules for that. And in the meantime, we are working with commute Seattle on the Outreach and education in Seattle for now is taking the lead on reaching out to specific businesses. But the cost of labor standards had you know, when it's ongoing work as we reach out to businesses for all number of labor standards on this is going to be folded into a body of work and her body knowledge that we were we discussed with businesses. And so for example, we have the business Outreach and education fund where we partner with business organism business hours organizations. I'm particularly with an equity Focus to reach out to businesses that may or may not have access to the full Suite of resources to comply with the law. Those those Partners. I'm helping OS do this Outreach to make sure that that folks can be in compliance and that those Partnerships, you know, we'll be relying Helion, commute Seattle for the first few months to you at to make this educational success. I'm going to turn it over to read the rules to help clarify how to be in compliance. Is that something that you think the directions Wilson cover or will there be a need to amend the ordinance at all? So if you need to come back here, I'm Happy Jack's but I thought so. Thank you for being here today. Thanks for all your amazing work in the city order to educate businesses about this new ordinance. Something to give a brief overview of the ordinance of self and its impact on employers that I'm going to talk about that Outreach methods and strategies and then go into current metrics and we're outreaches at today. And just for some background if people are unfamiliar with commute Seattle like Sarah had mentioned we are a nonprofit that partners with Transportation agencies. We are housed within the downtown Seattle Association and have a strong relationship with the business Community Counseling working with the public and private sector to form relationships and solutions for different transportation problems and also overcome those barriers. So that ordinances else with which Jasmine went over is capped at $255 per month that employees can use for their transportation costs very similar to a FSA are flexible spending account for health insurance. You put aside a certain amount of money every month for these cost of this is a great way for employers to offer a for their employees get to work and then also reduce the burden of commuting costs employees often can say about 30% a month on their transportation costs and employers can also save about $8 and FICA taxes with every $100 that an employee uses for their transportation cost. And as I mentioned this is a federal tax credit that is being mandated into the city of Seattle starting in Journey. First of next year and it will be required of all employers of 20 or more than pleased to provide some kind of way to comply but there are many ways to comply which is my job to spread the information on that. So are messaging at can you settle in as my role as Outreach coordinator is that we work with businesses and budgets of every size are Outreach is animal time media approach. So we hope they get people's information and whatever way works for them best. And once we are talking to employers and all Grand Marquis in a material is in hopes that they will first be able to offer pre-tax commuter benefits, which is the most cost neutral and also often saves the employer money or give them information to start an orca business program and just in case anyone isn't familiar at work at is our regional transit pass and then also information on how to take part on the wash. Washington garbage transfer station small business subsidies, and this is an incentive for all businesses with a hundred and less employees to provide commuter benefits at a at a subsidized rates. So they 50% back or a 50% rebate for the amount that they subsidize. So if they were to subsidize 50% subsidy the state would also rebate that amount through a short program survey before and after they begin and so this is open to anyone who has never provided a transportation incentive or subsidy in the past. And is that a watch that small business subsidy just for the first year or is it ongoing or it is ongoing it was extended into June of next year. It's just for the first year of an orca program now got it and so is that built into the the Metro pricing you see on the first your pricing of African with conducting a survey so it can be built into certain contracts, but some of it is provided as a rebate so they boarded Fusion sent it. Yeah, it's really exciting people. Love to hear that. So I'm going to go over the three different components of our Outreach one of which is a commuter benefits ordinance Hotline in person Outreach as well as our digital and video collateral. And then this is a brief timeline of the methods. So beginning in early art beginning of February of last year at my colleague Nick began digital Outreach. And as well as in person Outreach about the pre-tax commuter benefits and then the hotline became active just of April of this year. So this has been added on to all marketing collateral and then we are doing in prison Outreach webinars will begin at this month and then we continue to do Outreach post the effective date in coordination with the office of labor standards and office of Economic Development. And then with all these Outreach methods, we also have included Equity elements, including creating neighborhood and industry-specific collateral so that when we're approaching it say someone who works in the Foodservice industry or if we're in the neighborhood up you sleep for example, if we're ready to starting in the conversation and elevated way that it's individualized to their needs. We are also targeting in our initial Outreach into underperforming neighborhoods. This isn't to say that we won't work with the neighborhood of downtown. But as far as our in-person Outreach, we are looking at neighborhoods that don't normally offer some kind of commuter benefit program are marketing collateral has also been translated into seven different languages and we will continue looking into translating are webinars as well and then working with the office of labor standards and accountability to get the word out through other channels. On the underperforming areas. Is there a like a specific method Kelly commode split or is it really just everywhere but downtown? I'm just looking at where the most star versus the areas that generally don't have any kind of bird has a lot less than downtown. Yeah working with King County Metro to get that data. So there is also the resource hotline and this goes directly to me. So I'll be there in 5 days a week 8 hours a day ready to directly answer any specific Lee related commuter benefit ordinance questions. So generally people can find this on all of our marketing collateral also through emails and then we feel sick when this information to our partner organizations generally people are calling me. They want to have a really specific individual eyes consultation of how to how to make a combination of a program or just to learn more about what their options are. So these phone calls come out anywhere from 3 to 30 minutes, but it's my stupid like know that that resource is always available. Creating a simple three-step process that helps employers kind of get over the initial confusion of Aubrey and the benefits and I'm just going to quickly go into a bit more detail on this cuz it's still like it's very essential to the program and too many conversations. When is to survey their employees understand how they're getting to and from work and then also asked how much they are spending on their transportation costs money each month as well as from that they can decide to work best for the organization based on budget and their employer employees needs and then we help give them the templates to create these policies and from everything like the simple HR policies to how to get a card replacement two more in depth of like what their enrollment. Will look like and how to administer that We've also begun informational table and at wework centers like co-working spaces chamber events as well as the convention center and then have started going to neighborhoods Brockton neighborhood Eastlake to provide them information on different commuter benefits. I have a image hear of a marketing collateral specifically for nonprofits. And so we like to call out companies that already providing this benefit and how it works for their organization and then just give employers and the neighborhood and idea what's currently been offered. So a neighborhood specific one would have the mode options in the neighborhood as well. Are digital and video collateral it will be created starting this month and will have regularly scheduled webinars. And what I have here is a screen grab of the business and occupation tax credit. This was just under 2 minute video where we explain how to apply for this tax credit and who was eligible on this end up being very popular. So we're learning as people have short attention spans are just our gravitated towards video that this is a really great way to get the word out and provide a an option on social media also to share information. so is that the B&O tax credit is that so the watch that subsidy they talked about it these separate things property managers and employers that already provide a commuter benefit and they can apply for a tax credit in this is back in January of this year was the deadline Okay, so some current metrics we have consulted well over a hundred businesses. I'm we are currently working with these large change represented like Bartell's drug store Rudy's Barbershop and sea creatures Restaurant Group. We also I have had a lot of foot traffic on our webpage just in this year alone 553 Patriots 464 be unique and I'm proud to say that people spend the most amount of time at the community center website on the commuter benefits ordinance stay so it's just under 3 minutes and I am really looking forward to having all of these things together including the video that also boosts that What is a conversations didn't like what are you hearing from folks who have these conversations? We did a lot of Outreach in advance the legislation last year. Curious. If you're hearing similar messages are people signing up or they going to wait till the end of the end and enforcement starts or extra push with the wash. Subsidy gets people to think about this in a whole new light. So it really feels that there is a paradigm shift and people want to offer commuter benefits and want to figure out how to do it. And so it's it's just such a special time to start talking about these things in bits and very positive particularly when I was in the Eastlake neighborhood. I was surprised by how little people understood about their transportation options and commuter benefits and then how much they wanted to learn. So we have all that information ready to go for them. Now as of making it as simple as possible for them to figure it out. Yes, and so the legislation last year, you know, the Baseline was just a requirement that you offer this tax benefit, which is cost me to or maybe slightly cause positive for businesses depending on the scale some of these tools where you get the washed out rebate other things. Are you seeing people that are going to be on just the conversation about pre-tax benefit and actually thing I got to know about to subsidize my employees a lot of the small businesses that reach out in regards to ordinance have been directed over to the Orca program and I've been excited to find that they are qualified and have this opportunity and I in so many cases it makes sense for them to say, you know, it's like a gym membership. We're going to try one year where we pay 100% the state reimburses 50% in our employees get them for free going into it knowing that if in the second year we don't get the subsidy we can switch over to something like pre-tax. So in some cases pre-tax isn't even the first conversation point. I just want to die. I added this destroy highlights the importance of the partnership with commute Seattle to not only provide Outreach, but I think what they're actually providing is consultation and technical assistance, which is something that a lot of can provide we can provide education on the Mandate. But but we're happy to be able to refer to commute Seattle or that technical assistance piece. That is so key to making this a success. And I'm also just to talk a little bit about next steps as you as we just talked about people really want to have this conversation and it's going to have a massive impact has every business with 20 or more employees will be impacted by this. So we are continuing our work with opposite labor Sanders office of Economic Development Beyond then also plan to keep the hotline going beyond the effective date. And here is all the resources that I just talked about. Please share this and all channels that you find necessary or important. Thank you. Thank you for the presentation. That was outstanding and thanks for the ongoing work. It's really exciting to hear that that it sounds like at least it's having the desired impact you folks are getting beyond the traditional. Can you ship reduction audience which is typically the larger employers downtown and reaching out of small businesses and it's great to hear that. They continue to be really receptive to this idea. I know that people regardless of where you live and work as our transit system becomes more and more robust, but it's also can be a cost burden for folks to use give me some employer assistance. Even if it's just the tax subsidy, but even more subsidize your great is an outstanding thing for a whole city of our climate goals for congestion goes all those things. So excited be a part of it and I feel like we're always going to be this resource for employers and give them that like a completely free. I would say non pressured way to learn about ways that they can help the city help their employees in this exciting to be a part of the feel good but I do think we have to think about an LOL so I can see you think about the worker side of Outreach because commute Seattle is bites Mission business-driven more and so on but that's DVD that all workers. Will they move into the next phase of this making sure that they are not getting it they have a number to call and who do I talk to and how do I get this off for a really great piece of ass tots work to shift the needle in AR mode split away from Reliance on sov How do you connect people with different Transportation options? And so the ability for commute Seattle to work on a business-to-business a win-win situation? My pre-tax have been it's a great addition to the rest of our on business-to-business programming that we do in our transportation demand management work. Any questions on this one. Thanks for the update. Thanks for working as you get through as well as it gets through the rulemaking process or whatever. If is it national legislation that we need to do that to figure out how to better to find things. That's great. And you know, it would invite to Seattle if you hear he's like a fairly consistent message you receiving right now, but if there's if you start to hear any things that are different would love to hear back from that cuz I really want to be responsive to a program that is a win-win intenso. Thanks for Thank you. Thank you all. Kelly would you like to read in what I believe is the last agenda item pricing? So we have an hour left to talk about congestion pricing. So this is give me Grace. I can't imagine a better way to spend the afternoon being facetious. We may not find a flower hair. But I am really excited about the opportunity before us this is an area where has been really great leader for my perspective and how you know, we're seeing a little bit of action around the country and around the world on this and I think there's a huge opportunity and frankly with a lot of challenges to figure this out. So I'll turn it over to you all to me to introduce yourselves and start the presentation and we'll just ask questions as we go through that. Good afternoon. I'm Kristen Simpson with the Seattle Department of Transportation. And I'm Jennifer Weiland with Nelson Nygaard. Need to be here wearing different hats at different parts by 10. You hear welcome back Jennifer at work. And today we're here to share information about some recent work. We've done related to congestion pricing and to let you know what steps are coming up next. Before we get into the results of our recent work. I wanted to start with a little bit of the broader context for that work. It's no surprise to any of the Seattle in the region are growing and that the infrastructure for moving goods and people is very constrained climate change is a growing concern and as we heard in the comments Road Transportation generate 66% of greenhouse gas emissions in Seattle. Again, nothing surprising hear congestion is an ongoing concern and we recognize that it has impacts at a large-scale economically and also on the individuals who experience it. I'm finally inequities in the way that Transportation costs are distributed as well as related concerns about housing affordability make it vital that we think about pricing in the context of improving overall Equity outcomes. So the initial ask a question that 15% of the average budget is going towards transportation. Yes. I want to see I was smaller than what I have to hear but I see on the side of talks about for low-income households. I can. I can obviously be a little bit higher. So the initial pricing work that we recently completed as you know how to test routes in the city council interest and specifically in your interest of a thank you for that. It came into the public eye as part of me or Jerkins 2018 climate action plan. This initial work was intended to provide information in four main areas lessons from other cities that either currently have pricing programs or a seriously considering a review an initial evaluation of the different types of pricing tools available guidelines and tools for creating an equitable Outreach process and an equitable pricing program an initial analysis of impacts and benefits using existing data knowing that this would be a first pass and then we would have more detailed work to come. So like I said right now we're in the very earliest phases of this work there many steps ahead and it's fitting that this graphic is not a straight line. We know that we've heard from many cities who have pricing and plates were considering it that you really want to keep working on your plans so that you have something in place when the time is right and there are number of steps to get there. The specific timeline for implementing really depends on the community engagement process through which will be starting this fall and will be designing that in partnership with the Department of neighborhoods are priority. There is to make sure that any proposal that we put forward as its roots and Community engagement and addresses potential externalities of the program. I'm especially for a lower wage worker. I'm so this one. I'm going to turn it over to Jennifer to go into some of the details of our findings so far and then we'll go on from there. Great. Thank you. Enjoy. My council members want thanks for being there. Great. So as we dive into a few of the findings from this first phase of work, I thought we should start with just a quick reminder of what are we talking about? When we use words like congestion pricing congestion pricing is one of those topics that goes by many different name some cities call it D congestion charging others call it Mobility pricing were using the terms congestion pricing in Seattle. But what it is is ultimately a strategy to help address congestion and emissions and it is really at its nature about pricing city streets to encourage alternatives to driving alone to increase reliability and to reduce travel times while improving safety. Right. Now the cities with congestion pricing programs in place are all outside of North America, but I think it's fair to say that there is a race on along the west coast to figure out who might be first New York is a little bit ahead of all these West Coast cities that are studying pricing and we expect that New York will be the first US city to fully Implement a program that remains to be seen who will come after them. As we look across the cities who have implemented congestion pricing. There are a few key themes that really come into play, especially when you look at congestion or area pricing programs. One of those is the importance of pairing implementation of a pricing program with some sort of Transportation demand management that often comes in the form of additional Transit service. Certainly, one of the purposes of pricing is to change Behavior, but I don't think it's a surprise to anybody that a congestion pricing program can also generate Revenue. It is not the most efficient way to raise revenue and a lot like the way the city uses parking pricing revenues are really a byproduct of managing a system to optimize supply and demand the revenue is really across the board and all the cities. We've looked at have been used to fund Transportation enhancements. So the five cities that are shown here a couple of the highlights of what we see in terms of the benefits across-the-board. We see a reduction in trips a reduction in greenhouse-gas emissions and increased improvements in travel times. And then as I mentioned revenues are a byproduct, but they really do very bi-city depending on the overall cost to operate and maintain the pricing program as well as the size of the area that's being priced the base charge and a variety of factors like discount exemptions. Turn on that your Singapore. It says 15% with new technology 44% and 75 is that two different bass lines in so initially they saw a significant reduction. Exactly. So Singapore's program has gone through a lot of different iterations and when they initially implemented in back in 1975 is a huge decrease Central production that sort of leveled off after a. Of time which tends to happen in most cities that have implemented and so they did put a new technology in place much more recently and that led to another 15% decrease. So we get a few more words about benefits what you're seeing on this side of the chart on the right is from London and what you see here is Transit used which is the line in red steadily increasing over time. And these are different phases of implementation of London's congestion pricing program at the same time. You see the line in yellow going down and that is private transport. So people are driving less or private vehicle uses decreasing and Transit use continues to increase businesses in Stockholm and lens and both have seen economic benefits with the implementation of congestion pricing and it is a constant that programs have changed and evolved another key piece. So an example of fat is in London when the percent of people driving plateaued the charge was increasing that's similar to what we just talked about for Singapore as well. When you mentioned that the businesses have seen economic benefits. What can you speak more to that? In the charged Zone have seen an increase in sales of about 5% Some of the reason that they think that has happened is that because drivers are required to pay before they enter and exit the Zone. A lot of folks are staying within the zone to do their shopping and are spending money locally. London has also seen benefits to businesses within the priced area. They have seen growth. I'm going to say About doubling if I remember correctly, I'll have to get back on this specific number but businesses within the price only in Legend have also grown significantly faster than business is outside the price Zone. That's that's happening. Is it consistent with some of the other Transportation Investments we make I imagine that you know when you want to put in a bike lane or a bus only lane or congestion pricing imagine a lot of businesses. We have concerned that this will impact and it sounds like there is an impact that the positive one which may be kind of counterintuitive. I I suspected I'm curious how Freight is handled in various congestion pricing models to because one of the places where it seems like there would be an obvious benefit is for folks that are moving Goods around the city and congestion goes down. One of the trucks has to be on the road an hour less a day. That's a significant savings or maybe a toll in charge for the vacant a vino a nine trucks leave instead of a 10 truck Fleet. That's a significant Savings in both capital and operating costs. Absolutely that is very consistent with that is up to 25% more deliveries because of pricing and because of what that has meant in terms of reduce congestion. I guess it speaks to the those high-priority trips that again. They assume most freaked out also paying the congestion price for the offset to increase price of a 25% more efficient sees significant. Imagine supposed to liveries. You will hit a limit in terms of what you're paying is not going to Skyrocket astronomically. I'm a few other words about additional benefits. So as I mentioned it is pretty consistent that revenues are used to improve Transit service and to provide infrastructure for active Transportation. One of the things that we've looked at in our early work is the potential to use revenues to support projects and programs that can really Advanced Equity outcomes that could include providing more options for people offering free Transit passes. There are a variety of different approaches that can be taken a few other notes from London. They have seen fewer crashes as a result of having fewer vehicles on the road and maybe a little bit less frustration by drivers. They've also had some pop positive public health benefits as a result of reduced tailpipe emissions. Well, the Collision rate going down 40% that is significant. Surprise me. Cuz sometimes we think of or I think of congestion is a traffic-calming mechanism in you know, when there's actually more cars on the road, but the theme packs with one of the things that's important to note in London is that some folks will tell you that congestion itself has not decreased that much because a lot of the roads Facebook has been freed up has been repurposed for a dedicated Transit lanes and for active Transportation infrastructure. So I think that reduction in collisions is a result of having safer dedicated facilities for people as well as having fewer cars on the road. Could you send us because if you've already done that and I'll check with my staff and I apologize but those studies I'm assuming these bullet point you have from a studies conducted in London or Stockholm River. If you could send that to my office, I would really appreciate it. And you the question in my mind is about causality and you sort of alluded to that but we're also talking about cities that have far far superior public transit. And so I don't know what to make of this may be the way you're presenting it. It seems to suggest that congestion pricing is what has worked and maybe it hasn't he hasn't. I don't know but If you're all so you're comparing apples to oranges. I mean, the the reason people don't drive in there. The reason a lot of people are able to not drive in London is because they have far superior public transportation and I've been to many of the cities that you're you're talking about. So I think that we should have that data as well and that will be useful to look at great. We are happy to provide those reports. There are a lot of Studies have been done so far. I'm going to think one of the important things to come in from congestion pricing programs across all of these cities and even as the programs were initially being implemented these cities are making investments in public transportation Transportation. They're increasing the number of buses that are on the road are increasing the amount of services available. And so there is a very strong focus on providing those options for people at the same time your disincentivizing driving. So I think that That match is really critical. But we are talking about an entirely different dollar amounts. I'm assuming I mean, I don't know what you're as maybe you have an estimate of how much some some sort of congestion pricing model with generate in downtown. I'm assuming that isn't going to be a fraction of what would be needed to expand public transit by the proportion that we would need in order to actually ensure that works. I think I'm even know that even despite all that gots to Metro ridership has gone up tremendously. I don't think at this point it's a question of how can we convince ordinary people that there is a climate catastrophe at our doorstep people get it or nine people get it and people are making sacrifices for it and I run into people all the time who say that I wish I could only rely on public transportation every single day, but I cannot because I simply couldn't can I get to my day given how long it takes me to get from point A to point B changing buses or whatever not having jobs close by and No, that's okay. I think those points have to be taken into consideration. Yeah, I think your point is well taken that we are very different from London and Stockholm and even from New York City and some of our North American counterparts. So what we wanted to do is learn what we could about their experiences and then as we start to do community engagement, I'm in our own research about transit in Seattle be able to look at the things we've learned from other cities, but really make sure we're understanding them in a Seattle context. So moving on to talk a little bit about what we looked at for Seattle specifically when we talk about challenges like congestion like climate change. There's clearly no Silver Bullet. So as we started to look at pricing we cast a very wide neck and reviewed 11 potential tools these include some that are already used in Seattle or in the region. So for example in Seattle, we do price parking on street and a street tools like arterial toll roads are similar to highway toll roads that we have in the region and then the state's pilot for a road user charges something that we also have been following pretty closely. So it's a broad set of tools that we started with. One of the things that we've didn't spend a lot of time on in this first phase was thinking about technology technology is clearly going to be a vital part of implementing any pricing tools, but it is evolving incredibly rapidly and it's a little bit too soon to be thinking specifically about what type of Technology would be right for Seattle in our operative interoperability. So that is being able to talk to different systems and privacy are both going to be incredibly important considerations as we do begin that work. Certain there are those 11 tools that I mentioned down to a smaller handful for further analysis. We did a quick screening of them based on their potential to improve Equity to reduce congestion to improve climate and health and for some implementation considerations based on that initial screen. We selected Cordon pricing area pricing Fleet pricing and Road usage charging for further study as part of the Outreach will be starting in the fall and Kristen will talk more about that in a little bit. We expect that. We will hear a lot from people about whether these are the right screening criteria, and we may want to revisit the tools that we are considering for further study. So just a quick word about each of those for cordon and area pricing are probably what most often comes to mind for people when you think about congestion charging. They are very similar. The biggest difference is that with Cordon pricing drivers pay only when they cross a specific boundary, whereas with area pricing drivers pay when they crossed the boundary, but also for the trip that they make within the boundary And so on area pricing, I'd imagine that psychology changes a different cities you do a different way. But his is the general concept like if you you know, if you move within the zone is it like every time a camera sees your charges more or so the more the more you move the more you pay right now. It's certainly as as Road user charging advances a little bit more their opportunities to charge for the vehicle miles traveled. There's also been some talk about being able to charge for dual time zone. That's a good ways off but there are a lot of different ways to explore what types of trips and what is the metric that you use is it time is it distance? What is that? I know I imagine that as of this work advances will be looking at both the technology that's evolving to see what tools are available. But then also trying to figure out what is the what are the critical problems were trying to address or concern about people making the 6th block trip in their car around downtown or we can spend about the long-range commuters. What's what's the biggest problem? We're trying to solve? A couple of the other tools been so Fleet pricing is is an approach to congestion pricing that could be implemented is the first step of a cordon or area pricing program or could be a standalone pricing is typically a charge that is applied to certain types of vehicles that can be for hire Vehicles like taxis and transportation Network company Vehicles commercial Fleet or delivery vehicles High emission vehicles or even autonomous vehicles as we move forward. Surcharges then are as I mentioned the state of Washington did a pilot on this essentially. What does is charge people for the miles that they drive the state's pilot was really focused on road user charging as a potential replacement for the gas tax, but it is a tool and technique that could be used to manage congestion. If it was if you were charged by location or at a certain time of day, for example So as we started our work to do a little bit more evaluation of these tools and think a little bit about the potential impacts and benefits that we might see we wanted to start with an understanding of the inequities in our current system analysis of the potential Equity implications of pricing as well as if it has the potential to use pricing to help Advanced equity. The data that we had to work with in this first phase was limited. We were using existing data. We used a that's collected by the Census Bureau to look at people who drive from anywhere in our four County region to downtown Seattle for work as well as drivers who live downtown and drive elsewhere in the reason for work. We use that data to look at impact by race and income to see if they were differences from the general population are in this will work with very focused on identifying areas for further study based on a pretty undefined program. And as I mentioned limited travel Behavior data, we do have additional work underway to develop a tool that will help us estimate much more specifically who might be infected and benefited. This is an area that when we initially put the money in the budget a year-and-a-half ago. That was really hoping to focus on tonight recognized it that getting good data here is is challenging the reason the reason why that was important to me was know as we move forward designing a program and frankly, I think along the lines of I think some questions that may be council member. Someone was asking earlier. From me from an actual irrespective to understand who is currently driving downtown and why they're driving downtown is give me really important. We have a sense that you know, what around 20% of the commute to downtown are still in a single out hands the automobile and I imagine that some of those people are just like I have a bunch of options and I want to drive and for those folks to know I I feel more comfortable charging them. I imagine there's some people that are driving downtown. It's like it's already really expensive but I don't have any good Alternatives because of time of day or location or whatever needs a RN and understanding, you know, what part of that 20% is in the former Cavs versus the latter camp and there's probably no dozens of other scenarios that are brought up as any really important for us to implement this so how I'm curious. How do we get beyond the kind of high-level census data and Everything into you know, are we doing intercept studies or surveys or what? They look like. Talk about that a little bit more. But I'm I I do want to say that we've shared your frustration that we weren't able to do more with the data that we have. Now. We are developing a modeling tool that will help us get into some more finer grain analysis were also participating in the third round of the Puget Sound Regional councils household travel survey. I'm so that will provide some more samples will be able to use and then I think it will be also really important to balance the data that we are able to collect and analyze with for Community engagement and Outreach so that in addition to looking at the numbers were also hearing people's stories understanding what it means to them what their trip needs are in a from a personal level as well as from an aggregate level. Look forward to how we get that as soon as possible is going to be critical and I think I need one of the hard things about this is without that data. I often hear people that I would put in that first camp on mine, but but I have a lot of great options, but I just prefer to drive my own automobile downtown will say I don't like the idea congestion pricing. I'm okay with it, but I'm really concerned about some other people that may end in understanding. You know, how many of those people what are the challenges? How can we address those challenges? Whether that's there's no good Transit options where they live and they have to live where they live because of what they can afford and we have to provide them some other financial support to get buy or whether it's we're going to invest in transit to some locations that really popping up we see, you know, if a certain chunk of the people driving downtown are coming from certain areas, but let's make some more things like that that we talked about will be happening over the summer Outreach and engagement will be starting later in the fall. So it's not too far away that will be able to get farther into that work. So if you highlight span of of what we were able to identify with the data that we have available all of that data set and again, it's it's data that comes through the senses and we're looking at commute trip specifically. So overall about 13% of workers who drive in the region would be affected by a downtown pricing program and we used a pretty General downtown boundary for this. We also assumed pricing 24/7, which is not a system that most anybody would ever put in place. It's much more likely that we would look at some type of peak our pricing and then it would be a weekday only by those details have not been developed in terms of a program design. So we looked first at income and when we break some of this data down by income what we see is that a higher percentage of drivers with incomes over 75,000 per year would be affected by a potential downtown congestion pricing program and a lower percentage of drivers with incomes. Less than 50 $50,000 per year would be affected but that is simply talking about being priced that doesn't tell us anything about the relative magnitude of impacts and councilman Brian if you were referring we can assume that somebody with a higher income may have more ability to pay then somebody with a lower-income. Why are you so excitedly going to be true that if you are talking about a flat rate then of household with lower-income is going to be that's going to be a greater proportion of their income for a household with a higher income. So, I'm not sure why you're not stating that definitely is mathematically going to be true. It's on a question. It's not it's not be in that right, correct. I see there's no ambiguity. A greater proportion of that lower income household income is going to be used up and paying that tax or fee as opposed to a higher income household. I mean, there's no ambiguity there. I also want to know I also don't. I mean just against who disagrees with I don't find it compelling for you to say well more housos a greater proportion of households that have or commuters. I don't know how you're defining it as household income or individual income regardless. It's 14.7% Austell workers Is that what it means 14.7% of what I saw it? Maybe we should clarify that first before I speak to reflect the differences in the number of people in different groups within the region. So when we look at that 14.7% it is 14.7% of the people who have incomes greater than 75,000 who were within that group who would be affected by a downtown pricing program. And there is the denominator there just anybody who drives anywhere in the region region who would be affected by a downtown pricing program. And so those are people from within the Four County area who are 16 and over drive to work either downtown or who live downtown and drive to work with a denominator for each bar is different because you're using. Income group for each anything. But again. This is just looking at driver so someone who takes transit in the region. would almost certainly not be impacted by this but it's not showing up in this study at all either cuz if you're not driving you are not going to be I'm interested in how income levels affect Transit ridership and my suspicion is that lower-income people are higher uses Transit so that way they would also be less impacted by this because they more likely to retain Transit but it depends what we have here. This data says 14.7% of the commuters or workers who drive in the region who 14.7% of the households that make more than 75k. Right. That's what you said the group of 13%. 10.7% of the households that make 75 or greater. Isn't it that's what you said right will be will be impacted by the congestion pricing Drive in the region, but not all of them will be impacted by the pricing because they're not all driving into downtown Evanston downtown would be affected by so we're saying that approximately 13% of the workers to drive in the region data that enables us to say that even though there are different numbers of people who fall within within each of those groups. We would expect that approximately 14.7% approximately 15% of the people who make over 75k who are within that bucket of 13% of drivers. 15% of the households that make more than 25k. It's on the bed the universe of the data again. You're very clear about that. So that's what I'm doing fine. Very compelling for shefali because it says 11 nearly 12% of those under 50K. Will be impacted and nearly 15% of those under overpass 95k will be impacted. Do you know what I'm saying? I mean it's not like you're saying 2% of those under 50K will be impacted and 15% of those on 75k will be in fact, I mean, there's a 3 percentage-point difference between the two numbers and that's not very compelling. You know what I mean? It's not that different. It's it's true. It is not that different and I think that was one of the important findings as we looked at just this initial data set is that the range that we were seeing is is much smaller than we would have expected expected the differences to be much greater than this, but we're not seeing that in this initial Davidson. Right, one of the things that will be able to do with the model that we're developing is to turn different policy tiles to see if we had a discount program or a cap or other ways of adjusting the the program design. How would that affect different income groups? So this analysis is just started charging everyone exactly the same no, no caps. No exemptions. No time of day changes just a very first cut at survey. Yes or no impact Nets will be looking up at both the magnitude of the impact like Jennifer talked about I'm a different ways. We can adjust those impacts. Okay, love you mentioned that I just just things need to be said I think that is important to look at because congestion pricing as we understand it in general is a regressive tax. It's you know, because you're talking about a flat amount and it is going If it's yes, I know but we haven't you haven't done that yet and you're saying it's coming and I welcome. But at this moment your slides that's creating an equitable for pricing program and all it says is of these drivers more higher-income. People will be affected mean I feel like you're trying to make more out of what you have in this data than there is because it's not that much different 12% of the house or less than 30% 50k for 15% of households over 77 75k. I mean that it's not very compelling and and then on the other hand, I think for a slide that title Equitable pricing program it had it should be noted there in like I know you should have another bullet point that says well, you know normally congestion pricing people's understanding of congestion pricing is that it's across the board and so it is by definition is regressive and you can you cannot talk about Equity if you don't Organized. Because even if these numbers were very different-looking of us much smaller proportion of households of lower-income was empire impacted and I agree with you at this is somewhat. Is it good to have this Benchmark? We shouldn't Lala self into thinking that low-income households. I'm driving into downtown. Maybe they're being compelled to drive me to downtown and I'll come to that later but breathing aside from that. If you're going to title some a slide names with the word Equitable, then you have to recognize that if we're talking about a flat tax than our flight pricing whatever then it is inevitable that low-income households are going to be paying more and that is not Equitable by definition. So I want us to get off on the right foot here and not go something Equitable when it's fundamentally not equitable. I believe I believe we were stating our intent there rather than making a claim but that's an excellent point in will I think that's why we drink you spell it out. Thank you. First saw this similar to take away but a different reaction comes from what I saw this I was surprised at the lack of difference and I thought that's what this was telling me was it there's not much variability here. And so if we do want to we can't start with the assumption that they think you were saying cancerous want that hiring people drive more. I do have a question about this. Is going to be impacted differently what I'm worried because the Baseline of this is people who drive in the region not to downtown and of course, it's not looking at people who transit in the the data point that I think would be more useful for me from a policy perspective is of all the people that come downtown during the day. It could be you to work or to drop people off for the play. I don't know what this helps it is then looking by income who's going to be impacted because that will start to capture, you know, do wealthier people more often Drive alone that take transit or maybe wealthy people live close to the transit to date a Trans Am or let me know so so that universe and seeing how it spreads out is going to be really important is that data that we have and just in slice of that way I can get to that weather data set. The challenge of using the senses face data is that it is commute trips and it absolutely does not capture all of that other travel that is so important to be able to fully answer these questions. We didn't start our work by looking at the household travel Behavior survey data from Puget Sound Regional Council the challenge there as we tried to slice and dice it by income and raises that the sample sizes are very very small. And so that was part of what Christian was mentioning in terms of of being able to over sample a little bit and get some better data there because that data set includes all trip types not just commute trips. So as we move into the next days, hopefully we'll have more robust data from there and then we can do some intercept surveys and some other primary data collection to support what we're hearing through the Outreach and engagement to really build that much more robust story. I was wondering and myself also. Are you planning to do any primary data collection? Because I don't know. It seems like they might need that. We don't have specific plans are based on the feedback or hearing and I'm sure will I'm definitely not going to be supporting something that is inequitable to begin with. And so if we're talking about attacks, which is in my view not an ideal thing. I mean, I appreciated that you have a slide in and get you the exact give you my feedback. But I mean, I appreciated you putting this light in you. Nobody says that during activity and it highlights the the deeply degressive tax contacts that we are in but then if if we recognize dad is going to have all of this based on an idea that actually has been proven to be in it. For the most part, I don't know. What is Stockholm in London others have done. I mean if you are going to tell me that they did it in an equitable way. I would be very interested to hear. I will say though. On unborn one of the things that you mentioned in terms of discounts and those types of things. I would I would argue though that if you're coming up with the model of to make it a credible than it should not rely on household having to fill out a form or take some steps themselves in order to get the discount because data as you know, she was overwhelmingly. OP 10 programs are under subscribed. I am I think Sid getting around Equity United. I believe this is at least what I've heard from the mayor's office to as a top priority for them. And I think the reality of have something here in Seattle. It's going to have to be deeply I could have Bowl in my conversations with folks from both Stockholm in London in the past couple years about how they do it saw him was interesting because the society is so much more Equitable to begin with that the range of incomes within that Community is if you know, I think about the same amount of money that's probably can people take more transit for investing in transit, but I think I think fit the reality we need to really understand that that assumption I think is is an okay place to start but we need much more data because there are plenty of people That I can barely afford to drive today or not driving because they have a great choices and making it harder for them is going to be hot challenging. Yeah, I think that's the point about already the investment in public transit. The d-series have done plus the fact that they have far more progressive tax systems end of the tour length because they have a progressive tax system variable to fund public services in the way that the United States as a whole but especially regressive cities is attack cities, like Seattle have failed to do because we don't have the revenues and so they're also talking about cities where that not only is it, you know much less unequal the spider overall as much as I need anything but also that because of the much much more Equitable tax it system. There's already know by the time the congestion pricing policies put in place as already been investment in public transit as opposed to telling people, you know, working people who make more money to drive I'm speaking speculatively assuming that there are And who are forced to drive that pay now and then we will generate revenues to fund public transit in a better way so that you know five years from now you can start using the but you know, that's not fair. It's a completely different from saying hey we have we have done amazing Investments public land that you can use that now, so it's really up to you if you if you end up spending more on Dowling then that's your problem. You know, that's totally different in advance of the congestion pricing which is a beautiful model where you would get in hundreds of millions of dollars in advance of the pricing scheme is a question we have to address but another thing I want you can see clearly that when we get into this you were very close to being we don't have a proposal. We're not even anywhere near considering a range of things and yet we the public and policymakers. Want to get into that and I am so I don't want to jump too far ahead. Do I do when I just acknowledges some of the concepts I've heard they could addressing the concerns is that the price would not be flat but it could be based on the value of the vehicle. I'm so more expensive vehicle would pay more than less expensive vehicle. You talk a little bit about the vehicles that pollute more so, you know a Hummer would pay more than a Prius. And so they're there are there are tools that we could use again. It's it's premature to figure out how you would do that and what the impacts were but I think critically getting the Baseline data really understanding Cruise currently using our various systems and why they're using that and then how do we know my goal here is one around climate? So we got to reduce emissions. We need to get them to Franklin zero. I'm into around congestion. We want to make sure that people can get around or city in frankly. It's it's really saying if you choose to take transit or you choose to walk or bike. I want to make that the easiest Best way to get around and if you choose to drive because for a ride, but you live in a world. We have lots of options. That's a choice or take them then that's okay as long as it meets our goals, but we want to really minimize that Thank you for all of those common space Hi really nicely to the way that will close out some of this initial research so similar to what we saw in terms of income. We also looked at for a saint in the story is very similar the impacts that and not the impacts, but the the rate of people who might be impacted whether they are people of color whites or folks who didn't identifier who chose more than one One race pretty similar across the board. So again, this is a place where we don't know the magnitude of the impact still we don't have a great day. We don't have the final grade analysis to break out people of color in two different racial and ethnic categories. So looking at everybody as a single group we know is just one quick Glimpse at the start of this. But time to the strategies to advance an equity agenda. So what you are both hitting on is exactly in line with what we believe is critical to be able to develop an equitable pricing program. We're really focused on equity in three key areas. One of them is Outreach and engagement. We have to hear from the people who would be most affected we have to be able to collect that primary data and understand how people are traveling program design is the second of those and that involves looking at different geographies. It involves looking at pricing levels times of day and exemptions and then revenue reinvestment is another key piece Transit service of course would be a big part of that. But also things like free Transit passes discount programs more active Transportation infrastructure better Mobility information. Our goal is to design the program well for Equity outcome, so that things like exemptions and medications are less necessary. Couple words about potential benefits for public transit. So in addition to the potential for investing revenues in transit service reducing congestion also helps to free up Transit service hours and produces travel time for Transit Riders. And as was suggested King County Metro Transit Riders are generally more likely than the general Kane County population to have lower incomes or to have a disability. They're much more likely to live in a household that doesn't own a vehicle or to be over the age of 55. So, well, those are our sample data they do help to suggest that improve Transit service could have positive Equity outcomes. And then finally in terms of climate benefits. So again, we have not modeled yet and we did some quick estimation of potential reductions in vehicle miles traveled and greenhouse gases based on true Productions. How many trips might not be made by driving to develop these rough estimates the charge here shows the potential vehicle-miles-traveled production that ranges from 14 to 23% of the Baseline and that bass line is where we are today to 22 to 30% in 2035. And that is against the control scenario for 2035 greenhouse gas reduction estimates for those same scenarios are about 6 to 10% from the Baseline and about 10 to 13% in 2035. So we can see some significant reductions in vehicle miles traveled in greenhouse-gas emissions, potentially. So that is a very quick summary of a few of the elements of our early work Christians going to talk a little bit more about what's next question and answers of had so far, but I'll just go through them quickly. I wanted to emphasize as we've been talking about that as we move forward will be very focused on Equity both in terms of the Outreach process and in terms of Designing a potential program. Steps will be taking moving forward include more work on an equity strategy starting a public engagement process in the fall developing that modeling tool and doing additional analysis on potential impacts and benefits. It's a little bit more about that modeling tool that is going to let us adjust different policy levers and pricing levels to see the results of those changes on different populations. I'm going to let us try different times of day. For example, I'm Different pricing levels different Fleet types really any of the different things. We want to try to adjust we can see what different outcomes would be. And that's work that will be doing over the summer. And then this just going back to our house or where are we now slide? I'm thinking about doing engagement over the fall working with the Department of neighborhoods to design that process. So it's inclusive and comprehensive, especially given any potential Equity impacts. We really want to make sure that our engagement reaches the people who would be affected and takes their input into consideration as we move forward. Just a few comments. Some of them just two points that were made but some additional. Yeah, I would just reiterate that seems to me. I mean you obviously know better because you've been studying this issue in a very closely seems to me that we do need to do a primary data collection in order to get real guidance on who's going to be impacted unless we find a workaround with existing data, which you let us know. Of course, I would also like that when we look at those. We also need to take into account the fact that because of the affordable housing crisis more and more lower income housing at this point, you know, it's metal claws how fossils are used to think of themselves as middle class are now so adversely impacted the farther away your post from your place of work. I'm assuming Anywhere in the downtown dysentery the more likely it is that probably I don't know if there's a the data to show this but I would assume that the more likely it is for you to be difficult to take public transit. You don't because maybe you don't you don't have direct route takes longer and you can afford that time. I know of workers who come to u-dub for example, you know who work at the u-dub campus but definitely cannot afford to live anywhere close to that that live in Reno Kent and so on and so they do use the the the the sound sound sound sound frequency. And if you don't go home at a certain time, and if you think you're going to have to stay late for work near the drive-in, so those are real world problems that people face. So the farther away you are commuting from the more Likely, you will be impacted and that's Again by income because of the housing crisis. The other thing that I've heard a lot which I would really hurt you to take into consideration as construction workers who come and work and many of these sites. They will tell you if you talk to them and I have to talk to many of them. They will tell you that often. They are not driving is not an option for the job over there to that commute with their tools and they sometimes not sometimes they say often they have to go from job site to job site at short notice and that simply doesn't work out for them to depend on public transit and they will directly being battered and they will also tell you That they are already paying through the nose to for-profit companies that own parking garages. So already they are being you know, they're being there being exploited in that way. And then if you put a toll on them on top of that it will be extremely burdensome and very unjust and the other point of the make is that in terms of what what what metric we use to decide if we ignore if you are a mean if you're going to have to use some measure, you know by to decide who pays more and who pays less, I don't think the car Car make of the car or the cost of gari. I don't know how perfect how good of an indicator. That is. I think I'm much better medical income. I don't know how you would do that. I can see the problems with data collection, which is why I don't support congestion pricing in general because it seems to me. Although it is politically difficult as you have seen from an economic standpoint taxing big business and the wealthy households is a much better allowed in Stockholm London. All these cities have done that and so if you're going to follow them and congestion pricing, I don't follow them on something much more sensible, but regardless having said that I'm having recognized the date of difficulties in, so much better measure by which decide Equitable Equity another point about the cars. Is that Uber and Lyft drivers were deeply exploited right now by the Uber and Lyft Corporation. Do you have nice looking cars in newer cars? Because that's what that's a necessity for them for their business. And if this kind of congestion pricing is going to fall on the drivers and that will be quite inequitable. If there's situation I would just want to know the scores for the record that I strongly I'm fighting for and advocating for a little carbon Gold by 2030. I think that there are far more. The Thunder very very Equitable very just and far more sensible measures like taxing big business to massively expand public transit and I just want to take my all my reservations and concerns for the record. couple questions How does the mayor's office currently receive public support for congestion pricing? and I know you're not the mirror, but Been doing this initial analysis work behind the scenes and not we'll be starting our community engagement in the fall. And I think that's when we'll really start to hear how the public feels about this. And my second question is just going back to the other cities that have implemented congestion pricing. Did those programs achieve their initial objectives because I understand it when I look at those. It's for me. It's to relieve congestion to to reduce single-occupancy trips. Both to reduce CO2 emissions and then lastly to raise additional revenue for transportation Investments. Hopefully. Hopefully with the objective that we're doing it inequitable way toward minimize impacts to come use a color. So I'm just curious how those other cities that did implemented these programs. How did they initially achieve those goals that mean outside of the CO2 reduction that we saw? What are the things that I would say that but it's I don't want to speak directly for any of them and say absolutely yes, I think in conversations with them. What they would tell you is they did see movement in the right direction on their goals with the implementation of the program. They were generating revenues that they were reinvesting. They saw congestion go down. They saw a missions go down so so yes, but I think what's really important about all of those programs as they continue to adjust and make sure none of these cities are still operating the exact same congestion pricing program that they put in place a decade ago. And so it is really a continual process to to meet those goals and to ensure that the benefits are being realized and reinvested in ways that are Equitable sign a program differently. If your highest priority was emissions vs. Street space and congestion versus any other goals that you might identify. So that'll be part of the public. station as well a couple things that I want to highlight football calling. They're really appreciate the engagement on this and I appreciate your ongoing work on this. There's going to be out there so we can either work through this I I think fit as you mentioned any Jennifer you measure the beginning that this isn't a terribly efficient way to collect revenue and if we were just looking to collect Revenue, we would probably do two different when I think something else wants point. If I don't want to put words in your mouth that if the goal is to build a much more robust transit system and want to raise revenue for congestion pricing would not be the the tool we would use who would do something else in and we probably need to do that and you build on it. Yeah, but we also seen that for reducing congestion and frankly from my perspective at least the various models. I've seen getting to our climate goals. It's hard to imagine how we can do that without a tool like congestion pricing to change behavior and use the automobile and doing that little boy. I think our values are pretty aligned here, but it's really hard until we know who's using. So I just want to reiterate that. Exactly. I think I think injection pricing by itself versus congestion pricing combined with world class mass transit. I think they're two totally different things were talking about and so I'm afraid I can't remember the two years ago. We put the money in the budget or whatever you and 1/2 by 200200. Mm camera for the number was then I know last year there was additional money in the budget. I think million dollars for some more. Can I did that go with this report the result of of just the budget amount from from a year-and-a-half ago or was it augmented with liniment from last year's budget amounts with carried forward a little bit of leftover to start the modeling work. So and so is that million-dollar that and being used in the umbrella of congestion pricing from here on Ford still use a little bit of that to finish the modeling work and then develop a work plan and budget for that region engagement and for future Analysis work going forward. It. Sounds like that's not all going to be spending this year. We've been very frugal. And then we also want to Bloomberg award which complicated about support all those termed in dollars worth of support. Okay, how has that? Because that been helpful on the on the modeling work or have we figured out how to get the technical assistance is useful for us and we still working. The award was for congestion pricing as well as for some building energy work. So we're working with them on what the scope of both of those would look like. Crate and then I'm really I'm really interested in how we can get his robust a dataset as possible for the the question that I've asked multiple times today. And so would be really helpful if it's possible prior to budget this year getting a sense of what that modeling work is going to tell us and you know, if it's an amazing model and we have all the interest we need for the model and we're going to get great information. That's great. I can imagine us know we have a model but we have don't have a great day today put into the model and if we need to be doing more about survey work or intercept work or coming up with for the tea backing on PSR seized 8/2 sounds like we're doing now what we need to create our own thing. I would certainly love to at least be considering what the options are for getting a more robust dataset as we going to budget this year as opposed to waiting another year. I'm so I will reiterate that ass more formally, but would love to love to get some some feedback Maybe by September to see where we are so that can help him. I'm somewhere about your work going into the fall. colington Cafe Parkinson's from about any congestion pricing is disabled community members ability to use Metro access vehicles or any other options is limited admittedly at this point point and a lot of visible community members are forced to drive. So I think that has to be an important consideration as well. It's Brianna. So I guess I wasn't joking. We did spend an hour talking about congestion pricing. So that was outstanding. It's clearly an area of high interest and concern. I'm I'm excited about it and very concerned about at the same time. So, I'm appreciate your ongoing work. Look forward to the next conversation and colleagues. Again. Thanks for the engagement on this critical things that we need to figure out anything else for the good of the order then we will be adjourned.", "end_time": 7035.0}]}