{"format": "raw", "annotations": [], "confidence": 0.9488672126690155, "data": [{"start_time": 0, "text": "So good evening everyone. It's Thursday, June 20th to 9th 2019. It is a 6 p.m. This is a special meeting of a gender Equity safe communities new Americans and education committee. I'm council member Loadout on Silas. One of the Citywide Representatives at the city of Seattle Council and also the chair of this committee and joining me here this evening. Is it at council member Shawna sawant who represents District 3, which is the district that we are currently sitting in thank you for being here council member if there is no objection. The agenda will be adopted hearing abduction. Today's agenda is adopted. So before we begin it's customary for me as a Citywide elected official to acknowledge that we are in a particular district and to provide the District representative to give us a welcome to the district and some opening remarks. So I wanted to provide I can't remember still want as a district 3 representative an opportunity to provide us that wall command to give a few brief opening remarks to kick off our meeting and then I'll go through some Logistics and we'll go ahead and get the meeting started. It's my priority to start the process of hearing from community members at 7. So we won't we're going to write we're going to run a really tight show over the next 60 Minutes to make sure that we fulfill that commitment. Thank you can meet you in my office and I are meeting and I want to join you in welcoming everybody who's here as the district council member obviously, these are very important issues. I also wanted to use this opportunity to express my condolences to the family of Lowell Xing the young 20 year old black man who lost his life and clearly that is one of the tragedies that our community is connected. Dealing with and it's really important that we are here with the mayor's office Representatives as well and Department officials who will brief us on many things. But as I said, our main aim today is to secure from the community so really looking forward to that. Thank you. Thank you count supports before we go ahead and begin this evening is a John dad. I would like to thank each of you for being here as members of this community. I want to thank all of our Community Partners who've worked with us to bring this public safety conversation together, really appreciate all of you a special shout-out to the alliance for gun responsibility for providing us with both food and refreshment in the back of the room. So, let's hear it for the alliance. And there is plenty of food in the back. So please help yourself to as much food as you'd like and you are welcome to take home food as well. And whatever it is that is not actually consumed this evening. We'll go ahead and we're planning on donating that to a shelter in the area. So, please please please I take as much as you'd like and it and whatever is left over will make sure does not go to waste and of course, it takes a lot of hard work to prepare and organize these meetings outside of City Hall. So I want to appreciate the hard work of all of my staff who is here this evening and a special. Thank you goes to Cody writer and especially Roxana Gomez for my office for all that. They've done to make sure that we have a really smooth and comfortable evening and and conversation this this evening. So thank you so much some Logistics quickly. We do have interpreter services available in Spanish. Traduccion en espanol second is we have childcare in Spanish. For those of you who might need child care. If you brought any kids with you this evening, we also have childcare services available and you can find those outside the door as well. I'm not required to use them. But if you would like to go they are available to all right. So tonight we are here to discuss ongoing Community concerns about gun violence in the Central District in doing so I say I want to really recognize that this is of course not a new issue for the central district and it's not a new issue for us as a city or as a country. Sadly. We know that gun. Silence a knows no Geographic boundaries, but I find that it's incredibly important for us to Central this conversation in this neighborhood in particular who has consistently advocated for Concrete Solutions in his face and who continues to I believe bear the brunt and the disproportionate brunt of experience with gun violence throughout our city and it's important for me to make sure that we are here with Community acknowledging those impacts. And so I just wanted to take a moment to recognize that there are many of us in this room who have been impacted personally by this issue and there are many of us outside of this room who have been impacted by this issue you and the end gun violence in particular and I wanted to just take a moment to allow us to take a moment of silence to remember the folks and the Pea Who are both from this community and outside of this community who we have lost to gun violence and really reflect on how we are going to recommit here in this room together to keep each other safe and to work hard to make sure that that all of our neighbors feel like they are welcome and safe and moving about in this community. So if you'll join me in a moment of silence, I would appreciate that. I want to thank you all for that. So the goals for tonight are twofold first. We're going to have an opportunity to hear for the mayor's departments in to hear a presentation from them on strategies. That was their intended to address gun violence in the Central District that go beyond but also include law enforcement strategies the city departments include Seattle Police Department of Transportation City Light Department of neighborhoods Human Services Department Seattle Parks and Recreation and the Seattle office of Economic Development second. Our goal is to hear directly from Central District residents about the reaction and their thoughts about those strategies and any other things that they would like the city council or the mayor's office and her Department's to consider as we move forward. And we're going to go ahead and begin the agenda for this evening. I'm actually before the next part of me to ask if you're here is part of the first phase of presenters and asked me to start making your way up to the room while I do this next part cuz I want to minimize the logistics. Okay. So before we get started, I wanted to actually give Victoria beach chair of the African American Community advisory Council and opportunity to also provide us with some introductory remarks. I'm really grateful to you Victoria for allowing us to do this in collaboration with your ordinary meetings in this face. I really appreciate the the cooperation and the willingness to sort of bring us all together in the same space. So, thank you Victoria. well, I want to thank you for making it happen on Victoria BC Beach the chair of the African American Community advisory Council and I I thought it was important for us to be together because it's affecting our community and we should be involved in the conversation. I'm going to keep it short because I I want to hear from the community, but we meet every third. Thursday of the month at well. I'm not sure where I'm going to be. I think this is our last meeting here, but we need to come together as a community to help make a difference and it's important for our voices to be heard. So we should always take advantage of that and I want to thank everybody for coming. Thank you Victoria. I just really I wanted to share a quick story about Victoria and I really appreciate her commitment to community in these issues. She emailed my office last month wanted me to come to a meeting and I was unfortunately unavailable cuz I had a different commitment and Victoria was really upset with me. Just so mad at me and I was like, oh my God, I don't like it when people are mad at me. So I reached out to her and I and I and she immediately offered a phone call and and we had a really good conversation about how long she's been working on these issues about our Brinkley how tired she gets and how you know, she really wants to see something happen that is Meaningful because she care so deeply for her neighbors and this community. So I just want to acknowledge your willingness to get mad at me and then not be mad at me anymore and more importantly your service to this community and serving in this role is really seen and appreciated. And I hope you will continue to engage in this kind of community service cuz cuz we need you. So thank you so much. Yeah, of course. Because I wanted to add something really quickly. Yes. I just wanted to make sure I take this opportunity also to thank a few other people. I wanted to thank the community members many of them are year do they actually who came to my committee meeting a few weeks ago. It was just a few days after the recent Spate of shootings. Really appreciate you all coming and I see Emily there who came to my comedian talked about not only the recent Spate of shootings, but correctly being extremely concerned about the fact that in the current school year. There's already being a series of drive-by shootings and there's a specific problem that we need to address. I really appreciate that. And after that I appreciate the mayor's office also got involved. I also wanted to thank all some of my staff members dead bird on who are here and Nick Jones and also Adams and Kowski who's not here because he's on Parental leave, but who's being attending eastpak meet Community me? Kings and also the African American advisory Council meetings as well, but he's unable to be here, but I know you wanted me to best regards on. Bank accounts member. Okay. So why don't we go ahead and begin the presentations of these matters and I apologize for all the technical stuff we have to do because it's technically a special meeting. Oh wait, nevermind Victoria would like to add all of my meeting. We all want to be heard and I'm just asking that everybody is respectful towards each other and we have a list of here of our guidelines would please be respectful. Really really important. So we have a rule here behind us over here and we are in we are being hosted in the space. So we are going to make sure that those rules continue to apply and I'm going to ask you to help me make sure that we are all staying true and accountable to those rules so that the burden doesn't fall just on one person as we have this conversation. So the council rules also apply in this setting and so disruptions and violations of the council role will not be tolerated. And if you are disruptive in the meeting in a manner that is preventing other people from engaging in the meeting in a Safeway. I will have you. Rockin if you can read the agenda item into that record, I'd appreciate that agenda item one presentation of strategies to address gun violence for breaking an discussion. Thank you so much. So we'll go ahead and do a quick round of introductions of the folks to the left of council members want and then I will hand it over to a senior Deputy Mayor font. I believe is going to pick us off. My phone mayor's office. Rodney Maxey the deputy director of operations Maura broker I'm director of government legislative affairs for Seattle City Light. Thank you so much for being with us IW Mir phone. Would you like to pick a spot? Thank you for your continued leadership as chair of this committee and also giving us the opportunity to be here at tonight both the share some information about some of the strategies. We've been deploying in this neighborhood and we will be as brief as possible as we walk through a number of efforts that we have underway those tied to the mayor's approach holistic approach towards Public Safety and as the both council members Gonzales and council members so want to mention our primary interest tonight is to hear from you and make sure that we are fully capturing the range of Perspectives and thoughts and experiences in the community that we can take back and help inform our holistic approach that we want to be able to implement in this community as I when I refer to a holistic approach towards Public Safety. It really is as count as both council members have remark is beyond what is critically important but more than just fpds focus operations and tactical response to gun violence in the neighborhood at the same time. We are engaged in applying a very specific Place based Geographic based concentrated set of efforts knowing that given the vast majority crime happens and very specific locations. We want to be very data-driven and precise and how we're approaching the challenges that that you're seeing at the same time. We are trying to Marshall the full capacity and resources of city government so that we can apply multiple disciplines and mode multiple a To be able to address not just SPD related issues, but other community neighborhood specific issues that range from infrastructure to services and programming Economic and Business and Community Development. And when you'll hear quite extensive report on the range of things that we're doing right now as we speak, The other point that I want to emphasize is cited like meetings like this is that we are committed in the mayor's committed to an ongoing dialogue and engaging Community continuous feedback loop is the direction that we've given to our department of neighborhoods to develop a regular rhythm for which we can have this kind of dialogue. But at the same time as our departments are in the field that we are getting as much real time information back in terms of what's working and what isn't it where we need to make adjustments. So help us ensure that a hold us accountable for making sure that feedback loop is consistent and working for you. And then finally you'll hear a little bit about our efforts that are focused on what I referred to as going Upstream are strategies that in particular as a relates to use and young adult violence gun violence in terms of how we are deploying other strategies and efforts to focus on Youth and Family engagement and support. And where we can try to make it to the difference little further Upstream in the prevention side of the equation so that we can have longer-term impact on community. So with that we because this is so do you see how far we have PowerPoint presentation that we will walk through and and as we go through the the various elements of the work that we are engaged then we will go and rotate folks from our city government and our leadership up to the left. So I think we're going to get started for the council president apparel who represents District 2 has now joined us at the meeting and welcome council president. Chime in Gwinnett when you come late to a meeting, you don't start with opening remarks. I love you. Shut up you listen, and then you pick your moves. And so I think I'm going to being here, but I'll just look forward to the discussion. Has it passed through a couple of introductory slides. The first one is a central district neighborhood snapshot of some of the issues that we are hearing from from the community and Sarah Morning Star is here from our department of neighborhoods. And if there are any questions about how we are gathering this information, but through various surveys and Community engagement opportunities. We are trying to capture for every neighborhood in the city of sense of what some of the pressing issues are and I wanted to just make sure we highlight some of what we're hearing from Neighbors and residents not surprisingly issues of Public Safety housing and homelessness Transportation community and economic development are hitting our radar and I presume should be consistent with what is on your mind this evening. So if there's any questions about this and how we're gathering this information Sarah can speak to that little bit more later during her presentation. Next slide is the furthest to Debbie Chief car screen to speak to as it is that we are committed to data-driven effort here at SPD want to make sure we were capturing a snapshot of a little bit of data with regard to shots fired and see if if you want speak to this slide for a moment. Thank you what we call our shots fired dashboard and what that entails is counting the number of shots fired calls that we have and breaking them down into a series of groups. The first group is at what we call the shots fired group is where we go out and we can actually recover some type of evidence to ensure that it was a shooting so they'll be some casings and property damage and witnessed. It actually saw it and then we captured in the report that way the next portion. Did you see there is what we've had the non-fatal shootings has a shooting in which somebody was actually struck by gunfire. And then unfortunately, we have another block for a fatality shootings as well. So we look to count them. Try to figure out where we're going with in the different years as you can see we're up one from last year at this point in time, but down from several of the years prior to that. And while that looks good in a sense to me because we're down from some the problem is we're up and we're still having them so presents the problem right then and there that one's too many as we go through with this. We have had an increase in shootings throughout the city that were working with and we're dealing with but we're here. They're really concentrate. Hi to talk about what's going on in the Central District to another shooting is going on. So the real question I know that you want to know is what do I know and what am I going to do about it? Right? That's that's kind of where we're go to a lot of our shootings are what we call gang involved shootings. They're not necessarily what we would call gang shootings in the sense of that. It's one rival gang shooting at another rival gang for no reason other than the sensitive different game a lot of our shootings run around to where it is a dispute over narcotics or dispute over young ladies for the most part and two folks get into dispute. There's a shooting involved with that what we then she is we see what we would call a gang shootings after that is where members of those either those gentleman's parties now want to take it out on each other because they see it as some type of lumbridge to their game. So that's where we start to see the spikes that what we see with a lot of it. Central District, is it there shootings of opportunities? They're not targeted. They're not generally set up and waiting for somebody they're driving through an area and then when they see somebody to jump out of the car and I'll shoot and then I'll jump back in the car and then flee the scene. So they're they're little harder to deal with in that sense with the investigations and going on. Ultimately what we do when we we work with our federal Partners as well with the ATF to try to match the shell casings to so we can string these shootings together because a lot of the shootings the information we get at that point in time is I heard some shots fired. I looked out and I saw a car drive away. I can't tell you the color of the car the make of the car and I never saw anybody. So while we're never going to be able to put somebody in jail for that shooting itself. Generally what we do is we can gather a lot of information and intelligence about that. So what we do is we start looking at which ones are related to which and in those other one said related who was involved in that and then why were those people than into this other area? What were they? Who were they going after and how can we stop that fix that problem? There is a high level of enforcement. Obviously. That's what the main charges Seattle Police Department is to do is to go out and to put these folks take him into custody soon. Stop that shooting to stop the next follow-on to as well as we go and so we make are strides working with our federal partners for different things along those lines and then our own investigative needs to try to identify these people and then place them into custody before she takes a little bit of time to go through this a lot of times if we don't have the person on seen the other complicating factor in that is a lot of times we do not have the cooperation of the victim's. I thought we just had a shooting down at 2nd and Pike the other day very up close range. They know each other the victim will not tell me who did it. So as long as we as a community allow this code of don't tell if don't snitch just let these things happen or I'll go handle it myself. We're going to continue to kind of see these things as we go. So we work with the unfortunate Park what we've done in the Central District. We've added emphasis patrols into the area both foot Beach and bicycle Patrol. So we've had additional officers out there working. In fact of proactivity time when we're looking at it login for the amount of calls is up almost 25% in this area and that's really good news for me and make sure that the officers that were putting out there actually making contact talking to people seeing what's going on and make an arrest arrest for the crimes or what we're looking for. But what I'm looking for beyond that is how to generate a better sense of work with the community and to prevent these things from happening. So while we're out there we're doing a lot of that. I have the gang units working throughout the city and especially up here to the central district because we have traditional shootings at go on with the Central District in the South End their traditional old beats that are still out and about and we're still focusing on those as we go So we've got special 2 units up into the air that are working investigative process of deploying specialty unit into the areas for additional Patrol. I've asked the Traffic Unit to come up into the area different things like that where we can be more visible. We can be more seen and that if we see something then we can take some action as well as we work to that size kind of the of the enforcement part of it beyond that. We're doing more into the community as well. That's the other prong of where we really need the assistance and help the other day. We did a walk with some of the members of the in the neighborhood here and we'll all we do is we look for environmental designs that kind of lead towards try more things that we can do working with Arch City Partners to kind of make a little safer in the areas cutting trees getting street lights put back in things along those lines. So that's something we partaken and try to give our experience of what kind of leads to some crime or what can actually prohibits some of the crime going on. And so we're doing things like that out into the community with Community meetings because really what we're out. From the community as we're asking for the community to partner with us. We're asking for the community to let the folks know that you're doing this it it's not acceptable or asking the community to work with us to the one folks are out there doing this that we can bring those folks to justice as well. So we work with the community outreach partners because we know that a lot of these folks are just getting involved at the tail end of may not want to go down that path but they may feel that they don't have other options. So in the city shall wear the comprehensive gang model and what that is as we looking Folks at we believe there may be tangent. We involved with gangs are just becoming susceptible to that lifestyle where they're going to trip over into that life of violence. It is vocational schools. It is counselors Outreach everybody we can get our hands on the sit at this table and then we try to bring people in we say this is a person we'd like To look at Weebly could benefit from the program and then they're taking in their ass if they would like to participate in the program and it would you wrap around case management from it. Will there be substance abuse vocational training job training we're working at everything to see how can we get this person better at job just over broke right? We're looking for careers for people that can sustain themselves into healthy lifestyle and their families as they go on until we want to continue to work with. So, that's one of the big things that we're doing with it. These are going to continue a whole just a moment cuz council president Harold has a question in just a few questions on the Sol. I take my mother standing the different shot in a shooting as a shooting at a person as opposed to someone like shooting in the air just us a random shot or my we don't know what they were shooting at. It could have been a person that could have just been in the air that night. We had a gentleman come out of a nightclub and just fire the gun off in the air when the bouncer told him to leave someone, you know, when they're shooting at people. So the non-fatal shootings are the ones where we do know from evidence. It was at a person in the confidence in these numbers. These are aware there were shots and people called in 911, but I have to assume that there are times where there shots fired and press no one called nine-one-one and just wasn't complaining about I saw years ago. I thought Som charge where Maybe it's guesswork out her know that they talk about the percentage of of shots that are made but just no one calls in so you have no way of knowing about that. So, can you talk a little bit about shots weren't fired out there and they're just wearing a record of it. Maybe came in late or something like that or there's a lot of shootings or seem to be a lot of shootings become immune to them. Right? The people don't want to get involved to close the windows and they don't call 911 because they don't believe there personally involved in that shooting in some districts. Where is it in some areas cities where they've they've gotten acoustic gunshot locator where they deploy those in the city is the amount of shootings have gone up and what we really look at it that is that the shootings happen prison. It's just the fact that we're actually capturing dad and now that we didn't capture before because people didn't call in on them. Maybe thought it was backed by Maybe they thought it was at fireworks or something along those lines. So we do know that this is how this is what we can point to say. Definitely we have information of we do know that there are more that we don't have the information. How does this relate to in the Central District what they were focusing on this evening? How does this relate to the other districts to use? The legislative districts is example. Are they pretty much all the same or am I just for example this for to Howard this compare to that kind of these kind of this kind of frequency or do you know I've seen is a rise in gunfire in some areas that we typically have not seen some at where we hold steady. So we are closely monitoring that a lot of what we see. Is it some its transient find out where someone will come up here and shoot and then they believe that the opposing group maybe lives in West Seattle until then they'll travel to West Seattle actually do shooting back. So it's not really located in one area. What we hope to do is displaced those shots that they're not bringing. It is part of the material to ask you to give There was a rundown of locations in the Central District where some of the shots fired fatal shooting non-fatal shootings have been occurring and I was just you mentioned that ends in other areas this Behavior can be transient and other words for temporary in nature and geographic location. Would you say that in the Central District in particular that the issue is not transient meaning that it tends to be Geographic based and it's been geographically based for a long. Of time. We do have you know, a number of shootings in the Central District in the South End where we have two opposing gangs with each other and we're like downtown maybe more transient because of nightlife and other things along those lines. It's more historically stable with in the East Precinct in the south. Council member, that's a great Segways to the next slide, which is the Deputy Chief dark green is covered referred to as part of our focused SPD tactical response and less you see in the short-term strategies. Obviously, we've had some emphasis Patrol work in the precinct and he spoke to that earlier. I'm sure we'll come back to the deputy chief in the presentation as we mentioned earlier the mayor's commitment. So the holistic set of strategies as we're going to hear from a couple other departments that to the point that council member Gonzalez has mentioned we do we have been analyzing the overlays of where there is to the hot spots of activity and try to Overlay activity that is associated with physical infrastructure. Another neighborhood improvements that are departments can a can a deployment Implement physical change that can often help contribute to Environments of Public Safety goals and you'll see that we'll talk about some things related to barking and physical improvements right of way management issues here shortly. And then just a highlight be a little more specific on my earlier reference to longer-term Upstream strategies and engaging folks in a more strategic way. Our Human Services Department of Economic developments parts department Department neighborhood suda, playing a whole range of efforts related to use of opportunity Investments the use of family programming business and Community Development efforts will get into a little bit here shortly on the next light. I just want to make sure to emphasize that what we talked about before marriage commitment to be in the community and we have been here in the recent past as we've had a community-led walk with the Seattle Police Department. We did an SPD evening tour just a couple weeks ago and of course Roundtable discussion at Garfield as well. And again as I met, you know, I reinforce the point of that continuous feedback loop at finding a way to get into a rhythm regular engagement. So we're not just reacted to the issues that you're surfacing that we hold that relationship in such a way that city government of the community are in constant communication around the issues that that matter. So with that the next slide cover some of the things that deputy chief dark green already spoke to with regard to officer proactive on views and other specialty unit episodes speak to on this slide before we move on to f. Good evening. My name is Rodney Maxie and I'm the deputy director of Maintenance and operations for S. And I want to thank chairperson Gonzales and Deputy Mayor and as well as council member salon and council member hit Harold. Our role is to support this community. Our role is to support the city. The city council and the mayor's office and and helping in any way we can to help reduce crime the community along with the Seattle Police Department asked for a crime prevention through environmental design analysis. And that was done. We immediately responded to that and came into the neighborhood and looked at some things that we could do to to support reducing a conducive environment for any types of violence. We came in and prune the trees on 21st. We came in and prune the trees on Union. We let the street lighting back in we change the load zones. We're still going to that. We're still in the process of looking at some of the driveways that we may eliminate on to prevent traffic from turning around but still allow the businesses to be able to unload and load their goods. So we've been looking at things of that nature we've all Been looking at traffic calming. We're looking at any traffic engineering that might help the environment or might help the Seattle Police better enforce crime prevention. So we're here to support we're here to to to listen as council member Harold said we're here to do whatever we can for this community to hopefully reduce these unfortunate incidents. So starting with some of the other things that that we talked about in other other than the tree trimming and other than replacing some of the signs we've committed to looking at putting some different bike facilities at strategic locations around 21st and Union to help with the flow of traffic. We also are still looking at the hole Four door including the all the 21st all the way to Cherry and looking at some other truck traffic calming options. In the next life where we talked about our physical improvements in terms of traffic engineering as you know, we just recently finished several projects on 23rd Paving projects and reach analyzation in new signalization for the community from really from Rainier almost to the second phase. I think we'll be up by holy names. We have redesigned some crosswalks at the East End of Union and 21st. We're going to put some flashing beacons in that area to help pedestrians safely cross. We are also looking at sponsoring in demonstrating X or play streets where we close down the streets for the community and and remove vehicles so that the community can gather together and And have that sense of belonging and hopefully deter this type of criminal activity. We are also looking to do our Union project and some additional multimodal improvements along the union Corridor to come over the next 12 months or so. So, like I said, we're we're open to to any type of traffic engineering suggestions any type of physical right-of-way suggestions that we can change in terms of sidewalks Rhodes Street trees anything of that nature right now, as you know, we had a traffic count last year on 21st and Union and we only have about 200 Cars per day go down 21st that way an average residential street is about 500 to 800. However, we're going to do another traffic count next week now that the weather has gotten a little sunnier. The last traffic count was last March. So we will again will revisit that and check to see if there's any other things that that we can do in terms of traffic calming which I understand many members of the community wanted to explore so with that I'll be open to any questions. Okay, so, mr. If you haven't had the pleasure of being in one of my commute. Concrete questions around some things I like here. But what I don't like is that there's no timelines associated with when the delivery can happen or I just don't like the timeline. So so for example on the crosswalk issue related to East the side of Union at 21st and talks about how construction is anticipated as early as fall of 2019 miners Landing is that that project was supposed to be delivered sometime this summer I think in August or so. Can you talk to me a little bit about why the timeline is in the fall as opposed to sooner? Well, basically with my experience I'm with me we can put crosswalks in rather quickly. But when you add some of the other traffic engineering challenges like the beacons, I would say that doing the wiring and making the connections with City Light to set up the weekends before we actually put in the crosswalk is probably causing the Bit of that delay most of the other things that I talked about we have already done and we did rather quickly, but I would be again open to move to move in anything that you see would help immediately up on the the work schedule get going on them and work in collaboration with many of the Departments that you were to identify that are necessary in order to complete the project. And then I think of these are not insurmountable barriers to advancing the timeline and I've heard pretty clearly from community members that they're really interested in seeing these projects come to fruition is Capital Improvements in the space actually happened. I'm a little nervous about waiting until the fall to accomplish and deliver those projects. You know, summer is very Act. In the city of Seattle and and and I want to be responsive in cognizant of the realities of how summer can change the Dynamics on the street in terms of activity. So I would I would request that we take a closer look at that fall 2019 deadline and work diligently at seeing if we can do something as soon as I can absolutely do that. I think Deputy Mayor van will tell you when it comes to operations. I grew up in this neighborhood. So I take this very close to my heart. So we will definitely I will talk to my colleagues about moving these things forward. I think we had a question or comment we will certainly look at the opportunity to accelerate schedules and I hear you loud and clear in terms of the importance of the privatization here at the same time. I want to acknowledge a stout to work in the field throughout the summer as we've been carrying out a number of activity in terms of complimenting and supporting a concurrently spd's emphasis Patrol Patrol work across the city director Zimbabwe and Rodney and his team have done an excellent job and I just wanna make sure that he gets in tonight. So I also wanted to acknowledge all the work that the Department of Transportation has done already. Thank you for giving the report. I just said two things to add on modem is a question one is I wanted to let go by Jerry Gonzales all decide which has if the summer is the season when the community is most susceptible to these issues. It doesn't seem right to me to wait for any of those Milestones until the fall and a related point. It's from retrospective still. I think it would be good to hear something from you, which is my understanding is the community members, especially on the 21st section that we know the specific issue. They were talking about having reaching out to us. In the mayor's office since several months because they have experienced since the school year began. So I just wanted to hear from you and maybe also missed it. Song about what response and Outreach you've been doing over the months not just this last month and a half. Okay, as far as this. We've been involved in the crime emphasis from the start when the when the mayor and Deputy Mayor Fong and the police chief Carmen best brought this to our attention. We've probably completed 95% of the work in the seven or eight other neighborhoods including South Park Ballard Fremont Soto of the work that we originally signed on this this task and we continue to with the same resources in the same cruise to do the same things that you know, unfortunately the cruise that I have they put in crosswalks are the same cruise that have that have done that and these emphasis areas and every single neighborhood in the last 3 weeks the cruise that I have trimming trees the same and but we've also try to leverage our partners and bring other people to the table to try to get as much of this done to your point. Councilmember sawant we are deeply concerned about getting as much of this work done before we get into the heart of the summer because where we don't want any more shootings. So what I would just say to that is my managers have tried to prioritize and keep these things moving into each community and they're doing a good job there there. They know that the time is of the essence. Like I said in terms of the complaints before I'm not too familiar with very many complaints. in terms of of Transportation issues that we could do around crime prevention that came before but I can check again with my colleagues and and look into that and if there's anything that wasn't responded to I can assure you I will will make sure it will be responded to Yes, thank you. We have been approaching the summer with a far more extensive and exhausted exhausted after it around this holistic effort around Public Safety at the same time. I know the chief that for several months now Chief Baston members of SPD as well as members of the mayor's office and other departments have been having conversations around some of the heightened concerns related to shootings at gun violence in the in the Central District. I think that it's reached a point where we decided we needed to approach this not just with an SPD tactic responsible. If something a little broader and more extensive as it relates to multiple Department strategies, which is sort of what you're seeing manifesting now, but just marry of Arc To continue to engage with people in the district and we will continue to take that feedback into consideration as we continue to roll out different than a strategic efforts and will work with your offices. I'm I appreciate that commitment. And really do you want to acknowledge the work around making sure that this is holistic and not just as solely and squarely a law enforcement approach. I think again 1% of roaches are important for other reasons, but I think making sure that we are not looking at it through just that lens is is critical for for the long-term goals that I think we all collectively share to ultimately create a more stable permanently safe area for everybody who wants to visit liver passed through that space. So really quickly on the play streets and placemaking projects that could be sponsored by a stop this summer. Can you talk a little bit more about what the play Street concept is and what someplace making projects? So that's not my area of expertise, but I can talk to you a little bit. I mean the idea of play Streets or temporarily shutting down streets is creating an environment where you can bring community members and have events and safely closed off several blocks sometimes of Roads so that everybody in the community can come out of their businesses and homes in and get to know each other in a in a in a relatively safe environment. The programs are permitted through our street use section and coordinated. I believe with the Department of neighborhoods to get down to some of the intricacies, you know, I wouldn't do it justice because I'm an operations type guy, but I can get you more information on that or I could I would defer to the Department of neighborhoods Representatives that are in the audience. Turn a little bit later, but I appreciate that. I think that's a important concept. I do want to acknowledge that some of these shootings. In fact many of them happen in in that dark of night and early morning hours. And so well, I'm a big advocate of play streets and activating public spaces and generally so that we have more positive uses of that space also think we need to really acknowledge some particular of strategies that could be used around the peak hours of when were steam. According to list I have or anywhere from 9:30 p.m. To 12:24 a.m. To eat. These are really late hours. When a lot of folks are already sleeping. So I think I thinking through a little bit more about environmental design issues and practice policing strategies that can help us think through those those that particular complexity could be helpful as some of the issues as it relates to the next between lighting and Public Safety. Thank you. And thank you in person Gonzales. Attorney and counselor Swanton customer here all for being here City light as the municipal electric utility. Are there public safety roll is really in meeting the street light and public lighting needs of City residents and communities. And so we work very closely with the Seattle Police Department and the State Department of Transportation to make sure that were meeting those needs. Typically you have a street light every 300 feet, but were able to in working for the police department identify opportunities to add additional lighting Deputy Mayor van talked about the emphasis efforts going on. We've been to seven different communities and we did do did a walk here in the central district. One of my colleagues was there from the street light department in City Light and we have four four targets that were looking at the next light will be about the LED deployment Which Wich Is the broader street light department LED, which is light emitting diodes are brighter and provided cleaner brighter light and and help tremendously with pedestrian and and traffic safety as well. But out of another slide for that so which is there you can see we're done a tremendous amount of deployment already. The magenta is the LED lights and there still some decorative and flood lights and some difficult to reach areas. You can kind of see those are yellow there and often they were they were lights that were put in by private developers are others. So we work with them to stay one upgrade those but the public street lights are almost all the conversion was done back in 2013 2014. So we did some targeted improvements which were on the last one for those we were kind of tracking this 21st. And Marion were going to be looking at adding a light there. That one is still waiting a field survey. And then we are we are we have work orders in progress at East Union in West 22nd to add lights there. And then also at 22nd Avenue and Cherry we've got to work order and progress in that means it's it's going out to a contractor to be done. And then we're looking at Berkeley Court between Cherry and Jefferson. There's no lights right now and we're taking a look at what we can do what we can do their overall. We feel pretty good about the lighting levels particularly after the really great work done by our partners at s. Who came in and did a lot of a lot of trimming trees s. Trim the trees for lighting needs. We trim the trees for distribution. So are we really work closely on on making sure that we're doing what we can to to take advantage of our light? So we feel pretty good from a from a lighting standard where we are that said I want to talk about the third thing which is our rental light program. So we we do work with the police department on street lights for Alis and other public locations that that might not be part of our regular street light distribution and we work closely with the precinct leaders there from the police department on whether or not they filled additional lighting would be helpful from Public Safety standpoint. So we we take their Direction and then we coordinate getting the installation done and and and it just becomes a part of our system. If a customer service customer or community members want to add lighting we can present it to work with the precinct and and with us we can do that and determine whether or not that lighting is needed for Public Safety. If it's not determines need for Public Safety there still an opportunity to be able to do that lighting and we Parental programming week work clothes to we try to get any rental lights put on our distribution pole so that it's easier and cheaper for the customer and then we have a rental agreement that that we do, so that is an option as well for those poor people who feel that they would like additional lighting, but it wasn't deemed a public safety need from from the city's perspective. So and again, we we feel really strong about our important role in making sure that the public Lighting in the street Lighting in the city of Seattle has is doing what it can to help make a community safer. So thank you for the opportunity here tonight, and I'll be available here later. And also if you call anybody at city like we are very interested in and meeting your needs to to have public Lighting in Street lighting. That's that's keeping this community safe. Thank you. Thank you Mora on those projects that you identified that are that have work orders. Garrett Lee. When do you expect those orders to go from work order set installation? Yeah. I knew you were going to ask that and so we we have Rodney type but we've been doing this all over the city. And so I'd be very happy to give you a list of all the stuff we're doing instead of what that so I don't have that that specific time on Wednesday. It means so it is going out to a contractor. So that's but you're right. I don't have a date. Okay. Yeah, we shouldn't we can get that information. Before we move on. I just also want to acknowledge that City alight asked SPD said the council members appointed about our ability to respond and react to the fact that criminal activity is not happening. Just during the daytime. It's also a large part why Abby went out on an evening tour with community members to be able to actually carry out our infield analysis as far as what the situation was out in the field in order to be able to get a full feel of the Dynamics. So I appreciate the work departments are doing but the same time the community's willingness to engage has really at all hours of the day so that we can really be able to implement the kind of hold a whole range of strategies that I think so thank you. This is our pivot to the longer-term strategies that we have also been deploying and I just a polar next set of folks up from Executive Tanya Kim from Human Services Department Bobby leave from Office of Economic Development and then have the next to Media pieces. So I'll go ahead and turn it over to them to talk about some of the Youth Empowerment and opportunity strategies that we've been engaged. Good evening. So we're on round 2. So thank you for your patience. I'm going to try to give my talk keep it as brief as possible. I recognize many of you. And so thankful that you're here as well as thinking I'm Council and the mayor's office. My name again is Tanya Kim. I'm with the Seattle human services department and we're going to round out the conversation and go Upstream in the human services department. There are many things that we do for the community, but I'm going to focus on some of the Youth Opportunity starting with food. So at school will be out soon, and I'm on the table in the French and when you walked in and there were many handouts as well as a sign in and wanted you to know that I have some flyers that I brought them to help inform the community about free food that is available during the summer time and we work with Parks. I'm as well as many of you and to provide free food. What's good about the food? It's not just about feeding tummy's for young people. It's bringing people together. I'm kids and families, but it for anybody age 18 and under low barrier just come and eat with us and play with us. That is available again at the table as well as online the other with the human services department is we provide Direct Services some of you know about Mr. Services. We have our Upward Bound program, which is a national program and we're two different high schools as specifically for this area. Where at Garfield High School and also at Rainier Beach High School as well. If you don't know what upper bound is we work with high school students who would be first-generation meeting first to be in their family to go to college or access College we work with that young person for multiple years to not only get them into higher education but to help them to succeed and that's really critical to make sure that they cross that finish line. The other is our most popular program our Seattle Youth Employment Program and that City why but we certainly have a large concentration of young people who we work with from the Central District as well as Rainier Valley West Seattle and up north that program is dear to my heart. And when I was in working at a nonprofit, I had youth employment interns with us. And so it's 6224 low-income. Mostly youth of color that we I work with during the summer many times. It's their first job and we're providing the support services to get them there. We provide everything from Food Services Transportation helping to mitigate those. You know, I'm late. I'm stuck in traffic. I can't talk to my supervisor all of those basic things that we've experienced ourselves. We provide support for young people. Finally, I wanted to know that we also provide funding opportunities. So what that means just in plain language is we allow organizations to partner with us to provide those services that the community knows that are needed in in your neighborhood. We procure those dollars through competitive funding process these or some people know them as request-for-proposals. So we have a lot of them active right now organizations apply for funding one thing I did want to note. Is that where we're trying to plan for Our Youth Development RFP that is going out in the spring. So coming up so prepare get your ideas ready and look for those opportunities to apply for funds. So we provide food youth opportunities as well as finding opportunities for communities. Any questions for Tanya? Thank you Sonia Justin from the parks department. But I have a size the point of the the Nexus between Human Service department and the parks department here and why we have chosen to emphasize. This work is part of the holistic approach that the mayor has committed to is the during the summer months during out-of-school-time. We are trying to ensure that we are creating a positive activity and opportunities for our young people as possible and the connections between these two departments of the opportunities. They present throughout the summer is an opportunity to keep kids engaged positive activity as a as a deterrent effect really in terms of preventing them from engaging in perhaps less than a positive activities. So about to talk about some of the things that the parks department does but the Sweden portfolio things as the City offers. We have tried to be as comprehensive as possible in our communication and to the extent that questions about We are putting out into the field our folks here to speak to those opportunities after the discussion. So just go ahead and turn the Recreation services director and thank you all for being here tonight. And also thank you the African American advisory Council for hosting the meeting and specifically chair Gonzales council president Carl Harrell and council member swap for hosting the event as well tonight. I'm here to talk a little bit about the different programs that we have going on on your behalf with in the recreation Division and Seattle Parks and Recreation broadly. The first one is destination summer camp. This is a new summer camp program. I'm designed to really meet Annie that we saw specifically at Garfield Community Center and Rainier Beach where we didn't have a good saturation of summer camp has a patient. So this is an activity Camp meant to provide ease of access. We offer scholarships up to 90% of the registration fee and we still have scholarships available and slots available at both at Garfield and Rainier Beach for your participation. So if you know of a young person that's looking to connect with something fun and exciting to do this summer. Please encourage them to come to Garfield Community Center and sign up for the destination summer camp is that late-night type program, right? They hours between 9 and 12 when we know that some of our young people are out doing things maybe would like and so we provide a program Tuesday through Thursday from 2:30 to 8 at Garfield teen Life Center, which is adjacent to Garfield High School and then Friday from 3 in the afternoon to 12 at night and then on Saturday from 7 to 12 at night, so we provide a safe place for young people to come and congregate it's an age range of 13 or 14 scuse me to 18 years old that are able to comment access the teen Life Center to play games to my basketball to connect with a safe adult to have a conversation about maybe something that's troubling them and really connect with other people to really build. Strong community that we desire to see in our Inner City. Real quick. I also want to talk about Medgar Evers pool with maybe on a lot of your mind this to you know, what that the clothes are there in the remodel that's taking place. It will be open on August 5th. And so we're really excited to have that open back open for the Central District Community. Pratt. Spray park is also under construction that will be opening next spring in time for summer. So, please look forward to that. I'm Summer Camp starts July 1st are waiting pools and beaches open to Saturday. I'm please make sure that you're safe when you're out swimming and swimming make sure that you're swimming at one of our life guarded beaches. And also we offer free swim lessons at our beaches during the day and on the weekends and in the evening, so there's a lot of opportunities for you to be water safe around all the water. Do we have in our community? Also we continue to do ongoing graffiti removal, which is call effort. Sometimes. We have a lot of committed staff he want to do the right thing in or out their address in graffiti at practically as they can. We're trying to take a data-driven approach by where we where we if we know wall or Aspen Surface in a park is receiving graffiti on a regular basis. We have a route that were deploying our painting Crews to make sure they were proactively addressing to graffiti in order to reduce the presents in our community for the more we believe the activating public spaces is the best way to prevent crime in our parks. And so we had we partner with hsd on our summer food service program to create an activity during the day and then we also work with local musicians and artists to create more more sense of safety it or downtown parks in the end many parks are at the central area. An interest in addition to that, please you no, feel free to stop in at one of our for community centers. They are free to the public there at they often times. They have I'm different activities happening throughout the day. They have fitness equipment if you want to walk up and and and and and have a good time and reduce diabetes and Ed meet some people. So that's a great place to have to have some fun. And we also have some programs for older adults only isolated in this world. And so please make sure that you're connecting with older adults and inviting them to our community centers and we have a Siri found something and I'll be here to answer any questions. Thank you, Justin. Okay. Thank you and thank U City Council Members for your leadership and Deputy Mayor Fung. I'll keep my, short because all of you been listening for an hour now and so I'll just get to the point here wondering why is Waze office of economic about even involving discussion. So we both the previous speakers talked about the holistic human development and the Upstream part of this strategy what we provide we add the career development and employment opportunities for the population. That's a bastard other dimension that we would add it from our office at the same time. Does the Workforce Development strategy. In fact, we just laid out an RFP that we targeting the neighborhood here just recently in the second part is the supporting small businesses are named small businesses are really our best Partners in dealing with crying because they are out there on the front line. They see what's going on at the street level. They provide feedback to are police departments in all of our departments. So really there are Why is the years for the community so not only are dady important part of our Economic Development ecosystem, but they're really the backbone of our Civic infrastructure as well. So keeping them vibrant support stabilizing are small businesses important part of creating a healthy neighborhoods. And so the Small Business technical assistance focuses on the neighborhood and keeping them stable. The last part is I'm allowing Community Development activities to also accursed as a collaborative does going on now between different Business Association and neighborhood association and the goal here is to identify opportunities and risk and within the within the neighborhoods and come up with priorities so that we have a common Vision around how to make the neighborhood even more stronger and vibrant. I'll keep it at that level to pick up the time. I think a really important role the play we see that sometimes negative activity can occur around certain types of businesses. And I think it's important conversation for us to have about how we help businesses have been in the neighborhood for whatever. Of time to really understand the public safety impacts of of their business and to provide as much support and resources available to be a good partner to the city and to community in addressing some public safety concerns that could be generating part and parcel around particular locations that are businesses. So I appreciate your perspective here and I hope we can continue to have a conversation around how we can achieve that goal. Absolutely, if I can just make just comment on that it said if we don't stabilize small businesses and our neighborhoods and they close their shops than crime will go up there the eyes and the ears and importing gredients 100% agree with you and to the members of the media is important that when the word goes out about the shooting it will actually reduce food the traffic to these neighborhoods. So we got to be careful also in the way we presented to the public as well. Thank you. I appreciate it. Michelle Lee brought up about small businesses. I didn't especially it should be acknowledged add small but very small business is very small businesses owned by black community members community members of color in general have been so vulnerable to gentrification. I mean for Men for every small business black on small business that has found a new home in the Liberty Bank building and that's a phenomenal achievement for Africa down in the community. Probably 10:20 other businesses are being closed. I don't I don't know of any statistical study, but I'm just saying that so many businesses are are on a knife's edge right now. I mean as we speak my office has been working with uniform for months now, but it's not the problem is not going away with sell bike European cuisine on 12th and yesler but many other businesses in the whole 23rd and Union call Derwin who had a really hard time and we're also then when you go more South of Jackson, but still, you know in the city ID area that mean extremely vulnerable and I appreciate you making the point that actually all of these issues are interconnected and that the neighborhood as a whole suffers when you have these small businesses disappeared. I appreciate that point. I kept her Salon. It's it's certainly absolutely true that the issues that we're facing around lack of affordability gentrification and displacement certainly impacts our Legacy businesses in in in neighborhoods everywhere throughout the city and it disproportionately impact those entrepreneurs who are people of color immigrants and refugees. And so that changes fundamentally, it breaks the fabric of a community and a neighborhood and allows for other types of street-level uses to occur that make the neighborhood feel unsafe. And so I really appreciate mr. Lee your focus as the new director of The Office of Economic Development. You've really made a strong commitment to tackle this issue in to help us formulate a vision on how we can hold up support and really encouraged the entrepreneurship of People of color who want to continue to thrive as business owners or one enter into that entrepreneurship field. So, thank you so much for that. Our last presentation last but not least formal. Neighborhoods are Morningstar time the deputy director for the Department of neighborhoods, and I just wanted to quickly wrap up this presentation and talk a little bit about how the department of neighborhood is a part of this process. I like to Simply talk about it in three pieces as it is up on the PowerPoint. The department of neighborhoods has really been partnering with our Capital departments for some months now around doing continuing to do authentic and appropriate engagement with the community. So we'll work with City Light will work with us. We'll work with parks in LED and whomever else to make sure that Their projects their communication their time with the neighborhoods is what it needs to be in the languages that it needs to be in and at the time that the meetings needs to take place and things like that and and that is one way that the department of neighborhoods works with our partners and it's been a lot of fun getting into the weeds and and doing that work. Additionally. We have some of our standard Bearer things like our community engagement coordinator. So those folks in the department of neighborhoods whose job it is to be on the ground at the community meetings neighborhood Gathering things like that hearing what's going on in bringing it directly back. I'll say senior Deputy falling at the opening of the meeting talked about the community snapshots. Those are living documents that I know the council uses. The mayor's office uses. The other departments are beginning to use and those are much of that data that you can get online is information that Seether from You know tomography a demographic survey, but also what we hear when we are out and that is our job in the department of neighborhoods has to be out and sub to answer his question. That's where a lot of that. It comes from additionally we have the people's Academy for civic education literally teaching people how to engage and be in really tap into their own agency in their own advocacy and I think this panel here is as they were saying is is looking Upstream is the the more sort of I guess the whole the whole Community peace. And with that I'll just say This is also with the mayor's office was saying about addressing gun violence. But also what what needs to take place. In order to react to it having to happen, so we're not just how we react to it. And again, it's about place and community and feeling safe and feeling a sense of belonging and creating a sense of community. And with that some of it's just those classic neighborhoods program. It's the matching funds. It's the small Sparks. It's the night out the pay for those play Street and things like that. It's p patches to act as hubs for neighborhood Gatherings and boy if you want to know what's going on in your neighborhood just wander down to a Pea Patch date. They've been doing all the things and and again is us a piece of people don't always tie together. Like what is historic preservation have to do with crime. Well, how about if we protected some of our buildings and we had places that remind us of who we are and who we were and what we're about It creates a sense again of place and a sense of importance in a sense of Legacy whether it's a business or a home or an old building somewhere. And so that is what my department probably does every day. And it's beautiful to be here with Victoria Beach and Council and the mayor's office is a perfect example of what we do and working together to get these things done. So I may seem like Department of neighborhoods doesn't I'm not telling you what you know Street I painted or what light I hung up, but we will talk about how we how we work with our team in at Counseling in the mayor's office and in the community to bring everybody together. Thank you, Sarah. So that concludes the presentation. I'd like to move us into a public comment. And before we do that. I just wanted to give UW mayor and opportunity to give any closing remarks on behalf of the executive and then I know cancel present in her. I would like to make some brief remarks as well. I just want to thank the residents in committee members have come out tonight and that patiently listened to our our plus long presentation. I have asked our senior leadership and I'll ask the chief car screen. More Ruger and probably Maxi to come on back up and be part of the panel as we listen we want to be present and we want to listen to the feedback that you have for us and not just reacting to what we've said, but also other things that are on your mind to make sure that we're able to take this information back and continue to build upon some of the work that we've already The started so with that I will turn it back over to customer Gonzales. And again, thank you for giving us this opportunity today. Going to come up then. So if I can I just wanted to speak from the heart a little bit. I'm not going to sing. I did that this afternoon at a city function won't I won't sing this out. So at the end of the day that the active shooting someone with a gun in my personal opinion is a is an unnatural act of defiance and we can talk a lifetime about what went into that decision that impetuous decision of a person where the young or old to pull that trigger and being put themselves in that situation or to be in that situation when we when we start talking about that kind of harm and we start talking about stripes on a sidewalk or LED lights or things like that. They seem somewhat removed that I just want to impress upon you that as a policymakers a city council member. We're trying to look at everything and I'll tell you that when Justin talked about the Garfield teen Life Center, that's something near Dear to my heart because years ago my am I to two or three of my two of my kids they spent their Friday nights and Saturday nights at Rainier playing basketball in because I have a daughter who is actually the best athlete in our family. I asked a question. Will what about girls. What about where they supposed to go? Can they go out and and can there be mentors for them as well? Because they could find themselves in a bad situation as well this year as we look at the budget. I'm going to ask call the department has will the other council members that we can't stand screws control. We've come up with some great ideas like to teen Life Center, which I think we've changed lives. Is it possible that we can have some of the nonprofits that come from some of these demographics can this be a meeting place for them? They they meet perhaps on a Friday or Saturday night. Maybe are there mediation facilities a lot of the for some reason? This conversation so games like organizations clubs and I like being in these different clubs or gangs. Can we set up a a framework with some of our participants that have left that lifestyle and can we use our facilities for meeting places mediation conflict these kinds of things rather than just reacting. Can we really think creatively more and more and so that's the kind of thing. I think that the Department's the mayor and city council really going to try to push the LED LED lights is a good example. I don't know if this was explained to you but years ago, I went to a demonstration where the LED lights will the before the LED lights. We had these sort of yellow high pressure sodium lights and in that kind of lighting a a white car looks like a gold card is like a light brown car and the LED lights and they did. Los Angeles activate scenario could change the mood of an area is you an actual rendition of the color and so I push for that for public safety reasons, but just to activate it if a man or woman are in a car and I guess you don't know if they care about where they LED lights I don't think they're going to put the gun away. I'm not going to shoot here cuz LED lights of course not but we're trying to activate areas and try to make sure that our young people feel welcome. And so I want to impress upon you and I hear some of the stuff that stuff that you may think while man what's that going to change but we really are trying to look at a holistic approach. I want to thank the Departments and particularly. We really need to get out of cruise control and really think of new creative dare. I say just risky proposition to save lives cuz at the end of the day that is our responsibility to make sure you are safe. So thank you for the presentation. Bank accounts Frozen Darrell sure to add one more Dimension to the discussion. Obviously our next big agenda item is getting from community members. So I don't know proposing a discussion on this but I think you should be added into the framework that we are talking about and this is also actually in acknowledgement of the alliance for gun responsibility would have provided dinner for everybody and I'm signed up for that also about some of the point that they have may be making in their advocacy is looking at data from other cities and seeing if that is some sort of a guideline for Which Way Seattle or the Seattle region should go and what are the most fascinating piece of evidence comes from Oakland and the Bay Area as a whole and mixed it seems to be released. It's just a caveat before I I just wanted to court a couple of things from this article, but just a caveat is that area is also obviously as we know even before is the Seattle process has been intensely gentrify and I think I don't I mean I just want to say I would not trust statistics if it was if it said while the area is much richer much wider and it's safe for them and the communities that are old that I've always been vulnerable that I've always face operation of society. All the gun violence has moved that they have to deal with so we have to be a little bit circumspect about it. But what we do see so far as been quite interesting and I want to go over the statistics by which they ever use gun violence, but it is quite quite significant and I'll just go to quickly from the article but it says there's only evidence that local violence prevention strategies including a refocused more community-driven Gordon quotes ceasefire. policing strategy meaning not actually police coming as certified as a as a is a force but more as a community but having community-driven approaches have worked and intensive support programs that do not involve law enforcement at all. They were key changing contributing to the huge decreases and then the last but I wanted to read which hours of tremendous and purchase gun homicide rates for all Races have fallen for the drop was largest for black Bay Area residents of 40% degrees. I really think that we should be looking at what they owe how they were able to achieve and concretely see how we can adopt a dog for Seattle. Thank you. I really appreciate you bringing that example up. I think in Seattle where we pride ourselves on being the first and on the edge, but you know, we also like to steal good ideas. If it's good. It's good to take good ideas when other people have innovated around them. So I really happy to hear that you found that as a as a potential model an example here that we can cater for The Unique specific Community needs here. I'm happy to continue to have that conversation with you and perhaps maybe even make contact with some of those folks and Oakland to see if they can I talk to us directly about how they model that program really important for us to do so, we only have about 11 folks signed up. So that's about 22 minutes worth of public comment. So it looks like we're right on time to allow all those who signed up and to express that they wanted to speak an opportunity to do so. I wanted to close out kind of just said to dovetail on what council president Carol said. I want to emphasize that I recognize that environmental design on its own on its face is not it's not going to be the answer to all of the issues that are are facing us when we relate when we're talking about gun violence. And I know that there was intensive amount of work happening right now. There's a report this July that will give us a better sense of what kind of environmental design a project and you should be tackled for this particular geographic area. I'm eager to see that report in to identify some other ways that we can be working collaboratively to advance at some of those priorities. Obviously, the long-term strategies here is to make sure that people never have to make the hard choice of pursuing a lifestyle where they feel that they need to have a gun to protect themselves or to have a gun in order to survive or make a living one of the most impressionable stories that I have heard. I'm at the council member is at a town hall that actually the mayor hosted shortly after some of the national shootings that we saw and there was a young black man on the stage who said to us and I and I think I recall his age at the time was 17 that in his world a gun was currency it is how you paid for life. It is how you survived and that is that's wrong. It is morally wrong for us to be in a place where our children believe that a firearm is equivalent to currency. We not only can do better. We must do better by our future generation and we can't do that just as elected leaders. We are we are here because you you have elected us to be here and to be your voice, but at the end of the day, it's going to take all of us together to combat gun violence. This council president Iran mentioned what we're talking about is it just not the act of violence? It is people's sons and daughters and mothers and fathers aunties and uncles who are being taken from them and it is a traumatizing experience and the fact that we have members in our community who feel that there is no other option for them that is a product of years and years and Decades of of trauma, so I want to acknowledge that and I and I also want to again recommit ourselves to doing better by by each other and by our future generations and I am still hopeful that we can do that and look forward to hearing from you in a few seconds about your all's Collective commitment to join us in that effort. So that means I will go ahead and start with public comment just a quick overview of how public comment works again because this is a special meeting of my committee Levi Council rules apply, which means that every person who signed up for public comment gets up to two minutes to give us public, in order to get through the full list. So there is a timer up in front. There is a microphone right here in the center when I call out your name and your you should have a little ticket with the number on it. Come on up and tell us what your name is and then give us your public comment again, this is technically a council meeting. So that means a council rules apply, which means you have to speak to something on the agenda. And if you violate the council rules with inappropriate behavior or conduct I will have you removed. Okay. Let's go and get started. The first number one. I'm already to hear Garrett. My name is Omari to hear Gareth. And I'm not what you see I grew up as a dark-skinned white person as a quarterback for 8 years all the way through college half the college team that I quarterback join the Seattle Police Department. So I got an opportunity to observe about 20 to 30 police officers before they were police and after they were pole during their being police and after they were police cuz some of them I have to go visit at the Washington Care Center cuz they've had Strokes in the Bible I block then some of the others are preachers. Is there anybody in here with a gun? Is there anybody here in a gun? You see Dakota sign. Is there anybody in here that part of a gang that believes in the Code of Silence? My background is in science and physics and construction. now there's two things that are the problem here. That weren't even mention. When is the gun? I've been all over the world. Japanese police officers. Don't kill people. Because they have object in their hand whether it's a knife or whatever when I lived in London the police don't carry guns when I was in Africa. They don't even have walkie talkies in the stick. If you get into it with the police detectives belt off and beat you like a kid now you can fight with the police if you're right, but if you're wrong don't touch because they respect authority now, what is it going to come from? It was introduced to the Native Americans at the same time. Is anybody in here of Native American ancestry? How many Skins are all these people with Spanish surnames of Native Americans? They got crushed by the Spanish that came in first start killing them then they got defeated by the French and then they got defeated by the English. That's why so many black people have English surname. They have a school right across the street named after Indian killer and a slaver George Washington Thomas Jefferson. I used to teach school, but guess what the history they taught me was not true. It was a bunch of Lies Thomas Jefferson and George Washington Indian killers and survivors were not the champion of freedom and Justice equality what the problem is in the first person that I knew that got killed was one of my 13-year old schoolmates at mini Miller School when I was 13 by the Seattle Police Department. I think you have the next person up is Alec Zimmerman followed by Reverend Harriet Weldon. Is he High my my my my sweet dirty clown? Human garbage from Animal Farm put another 20 years and that's enough you'll be changed before we know change mentality of 700,000 idiot. Not mentally sick minority why to speak about gun? I speak about God I spoke about I spoke about. I want spoke about gun. I want spoke about gun before and I want smoke a gun and shoot and ask him if you'll be changed and I'll give you a classic example of a cup is government work. Yeah, and if I not find one honest man and government for the 30-year, what is I live in Seattle? So you give me 11 or 12 country days? This is exactly what they say I speak because you have low quality and I give you example don't interrupt me because I give you example you trespassed me 11 time for sale country day, so I cannot go to council chamber for 5 year because you are mentally sick people. Can we change you God? Mr. Zimmerman, you're done. Your microphone has been turned off and I'm going to ask you to leave. Mr. Zimmerman So Alex Alex Alex, can you be quiet and listen for one moment? You've already been barred from City Hall, but I'm asking you to stop because you're not going to be barred from anything outside of City Hall. I don't think you want that. So so I borrowed you going to City Hall if you keep talkin. If you keep talking you're going to be barred from even outside of city hall meeting so we're going to have to be removed. We're going to ask me what we do not have the force and there's a rule that says when you when you are ignore being removed, the repercussions are higher so be now on notice at the repercussions. Just got higher sir. And I made the record and we'll take actions when we get back to the office. And miss and Mister Mister Zimmerman you are you're asked to be to leave so you would need to leave the room now. Mr. Zimmerman, I'm not asking you to speak the more I'm asking you to leave. So because you can keep talking to mr. Zimmerman, this is for the record. So I want the record or float to reflect the fact that the chair and accounts are present asking to be removed. He refused to leave the premises at a public hearing and been put on notice and we will take the legal. We will take the legal action necessary for Hibbett him from attending these meetings, even if off-premise. bank accounts president Razor Ramon Arabic apologize for that. This is a serious meeting and we want to take your consideration of public testimony. So I apologize for that and thank you for stepping in as usual the strong woman in the room. Well, thank you. I want to thank you all for your presentation and especially think Parks parks with my babysitter years ago all my kids learn to swim at Madrona Park at you know, Madrona Beach, you know, you was there to rub 12 to 8 nice babysitting time. So they spent the whole summer all my kids spent the whole summer at Madrona Beach. Thank you. They all learn to swim. Out the parts. I would have just speak to the fact that you know, it's almost been a generation. Santa kids have been killed starting in 1990 all Epic guard feeling all around and it's been many of these meetings and I wanted to let you know the police have I have done some good III arrest in those days until Santa lot of people to jail. I mean to prison and so what we've been calling for every since long time ago is 4 cameras and a high-profile areas with a Sunset date. We've been calling for this ever since 2014 despachada, you know we to call for that to be able to see exactly where the shots are coming from. Are we also I with the silent War campaign and not mothers but the silent War campaign and family promise to do we have a partnership with the police on solving crime. I mean there is there is Tyrone love and we have all these other crimes that has never been solved. You know, when it one time we had the campaign on who shot me, you know, and we had some Billboards around we need to go back and look at some of this other things that we already signed off. Find that. What wasn't implemented old dip didn't have enough time out there. Meaning of the telephone number that somebody can call with a chip and all of those kinds of things. But until we get high cameras and high-profile areas people shoot people in the daytime cuz they know they're not going to get arrested because they know that nobody's going to talk or nothing like that. But this is almost a decade. This is almost a generation now, that's how much 30 years this has been going on in Seattle and I do believe it's the issue of class to me cuz class has something to do with this is why we have not solved all these all of these social situation. Thank you all for the cooperation. And I you know, shout out to everybody he was here and I think of this is what democracy looks like, but sometimes we have to cut it short and send some people outside. Alright, then Richard followed by Beverly Fletcher Robeson. Yes. I don't know if you have to see that comment speaker number for but nonetheless here it is. I miss Richard and I was born and raised here. And I know a lot of people have seen me around and I'm very unhappy with the circumstances at hand and I'm going to speak to this thing on tonight cuz I made an observation and it's the little foxes that spoil the vine. So when I was standing back there, I noticed that a detective cookie went like this with her hand and this stuff is going on across the country where they belittle us, they degrade us and we never seem to have enough of the things in the tools and stuff that we need to make it sometimes in life. So the Congress have to address reparations. Then we have Mitchell Carlos and because of a hundred fifty years ago, I wasn't around so how can we go back and fix this problem? Maybe you can drop from the earth and it'll be fixed. Some of you ain't fit to live in 50 die up in here. And you know, what you done already. Did your the scourge of the nation? And imma keep on speaking it until the day that I die. It was a requirement to read in high school the autobiography of Malcolm X. I couldn't even do it because I said, oh no, I'm scared. If I read this book then I had an epiphany with that man was almost like he came right into my room and spoke to me. So don't tell me you don't know nothing about why these black children are dropping off with a planet around here. Yes, you know, even before you called us into this room. You knew what you knew what you were going to do. What wasn't going to get Was going to get how they was going to get it and if they didn't get it what you were going to do. How are you looking at me now? I'm spinning around like the globe that you see this stop is world-wide what we going through and you better wake up in here. Next person is number 5 Everly Fletcher roofs in followed by number 6 anastacio done. Good evening, and I appreciate the opportunity to come here before you and listen to what the Seattle City city of Seattle doing regards gun violence prevention and intervention. I won't be as colorful as the prior speakers and I might pride myself on that but probably shouldn't the reason why I'm here is I am here with grandmothers against gun violence several of my grandmother's please raise your hands they're here and I have been with that Organization for the past four years. In addition to that. There are some of us including myself have been working in the South Seattle Community for the past year intentionally trying to understand what the issues are to intervene and prevent gun violence in that area. First of all, I'd like to represent the fact that many of the individuals who are committing these Violent acts are crying out for help are violent Cry for Help. One of the issues. Is there homelessness. One of the other issues as they are African-American males who are primarily not addressing specifically that these are the individuals that are getting killed and the reason why they are committing these crimes as well as being killed by them as they have no sense of value. And so what is one of the things that I want us to do is work better with a community service organizations. I work with On the Border Community passageways and I am learning so much about how these individuals are really seriously interested in working to overcome the past generations of abuse and the lack of a feeling of lack of a value. So one of the things that we talked about is looking at the city of Oakland and other cities who been successful and innovating and preventing gun violence there other cities such as Boston and And so what I want us to do is really be serious about having Community engagement and working in Partnership, and that takes us not just sitting here talking but actually actively involved I'd be more than happy to share with you my experience and ends participate in any way possible and some of you know, I have been doing that. So thank you so very much. I appreciate your effort and I look forward to us working together. Absolutely. I think I have your contact information here. So we'll make sure to follow up with a thank you for the offer. Okay will be followed by Rebecca Adrian. Thank you when I'm residents of 21st and Union been at all those meetings and I want to start by saying I really appreciate myself and my neighbor's really appreciate the mayor's team response to the violence that has occurred and in gone up recently. We really appreciate the engagement as as well as a lot of the action, you know, that that on those walks. We saw people a lot of the director heads Come Along on his walks and take action. Like you've Illustrated hear the question I have and I don't know if it's you know, if it's something that we can follow up on later is is there a process an exception process because we clearly saw actions being taken that are clearly within the silent natural process Departments of of all of the city departments lighting trimming all of that kind of stuff on those walks we saw We will be together all these directors leaders in their own departments saying hey, yeah, that's a good idea to do traffic-calming but directors and Bob we might not have the data at his fingertips to you note to follow the normal process of saying no traffic calming is important or are appropriate right for the normal process, but I think we have other data from our Police Department as well as other data from other cities that should fuel an exception. How can we make it different like some of you said and how can we make it specific that it should arrive in the summer and cuz we know we can do it. We know we can do traffic, We know we can do all of his activities. How can we help these managers as a leadership team? What is the exception process is if Sam Zimbabwe thinks he's got a collectively creative idea. Is there a formal process that can be followed so that it could be expedited because I know it is, you know, it is Administrative work. What is the Practical steps that those leaders can take to partner and say we I think we have the data we need we don't need another study. We appreciate the study. I'm all for the study but we don't we might not need it. Right and how can we take action? Cuz we need this to be different this neighborhood. The first slide said the same words different. We shouldn't need to peanut butter right? They should be okay for it to be different even simple things. You know that letting our departments do what they do best. So, thank you. Thank you. And AnnaSophia but Department folks are going to be here and the deputy mayor is also here. So I invite you to continue to emphasize that this is a priority for you all but I think this is part and parcel of making sure that we are creating this connection and and making sure that it's both urgent and sustainable willing to the Future to address the issues, please Rebecca and then we will hear from a Dan Sanchez. Hi, I'm Rebecca and I'm a parents and an educator. Sorry. I'm a little nervous. I'm a 13-year resident of the central area and I'm here because I heard and saw the shooter in a not gang related. Murder and it's giving me a lot of PTSD. And so now these recent crimes that have been in daylight hours and places for my child and I walk and bike are really stressing me out. I don't feel that I can walk to Starbucks. I don't feel like I can walk to the library and there's been shootings in a place where my child bikes regularly. And I'm sorry for the loss of those lives, but I feel our whole Community is suffering cuz I've been a 30-year resident of here. I am from the Bay Area and I feel like I'm I'm just I'm just nervous to sorry. I feel like we really need to address this in a couple ways. And when is that when I first moved in there was some gun violence in this part of town. I didn't live here then I live north and I heard that there was gun buyback programs. I'd like to hear more about that. I would like to hear more about how we can have youth involvement with more advertising of all your programs and all the places by thank all your stuff should be on a big board. How do you say and young people get involved? I mean all these things you're talking about. I don't know about all these things. And so I want to hear about them at all the places do all your neighborhood projects staff all these little flyers. I want to hear about them in the Bay Area. My mom was part of a community mediation program that has fostered a lot of these Community mediation things that you're hearing about so I would like to hear about how we can have a big meeting of all the groups that belong to the central area to Foster like a community grant writing workshop for the young people. Let's get kids at this grant writing meeting to talk about how to invest in these neighborhood projects that your other department is doing what is that the youth development program in the spring. I want to talk about displacement all these things have happened these three major shootings that have happened in my neighborhood four. If you count the one on East Union have been since there's been all this economic read of development the neighborhood meeting places are lost people used to hang out at the Red Apple Inn Community ways. They can't we asked a lot of people in the Redevelopment could we have farmers markets that has not happened. Can we talk with the economic opportunities The Economic Council and with the developers about having some other place for people to meet can we have Portables? Can we have little Community coffee shops to That are stop by the businesses that are displaced and then I'd like to talk about how can we have? A real voice through the community councils cuz I'm in the Jackson Place Community Council right down here by the Shell station and we don't have a voice. So can the mirror bring back the voice of the community council is because we speak to the people and we've been disenfranchised by the last man and the last I don't know. Thank you for the opportunity, but I believe in the mediation IDs and I hope that we can all address those. Thanks, Rebecca. Our next person is number eight Dan Sanchez and then number 9 & Eisenberg. Hopefully I can go off-topic just for a second, but it's going to wrap around about 15 seconds. So, you know whose families don't live here anymore. And you know, this is just not as there had about the a property taxes as a problem, you know, but here's how I know a lady on 21st. And Fir for house is worth about 700,000 according to the tax assessor 50% of the land but her lands worth about 350,000 now you can build a house in her backyard because it was just reasoned Builders will pay one-third of the finished value for the land. So her backyard is not worth 300,000 per $700,000 house is now going to be taxed assess had $1000000 50% increase there was a hardware. Turn Lake Union same thing happened I was taxed at a for a 20-story building and he had to sell the hardware store and pay the freaking taxes on it. So this lady's going to move now at 21st and Union cuz she's on a fixed income. So that's just one thing. I mean the city to me just for stuff like that up his own just take the money and then nod their head when I say, yeah, maybe property taxes as a prom date. There's a lot of credibility. They don't have Broken Window Theory think everybody agrees. Yeah, the Broken Window Theory is I think but we've decriminalized all drugs don't gang sell drugs as if that's the business there in right but with decriminalized what happened to micro police and everybody knows where the hot spots are. I love that store at 21st and you and I get my Teriyaki there. They sell crack pipes. I talk to police captain the other day about a cheap people got shot there the traffic calming at 21st. And Union is Lovely isn't that the street where they took the victim's from that shooting down to Cherry Hill? I'm not sure traffic coming helped or hurt that situation but that was one of the cars traffic is down to 600 cars, but that was one of them and I guess that's it. Stop living in your silos and stop creating groups that only convenient to meet the outcome that you want to have and let more people come to these meetings to stop letting departments. Just pick and choose who they want to have signed off on their projects. What percent is Ian? That's number 9 and then 10 is Angela Davis? All right, you know Eisenberg there's been a lot of talk about the crime prevention through environmental designs years ago. We could have stepped heads done and they were done in the matter of weeks at 21st and Union eye on the Southwest property and myself and the owner of the southeast property had been asking since early February for a septet and we don't even know what department used to be neighborhoods. We don't know who does it mean when you guys are supposed to be the experts we've taken down walls. We put up cameras. We put up lights but we're guessing we want something from the city everybody keep saying the septet is going to come and we have no idea and at the Union Market side of the street the family that owns that property has delayed putting up lights delayed putting up cameras delayed doing really anything waiting for the city to give us the septon that supposed to be coming and we just we don't know who to ask her to talk to and it's great that everybody's here. Everybody goes on these walks with us, but There's no real outcome. But actionable outcome that we is private property owners can take that advice and Implement your changes that will help the neighborhood. Number 10 is Angela Davis and then number 11 is Johanna colon. Yes, first of all, I can say I thank you all for taking the time to come out here. Imma try to be as brief as I can. I grew up in the Central District. I lived here from 1969 to 1976 with my mother. I moved back into that same house in 1989 and lived there until 2005 with my children when I moved in with my children, it was in the height of the crack cocaine error and on that block there was a continual 911 response which re triggered my Trauma from PTSD. At the same time there were brown and black people that I knew that I went to school with. Some of them went to the same day care same Community Center same child care that my children went to that. We're going to the juvenile detention center, which I also was an employee up. And at the same time the officers that were doing their job, they were having Brown and having black man laying in the street with guns on them in the front of my house on 22nd Avenue right around the corner from Ezell's now we have different people in this community and the identity of what this area represents I think also is a symbolism of how race class gender education and all of those things. There's a huge disconnect those that are able to navigate the educational system and be able to articulate what it is that they need are the ones that are able to be able to get it. So how do we assimilate information so that it is not so sophisticated for other people so that we can come together and have real Versation. I think that it is very vital and very crucial that we make it to that the everyday person that may not know how to put a complex sentence together to be able to talk about the same issue that we are in this room. Thank you. Hi, thank you. I'm going to get to the first point really quickly. We met I live on 21st Avenue and this morning the Key Beach and I and several people and Emily met with the mural artist who supposed to make them. You are all on Ian's property and it is the one thing that came up as a Seattle neighborhood group is supposedly going to do the septet and but we have no idea when they finish how then it's presented to the city and what the process would be to implement any of the ideas and that's up to so we would like to have some answers on that. And then I also just want to thank all of you for being here. I want to thank O'Shaughnessy want to talk office for having us at her committee meeting the mayor's office for coming out and bringing the department. To meet with us council member Gonzalez for having this meeting and Vicky Beach for helping at letting us be here tonight. Thank you. So that is the last person who formally signed up on a public comment sheet. Is there anyone who didn't get a chance to sign up for public comment who feels really inspired and would like to provide testimony to us now before we close out. All right. I'm so grateful before I do that. Let me go ahead and close out public comment. So I didn't see anybody else. Come forward. Did you want did you want to make a public comment? Okay, please. I am dick Rover Solon, Iowa track coach at Rainier Beach Community Center benefit dinner for 25 years and one things that you haven't heard about today is trauma for young kids as well as for impacted by violence last spring we had to track me to West Seattle 500 kids having a good time a gun battle turn out one of the families of my father's my track team was killed. Folks chart they were afraid they're frightened a year later kiss can't sleep. The family is torn Mindy my track for instead. Thanks Justin for helping I retract to make that a safer place, but people don't feel safe the idea that our kids are going through some amazing imagine your stuff that traumatizing and there's no I didn't hear anything today that really talked about that trauma other families are broken multiple generations of Brokenness and we can talk about how we heal the families at the beginning every time you have a shooting it's the person the family or friends the community and now the central area but she white folks we do things live here. I feel like this is terrible. I feel sorry that young lady woman said it I don't feel safe that's happened to Blackburn communities for decades hundred years. So our inability to create opportunity for dinner, It's really really poor is very little in the Shelf in the city. There's no Health Human Services problem that says when the shooting happened Rick and black community in that family and solve that begin to do that. We don't do that. Just got out of jail. I was just hoping the best I can get a job and something there's no drama. So now we're going to do those four things are really important that allow people to heal. There will be better service citizens of community. So I say that Thank you. I really really wise words around dealing with trauma and making sure that we have trauma-informed models, which is a really important part of serve a public health strategy to dealing with meeting people where they're at. And I and I really appreciate the push from everybody here to make sure that that we not only acknowledge some of the good stuff that we've all done together. But but also continue to challenge ourselves to do more and so clearly we have a lot more work to do in this space and I'm personally committed to continue to work with you all and work hard to dig in and I'm getting you to identify those concrete things that we can do and do it with a sense of urgency and I'm looking forward to working with the mayor's office in with my colleagues on the city council to continue to do that work on the inside as well as quickly on this up Ted report. I did get an email from the folks over the Seattle neighborhood group earlier today. 8 V. Somebody was supposed to be here today. There you are when you stand up so folks can see you sorry to embarrass you all. So my understanding is that they're getting ready to to publish a report in sometime in July. Is that is that correct? Sure, white what ya want you come up to the mic introduce yourself to everybody and and just maybe talk through when you expect to see that. I'm sure mother is terno cinza Gandhi associate director at Seattle neighborhood group and Linda span is my executive director. So we were connected to the neighbours at 21st and Union by somebody at s. Who said the neighbors want traffic-calming is a crime prevention method. We don't know what that means. Can you please help out? So Jules and Emily are connected with those books and met with a handful of the neighbors and talk about what SEPTA it is and what it can do and what I can't do. and offered our services to produce an assessment. They said they had asked for an assessment previously but didn't know if they were actually going to get one that there was some miscommunication or perhaps um, they weren't sure if somebody was trained in the East Precinct yet and so in there was a gap there and so we offered to step in and producing assessment and it takes us a little while we have to spend a lot of time on site many hours observing what's going on at all different times of day and night. We're looking at the built environment for things that support and facilitate negative behavior and we are very careful about what we recommend we like to talk to a lot of people also before we produce our recommendations after we make a set of recommendations. We like to start with community and I would love to do that in a community meeting. I don't quite know what the venue would be for that. But I am going to ask the neighbors what the best way and time is to do that and we will do that and probably Mitchell. And then of course, I will share it with everybody in the city who I have been in contact with over this set of issues. The document that we produce is just a set of recommendations. It doesn't have marching orders for any specific people. Although there are various jurisdictions that can step in and take care of different parts. So if there are any questions about that, I can answer at any time. So we're looking at July for an initial preview with Community around initial recommendation after that and then you'll provide interested parties including the folks sitting up here with a copy of a refined report. So probably sometime in August, I'm hoping it would be all wrapped up by mid-july or the end of July great. I'm going looking for person looking forward to receiving that report. We kick off our budget process at the city council in the third week of September. And I look forward to seeing if there are things that need resources and funding or if it's just policy changes or can be done with an existing resources. I think several of us up here committed to to engaging in that analysis. Appreciate you giving us additional information about that. Thank you. We have we have we have we work with several community-based organizations that engage with gang involved youth or otherwise criminal justice involved youth including choose 180 Community passageways and several others and you know that we're going to continue to support those organizations is trusted Messengers and conveners of those groups to help us interrupt & B Cycles of violence and ultimately encourage people to get out of that lifestyle or we're not pursue it at all. So, you know, we work it's really important for us as city leaders to not pretend like we know what the solutions are and what communities need and instead focus our energy on supporting community-based organizations that come from communities that aren't there are negatively impacted in this space to make sure they have the resources available to them to do the convening in the hard work that they need with the resources that are required to do this tremendous amount of works. Okay, so I think that is it for this evening. I'm not sure if I was able to answer the second question. And I didn't write it down. So I'm doing this by memory. Exception process. I'm sorry. I think that I think that really when were talking about this work. I'm not sure that we talked about it in the context of an exception process. It's really about prioritization and that prioritization comes from you know, I'll be frank making sure that community members or organizing and and collectively with a very strong and loud voice telling us what they expect to see him by when and so I would encourage you all to keep that pressure up and then do you know making sure that we know exactly what is a priority because you know, if everything is a priority nothing is a priority. So how do we how do we prioritize the things that have already been identified? How do we make sure that it's sustainable? And how do we make sure that we're working with? The mayor's office in the Department's to facilitate their ability to prioritize this work together and I think the fact that the mayor's office is here with all of his department at the same time is a very good sign that this issue has been prioritize. And that they are talking to each other in a manner that is multi-disciplinary so that we don't get into the silos and get into a situation where the left hand doesn't know what the right hand is doing. So and I want us to be too much for a marathon. But my sense is that that is a correct. That's the model that we're going to we're going to see from the executive here on your question. I think let's talk. Let's continue the dialogue and take it offline cuz I think I think I know the reference point, but let's spend a little more time engaging around the topic though. So As always has a government agency. There is a fair amount of bureaucracy and red tape that would have cut through sometimes and talking about sort of how we can make our systems more efficient to be more responsive is an important part of the style like so that is it for our items of business on the agenda. So we're going to go ahead and close out at 8:08 p.m. So we're going to go to the gym this meeting as a reminder. We have so much food in the back, please. Please do not be embarrassed to take a plate home. Whatever is not eaten. We are going to figure out our way to make sure that we don't need that so doesn't go to waste so this meeting is adjourned. Thank you all for being here.", "end_time": 7719.6}]}