{"format": "raw", "annotations": [], "confidence": 0.9456584469372074, "data": [{"start_time": 0, "text": "Scheduled meeting of the Human Services April 9th 2019, and I'm joined by a council member Juarez. Thank you for being here. We have one item on today's agenda. We will hear from Jason Johnson and Tiffany Washington where she from the human services department. Thank you. They will be presenting on the day. They have accumulated from the homeless Investments that the department has done over the last year. We held quarterly reports about 2019 to discuss the data, and this will be out for shopportunity to step back and see the results over time. But before we bring the pretenders from the table, we should have public comment and Nick Jonas's will be reading the names every person who signed up as two minutes to speak. Please keep your eye on neck to know when your time's up. All right, first time public comment. We have David Haynes. People are getting rich off of this report and it's very sugar-coated in general. According to this. We need an investigation into who is skimming contracts and doing what exactly I missed a modern third world slumlord managing The Villages, it goes from 1.5 million in 2017 helped a 255 and then the only help like 328 or something, but it cost for a point to 4:40 before point two million. Committee chair must investigate the races agenda that purposely bypass is all these innocent citizens while nonprofits are nowhere to answer for their egregious failure skimming as societal welfare to give me a social welfare salary acting expert Paula trickey racial and securely converted data to further discriminate against innocent sober drug free house list people always love you meme is treated as second-class citizen. Committee chair needs to stop using paid operative doing bidding of corrupt subhuman shelters providing a trade of accountability and integrity of inept and unqualified self-appointed politically-connected nonprofits and their Reliance on six figure salary donors working with lazy do nothing government employees playing the race card. It would be great if city city council and the committee chair dissolve all home.com and all the government and non-government agencies regarding the red tape administrative that is squandering billions of hard-earned tax dollars and you could use all that money to hire a twenty-first-century general contractor and an advanced architect and use the capital investment and other matching funds for a vocational education for Carpenters Union qualified workers to begin the Great American house and build out without fraudulent power-monger Housing Development Consortium and all of their partners in crime and I can go down the list. We need to have a. Bertha Landes meeting every week for the homeless hearing of what the hell's going on and have all these great like people that are participating in it show up solve. The problem is ongoing. After David, we have Alex Zimmerman and then Megan Murphy. Zipcar my daughter shooter and that's a garbage grass from manual for my name Alec Zimmerman. Is this your plan for cordless? I see this BS and you haven't done doing nothing about it. You could only reelection in socialism. So did not see my position very simple and I spoke about every time they go for the election 6 time so we can fix it every since it's our problem. It's number one. Number two. We need to open better room in City Hall. So people can come into our boys matter you Jesus. I keep this. No, it's not matter, you know people care so open Never suppose. This is very interesting sites. At least you are its number two number three. What is absolutely important right now to every month. Did actor of City Lights meet present so I can speak to her and it's almost Q&A. I talk to you many times. I want to know what it meant for many years and you always ignore it open. Conversation with every director in city, so every director can go in Cobb every month to report to see people have to urinate or you can talk in openly I do right now with C to lighten sweet why you never supposed to see cities is dirty Shepherd for six year. You never supposed to be in about director supposed to be spoke to do people every month like oh so you like business is doing Thanks for letting me speak. I heard Chateau residence are on things to Swan. I'm getting $5,000 each for a relocating which is not enough. We were at we were here for Holly song. I think it's called the trailer park and to be they have to start their whole regiments of Life over again, like they're where they're going to go to the doctor Heather going to get Transportation therapy. And it's there a lot of them are elderly and some of them have had trauma and I don't I think I'm Section 8 shouldn't be so centralized. A lot of landlords can't afford to take Section 8 ER won't and or the end is just too high to where people have to do with Section 8 vouchers have to be in like one building and I think everyone deserves the right to housing and do not be displaced, especially when How old are so? I don't think the you know, I heard that the company that owned chat. I was probably offshore and some like other country like China red. I'm not sure where they are, but they're owned by people with so much money that don't even know the residents that live there. And you know, I just I think people deserve the right to permanent housing safe housing and like Cher we all is going to get funded and I thought I think you should just be written that it's permanently funded in a lot of the shelter's, you know sleeping on a mat on the floor is really hard on people's bodies, especially if your elderly and I'm reading a book called the inner level that was recommended by Licata and you know Pete in an in an equal inequalities and is societies where this is what inequality that the standard of living is way lower. It's like there's higher levels of stress depression bipolar and a more equal societies that the health outcomes are better for Everybody so because then the people on the top don't have to be narcissistic in order to survive. So I think it would be really cool. If you know the Chateau gets a better day. I'm just really happened happy to be at the Chateau gets a better deal of share wheel is permanently funded. Thanks. Thank you Meghan. And as far as I know Cadence developer Jones The Shadow building is not an overseas company, but you're right. They are it is owned by a very rich people and they're actually being forced to know that then it's because the tenant organizing brought the principles of the corporation to uniforms them to meet with the tenants. And so I agree with you that $5,000 is not enough, but it's virtually unheard-of thing that the tenants at 1 and transferring the Section 8 is absolutely critical and we're going to continue working on that. Thanks. So if you could have the presenters come to the table, and we will start with introductions. And then as you all are settling in I just I was hoping that you can get it off. I was just hoping that when you do the introduction of the presentation you'd also just give us an overview of when do you need to help? How much is a flight from McGill if you could so I just wanted to get if you could give an overview on? The RFP process. I mean, I'm assuming as far as I know they lost out of fear. That was put out was in 2017. And so she could talk about what the thinking was for 2018 and if there's a plan for 2019 and also wanted to thank go Jason and different Tiffany for being here. I really appreciate it so far. This is the first time we've been this year. We've been able to get mr. Johnson here and we really welcome. And we hope that we can continue reading and future committee meetings as well. Edward own customers wants office Allen Lake Central staff Jason Johnson Human Services Department Tiffany, Washington Human Services Department. Thank you. Alright, thanks for having us. So we were asked to come and present Sean the fourth quarter data, which will include a full year 2018 of our homeless Investments performance data, and this is data that we look at every quarter and report back to the mayor to this governing body to the public so that we can it's a way of helping us stay accountable to the Investments were making but also how we help support organizations that we're investing in and making sure that there are successfully exiting individuals experiencing homelessness from their programs into permanent housing. So today we're going to walk through some of the key milestones. We also want to just highlight some of the 2018 performance and overall system performance and we want to focus on some Key Program areas and talk about the performance of those program areas. So I think this is this slide highlights a little bit of what you were asking your question about the RFP. We did not just land last year in a space where we had exits to permanent housing arrive into contracts without intention. In fact, this was a multi-year process that really moved us in the both the sophistication and the targeting of the level of data and the kind of data we want to look at and why so this really 2014 we were very much still kind of winter accounting. We were counting individuals or hours of service or some sort of bags of food meal served those kind of things in those are still important items to to count by through the results based accountability framework. I really asked us to look Deeper and to look at the outcomes and results that we want to achieve and finds the strategy in the performance measures that we're going to pay attention to that help us understand of Richie nose. And so just wanted to highlight that this has been a multi-year Continuum of getting some of our own thinking we have great experts inside of the department some deep engagement with providers, especially through the end shelter task force and the state of emergency homeless investment analysis. We did a lot of work with providers, but that we also had outside National Consultants help us understand how we could both track and report back information about our homeless Investments. And ultimately we launched the Pathways Home RFP in 2017 where we were very explicit It about our expectations that certain programs were able to show the number of people that they were moving to permanent housing and that's how we would be gauging success that we made it really clear that data was going to be a key component of our contract expectation. So we use data and decision-making in that RFP likewise. We continue to look at data in our in our contracts and that's the day that we're going to report back to you today. So I think the key messages here as we're making progress more households have moved from homelessness to housing in 2018 than in 2017. We are accountable to do people experience homelessness were also accountable to the public. We're working together with our partners human service agencies to improve program performance in potted positively impact more people experiencing homelessness. Likewise, we're changing how will report results in the coming year. We've been reporting on these results each quarter throughout 2018 and those results are that we've moved a total of 7428 weeks. Sorry, we've had a total of 7428 exits and these are this is an increase of 30% over the number of exits that we had in 2017. These are are a combination of 5627 household exits to permanent housing. And this also includes the sorry. I'm going to start over this this this number of exits is an a total increase of 30% over 2017. And that's that 5627 number will show the number of people that we invest in in permanent Supportive Housing. We also had 1801 households maintaining that permanent Supportive Housing. So we sort of consider both of those an important piece of data and understanding how successful either our emergency, you know, programming program Investments like shelters transitional housing. Free Housing diversion are performing but we also want to pay attention to the important Investments were making in permanent Supportive Housing to to show how we're able to maintain housing for those chronically homeless individuals councilmember Juarez and I were at a opening up a permanent Supportive Housing Development open fight eese just today and we talked I spoke with several people who talk about the important wraparound services that exist in those housing communities and that's really the Investments that we're making an into that kind of program programming that helps individuals maintain that housing without that important wraparound services without the kind of in Building Services that people who have experience homelessness for a long. Of time or have Conditions that make it impossible for them to work. These services are critically important and so we just want to needed to find a way to capture how well those Investments are working and we capture that is as is showing how many people are maintaining that housing because of those services. I want to also talked about in this is somewhat new information. Can you explain on what are the factors in an able to increase an exit to housing on slide 4 for the Native American peace and explain that so we've had a 87% increase in the number of Native American Native Alaskan households that have exited permanent housing likewise. We had a 27% increase in the number of black African-American households that have exited housing and we believe that that is because of our intentional effort in investing and programs that serve that population. So because of our it again, very intentional expectation that we've set for all programs to have a focus on on this population. We see the greatest disparities in the homeless. Elation for people who are native or Alaska native or who a black African-American and so it was through that RFP that we wanted to have a very intentional effort to both invest in culturally specific organizations who are already serving that population, but also we wanted to make it very clear that our expectation of all other organizations, even if they were white, let organizations that we needed them to help us really move the needle and helping to better serve. Population. I'm really excited about the data from 2018 and to see this increase and not just the numbers of people that we've been able to serve but that we've been able to move such an increased number of people through these programs in the Department of Housing and I want to thank you as well as Catherine because I know that she Seattle Club United in Insulated Health Board did the RFP together and that was the first time that all three organizations pushed forward together to combine it and that was something that was never done in the past. And then some of the resistance we got real. We've never done it that way and then it was well. Yeah, let's do it this way. And it actually that looks like the results proved positive and we kind of don't do business as usual. So thank you for that. You're welcome. I think it showed very valuable. Could you explain the different things that count as an exit to permanent housing like the different the different parts of that we're going to go through each program area and will be able to talk specifically in each program area what constitutes an exit so we'll go through and do that. Might not answer the thing that the thing that I was trying to get to sue like for each of these program are it's just different places that people could go and there's some programs have a very specific place but other people could go many different places and do count as an exit to permanent housing. So I was wondering if you could kind of go through all the different places that people can go in general. What are the housing is when someone moves from something that is time-limited that is temporary to something. That is permanent. What is non time-limited they did their they're there is no need for them to move. So that could mean that they move into housing as a lead, you know that they have their own least. It could mean that they're in permanent Supportive Housing where they do not have to move out. So there's no time requirement could mean that they move in with friends or family and those friends and family agree that there is no time limit to when they have the exit so that the key term here is permanence meaning that it is there is not going to become this. Of time when they have to leave like in transitional housing the maximum time that someone could stay in a transitional housing program is two years. Therefore. It's not permanent know going in that they cannot stay there forever in shelter. We really have a shelter State Target like 30 to 90 days. Do we know that that shelter is not intended to be permanent housing because the expectation is that they leave so when we talk exit permanent housing we're saying that they exit 2A. Situation and environment where it is non time-limited and they don't have to leave and then requirement I think maybe but I'm assuming we're you get hung up as where I continue to get hung up. Is that exits to permanent housing? It's not an intuitive word of it's a catch-all phrase by Hud to mean many different things. That's some of its definitions definitely need to be drawn out to understand the numbers like like. Correct me if I'm wrong, but when somebody gets a rapid rehousing voucher that counts as an exit permanent housing and then when that voucher expires, then that also counts as an exit permanent housing that comes in that counts twice in my right about that. Yeah, so there is some duplication in this exit number and so I think what you're trying to describe is that maybe someones and shelter and they get a rapid rehousing voucher that shelter I'm is going to count that person as exiting their program to permanent housing. So they're moving into a place where they have a lease and then the rapid re-housing program may be offered by a different program. They are after the subsidy and services and and after a. Of time which that individual is still in that housing without subsidy of services that rapid re-housing program is also going to count that as a successful exit. And so these exit number is there there is some duplication, but what we know is that, you know, we have unduplicated and I think we can go to the next slide. can I have before you go on to the subsequent slides and recognize that there might be duplication, but even without that or even assuming that I don't know what margin of error that presents but outside of that. Amanda's not the first time I'm having this question in this unit brought this up in the committee before but I'm having a bit of a mathematical problem and I've always had a mathematical problem. Hindi numbers look so good. What's happening out there? I mean the old is in these numbers are actually within a very statistics. Are we within a very reasonable margin of error? The only thing that the only story that tells me that if if I if I'm to take these numbers as statistically reliable than the only thing that explains the just ever-expanding homelessness pop music new people are becoming homeless. Are you saying that so many exist to homelessness exist tube housing happened and that and the same your new brand new people and on homelessness or people re-enter homelessness. I just know I'm just not able to square such an impressive numbers with the problem that are there in a minute. It's just mathematically does in a very much so as quickly as impressive as these numbers are as quickly as we're able to move people out through the Programs in into permanent housing. I mean are human service programs are doing a phenomenal job serving, you know literally tens of thousands of people in the homeless Services done yet. There are tens of thousands of people who fall into homelessness every year and so there is an inflow that far exceeds the outflow. So we are people are experiencing homelessness and using our home assistant at a pace that far exceeds. The number of people that are service system is able to exit into permit. We need to pay attention to these numbers. We need to understand the rate at which our investments are being used but it is literally the service providers as well as the you know, all of us an HST we under And that the system is is literally drinking from the firehose. I mean there is there, you know more people experiencing homelessness every year in Seattle King County. Then this current system these current Investments can keep up with I wouldn't dispute that at all. I have no I mean to leave without looking any any numbers. I think we could all be in agreement that the problem is getting worse because of other things not because of Any not because of Any lack of education on the part of service providers. I completely agree with you that service providers are doing a phenomenal job. In fact, they're doing more with their daughters than than you would imagine, you know, given the chronic problems with funding. That's all true. What I'm wondering about is just a scared of what you're presenting Jeremy needs. I just would not expect that much of I wouldn't have expected that the homelessness that we currently see is that so much of it is expected by new entrance this year. I know that some of it would be absolutely just add these numbers are so striking that if your if is the funds are enough to bring about these numbers then something is wonderfully. Right? And so, you know what I'm saying, and we are just the overall point you're making him just I just want to focus on the numbers are going to see that there are some program areas that are being very successful and helping people move through programs in into permanent housing. So you're going to see that enhance shelters are far more successful than basic overnight shelters, you're going to see that our investments into version have been really successful you're going to see that rapid rehousing Works were finding that the Individual to use Rapid rehousing are able to access housing and maintain that housing. And so you're going to see that the things that were investing in or the right things, but I I think you're absolutely right. There's a issue with scale here. Okay, so continuing on the the number, you know, we talked a lot about exits that is sort of our lingo that is is the terminology that is very familiar in this field is we talk about addressing homelessness, but you know in the human services department we feel it's also important to acknowledge that really were talking about people were talking about individual households were moving through some sort of crisis in their life looking for assistance and that hopefully the assistance that they're able to offer ends that crisis and puts a roof over her head in a permanent way. So so when it says 30% 1321 more exits to permanent housing and then you say households. So you're saying 1300 people. Not not as opposed to when you use the word households. That's where I get you have to let me go through it. Let me check. I guess a little bit of terminology. So we tried just Define exit for you. So that is a a program exit. So someone is exiting approach a household is exiting a program and going to permanent housing. That's what we counted to Nashville. It's a it's a household that could be an individual of wine or an integer. But you know family of four, okay, but we count that exit as by household if I head of household into the HUD requirements. Yeah, that's how we report the protocols that we received from HUD. That's very helpful. Thank you. So in 2018, we serve to 25420 households. So that is 7% more household served end in 2017. that Represents 30205 people so, you know we're talking exits and then we're trying to break that down to be you know number of unique households. And then we're trying to break that down two people served so you can see that 25000 number. Those are households that increases when we count individual people by about 5,000. So it shows that for the vast majority of the services that we invest in. We are serving single individuals but not every household is a single individual some of the households that were serving our families. Can I can I eat the the circle you're about to go to? How is that different than the than the first circle on the previous Slide the house like the 5627 exits to permanent housing here. How is that? What is that's obviously not the same number is here, but it would not different now lyrics to because one of the first one is exits and the second one is households. And so household May exit from a you don't we just discussed a a household May exit from two programs in a year. So they may use a shelter and then get exited to a rapid re-housing program and then exit to permanent housing account for those those earlier exits and how many of these break down to like, this is moved from a move from homelessness to housing or prevented from becoming homeless. How many of those are prevented from becoming homeless? And how many are moved from homelessness? And we had 700 for Unique household that were offered prevention assistance in order to maintain their current housing. So we have that broken down. This also represents just dive into those numbers a little bit more of that 3559 unique households that exited permanent housing equates to 5792 people and the 704 unique households that were prevented from experiencing homelessness equal 1386 people. So this is the exertive granule level of detail that we go into we do this to help us understand. How are investments are performing again? We really look at exits because we want to ensure that that that programs are moving people through their programs in the permanent housing. That's how we gauge whether those programs that we invest and I are working but we also believe that it's really critically important that we understand how many people are actually impacted by the investment and by the service being provided. So this is just to show sort of there's two ways that we will be reporting on these numbers presenting the number of households and number of people. This is new you'll see us continue this through this year. We have always found this level of information helpful, but it is something that we want to start reporting on again. These are individual. And so we want to go beyond just the are accountability and stewardship role of ensuring that programs that we invest in our successful and Performing are we also want to be able to talk about our programming and share that from the very personal level and making sure they were talking about the people that research ready programs. So now we're going to go back by program area. So this is a level of detail that we watch you through and in previous other quarters, and we're going to go program by program area and Tiffany's going to take us through through each other thinks so I just want to before we going to program performance just again highlight the difference between talking about how well programs work to the effectiveness of our funding. It's a tongue twister for me. My staff. Jason will tell me I'm new to this two years maybe and I am asking the same questions you guys are asking It's just sometimes it's difficult to understand and so when we analyze program performance or how well our programs work to move people to permanent housing, we look at enrollments. So this goes to Ted what you said each time. Someone enters a program. We want to capture that and each time. They exit a program. We want to capture that because if our system is working correctly. you know that one program can't meet the needs of someone and so if someone is enrolled in shelter and then they get enrolled in case management or rapid rehousing that's showing us internally how our programs work together to help someone ultimately reach permanent housing and that's What we've been the way in which we've been reporting to you guys to date what we heard loudly which Jason talked about before is the general public doesn't understand this they get tripped up on the same thing that you guys are getting tripped up on him if it's prevention, how is it an exit? Right or if it's this how is it an exit? So with Jason just showed you on this slide is really our attempt at looking at system Effectiveness and answering the question of how many people are better off because of our investments and so this will be what we use to help the general public understand. How many people is threat one how many unique households are served and so we have to do both an because when we report to you you want to know how are investments working? And then also how many people are better off. Does that help a little bit? So this is just a place that are also there's some Envy in here because I drew this so I put it up here every time just for bragging rights all the time here that you don't already know. The first light is prevention and prevention is successful when people maintain housing and don't become homeless, and I intentionally did not use the word exit here because it's confusing and so this program is successful when people maintain housing and don't become homeless. So what this data shows this is that in 2018. We find it new programs that are supporting cultural specific step provide culturally specific services, and we consistently serve people closest to experiencing homelessness with the use of our homeless prevention tool. What you'll see also is that we saw fewer exits in 2018, and we did in 2018 and that's because we find at 6 new prevention programs in 2018. And those programs needed a ramp up. And so we expect to see the outcomes for 2019 this year which will reflect a full program year of operations and give us give us a couple of examples of how are you in terms of prevention. How do how do we reach the target households? In identifying that they need help and I'm assuming you're talking about things like if there is an emergency Financial stress and they want to died over for paying the rent. I mean, she made things like that. So, how do I do the households reach out to you or how do we find them? So I'll take that I'm pretty sure I know the answer but I want to leave it open if I miss something that Jason wants to add I think that we find the people because the people go to the agencies that provide wraparound services. And so if someone walks into the y or into Seattle Indian Health Board and they say we need help we are going to be homeless if we don't get any help we use the prevention tool here to determine their risk of becoming homelessness. Like are they really really close? And if the family or the individual of the household is eminently they will be eminent and imminent risk of becoming homelessness. Then we use prevention dollars to keep them housed. Did I miss anything she want to know I think that's exactly right. I think that you know, we have Investments and agencies that have very skilled caseworkers and it's usually in a family's house was there trying to do everything they can to keep the roof over had to keep the lights on to keep food in the fridge. And so it is when they access programs and are having conversations about their financial situation about the realities of how they're trying to juggle all of this stuff that we can help them understand if you know prevention dollars can be a tool to keep them house. And so there are a number of agencies that do this work on our behalf the use of very targeted tool to sort of assess that you know, if there isn't immediate assistance, you know rent assistance made available to this household would they then have to use our Shelter Systems and you know, not everyone who Experiences extreme poverty falls into homelessness. Some people have natural Support Services. They can stay with a friend that can stay with family. They can ask friends or family. Were there jobs for a little bit of cash to help get them current on rent. And so what what are prevention dollars are really targeted at those individuals who do without this assistance they would wind up in a shelter and they would wind up using are much more expensive homeless Services tomorrow and this just to be clear because we also come back to this couple time. This is not to be confused with anti-poverty work or eviction prevention. That's very different. And so this part of my money only serves people who are at the highest risk of experiencing homelessness. It's not anti-poverty work. That's the other part of hsd's work in the Youth and Family empowerment Division. And I remember often times we go back and forth. This is Target. That's why that tool is used to It has to be imminent risk. An example of other programs that could be confused with this program like Direction and a property. So it's the example that won't that Jason just use that there are many people living in extreme poverty who have other resources or who find themselves living paycheck-to-paycheck or doing payday loans Unfortunately, they wouldn't when does tool assassin's them. They are at imminent risk. They don't have an eviction notice that would be anti-poverty work in terms of how do we get this individual out of the cycle of poverty living paycheck-to-paycheck experiencing extreme health issues that come with that level of stress. That's the greater anti-poverty work. It is not the this person is going to fall into the homeless system eminently so correct me if I'm wrong Tiffany Jason, but it's my understanding that you can somebody who receives an eviction notice may not actually qualify for professional or gas. Well, The imminent risk, which I can get you the definition of that for somebody who doesn't qualify for those prevention dollars that they would be turn to other resources outside of the homelessness and most agencies were people would go have those other resources. They would have like we need to connect you with this program in that program a no one wants to send someone away because they didn't hot score high enough on an assessment tool. None of the agencies want to do that. So they have other resources. It's not enough. But yes, we would have we would refer them. Senexon sorry that I've got two questions for you go first. So I just want to point out to the committee that the notes the trillion dollars for the Seattle housing assistance program. So this is a reminder that to $9 came from my one-time funds from the sale of the cop shop and that was a specific unique prevention program designed. It's new and it targets people on the Seattle housing assistance n s h a wait list targets people on that list to our risk for homelessness. I might say on average. It's slightly more expensive per client program than regular prevention programming but said we should see a first-year report on how the program is doing later this year. So I ask you questions about this. What is sometimes Staffing phones in charmsoffice. I'll talk to somebody in the imminent risk of being infected for not being able to pay the rent. Which is the best place to send them to access this money? I can get you that information. I don't have the list in front. I think that there is a 211 would you want to have that information we can get the full lists to your office so they can go to the straight to the source and get existence of a kind of go to for everything but sometimes I can. Sometimes have called us because I want a recommendation. So if we can do that directly that would be good. Then the other question that I had just about the numbers is the exits from the program and exits permanent housing if somebody somebody gets his voucher and they're good for and then six months later. They wind up not being able to pay the rent in their affected. How is that? How does that appear in these numbers? What would happen in these numbers in that the exits to permanent housing or the number of households that exited to permanent housing the total program exits are a mix of people who exited to permanent housing or somewhere else that we don't know of the second question. I heard was what happens if someone is it receives prevention assistance, and they're able to stay in their house and then Or not exactly they can apply again. Think they can go back and say I need to be run through the assessment tool. I met a man at risk of being homeless and they could potentially get assistance. Again. That's what I was hoping to Rose wondering about is how would that appear in the numbers? Like let's say they don't apply again and they wind up homeless. How would that appear in the numbers that time so there are five performance measures that we is it at the city and the county jointly look at returns to homelessness is one of those days so we could we could look at that data sent to give you that information. But it's a we look at returns to homelessness and and what that tells us is that someone use the program they were able to exit the homeless system and then they returned the permanent tax. It was not permanent. The dataset we also look at length of stay. So how long do people stay in the program we look at how full programs are. So do they have capacity for new individuals to come into their programs. So there's a, you know, we're reporting out a lot on exits to permanent housing for the city. We determined that that was going to be the key measurements that we were going to look at that was going to be the performance measurement that that would that we looked at to help us determine if our investments were successful or not, but we do collect other data through the homeless management information system that we're also help with the pool at the program level as well as at the system level so tired. I think your first question is if they received assistance and they stayed house where would they show up they show up in the exits to permanent housing if they that's where they would show up because they received assistance Network and it worked if they come back in they would show up in the return rate. I am just a reminder to the committee Department actually supplies the full range on all of the foremast measures each time. They report hearing committee. I we do Focus exclusively on the experimental housing, but they provide a full charts with each of their reporting periods. But for this time around were slightly delayed, so we will receive the full charts. I bleed soon as it's around 2% so it's low. So if it works, Give me the return right. The number of people who receive that first subsidy to stay. That's a 2% return rate of people who return. So next is basic emergency shelter this provides a safe space for people to sleep at night and it's a critical part of the crisis response system in 2018, UC we decreased the funding amount by about 800,000 as a result. We decrease the number of basic shelter beds by 296. We then reinvest it that funding into enhance shelter, which is proving to be more effective at exiting people in Department of Housing. So with the funding and bed reduction, even with that, we only saw 27 fewer exits to permanent housing compared to the previous year. So I'm going to say that because I asked because it was profound. So we reduced the funding by 800k and the number of beds by 296 and reinvest it that enhance shelter and even with that funding in bed reduction. We only saw 27 less exits in this program areas in the previous year. Enhanced emergency shelter. This is successful when people leave a shelter program in move into permanent housing in 2018 were a proud of the enhanced shelter achievements. We saw an exit rate. That's five times that a basic shelter. We saw an increase in the number of households served over the previous year and we saw an increase in the number of exits to permanent housing. I think additionally what's exciting is the rate of exit to permanent housing increased from 13% to 21% that indicates an increase in quality, which was a key focus of the RFP. Next we have City permit Villages Villages are successful when people move from living on the streets into a village and then from a village into permanent housing. In 2018, we expanded investments in case management mid-year for the villages. We also opened new Villages and added capacity and Q 2 3 and 4. The three villages that were opened under the path to 500 where the Lake Union Village Whittier Heights in true. Hope we also add a case management capacity at the existing villages with the hypothesis that increase if we increase services that will lead into an increase rate of exit to permitted housing and we saw that and quarter for there was an increase in the number served in villages as well as an increase in the number of exits to permanent housing over 2017. Just wanted to confirm the total program exits are greater than the greater than the number of total house. Is that explain by what you had said earlier just that exits are count the count of a separate from the house all certain is that explains that this will greatly exceed those exits to permanent housing most people use shelter exactly how it's set up to a 10 designed to serve individuals. They come through during a crisis in their life. They should stay for a short. Of time and then they move on and continue their life and for a lot of folks. We you know, they're at their exit sort of where they go to Soften unknown but these exits folks could exit shelter program and go to a transitional housing program, they could exit and enhance program and go to a basic program. So they could exit to a number of places that are not permanent. And therefore we still count the exit. We still counted that they left that program, but we don't count it as an exit permanent housing. The question Shasta was comparing it not to permanent housing exit but instead to Total household served. Yeah, so a person sorry. Okay, thank you. So the total household survey individual could exit a program a couple years multiple times in a year so they could use a program leave come back to the program. Okay, did that answer your question or use multiple programs in a year? They could use one program and then move to another shelter or use another program. And so we're still going to count them each time. They come and go this is a real life example why it's important to talk about program performance and then unique household because they answer different questions. So I'm just ending on the city permanent villages. We just I want to close with that while the results are promising. We are going to take a closer look at the role of permanent villages in our system which includes looking at both the number and rate of exit to permanent housing and the cost analysis. Rihanna followed you know, we had looked in Springs tiny house Village when you close your Mom first, and then I used to know the numbers on the top of my head. But I know that you have here that Villages are successful when people move from living on the streets into a village and ultimately move into permanent housing. We didn't get real good numbers out of that how many actually move to which we had to respond to to the community because I think we have like 84 people and then some of them did you have them great? I don't expect Ultimo. I mean, I mean, like I've said this before if people expect perfection in any program is a litmus test and we all fail. I just want to know what works and so when we look at that when you make when you wrote to send an ultimately move into permanent housing, I don't know what that timeline is a particular timeline because we had to but We had individuals that were perfectly happy living there that you didn't want to go anywhere else. So I'm and wondering how how we get over that. But that's why it's important to look at the rate and the number of its permanent housing because that's why we said while the numbers are promising so someone could look and say wow 33% rate of exit to permanent housing, but that's a hundred and thirty-five people and it's not and it's promising households. Thank you. See I still do it. You have to look at both and so we're going to dive down deep into how much does that cost in comparison to enhance shelter basic shelter because it's not until you look at the cost per exit the rate of exit and the number of households that exit until you can answer the question. Is this an effective program in pertaining to Lytton Springs what I think I heard you asked was there were people there that stayed a really long time and we're perfectly happy staying there. And so what we Found was when we had a close date and we increase the resources and we brought in Lifelong AIDS Alliance and different partners to do assessments and really work intensely with the residence a high amount of them did exit to permanent housing or permanent Supportive Housing. We had great success in transitioning to close that Village down. And so the lesson learned is that you need not just a place but you need intensive Services has combined to get an exit in Lipton was one of the villages that Unfortunately they did not have that level of intensive Services most important. That was at everyone came in with the expectation that it was going to open and close. This is the timeline everybody. This is what we're working with in this is what this is your end of the deal as well that you don't you're not going to live here forever and they were it's not going to be in Nickelsville it sits and then we're going to provide services social workers and safety. Yes. It was low barrier. There was some issues there, but it's some point. Are we going to get from you folks on the on the villages? What would be a good scenario of what you would want to shoot for like what a 6s look like I still don't know what success looks like for Village. We're working on that right now. Okay good. But thank you Tiffany for talking about the real life example of where actually if if if you provided what services that individuals need you can actually see those results and that's actually really important guideline to understand why it is that in some cases at work in some cases does it may not work? I think what we found there wasn't yes. It was about people not being sheltered, but we are finding that there are people there that were like being discharged from hospitals and dumped off. They're literally dropped off at from the hospital. With her medical needs are not being mad. And the people there were not supposed to know. It's a brick-and-mortar program it in and yes, it also happened at some of the encampments. It also happens for outreach teams are there so that they can help, you know, search and find the most vulnerable and bring them into a place. That's much more safe. You and Robert or I'm sure you guys have seen this he visited schedule and you know, it. It's very common for people who I've just had surgery and are too weak to move and actually need Continued Care just be literally like physically dumped on the sidewalk and It was it was quite a damning indictment of the healthcare system as a whole and it's in all of this is feeding into the homelessness problem as well does not just about the program that are able to do but what else is happening is charging a question do the investment amounts. They're also include Capital costs for villages. I can find out for you because we opened new ones. So it's really finding out if that's in there or not. And when we do that can we also include that the city didn't want to pay for some things and I member Sharon Lee had to get a private donor to pay for the showers in the sinks which seemed really unfair that we paid for some of the trailers for The Villages. Are we did we're going to take Okay transitional housing so is program areas to stressful when people leave within two years and moved to permanent housing in 2018. We saw an increase rate of exits to permanent housing but served fewer people so why there was a change in the quantity of people served we did see an increase in the quality so that goes back again to the rate and the number and so we exit 359 in 2018 opposed to 433 in 2017. But the rate in 2018 is higher, which means that that that speaks quality. I'm consistent with what has been reported previously hsd decrease the total number of transitional units funded and increase the number of units that were serving Youth and Young adults as a more appropriate intervention for this population. Next one diversion diversion is an area where we're seeing a lot of success. This is a one-time funding or services to help people move directly to housing either after a very short stay in shelter or by bypassing the shelter system completely in 2018 diversion serve more households and increase the rate of exits to permanent housing. And so one of the council staff asked about give me an example of diversion. That's the person that says I can move in with my aunt, but I need $500 to help pay for rent. That would be an example of diversion in this area and exit to permanent housing means that someone has left homelessness to a stable place either a permanent housing destination or temporary living with friends and Families. I think something that's exciting. Is that on HST partnered with King County all home and building changes as part of the diversion project which is training more than 300 providers across King County to use diversion building changes as dedicated $250,000 in Pearl. Jam home shows invested 750 in this project to be used for flexible funds. The flexible fun pool is managed by Africa town and can be accessed by any of the front door programs like shelter day centers Outreach and Villages. So we should see an uptick in this given this increased dollars and so I'm excited to see if Pouring this much money in this investment will result in more successes to highlight off and we think about diversion as the cash assistance that someone receives to move them from the front door of a shelter to a permanent or more stable environment. But diversion is really a strategy. It's a way of having a conversation with someone way of being helping an individual be really creative about what options they have available to them. So it is both the engagements the one-on-one engagement where I can explore with you, you know, where you able to wear it. Where did you stay last night? I know you were on your brother's couch. Why can't you stay on your brother's couch tonight? You know he got mad cuz I ate is ramen noodles. How about we buy some groceries helping pay electric bill and maybe helping pay some rent. If that were the case. Could you stay there longer? Yes, great. So make a call to brother, you know help that person. More options. I think when people are faced special when people are faced with homelessness. They are absolutely paralyzed and sometimes unable to do that creative thinking on their own. And so these really important prompts that case managers can offer an individual with the cash assistance to help out can be a really powerful 2. Ohm or seeing great success in our diversion strategy. So so diversion wouldn't be like eviction prevention because that eviction prevention is more emergency eviction prevention. You're not technically homeless yet. Yeah, then is welcome to the world of terminology. I mean visit this is how systems class in collide with each other to perpetuate poverty and homelessness. So just to answer that so add the case manager for me when I case manage. Young people coming out of the juvenile detention center. What was amazing for me is to be able to say to a young person because I was working in a system that require birth certificate social security card. They don't know how to get that when I could say I can pay for all of that. I can pay for your GED test. I can pay for your first and last months rent. That's the spirit of diversion. It's like quickly getting those barriers out of the way and not making them like go through in a whole bunch of system enrollment steps just to get $50 to get a bus ticket home giving someone an address correct. That's the problem we had with removable, since it was a catch-22. You can't have an ID cuz you don't have an address. What address does I'm homeless. You just like around and around and as Jason said diversion can be used throughout the whole process. There's not like you can only use it when you enter in shelter, or you can only it can be used at any time. Someone says hey I can get out of the system if I just had this. Well, I am happy to say that I thought the postmaster in one. What's up? I thought I thought the postmaster in one. Yeah, yeah, they would let a particular group use their address for anything. And I said no. I just want to miss being a lawyer cuz I couldn't see them. I'm a lawyer in my heart. So rapid rehousing is the next program area. And this is successful when people live in their own housing without ongoing subsidy and someone 2018 rapid rehousing improve the rate of exits to permanent housing to 78% up from 70 to increase the number of households served and had 680 next. It's too permanent housing, which is up from 476 in 2017. This is one of those areas where you all were asking about what works this this works? I thank you for that. I don't know if Dad wants to dead was informing me that we had a constituent call who had a rapid rehousing voucher with a private landlord. But and then faced epic addiction for not responding or for being a timer for not responding a time. I'm sorry, maybe you should clarify and if that's relevant here or not. It's useful to bring it up. so I got one thing that we all anecdotal it's not statistical like this, but I frequently wind up talking to people who have rapid rehousing vouchers that don't work for them because they then when the doctor expires I can't pay the rent or other problem or you know, any number problems that have to do with having a private landlord, you know, rather than the permanent supportive and Supportive Housing in that sort of thing the This specific case that is somebody who was evicted by their landlord and it sounded like very strange grounds for them to be affected on and because our eviction system is messed up they and they didn't have money for a lawyer. They want up not responding to the eviction in time. And then when they finally got a a pro bono lawyer agreed that they should not have been affected then it was too late and the judge rather than ruling on the merits of it said sorry you missed your deadline how it goes. And so then they were facing eviction said I contacted hsd2 say this was about to that came from the city through DSC. And so basically the question was okay. Here's a person who's about to become homeless because they're getting kicked out of out of this home if they were provided voucher. What can we do? And did not exact and that question still exist. What can we do? For that person you're speaking about the quality of case management. And so that is a tricky scenario, which is is the job of the case manager to ensure that where they're putting what wear this household or the individual is moving to is something that they can afford in the long run and so as a case manager people often say I want to live here, but the question really from case management perspective is can you afford that when the subsidy runs out also it's the job of case management to help that individual get job training or something that allows them to provide to to earn a livable wage. And so I say all that to say that is just one story of Minnie and if you unpack them at the end, it's a series of multiple issues that case management is designed to help kind of weed through so that individual does not in back the end up back on the streets. Yeah. I'm sorry to hear that happened to that individual what I love about rapid rehousing is it's completely Eccentric meaning that it's not a a voucher like here's your voucher for 6 months it is again like the version it's based on that conversation that a case worker has with an individual that voucher may be in place for a year. It may be in place for three months. It really is individualized to the person who needs some sort of short time or bar or temporary rent assistance while they get back on their feet and are able to pay rent on their own it also a rapid rehousing again, we talked a lot about the money but rapid rehousing is also services that come with that voucher. So it is the engagement the case management engagement that Tiffany was just describing it something that goes along with the rapid rehousing voucher. So, you know, the way the model is designed to work is that that individual if they fall into trouble there is someone for them to call and there is some Level of service at that person can lean on to ensure stability of that of of their housing it. Do you know it isn't successful for everyone but it is successful foremost. I don't remember the return rate, but it was single digit last time I looked and so this is an rapid rehousing is a program that has proven itself to be very effective for some household. It is not for everyone. It is not for an individual who has zero income. It is not for individuals who are likely to be, you know, permanently disabled and therefore on a very very reduced, you know limited and set income. This is really for individuals and families who have a you know One Time Crisis that occurs whether that's a crisis that impacts their health or their job. Were there housing and this helps them get back on their feet? So again, not for everyone, but for those that have been qualified for and deemed a good fit for Rapid rehousing this has been a really good responses program been around. It's been around for a while. I should say hsd is funded it for years. We funded it initially as sort of a pilot. We heard a lot about rapid rehousing participating in other communities and you know, we've been doing it maybe not calling it rapid rehousing but doing this sort of model where there is, you know temporary rental assistance packaged with some Case Management Services in the community 1214 West in less than a decade. ISO and thanks. It looks like the return rate was 3% in 2018 airing. I have to say Bloody Mary or the data people will get me. So just on this individual and I get that's an individual but I just want to be able to respond to him successfully sell the court-ordered in the sheriff has not kicked him out yet. So he's house at this moment, but impending homelessness. What can we do? I would encourage that you said it was I think critically important we connect with that person's case manager if that hasn't happened already. Which is which is what makes you faster than a contact But but so who in DSC can I call so I think the tricky part is that we're now dealing with like confidentiality. And so unless you can say John X. Then I can't all dese it really because that was called you and say this is Ted. I'm from council member. So I would like to talk to somebody there is an individual that is the summer program and then if you don't let me know and then that the contract an issue, but because you have that person's name, I'm assuming they felt safe giving you their name. You can no doubt that to DSC. Michigan so next is permanent Supportive Housing. This is successful as Jason talked about in the beginning when people remain housed in a permanent Supportive Housing unit or moved to other permanent housing what I would just say about this light is that we continue to see that this is an effective program to help chronically homeless people find and maintain housing. Question cuz no llores know. I have a question. So before we get us the next slide, so I noticed that. If we go back to the beginning to the great time graphic on page 7, so I just wanted to shoot a question about some of the interventions that are not in the presentation. So specifically they centers hygiene and then also which is not in the graphic at the top there but our Outreach Outreach programs as well and wondering if you could speak only to those intervention types. So exits a permanent housing for outreach-engagement is not a we don't have a contract goal that holds Outreach workers to exit people Department of Housing. So that's why it's not included in the presentation Outreach programs provide referrals to shelters or permit to villages. And I will get back to you on performance in 2018. I don't think I have it unless you do. And then day and hygiene centers again. Those are an important part of our system. And so if you really look at I feel like the middle part is all about the support So day and hygiene centers Outreach and so we don't put them in there because they don't have exits the permanent housing in their performance pay but there are critical part of the day are critical part of the system. So I do have Dan Heidi Center numbers for 2018. I'm just in terms that we have we have 15 shelter day centers that were serfs that receives city funding and in 2018 these days centers served over 12300 unique households. They just one plug here. It wasn't until this year that defy finally got one who the Mennonites and I'm going to push again for that Hay Day how you say hi and we have children but the Mennonite Focus for the men and that's all we have so I will be back at budget bugging you guys just so you know now will heads-up. Thank you. So I think this is the last slide but not the least important. This is about our 2018. Racial Equity goals. What's important here is as Jason said earlier. We saw an increase in both the number and rate of which Native American Alaskan native and black or African-American households in her housing the American Indian Alaska native households exits increased by 87% between 2017 and 2018. Black African American household assets increased by 27% from 2017 to 2018. And this increase is largely due to the new funding agencies that provide culturally relevant services to support goals. Thank you. Thanks again for your time. Again. This is a full year and the First full year that we had this level of data by program area focused on exits to permanent housing. I we've been sharing this quarter-by-quarter, but I think we've all been really looking forward to getting to the point where we have a full 12 month full year of this data. Again, we are really pleased we're seeing again that our investments have made significant improvements 30% more people exiting the permanent housing when compared to the year prior. We've seen a 7% increase in the number of people that we've been able to serve in this system and that really points to a level of both new opportunities to come inside. So we open some new shelter capacity, but also it it it signals that we're doing a better job of creating some throughput So that there are openings at programs that existed before and then most I think impactfully and most important to the human services department is being able to move the dial on some of the racial inequities that exist, you know, and so we're really pleased to see the numbers of Native Indian and Native Alaskan as well as black African-American numbers of people who have exited the permanent housing Co-op so much. I really appreciate you both coming here shutting all this this is very important one will be in touch with you. If something doesn't work out for the individual and also I would like to be in ongoing touch with you in terms of just like thing thinking more about it. No more than if there are questions on what they actually indicate as you said there's a lot of Neurology to make sure we are going to be understanding and then but before you go, I believe that had one question and then you don't have to go to go into in-depth it's fine if you want to end it offline, but I just wanted to make sure we go ahead and ask them for one of the largest areas of homeless spending is the navigation team, which is the presentation but So the navigation team their primary goal is not an exit Superman house. And I think it's important to Define when we say navigation team what that looks like because the the components of the navigation team are SPD. So specially trained officers its reach which is the Outreach and then it is field coordinators which rhsd staff and then Jackie St. Louis in August who manage the administrative side of it. And so when you think about exits to permanent housing the NAB teams Through Outreach primary primary function is to make sure that areas that are getting ready to be cleaned that Outreach goes and has a place for those individuals to go to and so reach is evaluated on the number of contacts made. And they're also evaluated on the number of people who go to shelter who they refer to a shelter and who go to a shelter that is the extent of the navigation team. You won't find once that person is handed off to the shelter the program responsible for moving that person in a permanent housing is the shelter. So outreaches like it's up a time. It's like this person is unsheltered. I'm going to ensure that this person gets inside and connected to a resource so they can move to permanent housing or navigation team is one of eight Outreach contracts that we have and Tiffany stated earlier. It is not an expectation of those Outreach contracts that they exit people to permanent housing we track some of that data but it is not a contract expectation that they show us or have or meet at Target of rate of exit to permanent housing. They're critically important. element of the the the service system it is those Outreach teams who are engaged with people who are living unsheltered and trying to connect them to services that provide a roof overhead trying to provide them a connection to meals to showers to those life-saving services that they need but exits permit housing is not one of those requirements that the human services department makes of any of our Outreach contracts when we talked to Homeless rights Advocates who described the work of the navigation team of sweeps and say that in reality. It's just moving people from one street corner to another and it's not getting them into housing if I understand correctly. You're saying that you are that I mean when is report when there's kind of when the navigation teams being Being promoted. It's promoted as something to get people into housing. But what I'm hearing from you is that that is not in reality. Those homeless Advocates are correct. It's just moving people from one place to another but it's not getting them until it is I would just say I would change the word housing to shelter. So the navigation team they leave every morning with a list of available shelter beds. So they understand that maybe Saint Martin de Porres has you know, this many bad stat tiny house Village maybe has this many beds that the navigation Center has this many beds available. And so they're aimed at getting people from an environment where they're sleeping under a bridge in a park on a sidewalk on a park bench into a program with his roof of her head and said, there's a shelter programs. We require that our shelter programs get folks into housing. So Outreach is definitely part of the But it is not it is an unrealistic expectation for us to consider that I could be out on the street need Allen have a short interaction with Alan and be able to get him into housing but getting him into a shelter resource is something that we do expect of the navigation team and our other Outreach providers people who are swept get into a shelter who are just to backup a minute there two different kinds. So there is General Outreach, which is we funded a lot of different agencies including the Seattle Indian Health Board and other agencies for the first time in 2018 to do General Outreach. The job of General Outreach workers is to beware unsheltered people are all the time and developing relationships reach does that as well the job of reach as it pertains to nav? Haitian team, so I just want to change you think of it as a good thing. It is our promise to people that if you're living somewhere that's going to be cleaned. We will not clean that area until we make every effort to ensure that you have a place to go inside and so it's not those are two different one is just about making sure that the navigation clean up side doesn't clean up and tell people have shelter the larger Outreach and engagement is about going to the same place all the time every day knowing the person coordinators with reach do a lot of important work and they do develop those relationships. And we also want we want to make a distinction between read me. I mean there may be different points of view about whether the sweep should continue or not. But we also a while we are opposed to this was my office also want to make a decision Without End of the social service providers who and Regent the bridge program is part of that which actually has MeetMe believe has value. We just believe that it should be coupled with maybe different kinds of ways in which people can actually be able to access shelter because what are the hours for many homeless people who have been caught up in sleep sack and again is that what's provided to them is not what works for them and that's why they they just keep coming back, you know not because they are adamant in any way they would like permanent housing and maybe they need support services, but it's not working out for them that just some Temporary Service still not working out for them for whatever reason. I just wanted to make sure that we have you make a distinction numbers. We don't have them here. But I think I'll end on this with the nap team just went through diversion training so that one time money that they can offer folks. They now have access to say to someone this area is going to be cleaned. How can I help what do you need and can provide immediate assistance in the same way that others throughout the system can do that we met with Jackie St. Clair for 2 hours last week and we've been having particular issues and I think the other side of the story needs to be shared is that in one area where we had 27 tents and we actually walk the area went out there our district director and unfortunately of the 27 tents in the individuals all in those tents not one person wanted our services and wanted shelter. Not one person. So that's the other side of it is that they didn't want it. So they literally went out there a times we were out there twice and you know, sometimes like you say, we we have to build relationships. We know that we have other areas in particular my district week is if they've gone out there off of Lake City Way Thornton Creek, I can name Aiden off top of my head where the real key to success is the individuals or organizations that are already in District working with those groups. Like we have Kelly Bryant North helpline. We have the the Mennonites at God's Little acre. We have our folks at Aurora Commons the people the Lake City Community Center in the Mennonites. I mean, we literally use these on the ground people to work with an AB team cuz you're right it takes two three four times to build that trust and then to get them in but does that make a story on any particular Channel? No. So but it is disheartening when you work really hard and we are out there a lot and we counted I counted up to 27 chance I go up there and Saturdays and not one person wanted any of our services. Because I think they end up going other places and then we see them again and again and so I guess my frustration is and I I like how you TWP it and responded that it's not the navigations job to find permanent housing. It's the Continuum of the navigation team finding those human beings and finding what their needs are building that relationship and then moving on to shelter and then moving on hopefully to permit housing and then getting them shelter and then addressing mental health issues or addiction issues or any of those kind of issues. So I want to thank you for the hard work that you've done. I'm meeting with Jacky for a couple hours was very eye-opening again. He's just he's just a wonderful person and I really appreciate his enthusiasm and his Humanity. So thank you. That's the way that's who we thank you for being here and I look forward to more discussion. I do want to say we we have to Precisely because of the success stories don't make it on TV and then you see very right-wing point of view. I think it is important that we shouldn't play into this narrative That Homeless community members are just refusing service has clearly the chili Society is feeling that made it is a social problem. And I think you need to have that land and if it does this is not working at something else has to be done and he and the main reason and I said this before but just to read it because this came up today the main reason my office is against us weeks and we know we're not alone baby. As dad was saying that there are a whole rate as a whole range of homeless and an affordable housing organizations that are advocating affordable housing and homeless Services don't accept spend on something that is clearly not working now. I mean that there are components of it like the reach component which actually need to be part of a comprehensive approach to homeless services, but clearly the sweeps are not working because I mean it's just evidence and I wanted to say that with an acknowledgement that ultimately it's it's it's political officials are elected official official that decide policy is not that it's all on hsd's shoulder. So appreciate the constructive work that is being done by the staff at a stitches diesel. Thank you very much. Do any other? Okay. Thank you Ellen also and getting a job.", "end_time": 5434.2}]}