{"format": "raw", "annotations": [], "confidence": 0.9617497815805323, "data": [{"start_time": 0, "text": "Good morning. Thank you for being here for a regularly-scheduled council briefing on April 29th, 2019. We have a shortage in which is good that I must remind you that we will have an executive session schedule for 10 right after this meeting and it shouldn't take very long that session shouldn't take very long as well real quickly. I'll just say I'm the full Council I will introduce and we'll hopefully it. Three resolutions at full concert today. Basically, I want to welcome our newest counseling accounts from able to check on to the table and three resolutions that will that pertain to that Edition one resolution will update our standing committee structure. Will Bay City council member check hose name will be in place of former council member Rob Johnson. The other one will update the President Pro Temp schedule and the other one will update our assignment to King County committees and Regional committee State committees in city of Seattle companies for 2019. also, I did want to say That many of you might have read that I 1000 pass last night and that's huge news for a lot of folks into a lot of work went into that some very happy to share that news with those that hadn't heard. Okay. Let's go around the table open till we have for today Cancer when she want. There are no items on today's city council agenda from the Human Services Equitable development and renters rights committee. The next meeting of the committee is scheduled for its regular time, Tuesday, May 14th at 2 p.m. I also wanted to invite council members to a community meeting. My office is holding along with the US Postal Service to discuss restoring the central areas post office as many of you know, there used to be a post office on 23rd and Union, but it was caught up in the Redevelopment and there are plans to bring it back, but there will be At least a few years and it's not very clear whether that will be entirely possible or not. But now right now there's a white spot of the central area that is a virtual post office desert and we've heard from hundreds. If not thousands of community members that this is a real problem. It's affecting small businesses elderly people and Working Families, especially if color and so we're hoping to see the US Postal Service build a post office in that area soon. The community meeting will be this Thursday May 2nd at 6 p.m. At the Garfield Community Center and I was just wanted to let everyone know that there is a small business called the postman on MLK and they have been a really useful service for a lot of people and they also agree that actually we need a u.s. Postal service in addition to that and as everybody heard of course that there was a very very tragic Accident that happened when the one of one of the construction cranes was being dismantled at the new Google Tower in South Lake Union and just wanted to say that our condolences go out to everybody who lost their lives including a student at Seattle Pacific University and two workers 1 ironworker in a crane operator. And also I think it's a it's an important opportunity to recognize how many of the the workers who assembled and dismantle cranes do it in at night because they want to reduce the impact on traffic also want is it a safety precaution? Because obviously if you did it at the time and a lot of people are out and about that is a bigger risk, but that also means that the workers themselves take on a lot of rest and this just brought the address to the light of day and you know where you stand with the workers and unions The Operators Union and the Iron Workers Union and also, Oh, I just wanted to let everybody know that the Ironworkers Local 86 is doing a collection for the bereaved families. And if members of the public are elected officials wanted to donate to that that I think that would be much appreciated and I will be sharing that for my office on the full Council agenda today. The Do-Right's utilities account about Menards committee has items as follows the Seattle office of civil rights director Lockhart confirmation is coming forward. We had two hearings in our committee to interview and discuss with director Lockhart her interest in pursuing the current position and he 120 this year director Lockhart. Engaged in a confirmation process that was designed to create greater transparency and engagement from SOC our staff members and socr Commissioners you made her call. The mayor appointed director Lockhart is in Iran in 2018, and the expectations letter from the council signed post be signed by myself and council president Harold has been emailed this morning for your review and addition we have on the full Council agenda and Ordnance related to the application of the herbicide. I'm as appear to treat invasive knotweed in the Cedar River watershed this ordinance allows for 3 additional years through 20 21 of limited sprayer spraying of a mouse appear with a goal of eradicating the weed. This is an extension of Seattle Public Utilities ability to two. Use this application that we have renewed every few years since I believe the 1990s. Items that we have coming up this week. There is an economically about mint District board, which is one of the psrc regional committees. We also have the regional water quality committee and items coming up this week in addition to committee assignments include the West Seattle Chamber of Commerce breakfast. I'll be going out on Friday to participate with schools in the Fauntleroy salmon released and also attending Friday Evergreen Treatment Services luncheon, and finally on Saturday will be attending an armed CVS 50th anniversary gala Friday evening. I should mention we are going to Deportes having a welcoming event at T5 format to thank you. Thank you so much. I've got two items to discuss first of all this afternoon from the financing neighborhood committee. We've got three items to vote on. When is the 2019 and wanted ordinance there were three positions that we're bringing forward for exempt status. And then we've got two appointments to the Pioneer Square preservation preservation board at least a day and Audrey Morton the next finance committee meeting. It's a week from this week to on Wednesday May 8th now also for Debora Juarez who's not with us this morning, but intends to be here this afternoon that she's got two items on the agenda. One is the appointment of Jesus Aguirre as superintendent of Parks and Recreation. We went through a lengthy search and Jesus says returning to us and the second is an ordinance related to a partnership between the Seattle Academy in the South Park Community Center. I'm sure you've been very much involved councilmember her both on that. And then on behalf of D5 this Saturday is the official opening at the Aurora pedestrian bridge and council member Ward says that we funded this project to beautify the bridge for the community and add lighting and she wanted to thank the Aurora licked in Urban Village for leading this project. That's why I'm mascara. Good morning. Are there are no items on today's full Council agenda from the housing Health Energy and workers rights committee. The next committee meeting will be on May 2nd at 9:30 a.m. The appointments of to the labor standards advisory committee will include will hits from Teamsters 117 J Gilmore from optimism Brewery and Marilyn Watkins from Economic Opportunity Institute. We also have the chance to discuss and hopefully possibly vote on The Office of the employee Amba director. We send questions around two weeks ago. We received your feedback on those questions. We sent those to dr. Khan for her to fill out and we should be able to circulate those back to you all on prior to the Mets seconds. I hearing for you to wait and take a look at we encourage you to join us again really excited to see that this included participation from the interdepartmental task force fields from the silence Breakers and folks in the front line who work at protex 17A War involved in Process and excited to hear the answers to the questions. So thank you all for submitting your additional questions also have the hotel workers industry standards on our agenda and almost every meeting over the next three or four months here as we work towards. I'm coming up with some legislative Solutions. Thanks to all of the office is involved last meeting we heard stories from the workers at Unite Here and this time we'll have a chance to hear from some of the hotel industry folks who are also I'm laying in on the various drives last we will have a Fort Lawton plan and land-use discussion. The legislation has not been sent down yet, but we will be getting a chance to get a full briefing on the proposed Redevelopment plan and legislation. That is forthcoming and saloon. Later this week. I will be scheduling a scheduled to attend to two or gay City. This was part of our District 3 tour that had to be rescheduled then really excited about doing that also want to make sure that we get a chance to celebrate our newest colleague on Thursday. So I may be rescheduling that so thanks in advance our folks at gay City and I'll be coming this week no matter what but I'll just take a quick second to acknowledge our incredible person Miriam who works at the office of housing. It is her last week this week and she is the deputy director will be honored to honor her on Thursday this week is this is her last final week, but given that this is her last full briefing before she takes a leave of absence. I just wanted to thank Miriam for all of her incredible work on that. She's done and and look forward to working with her and her next iteration. Hopefully back of the city and I want to give you guys a heads up. We're going to be having a work session on confronting harassment and discrimination best practices, especially for public employers as we work on addressing worker needs as we think about how we respond to the me-too movement and when individuals especially in rank-and-file speak up how we change. Our public policies are institutions are this will be held at the University of what are near the University of Washington University Friends meeting place at 4001 9th Avenue Northeast from 5 to 5 from 5:30 to 7 p.m. On May 8th, Washington Post doc members of the of the University of Washington Husky way W 4121 experts on harassment and retaliation and discrimination who are also researchers and our friends and representatives from the University of Washington as well. Hopefully Will be able to give us a synopsis of what they're doing to address intimidation retaliation. I'll be speaking up as well about some of the work that we've done on the ivt and the resolution that you all passed last week, which was Revolution 3187 and responsive workplace, especially here in the legislative Department in closing. I just want to Echo the words that were said earlier to Echo are both solidarity and sincere condolences to the individuals the families and those who were injured in the crane incident this weekend or heart goes out to those who are The Operators that Ironworkers the individuals who are passers-by who both were killed and we're also injured or traumatized by the event. I want to thank as well the firefighters in the police officers union members as well as iaff 77 and spog for their quick response and reach What's the Building Trades of Ironworkers over the weekend? I express that we're all here to do. Whatever we can thank the council members want for notice putting us on no notice of the funds that they're raising. We stand in solidarity with cleaning safe workplaces and communities across the city and it really was tragic. Also wanted to say we also standing and deep sorrow with those who experience and have continued to be traumatized by this weekend shooting in California coming six months after the synagogue shooting in Pittsburgh and our cities dance with the Jews community. And those who is I'm just finished celebrating Passover. We do recognize that this is a growing Trend that we as a community continue to fight back on and will not be silenced about our outrage over gun violence. Council president of also mentioned the incredible work of this last legislative session noting the passage of initiative 1000. Thanks for the state legislature. I just want to say quick thank you to our incredible legislative teams last night. I think that they wrapped up in the wee hours of the night and they spent you know, I didn't win sweet I saw was at their work until 5 a.m. Monday. So thanks to all of the work that are them colleagues in the state legislature have done this year. I'm really incredible work from everything from making sure that we had dents or communities Green Transportation the school levies environmental package and making sure that we got some additional funding for housing really excited girl power your Workshop. Again is May 18th at 5:30 just to be clear, correct. May 8th, I think we do have a quorum issue. Just let us know if you're interested in coming and we'll make sure that we don't go over for me. I'd neglected just to make it very clear that Thursday May 2nd at 4 p.m. Thursday this Thursday at 4 p.m. Down in birth night. Lana's we're having a swearing-in ceremony and reception for new accounts were able to check us to all of you or not. Only invited expected to be there. So that'll be this this Thursday for customer Pacheco. Thank you, and thank everybody for being so welcoming. So I want to start first with the introduction of referrals there two plus I don't want an introduction referral Council Bill one 19505 which types of Ballard neighborhood design guidelines and D6. Cancel Bill one 19506 Wichita to Capitol Hill Neighborhood design guidelines and D3 for the full Council. There will be no plugs related items on the agenda today and they will be the next Pleasant committee will be this Wednesday May 1st. I will be four items on the agenda a briefing and public hearing on CB1 19471, which clarify the definition of a vessel in response to a hearing examination decision and annual update from the office planning and Community Development update from the Seattle Department of construction and inspections and the presentation on s d c i o p CDs race and social justice initiative Report with the crane collapse when I express my condolences to the families impacted in the individuals. Who lost their lives this weekend is very tragic a crane class in South Lake Union in as a chair the committee that oversees sdci on my team is working the department to understand the details of what happened in the city's Rowling response at CCI has yellow tag. The building is limited SEC is a senior building inspector inspector on-site on Saturday. And as a structural engineer outside who is assessing the safety of the building will be hosting sdci director Nathan Wilson and the plus coming this Wednesday and he will provide an update on the SDC as response. So I welcomed other members of the council to attend to have any questions answered and With that, thank you. Thank you all done customer Gonzalez and excited to hear that you already digging in looking forward to an update on all those materials from a PCI. Okay. So there are 10 items on this afternoon city council agenda related to the gender Equity safe communities do Americans and education committee all 10 or appointments Andre appointments to the community police commission for or cancel appointments 3 or mayoral appointments and 1/3 appointment and there will also be one CPC appointment and one CPC reappointment to the community police commission and all of those 10 items are on this afternoon's Council agenda. I will try to go to them as quickly as possible cuz it is a lot of heavy heavy on volume there on the appointment really quickly. Just wanted to review And what I'll be doing this week in community so at Tuesday April 30th at 12 p.m. I will be attending the alliance for gun responsibility annual luncheon really excited to continue to stand with Alliance for gun responsibility as we continue to demand safe for gun laws and and common-sense reforms to gun safety laws across the country couldn't hear at home on Thursday May 2nd after I have the pleasure of being a witness to the swearing-in of our new council member. I'll have an opportunity to head out to join DSC at their annual dinner. I'll be joining them for the reception and then I will be ending off the evening attending the dinner for at Chapel Hill housing at their annual fundraiser is also on May 2nd on May 3rd. I'll be joining house number for both and many others and sitting with the Soto Bia folks attending to Evergreen Treatment Services. Does annual dinner at noon on Friday May 3rd, and then I will be joining Community the evening of May 3rd at 5:30 p.m. At the 29th. Annual Cinco de Mayo celebration at the Columbia tower, which is right across the street. So and if any of you are interested in Poppin by you just walk right on over and join us in celebrating the kickoff to a celebration weekend for Cinco de Mayo on Saturday April 4th. I will be heading down to the showare center in Kent for the call today celebration. It is an event that is celebrated by the Sikh community and this event is going to occur again at the showare center. Beginning at 10 a.m. The doors open at 8 a.m. And the day includes Services exhibits for the Sikh Community cultural displays and martial arts demonstrations and the turbine experience so highly encourage all of you who want to learn more about RC Community to join us in Kent at the showare center. They will have a parade that starts at approximately 3 p.m. So it's going to be a day full of fun and I'm really excited about joining a members of that community and Kent on front on Saturday. And then I will end the evening by going to the entrance edas anniversary gala is their 50th anniversary gala this Saturday at 5 p.m. That's it for me in committee has one item on this afternoon's agenda. We have an EV electric vehicle Readiness ordinance bill. This is a bill that came out of Committee of the week before last. Quick overview. This essentially is a requirement for new construction to where there are where they're already providing parking at some of those parking spots be ready to hook up a electric vehicle charging station. So what that means is there needs to be a electrical wire poles the spot they can either install the actual Outlet or not, but needs to be sufficient capacity in the building the panel needs to be all set up so that it's a very simple operation when someone wants to come in and put a charging station the requirement ranges depending on the size and type of the building for small residential projects either single family homes or or townhouses where parking is likely to be a private so we can do visualizer on spot. There's a requirement that each spot Pee Dee ready as you get to larger buildings above. I think it's seven or eight units then it starts to fade. Down to what is about a 20% requirement where you have shared parking and sew in a shared parking situation that would mean the 20% of the spots would need to have a outlet but the current technology with and expected technology was charging stations. Is that a charging station with the proper or software should probably be able to manage five vehicles per Outlet. So that actually could get us to 100% Eevee Readiness with a 20% of the spots having an outlet. So pretty excited about this. The requirements for a commercial building is a little bit less about 10% and I'm so sorry grocery store those text messages that may have folks just passing through or places of work, but it's really applaud the folks at the office and ability and environment and STI amazing out of work and looking at other jurisdictions. I feel like they're taking the best of what some of the other are pure cities of Dawn and combined it into single ordinance. So this will be great other thing. I just want to mention I'll say that the standard Elite Transportation command does not meet this week. Our next meeting will be next Tuesday on Friday just mentioned that we had the last elected leadership group. So thanks to all of you who are there out of that meeting. We made a set of recommendations to the Sound Transit board. They will be making a decision later in May. The decision they're making to declare is which segments of the Sound Transit 3 project to be studying in the environmental impact statement. So this isn't a decision on what the alignment is going to be at her with the station's going to be but rather what to study with the LG did and electric leadership group included a number of City Council Members County exec of the mayor of Seattle County Executive Constantine County Executive Dave Summers from Snohomish County and Stephanie Bowman from the Port of Seattle. And essentially endorsed a set of Investments are set of alignments in stations ranging from Ballard to West Seattle the priority and Bill at both ends of the line fitting Ballard West Seattle was a tunnel crossing the ship canal and a tunnel station at the Alaska Junction. There are a couple of alignments that the phone with the LG asked to not move forward because there was so problematic one was a movable Bridge Crossing the ship canal in Ballard and the other was an elevated station what was referred to as the orange line that ran through the neighborhoods just just north of the Alaska Junction. There was a recommendation to study a higher elevator bridge in Ballard. That's not moving an elevated alignment in West Seattle. It largely State along the right away as Alternatives lower-cost alternatives to tunnels throughout the rest of the alignment. There is really pretty broadcast. The one area where there's still a lot of work to do is to Chinatown International District there since we have been kind of four possible station configurations all around the Chinatown International existing station, and the recommendation was to continue to study all four of those possibilities through the environmental impact statement to continue to get more information and help the community better evaluate the trade-offs between those options the board will hopefully take our recommendation. Seriously. I imagine they'll probably add a few other things ended. They'll be required to study legally on the board of course is elected officials from the Tri-County region, so they may have a broader perspective and so we'll see how that happens. But this work was all done to to really move along as swiftly as possible getting to the opening day as soon as possible or Sound Transit 3, and we were able to take a lot of options off the table, which will help them Focus their The efforts in the next couple years in the is on the the areas where I believe we had a pretty broad Community consensus in the process. So I'm really proud of sound. Thank you, and we take some options off the table. Thank you for that. Look for 1 today at 2 on these issues. Okay. So is that the Seattle City council now convenient executive session the purpose of the executive session is just got spending potential or actual litigation. This gives us an opportunity to discuss confidential legal matters are City attorneys as authorized by law and however illegal monitor is always present to make sure that we insure policies questions of policy for our public open session to expect this session lasts for 29 minutes. And so it'll go till 10:30 and if it goes beyond that point out of going back on the public session and announce it's a continued or extended duration.", "end_time": 1647.8}]}