{"format": "raw", "annotations": [], "confidence": 0.9457004198006221, "data": [{"start_time": 0, "text": "Good morning. Thank you for being here in our regularly scheduled scheduled Council briefing on July 22nd. Just to try to describe to the public that we are. Summit pressed for time in that we have two executive session scheduled in immediately after this briefing and exact and the two executive sessions. We have a select committee on homelessness and portability that we want to start at 10:30. So really cutting it short because of if you look at the time of that so having said that there are three Items up for vote relative on a full Council gender. Then I'll present what we talked about this before. When is the skate plaza site transfer down at Seattle Center. These are all relative to carry in the Bible that says select committee. So most of your chain of the Select Committee of her Civic green has so the first one is a skate plaza site transfer. Where were basically transferring jurisdiction on the vacated area around Broad Street from s. Sandshell Center to continue the skating activity of the second piece of legislation is Storm Key Arena facility use agreement basically where we are and sanitizing a great team the storm to stay in town as opposed to going far north lake Everett. So it doesn't increase our liability is a city. I think it's still 2.6 million, but it just sort of redefines cost versus revenue and I was an agreed-upon arrangement again to sanitize the storm to play locally by the way, they played a tackhead. Couple days ago and my family at dinner that game and I couldn't make it and the last legislations just the Seattle Center Arena sign overlay district and thank all of you for participating in our many of you for participating in the discussion and we just were making sure we are monitoring and regulating this signs down there for wayfinding during all of the activity around Cary that's all present those three this afternoon. And with that I'll turn the mic over to customers want the gender of the Human Services Equitable development of interest rate, read the next meeting of the committee is scheduled for its regular time tomorrow, July 22nd at 2 p.m. Where the Human Services Department of present on the out-of-school-time meals program and as we know during the school year many Seattle students depend on free and reduced lunches during the summer that nutritional support is not available. And so this program attempts to fill that void and we'll be talking about that kind of beer O'Brien Mesquita and Gonzales in if there's no objection the minutes of the July 15th, 2019 meeting will be approved. An objection amanecer approve. Sorry about getting the Rhythm to get a contract show from last week Seattle public libraries presented their rsji report and they also brought forward the reappointment of our good friend Jay Rich for the library Board of Trustees. So that will be coming up for final adoption this afternoon in Council also and council member was his committee three items of business Discovery Park King County Outfield legislation that maintains over so I Pipeline and channel that'll be up for vote Thornton Creek acquisition of 125th Street when I say this is all of all about D5 and a parcel of property that Parts is purchasing a different work really hard to make that happen want to thank her and her staff and then also the last committee that she has four Civic development public assets and Native Native communities committee is scheduled next Wednesday, July 31st from 12 to 1:30 p.m. So I also want to say for our own committee the financing neighborhoods committed today. We've got two items this afternoon. All of you are well familiar with them both the short term rental tax revenue and dedicated funds for EDI and also the ordinance that will create a dedicated fund for the sweetened beverage tax revenue. I mentioned that council member services committee is going to be on Wednesday. July 31st likewise will have a finance and neighborhoods committee on July on Wednesday, July 31st in the afternoon and my normal committee day of this Wednesday, the 24th has been cancelled. I will be out of the office for the last 3 days of this week on a fan. Medical issue and also wanted to say thank you to Deborah Smith from Seattle City Light. Also Deputy Mayor Mosley on my buddy. John Pearson fabulous events opening up the Denny substation this past Saturday so many things to all for making that happen sign up on the full Council agenda. I have no idea memes from the Civil Rights utility, development Arts committee, but we do have a committee meeting this week on Tuesday. We are going to get a briefing on what we're referring to as the eviction Reform harmonization Bill. You may recall that the commission working together with the King County Bar should report last year called losing home that portraits the funding for that report was partially provided by my office we had Things in my committee about the recommendations from that report. We passed a resolution that identified the priorities for the council as well as priorities that we wanted to support in the state legislature for addressing several of the recommendations that came out of this report and created a timeline for for doing so the state legislature passed a bill that addresses many of the issues in the losing home report around addiction and that legislation it requires us to make some changes to our on Just Cause eviction ordinance. So we're going to hear about that in committee. We also have a couple of other bills that we're going to hear in the meeting first meeting in August addressing two of the other recommendations. I'm coming out of losing losing home that weren't covered in the just cause changes in the state legislature. I'm so we're going to have this initial briefing on this bill here to others the next meeting and hopefully roll all three bills moving moving forward and hopefully get them up before budget also in committee on Tuesday. We're going to hear from you. If you can on the development on their race and social justice initiative report will be hearing from Seattle public utilities on the bag ban compliance report will be lifting a Proviso for funding to help Town Hall that was approved in the 2019 Budget on the Proviso lift relates to necessary public benefits required by this Council in exchange for the funding and hear a report and presentation from Arts fun on the social impact of the Arts. No, proclamations prepared currently, but just want to give folks a heads up that we're working with the people with disabilities commission to issue a proclamation recognizing its 10th year. I'm in The Advocates who helped start the commission including on Julian Weaver. And then finally, I just want to share with folks and Amendment related to an item that I believe councilmember O'Brien will be talkin about more. So I'm just going to pass them out and we can hold scussion until we get into the presentation from Brian about the sugary beverage tax legislation. Thank you. Cancel. My herbo Catch My Breath. Good timing. The San Antonio Transportation committee doesn't have any items on this afternoon's agenda nor do we work this? We have a committee meeting this week. I will just follow up on two items a counselor. Make sure I mentioned ordinance related to Deckerville development initiative and they aren't related to the creating a fun for the sweetened beverage tax. Those are both that I'm very supportive of and one specifically on the new ordinance related to the sweetened beverage tax. There is a couple amendments that I'm aware of one is going to be circulated by Central staff Yolanda ho it's a technical clean up where there was some language that could be interpreted as slightly different way. And so she is worked out with a small change and she'll email at all of you. It doesn't change you this up since we talked about on the committee and then I appreciate your work on this. The one in my hand it back to you to speak to it directly provides some certainty about the council's intend and the council's hopes as it relates to the things that we've heard coming out of the executive about the impact of the legislation that creates some some sidebars through the through the fund to protect funding for programs that we've identified as a high priority for the sugary beverage tax funding but not as high priority, but the the intended policy council member bags just suggested what I would consider a friendly Amendment. Recital itself says that this legislation is not intended to reduce funding for any impacted programs. And the executive is expected to identify other funding sources to maintain full funding for these program. This was written in such a way to emphasize the understanding that it is executive Depp proposes that the 2020 budget her back shot expressed an interest in making it making some changes so that it says executive and Council are expected to identify other funding sources, doesn't it? It's still kind clear that it's the mayor that proposes the budget but the council and its role adopts the budget I'm and I think it can create some further certainty and Clarity for the public as well as for recipients of funding that we're working together to make sure that funding is preserved for these programs. Jo-Ann's Council are expected. Okay, that sounds great. I have one of my men on the sugary beverage tax Bardsley and Technical Amendment. But again in the spirit of making sure that the language of programs that we intend to be funded that is consistent with the original ordinance that enabled the implementation of the sugary beverage tax. We heard we had some Communications with some of our early learning providers for tipping the space around the nursing home partnership and the parent-child home program that were concerned about some of the language that we had in the original Amendment around Early Learning in and and prenatal services. So the original version said that the expansion of evidence-based programs in the space would be for birth to Age 3 and kindergarten reading the services and we just want to make really cool. Where is that we don't intend to limit the expansion of existing programming and services that we provide in that prenatal space. So we appreciate the Outreach by some of our good partners who do this work to remind us that there is a lot of funding that happens in the before zero age space in so we have a stricken the word birth and inserted prenatal to acknowledge that full spectrum of services that the city currently funds through General funds and sugary beverage tax. So, I don't think it's controversial. It's just a cleanup effort to make sure that again the original intent of the sugary beverage tax is continue to be fulfilled think you fully support that. Thank you for that change. That's my Brian and that is all from the sustainability of Education committee. Thank you very much for today, but couldn't be here for Council briefing. There is on the introduction and referral calendar. The council has received a notice of intent from the Seattle Central College to prepare a new major institution master plan for Seattle Central College campus located at 1701 Broadway project number 303-4600 type for this application is now pending for the purposes of council quasi-judicial rules. Council member should avoid all Communications about the merits of the master plan with proponents or opponents of the plan. If you have questions about the council's quasi-judicial rules, please see Central staff Kettle Freeman related items for today's agenda and the next plus committee meeting is on Wednesday, August 7th. They will be discussing and voting on the annual comprehensive plan amendments docketing resolution on to my updates was president in the housing Health Energy and workers rights committee on today's full Council agenda. That's Council Bill one 19537. I want to be clear. This is not a new piece of legislation. We're actually ordinance from about 5 years ago, the existing notice of intent to sell ordinance require sellers a multi-family properties of 5 units and more with at least one unit renting at 80% of the area median income to notify the office of housing of their intent to sell and provide a 60-day window before any transaction to allow an opportunity for affordable housing developers. Just a minute offer. Should they be interested in acquiring the building after having many conversations with tenant Advocates and nonprofit developers and organizations who are interested in especially addressing the displacement issues that many of our communities at risk of displacement. Experiencing we work together to come up with legislation that immense the existing ordinance. So when is first thank councilmember backshot and councilmember herbold to work with us on various amendments to the store to this proposal. There's some things of note in the legislation first. We want to make sure that it's clear that this amendment to the existing ordinance does really to three things that creates a tiered notices that first owners post and submit their notice of intent to sell. This is now not only available to the nonprofit developers, but also to community group and really importantly the tenants who live there, then it's on to give those three entities and opportunity to indicate whether interested in purchasing the building by submitting a statement of interest and then the third tier is that the submittal of documentation in the financial ability to purchase a building needs to be submitted. And finally, there's. Of time that owners must hold the building ticket time for the tenants or nonprofits to submit an offer. It does not have to be completed within that window. I think this is really important. We are broadening out the definition from five units to two or more units were also making sure that the tenants of the building get notification just like the nonprofit developers and organizations that are increasingly interested in entering the affordable housing and development Arena also get that notification. This is really trying to facilitate the opportunity for us to create both first time home buyer options for those tenants who can come together and purchase of the coop and also opportunities for nonprofit at developers and nonprofit organization to have an opportunity to create or preserve affordable housing, especially in areas at high risk of displacement. I also understand that there is information that's out there and while we really appreciate the ongoing interest in the legislation, we have already looked into the matter and its legality and we've already talked a lot and we have Call from law that I'm happy to share with folks. There was some interest in making sure we've got it all eyes and cross all teeth as it relates to the legality of this legislation and I can assure you from our city attorney's office. But this is very different from what was covered in the blog post unlike the court in the blog posts and the reference to the Washington state supreme court announcement in a 20 years ago that mr. Schofield reference regarding manufactured housing Association versus the state of Washington Washington State Supreme Court ruling from 2000 in which the court invalidated just a lot to give mobile home TENS to right of first refusal to buy mobile home park where the homes were situated want to be very clear. This bill would not force the landlord to sell to anyone. In fact, it requires notice of intent to sell enabled tenants and housing providers to give the landlord an opportunity to potentially sell to those. Tenants nonprofit developers and nonprofit organizations one could argue it helps the level the playing field and give more opportunities to sellers to have an even more even more potential buyers when we're creating opportunities for those tenants and nonprofit organizations to have access to information that the office of housing is now going to be providing with some of the Amendments that council member works on to make sure that the information was robust and thinks the council member to see that it's working this week or next to the committee meeting is August 1st, and we will have the mste renewal and report and we will also be having a briefing in discussion again on our hotel worker legislation. There was a revised version of the agenda that was sent around so folks can see the full timeline for that as well. Let us know if you have any questions this week. I will be headed to our local. Detroit I know council member Gonzalez will be there as well and maybe some other council members. Look forward to seeing you all there and that's it for me. Mr. President to be very short. Nothing on this afternoon's Adventure from the gender Equity Safe Community Americans in education Committee of the fact that I will be out of town beginning tomorrow to attend both the local progress board meeting and the annual convening for the rest of the week. I have canceled the regularly scheduled committee for this Wednesday, and that is my report. Thank you, okay. Well that we're going to move into executive session and so is presiding officer. I'm announcing that the Seattle City council will now convenient executive session the purpose of this session to discuss pending potential or actual litigation in this gives us an opportunity to discuss confidential legal matters with our city attorneys as is authorized as authorized by law on illegal monitor from the city's attorney's office is always present to make sure we reserve questions of policy for our public open session. So I expect this is actually two sessions to last combine about 45 minutes. So we'll say Then who's that up 9:54 in 45 minutes. So that's a that's will say 1041 something like post like that 10:40 house that will is going to go to 10:40 actually going to go to 10:30 cuz we're in the charter select me to 10:30. So I'm still on the record. This is going to go to channel 30 and if it goes beyond that will announce it in public open session. Thank you very much. That's moving executive session.", "end_time": 1297.6}]}