{"format": "raw", "annotations": [], "confidence": 0.9273468963031111, "data": [{"start_time": 0, "text": "Three conversations six appointments to the Seattle design commission briefings public hearings and possible votes on Council bills one 19505 and 11950 6 the Ballard Inn, Capitol Hill Design guidelines a public hearing and possible vote on Council Bill one 19489 which allows for the Seattle Pacific University to apply for it and expanded Mage institution master plan a public hearing and possible vote on clerk file 3 1 4 4 1-3 an application for a temporary expansion of the north priest the north Seattle Precinct and a discussion and possible vote on Council Bill one 19471 clarifying the definition of a vessel. The next regularly-scheduled plus meeting is on Wednesday, June 19th start at 9:30 a.m. Here in council chambers before we begin is there any is there no objection to today's agenda. Which one which will be adopted? Colonel Jackson today's agenda is adopted at this time. We will take public comment on items that appear on today's agenda. We have 10 minutes today for public comment. If you were to comment on any of the agenda item 7 through 10 there a separate public hearings for those items. So, please save your comments for those public hearings. My speakers are lined up for 2 minutes for public comment. If the speakers, exceeds the two minutes to Microsoft. The microphone will be turned off speakers are asked to begin their comments by identifying themselves in the agenda item. They wish to address as remaining is reminder public, is limited to items that are on the agenda or within the purview of the committee. First on our list is Mari more Schuler. Thank you counselor Pachinko. And committee members. Hi, Mike. Good to see you. Good to see so many familiar faces after all these years. My name is Maury. My name is Maureen Morris Jeweler and I am the President of the Lake Union liveaboard Association also known as Lula representing the smaller house boats around Lake Union and any other liveaboards who are members of our organization. We have for the last Dozen Years been consumed by trying to help the city recognize protecting codify our existence as vessels as live-aboard vessels the state did recognize us in a piece of legislation for our historic and cultural significance and requires us to be moored in Marinas. With this proposal before you today, you are removing our status as vessels and making a strictly structures. While at the same time the state law requires us to be in Marinas. This is a disconnect and it is very convoluted for our marine owner and for ourselves. State senator Jamie Peterson who wrote and sponsored our protective legislation said repeatedly and is adamant still today that there was no intention of denying our vessel status in the legislation yet with this action. You remove the very thing that Marina's need for their own protection. I hope it's not a deliberate wedge between us and the rest of the maritime community. This also affects many of the things that I don't think the staff has considered our insurance. Purchase and sales of our vessels I even whether we are covered by the derelict vessel bill which requires pollution insurance if we're not vessels do we need pollution Insurance? Maybe not which is jeopardizing. The state's Waters just a thought something I think hasn't been considered yet. Thank you. We would ask again that you table this measure until such time as the staff and clearly explain why inclusion in the vessel definition not be a preferable alternative. Next on our list is Barb Ingram. Hi, I've lived in the castle Community for 14 and 15 years and I participated reactively in the last go-around with the city. They're doing a review and trying to change the rules and set up the rules that would protect us and so it's really hard to think that we're entering on anything like that again, and I just want to ask you really satisfied. Are you satisfied that there's some urgent need to change the definition of one word right. Now, I presume that most of you live on sure if the city came to you and said we can exchange the definition of house. Don't worry. It's not a problem for you. We just spent four years in a fight to try to protect a right to stay in Seattle. I understand from the information that I've gotten that one of the reasons that was presented was that there were a whole bunch of new houseboats coming in and we needed this clarification to protect Seattle from this influx of houseboats. Well, the existing ruled as that, you can't be licensed as an f o w are floating on water residence. If you weren't if you can't prove that you were in Seattle on the 1st of July 2014. So why would be there? I need to change this and I'm sitting here and I'm thinking gosh hordes of new houseboats coming in rapist and murders on the southern border map of weapons of mass destruction really like the way this whole thing is playing out. It sounds like a familiar to me. I don't think that there's an urgent Are urgent need to do this right now in two years. We're reviewing the shoreline master plan again, and that would be an appropriate time to look at this. I don't think now is an appropriate time to rush it through on a vote now would be to overlook the possibility of having really critical and important information an important input from the people who lies are very much affected by this. Thank you. Next on our list is John Chaney. Good morning. My name is John Chaney my partner and I own a verified flower floating on water residence, which is the best whole since it was designed and used for navigation yet would not qualify under this proposal as a flower. I appreciate the on codified statement proposed by council member herbold. But the protection of our fleet was intended to cover houseboat such as my own now and in the future the legislation is proposed would not allow the verification of my vessel as a flower if implemented get the Twisted City definition of conventional recreational vessel would not include my houseboat. I am too much a house and not enough a boat or some days not enough about Into My Chart House my legislation this legislation will create unintended consequences a cursory examination of the S&P finds. The proposal would remove house barges from the vassal definition, but would also remove them from being allowed residential use in a marina. This is going too fast and making not making the correct analysis SMC 2360a 200 only allows a residential using marinas of live aboard vessels and floating on water residences where the house barges authorized if they are not vessels DCI has not addressed the impacts to marinas from this vessel definition change. What will the impacts in its mitigation actions at Seattle Municipal Code? 2360a 158b when we are declared to not be vessels Lula requested that flowers join house barges is exemptions Under The Vessel definition. Why is this not acceptable to DCI? We appreciate the date on the staff report. We've been requesting this for a long time. However, it is incomplete how many verifications were denied or are pending that is not an answer question. Where is the evidence of the impending Advil? Can shove flower applications? Why can't the public access the verification applications? This is a very clouded process. Thank you. Next on her list. Is Nora zehetner. General statement vessels that maybe I signed up on the wrong sheet my first time here I am a longtime resident of the Northgate neighborhood and I'm very concerned with the recent changes and the future changes. Recently a single family home on at 6 6190 foot square lot was demolished is being replaced with eight units. Another single-family home is up for sale and its newly rezoned RSL supports five or six four to five units. There's another neighbor of single-family home that was demolished and completely denuded of all vegetation and old-growth vegetation and it's being divided into Lots. There's another one same things happening by the same contractor. They're putting in 6 Lots on two different single-family Lots in so how does this existing infrastructure support these changes who pays for the upgrades parking the majority of people will not be giving up their cars will these changes damage the environment and the livability? I support equity and justice for all however, when one unit becomes three or more, this becomes an investment property. Where is the equity and that the city council is up zoning and rezoning. It is difficult for the average citizen to follow all the changes you make developers and investors have the time to research and Lobby for what what works for is it to their advantage? Please do not razon for multi-unit buildings beyond the current boundary of Northgate Way and 5th Northeast as you begin considering changes in the zoning. Please be mindful of these concerns. We citizens voted for you to make decisions for our in our best interest. Is this a misleading trust Kamal Oculus? Thank you. Good morning. I just came and I didn't even know the agenda today's subject, but I have a Property over Magnolia that's 9100 square feet sitting in a single-family 5000 zoning. So since the city are we working on did you know the smaller lots and high-density? I wonder if is there any way to work on the 75 80 rule so able to build two houses on a 9000 sq ft Garden just big mansion on the property. If she ever concern to modify a mega modification on 75 80 rule. Air India flight 275 Israel is it doesn't work. 75 works by 80% doesn't that's all thank you. Next on our list is Steve Stella. It's always nice to speak to such green environmental issue. I don't mind going down trees for development. That's a is a higher calling as we say all that. I think that if you are going to be green you might as well be consistent and we should be looking at the Heritage and the Legacy the the bigger trees are by far the most important in the whole idea of looking at canopy. Another words it from the moon looking down a shrub is equal to a Heritage tree is just so so Seattle City console and filmer are these days we have to take a look at that being really green if you want to be green, but let's take a look. We're seeing less and less bicycle used because the people you are importing, you know, if there a lot of people you're shoving out the city, we don't like to count that cuz we are a welcoming City. Don't talk about those people that are being forced to leave the city and it's time we looked at both it's a time that we looked at things in general. You are not elected to be advocates for small groups like Bourbonnais, which is to the development Community as the tobacco Institute his do the tobacco companies and the climate deniers are to the coal and petroleum companies. Let's just take a look and do things for the good of the city not for the good of small groups, which you would seem to be very good at these days city is like an iceberg very little is seen by the public and much happens beyond the reach of the public and you need to become more exposed and you actually need to I hesitate to use the word listen to the public. Thank you. Thank you. Next release is John. I just Jessica. Sorry if I sorry. My name is John Geisinger. I'm retired Maritime lawyer and a professor and I'm also a live-aboard person on Lake Union on the member of the Lake Union of the Board Association. I'm not here with a long technical explanation. I mean, I used to teach law students the definition of a vessel under federal law and it's interesting and complete and can easily be found and I'm a little baffled by whether that's the same sort of research has been performed by the development office. I'd like to speak no more personally to this fact my wife and I built our houseboat to the specifications the city required in a 10 years ago. And frankly. We thought our retirement would be a little less frenetic and said we have found herself at many meetings here and many meetings Outreach meetings trying to just simply defend our own existence and I hope it has not escaped the notice of the city council members of the city council and thank you for your time today. Most of the members here are no longer young and most of us live in dwellings in which we are hoping to have a certain degree of Serenity. And the other thing I'd like to add is this I sense and having litigated many cases over 30 years that this case that's this situation has gone beyond mere intellectual discussions between grown ups and has become one of unafraid Animas between the development office and members of the maritime Community here. Thank you very much. Thank you. Next Wireless is Sheryl Crow. Good morning. Thank you very much for this opportunity to speak. My name is Cheryl Groff and I am a house barge owner and would like also to just speak personally to this issue of the vessel definition and looking at that we support very much Lula in the fight to postpone this just a decision. We feel as homeowners very endangered in a sense and I'm new to Seattle but have been a house barge owner for over seven years. This property was purchased through a real estate agency a partially financed by a financial institution here in Seattle. It is our home and I think it I really want to emphasize that we're not an act. The f o w are these are people's homes on our Marina. There are about 70 families currently living a represents single professional people families with young children in Middle School in high school and also retired families. So we are all verified vessels according to the regulations and yet again, we see that this issue is being raised. So I plead with you to please consider our case and there are not many families in the Seattle area. These are our homes, and we would like that to be respected and housing is Eva premium in Seattle. So, thank you very much. Thank you. Next on our list is Michelle. Michelle Good morning. My name is Michelle the office. I also am a longtime live-aboard in Seattle Washington, and I wasn't planning to speak, but I'm so happy to be here. I've been on the water since 91 and I have been in the Indies Chambers not these nice new ones that these Chambers for much of that time in and out and I'm just here to say this is getting a little tedious defending our lives our homes and I was born and raised here. I'm a native and I also plead like the lady before me Cheryl that you consider. I'm now approaching and in retirement years, and then these are our homes, and please consider that and we are responsible citizens if we are not hurting anyone by being there, so ask yourselves if you would like to be removed from your home. Thank you. Thank you. Is there anyone who would like to speak and did not have a chance to sign up? Seeing that there are no additional speakers. We will move on to the next agenda item. Will you please read these appointments until the record for the design Seattle design commission one through six appointments 0 1 3 6 0 2 0 1 3 6 5 appointments of Amalia Leighton Cody Brianna s Horne Richard F crocus Vinita sidhu and the Elaine wine as member Seattle design commission for terms to February 28th, 2021 and the appointment of Benjamin William de rubertis as chair Seattle design commission for a term to February 29th 2020. Well everyone of the table, please introduce house. Vinita sidhu. I'm a landscape architect practicing in Seattle for the past 20 years. Elaine wine, I'm an architect and a development manager with the Seneca group Seattle design commission and architects. Michael can you remind us of the Seattle design commission be happy to for the Seattle design commission was established in 1968 to advise the mayor the council and City departments on the design of capital facilities that the city undertakes as well as a project to seek either long-term or permanent use of a right-of-way the 10 Commissioners that populate to the design commission or representatives from the architecture and design communities and they look at the aesthetic environmental and design principles of projects. I come before them. We're here to seek confirmation by the Council of five appointments plus a chair. The chair is appointed by the mayor and confirmed by the Council of the three appointments were seeking today are for bandier Paradis as our chair and has he told you he's been a member of the commission and he also is an architect for flad and specializes in Healthcare facilities are also seeking appointment of Amalia Leighton Cody who was unable to be here today. She's traveling for work. I were seeking her appointment as our transportation planner. Amalia is the head of a tool which is a local or an excuse me a national Transportation Planning firm. She heads up the Seattle office and specializes in transportation planning an infrastructure. Vinita were seeking confirmation of her as our landscape architect and she's a principal at site Workshop a local landscape architecture and Urban Design firm Vinita landscape architect that specializes in institutional and open space development both here in Seattle in in the region and I'm finally receiving confirmation of Elaine wine. As one of her two architects. Elaine is a development manager at Seneca group and most of her work appears to be for Amazon in their local campus and she spent a significant amount of time and Denny Triangle working with them to help build and expand the campus here in Seattle and we're shaking her confirmation as well. We're also seeking reappointment of two people Rick Bayless who is seeking a second term. He's one of our he's are at-large member and Brianna whole one works who are also seeking reappointment of N2 service in the urban planning position for the commission. Thank you all for being here today or this morning. Would you all like to spend a minute to introduce yourselves and and say about your speak to your interest on service design Commission? I can start as I mentioned. I've been practicing landscape architecture in Seattle for the past 20 years essentially my full professional career. I've worked on institutions and parks open space planning and I bring that wall so that knowledge to all the projects. I work on an appointment. I look forward to being able to influence the development of capital projects in the city and a positive benefit for everybody thinking about the larger community and the legacies that we leave behind. Hi Elaine wine. I'm a licensed architect here in Seattle and started my career. It's not practicing as an architect and eventually moved on to project management with Vulcan Federal Transit Administration. And now the Seneca group so I bring a fairly diverse background not just on the design side but implementation but prioritizing design Excellence has really been a focus of my career and I've been working in the community for over 25 years. I've got a passion for community service and I love Seattle what I want Seattle to be a great place. I've served on the Seattle landmarks for the Ballard Avenue landmarks board, which is the community in which I live in a part of the Alaskan Way viaduct north portal working group served with AIA Seattle architecture tour. So it's something that's incredibly important to me and one of the things that really excites me. About the design commission is an ability to utilize my skills and enhancing placemaking in Seattle. And I think it's just an incredible time. There's a number of capital projects for legacy projects, you know, the the great one that comes to mind sst3 and how that will really influence the the landscape here and I'm I'm just very excited to be a part of that and support I'm design excellence in sustainability and an equity and design so I'd be excited to serve. I'm bendy Roberta send I've got about 25 years of experience that's has the verses. I could possibly imagine it to be from doing public art projects all the way through doing Capital construction projects of 200 million dollars in more in value. Seeing that whole scale of of of endeavor, I think was good preparation to be on the design commission. And while it would be really hard to improve on the objectives that Elaine just listed. I think those are really laudable. I might add to it that it's an unbelievably educational process to sit on the design commission with other professionals. And I think we're able to achieve together something that we really wouldn't be able to achieve as individuals and I think we can hang our hat on the idea that by doing that we really are helping to raise Seattle's game and provide the kind of input for elected leadership that only a body this diverse could could produce so very committed to it very excited about it and that's real to get started. California by Immature this probably directed more than Michael herb. And then I'm the last few years have seen significant body of work come through design commission. I guess you all know what you're getting into some of the projects, you know, some of the freeway projects the convention center was a massive one you mentioned st3, which is nicer. The projects are coming, although I imagine they're probably still a few years away from coming for the design commission. So I'm curious. What are the what is on your plate for the next couple years what types of projects are specific projects? I think st3 is going to inform a lot of with the commission does impart I think there's a s I think that what we've been saying Sound Transit do today. It is really saying we want to front load in many ways looking at how in the city of certainly saying this as well. How do these successfully integrate into our neighborhood and I think the opcd and City departments are now beginning to tackle that question in Earnest and I think what you will be doing on behalf of the city is trying to look at the initial work that they do preparing for the idea of maybe embedding Urban Design work that the city expects in advance of any contracts. I think they're they been very vocal about taking a different approach possibly proceeding with more design-build contract if that is the case and I think that it is the work that the design commission does and trying to elevate Urban Design expectations, and I'm betting that in work becomes more Earlier rather than later. We've learned a lot about that with the work that we've been undertaking with 520 and bedding Urban Design values in major infrastructure projects that are going to be design-build and I think that's where this is going as well. I think maybe the three lenses that we've been looking at most carefully or Equity certainly with respect to how significant investment is going to affect neighborhood. I think also immigration is something that that this body has really chosen to focus on me really asked to see the apartments then jurisdictional where we have jurisdiction over lap to just make sure that everyone's communicating with each other so that we're getting projects that are more than the sum of the parts with her is the opportunity to have investment kind of multiply. And the last one is Vision. It's really important that Seattle and elected leadership sets the vision for some of these significant Investments. And that way we're not devolving down to the lowest common denominator of what makes for feasibility. We're really raising that to what makes for a great places to live and I think I really appreciate the worth of the design commission is done and I I hope that in addition to the the body of work that you all have that there's capacity to be proactive in helping us think through the projects are coming our way and I I look at you know, the challenge and opportunity of a second downtown Transit tunnel and specifically the Chinatown International District II station there and the you know, the threat of construction and disruption Very fragile ecosystem that is already being squeezed for so many different angles right now and the opportunity to have a multi-modal Transit Hub that serves no frankly the whole Puget Sound region that functions really well for all users including and maybe even first and foremost the folks that have historically lived in that neighborhood and waterways we can get that wrong and I'm not exactly sure how to get it. Right but I've been really impressed with the conversations I've had with design commission members and I hope that those capacity to really help the city and the community probably just as importantly navigate the next two years as we think through it's possible in that one neighborhood and then we have you know, we have challenged with my friends and Ballard rugs. There's going to be some major disruption in Ballard happening, you know, probably a few years later, but it how many in West Seattle obviously has its own challenges to so I know you all spend a lot of time on this stuff and I hope that there is time to I hope we're not. So many projects coming at you that you have time to be really productive and thoughtful and help influence us as we're making policy decisions. Well, thank the folks who are coming forward for giving your time your service your talents to this body of work. I do want to once again express some hopes for better representation on this body. We only have representation from three of seven districts District 1 3 4 and 7 are not represented on the on the commission and I think particularly as it relates to projects that will be coming before the commission that are based in those neighborhoods that don't have representation. It makes it particularly important. So there aren't going to be any openings until February of next year and there's only one I'm sorry, there's two that are open February next year. There's a get engage program that's open later this year. So I would request that the design commission staffers do two things one come up with a plan for having better representation. When those openings do come up and to work with the the commission to figure out along the lines of councilmember O'Brien's request how to given that there isn't representation on the commission itself from from those neighborhoods where there are some pretty big reviews coming up that y'all going to be doing perfectly around Sound Transit. I'm how to make sure that you're really engaged with those communities. I'm a little a little extra boost to be appreciated. Thank you. Is there any further questions or discussion? Thank you all for being here this morning. I will be moving out toward the vote. I moved to confirm appointment 0 1 3 6 0 2 0 1 3 6 5. doesn't favor de Pointes, please what I Sorry is your second favorite? So I got out of myself all those in favor of a promise we go die. All supposed to be in thank you. All your appointment will be considered by the full Council on June Monday, June 10th. There's no need for you to attend, but you're all welcome to and thank you again for taking the time to serve on the design commission. Thank you. Thank you. Our next item of business is a briefing public hearing and possible vote on Council Bill one 19505 which adopts the Ballard neighborhood design guidelines, though. Would you please read the abbreviated title into the record will 1 1 9 5 0 5 10 Ordnance relating to land-use and Zoning amending the Seattle municipal code to remove the Ballard municipal center master plan area guidelines and adopt the Ballard neighborhood design guidelines. Well, everyone's at table once they've been seated, please introduce themselves. David Goldberg with the office of planning and Community Development Yolanda Council Central staff Katherine Weber co-chair of the committee that helped David on this project Association Good morning have cast members on Tom Malone. I was co-chair along with Katherine of the design committee and I am chair of the belt Alliance repairs board. WM presentation I know most of you are familiar with all of this would have been through it about the public was listening mail also want a little brief overview. So we'll go over that design review program get my name is David Goldberg. I work in the office of planning and Community Development had the great pleasure to work with these Community representative as well as many others to develop in the Ballard design guidelines City design review process was established in 1994. And there are have been over 1,500 projects that have been reviewed since that project began design review takes place as part of the master. Yoo's permitting process for most larger developments before before they can apply for construction permits next Slide, the purpose of the design review program is to encourage better design and site planning so that new development fits into the context of the neighborhood both existing contact and they desire Future contacts it provides flexibility in the application of development standards and it improves communication and collaboration between Community developers and the city there several types of design process. There's the full design review that applies to larger projects that there's administrative design review for smaller ones and their streamline design review for townhouses. The design review is administered through a board there and there are different boards throughout the city today will be talking about I'm neighborhood design guidelines in the Northwest board and the Capitol Hill First Hill Board the each board consists of volunteers a ported appointed by you and the mayor and their duties include synthesizing Community output providing design guidance recommended recommended conditions to the director of Seattle Department of construction and inspections and ensuring fair and consistent application of the Time Guidelines. In 2013. We took a look at the Citywide design guidelines and created a new organization structure that you see here the different categories include the context in the sight public life and a Design Concepts. There are Citywide design guidelines and neighborhood design guidelines for many neighborhoods in in the city. They're both using the same organizational structure neighborhood design guidelines. Do not repeat but compliment and enhance Citywide design guidelines. So and reach subcategory that you see here. They're usually three to five specific design guidelines in the Citywide document neighborhood base design guidelines may or may not provide additional guidance on under each of these categories end in neighborhood design guidelines. There's a key at the very beginning that that indicates where is pig ditional guidance has provided to help the people understand that for example, in in the Ballard has not gotten that this will go into a bit. There isn't additional guidance on walkability actually all of that to El Pollo an important topic it all of that's address through other parts of the neighborhood design guidelines. So that's the context of the specific neighborhood design guidelines that will Now present moving on to Ballard. The Ballard design guidelines follow a large amount of planning that's gone on the community since the late 90s and it's important to kind of reflect on why these neighborhood design guidelines are the way they are in 1998 the neighborhood completed their their Urban Village plan subsequent to that. They developed recommendations for the creation of the Ballard Civic Center, which is the community City initiative that caused the creation of the Ballard Commons park the location of the library the location of the neighborhood service center, and then the city designed adopted design guidelines for the area around those facilities. After a number of years of moderate growth large-scale grows really began to occur in Ballard around 2008 and the community reacted to that in a number of ways one is being very proactive in connecting with the city. The other isn't the more General conversation that we have here around the community. We don't we don't mind a growth as long as there's it looks good and we have good Transit which is something I think everybody in the city can understand. So the business owners that are in community residents that we see around the table join together to create the valley partnership for smart growth and it's now the Ballard Alliance and it really was instrumental in bringing together all sorts of different organizations in the community to talk and meet regularly with us. In response to that organizational initiative opcd and Seattle Department of Transportation collaborated to complete an Urban Design and transportation framework in 2016. It sent it recorded Community Direction on development standards modifications that were adopted in 2016 Transportation improvements that has been been updating and then in the development of a design guidelines that were talking about today. We are measurements with adopted the recommended zoning standards a changes in 2016. And then we began the process of developing the design guidelines with a committee. We can meet the completed that work in the fall of 2018 and thank you for moving through the slightest working perfectly. So why update the Ballard neighborhood design guidelines of quick quickly go through the things that we're we're pushing Us in that direction their significant growth occurring throughout the Urban Village, the existing design guidelines only applied to a small area within the Urban Village around the Ballard Commons park the community recognized in the city recognize that there are many different areas in Valor required additional guidance. And so we wanted to expand the area that the guidelines applied to the entire Urban Village. We also realized that with a new types of building ever being constructed. There's an additional guidance needed about bulk street level design and detail and Leslie as we were completing the work it became clear that mandatory housing affordability was likely to apply more height and density to the community and they wanted to respond to that. So the work that we did involve the tremendous amount of community engagement. There were 24 committee meetings and I really want to do a shout-out to everybody that stuck with this process and completed a very methodical approach to analyzing how the how the community is currently constructed today how they see a growing in the future and they provide a consistent guidance throughout 24 meetings to develop every design of Transportation plan as well as the design guidelines. We had five well-attended open houses. We had a number of community conversations with specific neighborhood organization. Send me completed a ASC process. I want it mentioned the people here around the table. They were I believe it almost every single meeting throughout their Katherine and Tom. Thank you very much for your you're dumb you're sharing of the committee was wonderful and Mike for your consistent and representation of the Central Valley residents also want to recognize Julia Park who worked with us throughout the process. Unfortunately, she's not here with Today but you contributed menu for hours over the over the timeline that we had to develop this process and also do a test. And kind of opcd to design and communicate what we were hearing with a community. So her work was was for the city was really instrumental in getting this work done. So the priority designers issues. We wanted to enhance the different character areas that the community identified by not having one main street, but a number of different areas that are important to the overall character of Ballard improving the street-level character of each of those distinct areas reducing building bulk throughout and then using high quality detailing in materials and the next slide you can see the character areas indicated by the different colors. The ones that we focused on her are the character core which surrounds the Ballard Landmark historic district design guidelines. Pioneer but that isn't important reference for for building quality in building character that applies both of Ballard Avenue area as well as Market Street, then there's The General commercial areas that we see the what we called the Intown residential areas which are the high-density residential areas that surrounded the commercial core and then the Civic core which is an interesting area that is off of the main streets, but it's still a very high-density walkable area, but has a much more relaxed feeling next slide. I could Catherine the for each. Of our areas, we provided a summary as well as some specific design Direction. So these this is an example of the design guidelines where we addressed for example the areas. So we listed supplemental design guidelines. We provided an illustration that shows the building facades in the streetscape. So we got a really comprehensive look at the entire public realm and then we provide specific examples that illustrate the character. We would like to see moving forward you can see on the upper left. That is the character on on Market Street that many community members would like to see a continued. I'm in a meeting to be less than I don't know. What's in a quarter mile away. There's a very different character in the Civic or wear different types of amenities are provided to provide still a very walkable area. next one street-level character was really important in the neighborhood. But as I mentioned it isn't the same everywhere what was important was to create throughout the Urban Village welcome against patient sidewalks active residential and Retail Hedges integrate private and public open space in a way. They're really creates a nice walking environment and then making good luck connections next slide. So for example in the more traditional retail areas, it's necessary for Street to be a cheap storefronts active storefronts to be adjacent to the sidewalks and specific character that you see there on the top is the Ballard Avenue character. There's also a different character with new buildings. We provided some please don't do examples in art design guidelines for the bottom one. Is it please don't do you can see that there's still a lot of storefronts there, but they're shadowed and they're not nearly as a gauging in the under the pl3. You'll see an example of of townhouses and it was very important that our residential areas also include a very active Street Front. Exlines one of the next things that we wanted to deal with was building bulk and the refrain that we often heard his please make sure we don't have a canyon on on Market Street and we knew that building the existing buildings would be dwarfed overtime by larger scale development. And what we wanted what we did first thing to do is adopt regulations, which required upper-level setbacks and required building model modulation. The other thing that we wanted to do is acknowledge that box a building a large rectangular building does not have to be bulky there many ways that you can that you can adjust larger development to fit in better with a neighborhood. So we provide guidance about the units of design having them reflect the older scale of the development and Andy the details of those designs next one building materials a lot of it boils down to the they will tactile nature of that you feel Ramon has more Whimsical design I would say but for Ballard it may be reflected a kind of the essence of Scandinavian design that people often refer to permanence and honesty where words that people use to describe the types of materials that they were looking for selecting ones that conveyed permanence and I could either traditional materials brick and stone or modern materials at UCF here next slide. These are examples of things that people appreciate people appreciate both the very tactful nature of the brick then they really like the of the Ballard Library both are examples that we refer to in the design guidelines about how to use materials. Well, so this is an overview of the different different topics that we addressed some examples of how they show up in the design guidelines and we're open for questions about this one and then we'll move into the Capitol Hill Design guidelines shortly. Any questions or comments? I want to start by saying that my gratitude for the work you all done about the community and I've put a lot of time into this the land use decision. We made a few years ago was the least controversial and just decision. I've been part of and I know that's not random. I think there's some amazing Community work done in advance to really build strong consensus in the community and a model for how we can do that but it only happens when they're engaged to members like yourselves that are working to process all the way through so very appreciative for that. And I'm I'm looking forward to being able to adopt these new guidelines and there's been a lot of development. There's more Development coming especially as the promise of Light Rail becomes a reality and I think there's an opportunity here with the following the great work that you and three members have done to Really shape with that looks like going for it. So appreciative that. Thank you. If I could just come and I'd like to thank both council members were mentioning sound transit to the people are just on the same committees. You know, it's the Elephant Room for us right now as Brian say having set up his own subcommittee to look at it. So, thank you. If I'm a little person with side is that back in 2012. I started the central belt residents Association based on two issues that I felt personally one was the buildings and the other was parking while parking is to a problem obviously, but the buildings that was a real concern and what we saw is that between Market between 15th and 17th is that can a canyon which has been referred to oral and I didn't want to see that happen throughout the rest of Ballard and it was with great pleasure to see the changes that have come about I don't agree with necessarily all of the suggestions, but I love the concept of the walkability and to work on making sure that the buildings Are part of the environment and a classic example is the building on 50th and Market on the northwest corner where they have a bus and I'll drop off and the building is built right up to the sidewalk and there's absolutely no room to to allow people to waiting for the bus and not avoid the sidewalk eccentric. These are the kind of little details that are important and I mentioned on the desired guy lights. I know that some of my members would not be happy about some of the residential issues example Row Housing houses, but you know over all these We work together for the good of the community, and I think that we have done as best we can and I appreciate the work that David has done to facilitated throughout the process and it's nice to move forward. Thank you. Thank you. I want to give special thanks to David because without his persistence on this this would not have happened. He was in absolute instrumental in helping us channel the energy of the community and always encouraging us to bring more people to the table. We probably had 36 people through our committee over the we would bring people and lose people up in park and what we were talking about but we consistently reached out and David really encouraged us to do that to make sure we had renters represented new residents of the neighborhood long time and really bring that together and it was it was in a process that I hope that the city can use as a model for other communities and empowering other communities. We had a new development go in before these guidelines obviously been adopted that actually used a lot of the principles that we had been gathering with the community and the the building at northeast corner of market and 15th is far superior as far as an asset to the community and providing that space so Thank you and to your point and as a renter myself homeowner homeowner, is that are you at the table and then business owners? We're all neighbors and I think that thank you for your just the 24 mini minions a community means that you all participated in there. Any questions David made in how important it is that these guidelines distinguish allow you allow development to distinguish between all of the different character area. I think Ballard hat is unique in that it has so many different character areas. I think seven it looks like from this map. And so that really adds I think a lot of complexity to the to the work that you have to do in order to maintain that uniqueness because together as a whole it really I think Maintain the character of the entire District. So thank you for for digging in like that. I will now open public hearing on Council Bill 11950 5 speakers are limited to two minutes to put the comment if the speakers comic season 2 minutes, the microphone will be turned off. the first highest Steve Rotella Ballard is probably very appropriate for special consideration. Cuz I remember many years ago that the Ballard was not very well organized and the city looked at it as a free fire zone for rezoning and treated it exactly that way and it needs help. And has needed it for a very very long time. My hope is that you will expand design review to help them even more parking was mentioned when the urban Villages were first proposed design review covered far more territory than it does now and design review ought to cover the whole project that was part of the deal with the neighborhoods, of course deals with the neighborhoods are short-term. the idea of fast and sure with the development Community is forever. Now I hope you have a lot more respect for Ballard than you do for Fremont in Fremont. The design Review Committee out of all the days of the month is always chooses. The same meeting night is a Fremont neighborhood Council the only really citizen group that represents citizens and my hope is that you will show a little more respect for Ballard and that you will add to the authority and not just choose the color of the Hardie board and a few items but still the whole impact of the building and where does it say it does it fit and will it be an asset to the community or just another profit Center? Is there anyone who would like to who Dennis I have to speak in would like to speak? Seems we have no additional speakers. I will not close the public hearing on Council Bill one 19505 Council rules. Typically prohibit us from the same day as a public hearing. However, as we have also been with the guidelines in the past, I like to ask my colleagues to consider suspending the road so we can vote on this today. If there is no objection to that. I moved to suspend the rules to allow for a vote on Council Bill one 19505. Is there a second? All those in favor, please vote I supposed to vote. No CNN the motion passes. Before we move to vote on the underlined legislation. There's a technical minute to design guidelines legislation for the Alonda. Can you describe that amendment of amendments to the council bill and the associated attachment which is the design guideline document. So to there is on our Central staff memo attachment is Amendment 1 to cancel bill 19505 and it's a purely technical Amendment there was in the cleanup of the legislation because I'm the Ballard municipal center master plan area is being removed from the bill. There were some following maps including a upper Queen Anne commercial areas map that was actually updated in the zoning information. But because that was not addressed in the bills title, it cannot account fall within the scope of this Bell. So what we It was just sit merely change the title of the map in retained the very old zoning at this point of that will be updated and I believe the Omnibus Bill later this year and given with mha we already changed the zoning again. So but if needed to be changed regardless, so that is the first amendment and then the next amount was too attached to the attachment which is the design guidelines and merely correcting typos and clarifying language. So and those are all detailed in the memo. Eagle I have any questions CNN I move to a man cancel Bill one 19505 as shown in attachment to a to send to the central staff memo and bicep students attachment one with attachment be to the central staff memo. Is there a second? all those in favor, please vote The amendment passes now. I moved to adopt. Cancel Bill one 19505 as amended. Is there a second? All of them. Please vote by thank you. Thank you. I will be back on Monday June 10th very much. Thank you. Very excited to get uncomfortable 119506 which approves accounts Capitol Hill Design guidelines know it. Would you please read the abbreviated title into the record 06 in ordinance relating to land-use and Zoning amending the Seattle municipal code to approve the Capitol Hill Neighborhood design guidelines 2019. welcome back you on the Yolanda ho Council simple staff from the office of planning Community Development District Capitol Hill resident and practice off good morning. So the reason that we're here this morning is to talk about an update to the Capitol Hill Design guidelines. It's been 14 years since Council originally adopted the Capitol Hill guidelines. And as you know, how much has changed in Capitol Hill. There's been over 50 projects that have gone through the design review process. There is New Light Rail and all those the guidelines for a station sites were adopted in 2013. The bulk of this of the other guidelines have not been changed. So Seattle Department of construction and inspections Capitol Hill housing decided to partner on this project to Assassin update existing neighborhood design guidelines. And some of the reasons why we felt that we needed to update these was because there was a new light rail station. We also have is Joel mentioned. There is the Capital heliko District that was established in 2011 and more recently. There was an Arts District established. And so those groups have really given a lot of thought to how this neighborhood is going to develop in the future and that might not have been fully reflected in the existing got design guidelines. We also updated our city opportunity for us to eliminate any duplication that existed make these guidelines little bit leaner and more specific to the neighborhood to see eventually what additional height and density would result from those zoning changes. And also we thought that this could be a really useful tool for communities as we may change. Stupid design review program overall to encourage more early community and put this map shows where the design guidelines will apply within the Capitol Hill urban center neighborhood Village. And then also I just wanted to point out that there's a few places within the area of where these design guidelines is the Belmont Harvard historic district. There's little part of that is within the boundaries. And again, there are separate guidelines that apply to that area. We also have two major institutions within the urban center Village boundaries the Seattle Central College and Kaiser Permanente and a Rosary are development in those places have different guidelines that are associated with their match major institutional plans. So we did the core of our communication. It was really working with what we called it working group. There are 14 members and we worked with them again over 14 month. To assess existing design guidelines. Look to eliminate that duplication amplifying to make these guidelines to to the Capitol Hill Neighborhood call output circular locations and be more specific so over that time we worked very intensely with that working group and then add certain at certain points. We also invited back from the broader Community. We had an open house in the fall of 2017. We also had a amazing response to an online survey that we did. So that was a real learning for us. It was the first time we had tried kind of a visual. Print survey for design guidelines and people really when you show them pictures people can much more tell you what it is. They like and don't like about the development in their Community. How do we also have another public meeting where we showed the shared the draft? And again, we had an open house in an online survey and then of course, we we did also gather some additional comments towards the end of the of the comment. During the CPAP. They weren't really about the environmental review, but people still took that as an opportunity to share their thoughts and I wanted to ask Joe to share some of their thoughts about being part of this process. I'm about to Capitol Hill about 7 years ago and I am a graphic designer photographer and visual artists and I'm also passionate about architecture and preservation as well as affordability. And what I started noticing is at the new buildings coming in did not look good and they did not fit the neighborhood. So when this opportunity to get involved presented itself, I felt it would be important for me to contribute. Whatever. I have all the knowledge of the built environment to the discussion the process because the discussion was not just about how the buildings looked but about messing and how they live in the surrounding environment how they enhance small business and Public Access. We did have a lot of discussion dedicated to the public realm and three canopy. And just in general ways to engage public sort of around the building and make it more more user-friendly to whole populations regardless of ability. Set a reminder to take away from this was that everyone in the group had different ideas of what a good Building looks like especially when it came to materials. And that's probably the issue that I was interested in most is what they building feels like and looks like and some of us were traditionalist and we wanted brick Hand and Stone and then that only and others where staunch modernist and they wanted buildings that we're Morris Soto. I would say contemporary Bauhaus but we all agreed on this we wanted the new construction to be well-designed. We felt it a lot of the new buildings coming into the north have any design concept behind them. And we wanted to have the evidence of the design work that went into those buildings. We want the buildings to be attractive and to build long-term additions to the neighborhood and not just, you know, clapboard houses that will have to be rebuilt in 20 years. And finally, we wanted them to complement existing architectural style. It doesn't mean that they have to mimic Earth, but they have to respect them and fit within their surroundings. And you call it in materials? I guess one thing that was that I wished was also covered in the process as I wished. We had more references with a lot of examples from the neighborhood in from Seattle in general. But I wish we also look at how are the cities internationally solve the problems of urban infill and there are certainly a lot of examples of how they do it in Helsinki and Amsterdam and Berlin and Moscow. And I think we could we could have been less insulin learn more from others. Thank you. I guess I would just about a couple of things one. I just want to. Command Patrice as well as Christina gone and Aaron Darcy from DCI being very active and engaged Partners. I think the bottom line in terms of what we learned and often learning as the process of relearning. Right what we learned in this process. Is that a good process combined with Community ownership and Community leadership leads to a good outcome for that Community. We were we were really happy to have this opportunity to work on the design guidelines design guidelines are A pretty limited tool. I think we can all agree. and to be honest it wasn't The tool we wanted porting tool but we and Diane Sycamore now Samus after I can testify that just about every year. We we dark in the doors of the opcd offices and say we really want a new neighborhood plan. It's been since 1998 and as Patrice said the neighborhood has changed a lot and Sam's response in this case was but we can't do a neighborhood plan. But we do have a little bit of funding to work on a Neighborhood Place Neighborhood guidelines update. So we're happy to get that opportunity. And comment on that I would suggest that you have a lot of common cause with a lot of communities throughout the city and your desire for an updated neighborhood plan and might want to consider figuring out how to mobilize and put to use that, cause it's something that we hear a lot of all over the city. Thank you. Yeah, that's that's my impression as well. I know that are interesting and needs are not unique but we we wanted to bring to the process as much as possible with the design guidelines update is how could we In bed and include some of the goals and priorities of the capital of Inca District in the arts district into design guidelines again recognizing that it's a pretty limited tool but I think we did pretty well. There are pieces in there about regenerative design habitat corridors reinforcing the architecture that's there that we want to reinforce and provide additional guidance. We did have many monthly meetings and many Community forums and they were very well attended which I think speaks to the the appetite in Capitol Hill and I think you would agree to be engaged in to come to the table and work with the city on these things. In terms of you know, I'm always as working with the Eco District. I'm always asking the question and I think council member O'Brien knows this especially is like, okay. What's next? What should we do? Building on this process we did identify a lot of things that could be included in the design guidelines and a lot of things that would not be as appropriate to put into that tool. And one of the things that we've been focused on is really how do we shape the public realm is as well with goals that really reflect the community's interests in terms of health health and resiliency. So we have been working with s. On a public life study and will be continuing that work through the year and I would like to plant the seed of a request for 20/20 that asked. Get expanded funding to help Implement some of the findings from their public life study that they're doing not just in Capitol Hill but in other neighborhoods The public realm is where the city has the most agency and where the community wants to be incredibly involved. So I hope that we'll have more opportunity to help shape the neighborhood and short of a new neighborhood plan. I think of public ground plan might be the next good thing that we could do for the neighborhood. Thank you. I could Joel and Lana. So I think both touched on some of those priority design issues that were uncovered during this process and the architectural qualities walkability the local values of the ego District the arts district in the lbgt community. We will definitely Greener more resilient and as much attention to the public realm to that area between the building facing the curb as to the actual building and in the private realm components within the building and then also looking for opportunities as the major institutions in those areas consider changes to their plans what guidance we might give for the areas around those major institutions. Some of the key things in the context insight and hang out those distinctive streets and particularly. The retail quarters are are so important in Capitol Hill has several important ones and also kind of balancing and that was really an interesting discussion is when you have very old and very beloved buildings, but also new architecture and actually in Capitol Hill that's part of the character of the neighborhood and but so how do you balance those two Desires in in the design guidelines? And then also seeking creative opportunities that reflect the local communities culture? And here's just an example. This is the energy choices section of the guidelines and there is a lot of directly from from the Eco district and interest in green buildings and the neighborhood. Public life. So again, this is this is this was a big issue and we did spend a lot of time talking about how these buildings help to create and contribute to the public realm and some of the key places are the connections between Capitol Hill green spaces and those and those areas where new development might happen and how they can contribute to some of these corridors continuous Street walls and and ample pedestrian space particularly along the retail Corridor is where we want to make sure that there is adequate space for people to stay together and to walk. We also had a lot of discussion about about what was happening and in that public Realm So there's there's really as as much interest in this public realm as there was in the actual design of the building. So I would say, you know, it was really like a 50/50 mix in terms of the discussions that we had interesting way. This was also during the Bike Share pilot program so that we did spend a fair amount of time talking about bike parking and and came up with some good suggestions of that that will be implemented in the future, hopefully. Hopefully bike and scooter parking. but And here again is just an example from the public life section where we see a lot of those values about access inclusive neighborhoods interesting. We spent a lot of time talking about weather protection and and how we can still accommodate Street trees and and still provide that weather protection. That is desirable particularly along those retail Corridor is The design Concept in again. This is the area where we talk more about the design of the buildings and we had some quite interesting discussions about what it means to be a building in an Arts District and how how can those new developments how can the design of those new developments contribute to that? And so again this idea of having flexibility and adaptability. Although the design guidelines do not speak to the uses within the building. We felt that designs that were flexible again with would help in that particular situation to accommodate a lot of other kinds of accommodate a range of uses and hopefully some Arts uses. I'm also a lot of discussion about how we can integrate into the buildings again to reflect the Community Values. We met with the arts district and we had a lot of conversations about what it means to reflect the lbgt culture and history in the community and it's more than having rainbow crosswalks in the right of but but yeah, it has to not be overdone. And so that was something that we didn't have specific Solutions, but we were able to flag that that was definitely a desire and the community And again here is is just some of the some of the example language that we've included around ground-level open space and and residential open space again, a lot of that kind of shared realm was really important in our discussions. so so we'll leave it there and if you have any questions were happy to talk more about colleagues Atsion just up moving too fast for me. Sorry, you know, there's so much going on in this neighborhood and has been then we'll be for quite a while and it's it's got so many interesting things. It's not dissimilar from Ballard, but it's obviously very unique and I really appreciate the you're the worst. Did you have to chase in the north with a visit up Steven the community members are to come together to really be thoughtful about what can be accomplished in the neighborhood and I'm excited to get these are some of that I'm excited to see how they work going forward. I think he'll has been for such a long time. I know one of those neighborhoods, it's on the kind of the Leading Edge of what we try in the city. And so I appreciate that thoughtfulness about how to both retain what's important and grow It's going to be it's going to be interesting to figure out that balance and my sense is that committee members are generally ready to embrace that challenge not going to be easy, but I'm excited about that. Thank you for such a process and I like to swim a lot of my time in District Four but Bakery the closest bakery to voting district 3, so they're frequently. All that, excuse me. I'm going to I'm going to open public hearing on Council Bill one 19506 us because the two minutes of a common and the speakers, next season 2 minutes a microphone microphone will be turned off. First on our list is Kellie Martin. Yes, I did. My name is Kellie Martin. I live on Capitol Hill. I moved here 45 years ago. I did answer the online survey by the way, and there were some difficult decisions to make but what I'm really here for is to discuss another matter that does take place on Capitol Hill councilman O'Brien you might want to cover your ears. We all know the budget constraints of city has right now and I need to prioritize prioritize or Revenue. Enough of that enough for the protected bike Lanes already. It seems as a maybe 10 years ago bicycle started to become more prevalent on the streets of Seattle. What used to be shared roadways are now slowly being taken over by cyclist demanding more protection for their decisions. No one is forcing anyone to ride a bicycle. Anyone riding a bicycle must always realize the dangers. They are subjecting themselves to if the city is taking away parking spaces needed for businesses in Duck business. There's no excuse for taxpayers be paying for bike Lanes to protect bicycles. They can learn the rules of the road and integrate by Floyd Vehicles the way it is always been in the past or they should consider alternative means of transportation. Right. Now the Department of Transportation has asked has been asked to remove all parking From the Block that I live on this is Melrose Avenue between Olive and anyway. This block has approximately 40 parking spaces used by the Residence Inn in the three buildings on my block 3 loading zone spaces used for deliveries post office. UPS. FedEx Amazon waste management recycling even a school bus. Bicyclists have never had a problem with music industry for years. And now for some reason it's not adequate enough for them. Thank you. Next on our list is Steve rastello. Again, you're not thinking big enough design review ought to really look at the situation and all your pictures of Capitol Hill where during the day Capitol Hill is a different place tonight. Capitol Hill is not the same all the time and parking is a very interesting thing on Capitol Hill. People have not given up their cars, even if they use a lot of Transit unit. They used buses. Even if they do other things so you're going to are you should consider in design review looking at cumulative impact now, I know that that's a dirty word to the city because each project should be look at totally by itself as if it was in his own Universe, however the city Is one place not a series of little universes. So you must open up the process again add parking look at bicycles. Look at the sidewalks. Do you care at all about pedestrians? You know, I mean, even if it able people as you start putting more and more vehicles on the sidewalks and when you're looking at your device and walking on the sidewalk and a bicycle scooter or other device a motorized skateboard comes whizzing by you know, you don't want to see your life going before you quickly. What you want to be able to do is go reasonably from where you want to go and do what you want to do design review is only a skeleton of what it should be. We should be building a city for peep. Not a city that people want to leave. Is there anyone who did not sign up that would like to speak? Soon as we have no additional speakers. I will now close the public hearing on Council bill 119-2506 just like we did before I would like to ask my colleagues permission suspend the rules to vote on this legislation today. I move to suspend the rules to allow for a vote on Council Bill one 19506 on the same day as a public hearing. Is there a second All those in favor, please. Vote by the motion passes Yolanda. I believe there's a technical Mehmet to these design guidelines as well one 19506 which are the Capitol Hill Neighborhood design guidelines. Just cut some typos, and I'll basically it's so that those are all listed in the memo. Hamilton and Council Bill one 19506 by substituting attachment one with attachments e to the central staff memo. Is there a second? All those in favor of the amendment, please vote I now I moved to a council Bill one 19506 as amended. Is there a second? I all in favor of the motion, please what I the motion passes. Thank you. The legislation will be back before the full Council on Monday, June 10th. Agenda item is a public agenda item is a public hearing impossible possible vote on Council Bill 1 19498, which allows were limited expansion of the major institution Master plans into industrial Parcels know it would you please read the abbreviated title into the record low in limited expansion of major institution uses in a portion of industrial zones located near Seattle Pacific University and amending sections of the Seattle municipal code. We are joined by Lish. What Whitson of central Council Central staff list. Do you have anything you like to learn it before? I open the public hearing? Yeah. I thought I would just remind the committee on what this legislation does. It is related to Seattle Pacific University, which is located on the south side of the ship canal on the north side of Queen Anne Hill Seattle Pacific University is one of two major institutions in the city that about industrial areas. The other one is University of Washington. This bill would allow for Pacific University to consider expanding the campus on to a couple of blocks at the northwest corner of campus in existing Industrial Area. It does that in two different ways. First. Did it changes the industrial? Land use a table to state that major institutions uses are allowed as of right well are allowed in this particular area shown on the map in blue and it also amends the major institution chapter of the land use code to allow for the expansion of the major institution on to these two blocks. So the legislation would allow Seattle Pacific University to either Matrix to smash your planner prepare a new matrices master plan that includes these areas these blocks In their campus or separate from the Matrix tution Master Plan update process would allow for the Matrix addition to construct buildings in this area. Are there any questions? I will not open the public hearing on Council Bill one 19489. Stick is limited to two minutes before the Common Table the speakers comic season 2 minutes and microphone will be turned off. First on our list is Daniel Martin. Good morning. My name is Dan Martin. I serve as a president of Seattle Pacific University and draining my eighth year at University want to thank the council for your service on behalf of our community and thank you for your time today. How to reduce the approval of this proposal which is really the implementation of the comprehensive use permits and plan from December of 2018. That was before the council. This was really a result of community conversations in collaboration between the University City Council staff elected officials are Community neighbors and concerned citizens and Industrial land use owners within that area. We're grateful for the conversations that we had in this proposal will simply extend these conversations as we collectively think about the best use for these particular parcels and how that may benefit broader Seattle. We've been in this exact location since 1891 and we were founded in 1891 Seattle was simply a city of 40,000 people in our Founders. Not only had a great vision for this University, but for the greater Seattle area, they saw us not just as the sea. At the edge of the end of the United States, but really a city at the edge of the future, and we have become that a world-class city world shaping in a world to finding City, and we've been apart of that Creation in this ability for us to move forward as a community. We want to continue to do that. So we look forward to the conversations to the ways in which we can be involved and stay engaged within the city as we move forward together for good. Thank you. Thank you brother martin. Next on our list is Steve, Gillespie. Morning, Steve Gillespie Foster Pepper for Seattle Pacific University. And I want to thank the committee for taking up our our bill and on a bank President Martin for coming in presenting to show how important this is to the university not easy to find 3 hours and University president's schedule in June. But here he is along with the vice president of the routing for this bill and weird you do to pass it up to the full Council as many of you as you all know. This is been a work-in-progress for several years now for probably 20 years of the community has been encouraging the university to look North into this area food to accommodate future growth. And this is the University of responding. And with the community is President. Martin said, we very carefully crafted this legislation to minimize any unintended consequences and as a result we have the Port of industrial and Advocates people who have spent their entire professional lives advocating for Seattle public dustrial and support this proposal. I would add only that. This is not the end of the conversation. This is the start of the conversation what the next step will be when the university comes in for a major institution master plan. There will be a very robust public discussion about the proper use the best use for the public of these Land This is how Community planning should precede the community talking to Al and user land use for the institution in this case responding engaging and bringing it to council and we really appreciate the collaborative nature of this process and your support. Thank you. Thank you next by Steve Rotella. It always starts though. sweet it always starts with real limitations would like to look at the history of the city Seattle on that major institutions once you're in the door. The city shows very little restraint on usage. and your Outreach Many times our presentations of what is going to be regardless of what the citizen say after one of your Outreach meetings in Fremont. Wa hours ago. I was talking to an MBA and they explained to me that I thought this was more of a selling meeting. They said yes this type of meeting is always a selling meeting. So when you go forward take a look does this property really belong as part of the major institution because once in the door, we know what's going to happen. It takes sometimes a short time and sometimes a little longer but whatever the needs of the University That's what that property will be. And what we say right now has very little relevance to the actual usage has which will evolve and sometimes very very shortly. Now when you say nobody told you that my name is Steve Rupp stello. Nobody. Is anyone who did not sign up with that would like to speak? Seeing as we have no additional speakers will not close the public here on Council Bill one 19489 Collies. I'm going to ask him to suspend the rules again to vote on this item today given that we have heard this item in committee three weeks ago and given that it is implementing a comprehensive plan amendment that this can be ready. Did last year I think is appropriate to move forward today. I moved to suspend the rules to allow for a vote on Council Bill 11948 9 on the same day as a public hearing. Is there a second? Those in favor, please vote I is there any further discussion before we? refresh my memory when we amended the comprehensive plan last year that was specifically to take the area out of the plan the area shown in Blue on the map was removed from the Ballard Interbay North End took that action and there was General support from from the folks associated with we've been met for that for that action at that time and this legislation before us today only sets the stage for future possible actions that Correct. It would allow the university to apply for development permits under the industrial zoning limits in this area as well as allow them to expand their major astucia master plan, which would require a either new plan or significant Amendment to the existing master plan, which would be a multi-year process. So one or both of those things either of those either one of those things in order to basically utilize The Authority granted by Judge pistol, and I should mention that they own some but not all of the property in this area at this point. And y'all are having practice a little bit through the Comm plan process was I've been impressed the ability of the University of the major institution to work with the adjoining property owners, including the dim Nick and I've I've heard I've only heard support for this plan not an easy task to do so, I don't exactly know how all those conversations work. But I applaud you all and bring that forward and some more to what this was saying. This is this is a step in what is likely a very long process. I imagined for University of it's been there for as long as they are there thinking about decades to come in. This is one of the steps I need to take and I think it's an appropriate place for them to be at least considering planning for expansion is I support portal. Well, I moved to adopt Council Bill one 19489. Is there a second second all those in favor? Thank you. This legislation will be back before the Council on Monday, June 10th item of business. Today is a briefing public hearing it possible to own a clerk file 3 1 4 4 1-3, which is Council land use action to allow for the temporary expansion North Seattle police precinct know which please read this item into the record agenda item 10 clerk file 3 14413 Council land use action to approve a temporary expansion of the north Seattle Precinct located at 10049 College Way North Effects of second chance to sit down woolfolk's please introduce themselves and all right kiddo Freeman Council Central staff. King stci partnership Architects for the project finance and administrative services Burberry Chief Operating Officer Seattle Police Department Eric Santo captain of the Seattle Police Department North Precinct Chelsea a couple of introductory things to orient the committee little bit of legislative history and then turn it over to stci and FAS, but this is a different type of action for the castle to take Medicaid flee. The castle has to come act on a land use approvals for City facilities affect the legislative history on the committee members for call at about three years ago the council deferred a decision on a new North Precinct. And as part of that decision making I'm allocated approximately eleven billion dollars to FAS Hopper interim improvements to the current fishing facility and for planning for a future Precinct the action that time you may take today and have all the public hearing on a land use approval for the former for the internal improvements. So I think that's pretty much all I have to say. I'm about to turn over to Lindsay here to talk about this type of decision and then leave from FAS on the phone number. We have start stop by about 11:40 so we can move it a little bit quickly things were a little bit behind. Thank you for having us at I-5 action is required by the land use code when a public facility exceeds a certain size threshold or is unable to meet development standards. So the proposal you're saying today triggers, both of those said exceeds 10% Edition from the existing for area and will request a waiver of development standards. The format of the meeting is that Duncan and Andy will give you an overview of The Proposal at the site and how it fits on the site and then I'll take you through the review process. That stci does including the environmental review and finish with our recommendation. Text Lindsay, the purpose of the project is to provide a short-term solution to accommodate additional officers at the overcrowded Precinct was built in 1984 as since gone through numerous renovations to maximize the amount of staff that can fit inside the building. Africa sample of the community room which is a popular which was a popular amenity for the neighborhood which is also used as a roll call room was repurposed to fit more lockers. So it's actually every available space has been repurposed to serve critical needs to the precinct in addition to that currently SPD Lisa's over 5,000 square feet of office space in a nearby building to accommodate their detectives and the community police team and other support staff separating Staffing different buildings is not an ideal situation, since it does not promote be spontaneous interactions and sharing of information among the detectives and Patrol officers and we've explored options at least additional space. But again, this was Dean's operationally infeasible due to the reasons. I just mentioned So the proposal allows for additional officers at the North Precinct for the short-term and for planning purposes. We have assumed up to 50 additional officers by 2025. Now this is not a hard number and it's a very hard number to pin down but for the sake of our analysis and reports that's what we've assumed and now Duncan theme our project Architects for walkies to the presentation. So the site is located in North Seattle Western Northgate mall across Interstate 5 just Northwest of North Seattle Community College and go quickly. He needs at the time. It is surrounded primarily to the west and North by a mixture different types of residential zoning. It borders directly on the major institutional overlay for North Seattle College to the southeast. The site itself is SS 7200 single-family residential zoning designation. Oh, I'm sorry. I would also add that the entire area is in the Northgate overlay Zone and this space directly to the north is in the urban center at Overlake Northgate. The project scope basically includes the addition of the location of three modular buildings on the site to serve three particular needs one is for a break room space for the police because our projects proposed is taking their current break from space and repurposing it as a roll call room. A storage portable will take care of freeing up space inside the precinct to allow the creation of the interview rooms that are badly needed a place to store their unusual occurrence gear and in the front parking lot the public parking lot for proposing a small trailer that will become a community room where the police can engage in meet with the public. Are all three of these trailers are currently owned by the city to Seattle. They were formerly used as temporary fire stations during the fire Levy project. Project also includes expanding parking to provide more location for fleet vehicles primarily the addition of landscape the preservation as much as we can of existing trees at the neighborhood prices and some some modest improvements to the existing Wetland on the site. Parking is an important component of the project our project by locating the temporary trailers or I should say in a room or modular trailers remove 22 spaces from the available portion of the parking. We are expanding to the South will add 20 to scan. It will add 35 spaces for Annette at I'm sorry, and I can 13 after we have 35 more. My map is better than seems when I'm talkin right now. The parking has been tailored to accommodate the requirements there been put to us through his land use review with sdci of which called for us to use to characterize the precinct building as an office use and then told to make sure that we provided adequate parking to serve the police's Fleet needs. I can go into more detail. It's a complex topic, but the proposal is to provide 30 more spaces. As a part of accommodating than the needs of 50 digital officers working from the site. Project landscape proposes creating buffer landscape around the new parking areas. We are preserving trees around the new parking area the our initial submissions looks to maximize the parking in would have made it difficult to retain those trees. We have working with the community responding to community comments of pulled back the parking in order to preserve them. I'll comment that we didn't have an arborist review the side of that identified one exceptional tree. It is located in the Wetland. It is not one of the trees at the neighbors asked us to consider saving. Part of the work includes providing an area of enhance planting at the Wetland to mitigate for the boundary adjustment. We made to the Wetland to locate the the storage trailer. So it sounds like the proposal before us is kind of balancing both parking and the preservation of trees. Yes. That was the intent. I'll look for some quick very simple renderings. This is a view of the front entry of the north police precinct from the Northeast the site from 103rd Street looking south west across now that's existing condition and our proposed location of a modular building for the community room would be at the front near the corner of the site. Further on down the same street. We've just moved to the West this is looking out over the existing secured parking lot from 103rd Street looking South The Proposal would raise the fence line around the secured area from 6:50 to 8 and locates of modular trailer at the middle of the parking area to be used as break room and some storage space for the police officers. Finally, this is at the South End of the site to the left. You see the open area south of the precinct where we intend to expand parking is parking would include an 8 foot tall chain-link Security Fence when you can see in the left are the extent of the parking lot in the foreground of some of the trees the community asked us to make sure we preserved in the process of Designing this project. Are there any plans for the care and watering of the vegetation surrounding the precinct? Cuz it mouth is hurting has received inquiries about that. Set of 3 landscape that we put in place to help screen. The parking lot will be maintained by fire maintenance staff. So finally I prophesied that shows the the one development standard approach for asking for an exemption in a single-family or residential zone parking is ordinarily not allowed in the front yard setback. This being a an unusually shaped lot that that long front short of curving front. Along College Way is the front yard of the building into our parking area intrudes into it. 1200 often I got this is a slide for things. The first is to identify any waivers of development standards that will be requesting your project proposal. This is what we're asking for today is to allow parking in. The required front yard is the part of the process we go through a public comment. Two other items that are to identify any comments from affected City departments or other neighbors public that are submitted mstc. I did receive comments from Neighbors but not from City departments receive comments related to the Wetland lighting impacts trees noise and parking in traffic and I'll touch on each one of those as a relates the Wetland Wetland biologist report was submitted as part of our environmental review are Wetland biologist review that including the buffer averaging and the restoration. It was found to meet code requirements. No additional medication is being proposed. Trees Duncan touched on the exceptional tree that is located in the white line that will be maintained in addition to a number of large mature vegetation have been maintained around the perimeter of the site on a tree protection management plan was submitted as a part of the project proposal and has been recommended as a condition of approval that that be maintained to all future permits. To adjust the lighting and Paxil lighting impact analysis was submitted for review. It demonstrated that there's no additional Claire that will be impacting the Wetland nor the adjacent residential structure. So that was found to be clients as a relates to noise impacts on STI review the noise protection code which identified that the noise allowance in a single-family zone is quite General and Broad. So we recommended a condition of approval that the noise specific to construction be limited to 7 a.m. To 6 p.m. As a relates to track traffic and parking that is a complex review and we had Transportation impact analysis as well as parking utilization studies submitted. What it demonstrated was depending on the time of day. There would be an anticipated 17227 parking Vehicles spilling onto the street and the parking utilization study showed that while those additional cars are parking on the street. It would still be below if this utilization rate that is accepted by the city. So the parking utilization is anticipated to be between 6763 and 73% The city has a threshold of 85% So no additional medication was warranted. I'm finally the component must demonstrate why there is a need for the public facility in the single-family Zone this facility exists and the single-family Zone and until a new facility is developed. It is anticipated that the needs of the police department are going to continue to grow that proposal that you see before you is anticipated to meet those needs while balancing the location of the Wetland and the location in a single-family Zone. We we confirm that there is a public necessity for the Edition. So we recommend approval of the proposal puppy for you today with recommend with conditions for noise as well as the truth and protection management plan. Clarification question is it accurate to say that the reason you're before us to make this request for the modification development Sanders is just because of that orange area if the parking did not go into the orange area. You would not be triggering this requirement. There's two reasons were here before you one is the waiver of development standards for the Orange area. But the other is that because you're in a single-family Zone, there's a limit on the amount of additional area that you can propose for a use for a public facility. So the limit is 10% of the existing grass play area. The fleet parking is included in that calculation. So that is the living balance your public engagement around this is made reference to stop receiving public comments along the several highlighted areas from noise to the wetlands and some of the other issues. Were there actual public meetings that you had or did you just notify the public via notice to the residence and and property owners in the affected area? There was no public meeting held the public comments were distributed to an area. I believe it's 200 feet and proximity to the Publix at the site 200 or 300 feet. So I'm mailing a scent as well as postings on site. So large white signs there. They have the ability to make comments All Through the review process. So and a number of months. And also I drink the design phase in partnership with the Department of neighborhoods, and also the community police team we did do I reach by, you know, creating Flyers bring up the website and also relying on the North Precinct officers to talk to the neighbors and informed them of the project that there are findings conclusions that are part of the attachment are those findings and conclusions. Basically what we've heard hear about the recommendations for how to address the various identified impacts is so attached to the memo just now and there's also a proposed findings conclusion indecision documented that is essentially the document that the Council on what act on if the council chooses to crank exception approval of the expanse. And modification of development standard and it essentially make similar findings the same findings to what Lindsay proposed and also incorporates the conditions recommended by CCI. I never questions. CNN I'm now going to open Public, public comment on hearing our town clerk file 31441 three speakers are limited to one minute of the common is speakers, succeed one minute. The microphone will be turned off first analysis Irene h First thing I want to say is one minute is completely inadequate but because that's completely inadequate. I'll just simply say this. I'm a live behind the police station for 31 years. They're basically good neighbors. I have no problem with the police but this expansion doesn't take into consideration the neighborhood and the impact is going to have on the neighborhood. I am part of Belvedere Court homeowners association on May 26th. We submitted a letter that had nine suggested changes. I would ask only that you actually read our letter and considerate before you vote. So please don't just do a pro-forma. We've considered everything we're going to waive the requirement and vote on this proposal today. I would request a courtesy for the neighborhood of you actually considering our recommendations, which we believe accommodate both the police's need for additional change and the concerns that Neighborhood has about the police station being built there, and I'm out of time. Thank you is David Haynes? City council should reject any more expansion of investment in any more buildings for break rooms for cops. The police department in Seattle has failed the community and have a policy of coffee Outreach the falsely Asher law-abiding citizens there safe policing in Seattle has a bunch of lazy breaks built into their Union efforts that resulted in harassing citizens with a new catch me lease and meet and greet. Take away the cops lazy accommodation and demand for more survival gear by God. Take away. The lazy accommodation cops are demanding police are getting rich off overtime not fighting crime. In Seattle reject us out of principle that cops were hired to jail criminals not take breaks at work. Maybe we should put the prolific offenders in a module and break their habit. Anyway, we need Bill and prove it at the police department. Thank you next to Steve rossello. Is the Fortress ideas still alive? We still haven't done anything about a very long problem. This is not new to the police department in the north end. This problem is going on for quite a few years. If this is a city waiting till it gets so bad that you must accept the only plan that is still available. Let's start making a real plan for long-term not something to get us through a few months or a year. The police department is had that building for a very long time. It has changed that building is way too small and you may have to look at 2 Precinct in the North End my God that might give better service we couldn't do that. Could we but the police really need a building that works, but you also have to consider where it is. So let's take a look at do something. This is supposed to be a planning committee as well as loud. juice what anyone else who did not sign up to speak like to speak? And just so that we are able to keep record of it. Please be sure to sign in for the agenda. But I thought that you had already found a spot on Aurora from what I had read earlier and I was really surprised when I went by there recently and saw that they had eliminated a lot of the parking that I used to use when I went to North Seattle a couple years ago. What about the cost? I mean if it's just a temporary fix, I mean, is it really worth the cost? Why don't you just do something permanent and put underground parking gets all these cars off the street and I say that for all development. chili do sign up. Well, seeing as we have no additional speakers. I will now close the public hearing on clerk file 3 14413 Tell colleagues I'm going to turn to you and ask that we table this vote until the following committee meeting and so that we can have some more time just to both respond as well as complete as meeting on time. Is there a second? I don't think we need a second given that you otherwise we were going to consider waiting the rules to vote on this and given that the action that you would need is a motion for and a second floor in a vote on would be the waving of the rules if we're not living the Hills. Okay, so we will table this decision until the next committee meeting for the pledge committee. Our 11th final item today. Unfortunately, we will not have a chance to get to as well and I both want to be respectful of both my call time, but the time and appreciate me Members coming out to speak today that we table this as well for the following plus committee. Bring a motion for that now that we have approved attendance. Motion passes thank you to everyone who's been engaged with us on these issues. This will be back before that's Pleasant meeting on at the next meeting concludes our June 5th, 2019 meeting of the plus committee as a reminder. Our next regular meeting will be on June 19th starting at 9:30 a.m. Here on council chambers, and we will continue where we left off.", "end_time": 7348.6}]}