{"format": "raw", "annotations": [], "confidence": 0.9483952160295286, "data": [{"start_time": 0, "text": "Deco are both inside won't be doing it soon. So since I'm going to be here for myself by myself in the beginning, I'm going to move adoption of the agenda. And since there are no objections agendas adopted. Thank you very much. That was well done. You think thanks. Thanks so much just to give you a little update. I'm going to take public comment. I'm going to ask you to keep your comments to a minute. I've got this notebook full of things that we get to go through today. And I know you're all excited about the technical amendments. I know that's why you're here. But actually I will just as a little preview on the Amendments. I think we've worked most of these through so don't feel like you are having to twist our arms. There is money in the budget. I have been working on this for weeks to make sure that for example that are downtown Emergency Services Center nurse will be funded our lead database Staffing and funds will be funded on the AIDS Memorial pathway. This is a special ad council member former council member Tom Rasmussen has been here working with us on this our Human Services Cola that's going to pay the cola increases for non. Go fund contracts. We've got money in the budget to handle that are Highland Park intersection. The University Heights elevator all included the food bank support for the U District Food Bank and I believe we've got an amendment for D5 the north helpline Food Bank milk. We don't okay moving on the green janitor education program that will be supported. The last two were going to have the finesse a little bit on the native cultural organization support cuz we haven't run that through any kind of an RFP or competitive process and also that hsd dashboard tracking performance. There's some issues that we don't want to duplicate what's been going on with all home. But if you're on any of the first the top 10 you're covered so welcome to City Hall and glad that we're going to be able to move ahead just know that we're going to have money to support your projects. Okay. So with that, I think the next thing that we're going to do is just jump into public comment for a minute apiece. It looks to me like we've got fifteen people signed up. So Lindsey grad, welcome back in a long time. Glad you're here Maureen Ewing. You're the you're the top three. So if I could ask you just to line up at the microphone, so we're just ready to go one after the other other dese nurse in particular and the hsd inflationary increases. So I'm really glad that both of these Amendments have been brought forward and are being supported and in particular when it comes to redirecting for similar purposes the HST inflation adjustments just want to reiterate that we supported both your budget work last year which created the spot of money and the inflation adjustment work done earlier this spring into this is the Logical way to fall for it on those values and make sure these workers are being taken care of. So, I appreciate your support and your work on that thing and Lindsey thank you for all of the support you and those that you represent has been very helpful to hear from you. Thanks, very good Beth Moore in and then Jennifer Good morning, Madam chair and councilmember Bagshaw. I am definitely cheering co-chair of University Heights. And if I heard you correctly we are included in the proposed budget amendments and that is what I was here to advocate for and I'll just briefly say that University Heights is has invested over four million dollars into the capital program and projects that you Heights from since the time that the state of Washington and city of Seattle purchase the community center in 2009. And then we've made huge progress on all sorts of projects seismic for completing the Steinway for rebuilt the outside the park the the Pea Patch the parking lot and everything, but the next thing that we really need to tackle is our Ada access to the building and so that's why this elevator project is so important to us and so important to the community and I asked you to extend my thanks to your board that University Heights Center is such. Jim for the University District and I want to acknowledge that you've had great support from Abel Pacheco. And of course his predecessor Rob Rob Johnson, and the mayor's office is also indicated. This is important for Ada purposes. So I'm a great request and we're happy to support it. Thank you Jennifer and then Jerome and then Matthew Sean Madam chair. We are very appreciative that you're including us in every appropriation the same and we have resident organizations that provide critical community services for children on the autism spectrum for homeless youth older adults and more our vision is to be a place for all and we can't do that without an elevator right now. You have to climb 15 Step Steven Acme now, and so either people get to the door and they leave we've had Groups for my new Heights theater Alliance refused to perform because we are Ada accessible just last week. We had a Hogwarts camp and there was a 11 year old girl who participated who had was wheelchair-bound and I watched her everyday she refused to get on her left because it's scary and now it's not working and we're having to dump five grand into it, but I watched her climb up the stairs with using only her arms and she had to go in and out several times a day and she's always the last person out for recess for also. Thank you very much for your support. Absolutely. And thank you more than I appreciate that. Desmond is quite a visual and you know that our office has been really leading the charge around all ages and abilities and making sure our buildings in our city as a whole is accessible. So thanks for bringing this up. Appreciate it. Okay, Jennifer Jerome and then Matthew My name is Jennifer Annabelle and the executive director for the academy for precision learning. We're located in University Heights. We serve kids all across the autism spectrum as well as we have our high schools on the second floor. We have families, but Dad was in a electric wheelchair and cannot the lift won't hold him. So whenever we have meetings, we have to meet us off campus. We also would graduation time when we hold it upstairs in that great Auditorium there. I have to go off-site if I have anybody that is not able to access the building. So I really appreciate that we can now be accessible to everybody and also so they can participate in their kids planning and education. The other thing is I'm also on the board of directors for Broadway bound Children's Theater and they have they put on shows up in the auditorium as well in the summertime. It's like five shows every Friday and we have a really hard time when it comes to grandparents and make and helping. Be able to get up those stairs without to take many breaks, and it's really important for them to be able to come and participate. So it's we're grateful and very thankful that you support this as be greatly appreciate it, so everybody can have access. Thank you. Thank you. Thank you very much for that. And for all the work that you're doing Jerome Matthew, Stephanie. My name is truck broker. I'm a janitor at 1101 Madison part of the Swedish complex. I've been a janitor for 42 years and my concern is environmental products be used to clean. The buildings education program would be much appreciated want to make sure we're doing the right thing for future generations to come after us. Education program would help me very helpful. I know that. many of my co-workers probably don't have an interest but there are some of us who have Is concerns thank you. I appreciate you coming down today Matthew Stephanie and then Lauren Ross. Matthew, and executive director the Seattle 23rd District an organization is trying to significantly reduce the environmental impacts of buildings by the year 2050. I'm here today to talk program. I'd like to thank you for your support. It provides one more solution to building on his to help them improve their environmental performance of that buildings. But it also provides additional training to Janet has in those buildings the program and I like showing significant Savings in both Energy Water waste and then also the clean building of the clean the green cleaning products, That's hard to say. But this program also shows that everyone has a significant role to play in combating the climate crisis that we have here in the world from the for the building of the building by also the people who work here. So thank you very much. Thank you for coming Stephanie, Lauren Britton and Richard. Good morning. Good morning. My name is Stephanie cell and I am the Washington State policy coordinator for the blue green Alliance. We are a labor environmental partnership that seeks to create and support good jobs in the clean energy economy and I am here speaking in favor of the green janitor education program. Thank you so much for your support. I will just briefly say that my work is often focused on trying to create good jobs and think about are mostly in the clean energy sector solar installers retrofitz that kind of thing but it says it's really important to be thinking about the full range of the our Workforce in our workers that can benefit and want to be part of the solution and a clean energy economy. They want to have cleaner materials, you know to be doing their work at different times of day that can help save energy while having a better work-life balance and to provide Workforce Development in a more Economic Security. So we're really excited about this program. Our colleagues in California has been involved in found it successful and we're really excited to see it. Thank you so much for coming both Matthew and Stephanie. It matters a lot that we are focusing on not just Workers Health, but that the impulsive impact that we can have on buildings by getting rid of some of the toxic materials. So well done. Thanks for doing it counts members Pacheco and the skate of my buddies. Thanks for being here. Okay, please visit Improvement area. I'm here today in support of the city looking further into solution surrounding unsafe RV conditions Soto faces a public health and safety crisis are encampments for Denton unsafe and unsanitary environment for all and have a direct impact on the social and economic health of the area. We strongly support policies that address the health and well-being of our social studies on shelter residents and the health and well-being of the more than 45,000 employees that come to work in Soto each day that sort of remains committed to being part of the solution. I want to work with the city to develop a plan that dresses the very real tragedy of homelessness and the unsaved environment creates when neglected as a husband and said no, thank you. Thank you very much for coming Richard and Tracy Gillespie. Hello, and thank you for the record. My name is Brighton rice and I'm here representing the Northwest Energy Efficiency Council. We are a locally-based nonprofit trade Association that represents the Energy Efficiency product and service providers. And so I'm here representing are one of our programs which is the building operator certification program is a national program that is a training and certification program that helps the people who go through the program make their buildings more comfortable efficient and environmentally friendly. So we're here to support the green janitor training program as well. And I'm very interested to support the program and help empower the people who work and buildings in Seattle and I'm realize that they're the ones who can actually make the buildings more green and how I see I don't need their climate goals, and I'm so thank you very much for your support and Richard good to see you again Tracy Gillespie and Good morning, honey. I'm here today on behalf of Youth Care board of directors and in support of council member must gay does amendment to carry forward unspent 2019 funding for an inflation adjustment to Human Services contracts not supported by the general fund. I want to thank you for your leadership and passing an annual inflation adjustment for Human Services contract tied to CPI. As you heard during testimony human service agencies are not only struggling to pay our staff a living wage. But also to keep our doors open or lights on our water running an excuse me. The annual inflation adjustment is a first step that will allow human services agencies to stabilize our budgets and begin to focus on compensating our staff for the incredible work that they do everyday. This amendment office just an opportunity to protect funding that was intended to support these agencies. We should safeguard that funding and an honor and excuse me an honor what it was meant for supporting and not undercutting the Human Services sector support securing these foreign funds forward and 20/20 to serve the purpose for which they were intended and not putting them back into the general fund college counselor, Miss Kita. Thank you for your leadership on this. You have been the stalwart starting last budgets and carrying it all the way through this year. So you doing the work you're doing the right thing? Okay, Tracy Tim Katrina Johnson assisted diversion program, and we are here in regards to the budget provision prepared prepared to ensure that there is support from Seattle it for the development of our lead database the first. Thank you so much for your leadership on this council member. Delete database is completely funded by Microsoft and will be built by a contractor. However, these additional funds will help ensure seattleites. He should be able to provide oversight and ensure the flea database is Creed in a way that's effective and efficient for all of our lead governing partners and operational Partners satellites. He helps create our scope of work. So they deeply understand this project and their support would be essential. So that's with roll out there two main goals, of course for the lead database one to support communication between partners and also to help ensure our ability to share data with any members with our funders and with our governing Partners as well. We're deeply committed to our transparency and being able to provide reporting and data that is accurate and efficient. So these funds would really help ensure that that database is able to provide that great. Thank you. Thank you so much. And I know Tim and Katrina that you're talkin about the same topic. I just want to say thank you to all of you for making. What happened and to recognize our King County prosecuting attorney Dan satterberg who was instrumental in getting this $300,000 Grant from Microsoft. So well done to all of you, please go ahead him. Thank you so much for the record. My name is Tim Kendall of a project manager at the public defender Association specific to the lead program. So do you think he ever growing questions and the expansion of people want to know about Real Time Performance? So in response to that, once again, thank you cards number Big Show, you put together a slide and provides all that allotted us a business analyst from Seattle it to identify a vendor. I we were able to identify a vendor and it's Tracy mention build out that scope of work upon review Seattle itdm that this was a reasonably priced database especially for what they were being able to provide and again, just echoing the importance of King County Prosecuting to Dan satterberg and his relationship with Microsoft for us to secure that three hundred thousand and we recently Designer contract with dxc Technologies with a go live date of March of 2020 and this extra support from Seattle it in continuing. This will be instrumental in ensuring that this is effective in holistic self. Thank you. Thank you. Thank you, Tim. And batting cleanup is Allison heisinger morning. I'm a project manager for the law enforcement assisted diversion program South Precinct specifically DeSoto area and operationally the cross agency data sharing that happens with Partners is essential in that database will be away for law enforcement officers to carry, you know, what's going on with a client in a real-time way so that we can find out if they if they have housing that's coming up. And other important dates all prosecutors are also be able to see if they have upcoming court dates and things like that and so officers can get the whole picture when they are interacting with these individuals and make the best decision for those individuals in this database will enhance that and I just want to thank you council member for taking the lead on this and making sure that we get those dollars and that Seattle it is able to oversee the database and implemented and being done in a timely fashion and the way it's meant to be done. Thank you. Katrina. Thank you for that. We will be talking more about lead as we get into the individual amendments. It's something that I've been supporting for years now, and I know there are some folks who think we don't have the outcomes to show the positive steps forward based upon the Investments or making I think that's database is going to be Important for us to show this is really valuable the harm reduction model works if we're able to follow up and make sure the people have a roof over their head that they've got the case management weather is mental health or Behavioral Health the services that they need to actually get themselves back on their feet and be able to move forward in and latest doing has a really important part to play in this so thank you for that. Hey, we got a baby here. I'm so glad so I don't I don't see Peter. I don't see his name on this. So you have to. And I'm here on behalf of MLK labor Council and I'm here to speak in support of the green janitor training program. And the reason that the labor Council support this program. What others have said we believe this program helps create the kind of green jobs that we need as well living through climate change. It also helps downtown buildings and sustainability. Play one of the things that others haven't mentioned which is that workers. Bring what they learn on the job to home to their home Community Central as their learning these more sustainable practices. They're going to be bringing that back to their own homes to their place. The Civil sector institutions that are part of the impact far beyond just the immediate jobs that in effect. To Seattle Public Utilities. They have done a tremendous amount of work on green options. So things that do help us clean our homes and aren't necessarily the really strong toxic kind of things that many people who are having to work in these buildings have seen for years. So thanks for doing that. Thanks for bringing your baby. Always a good move Allison. Never follow baby's for the record. My name is Allison eisinger and with the Seattle King County Coalition on homelessness. Good morning to your bags and temporarily absent member Muscoda. I am here to speak in support of customer must get us at Proviso specifically regarding the remaining funds from the budget work that you helped us through council member Bagshaw last year to support the non general fund Human Services Department contract. I also want to just take a moment to note that this is a really interesting part of the budget process that most people don't see, you know, the idea of investing in it green education for janitorial workers that extraordinarily important Ada accessibility issues for my local community center in the University District. Thank you at work to provide the ability to technically gather and Report good day. These are all this small additional Corrections and changes that Council can make to the budget and we appreciate your doing that and thank you for that. I really look forward to our budget session this fall and I hope we will have the opportunity to work together to make some much more large and significant investments in some of the programs. Are you planning to come back within six weeks and welcome to my back shot, you know as well as I do that what we need is of course the kinds of sustained and significant Investments that mean that these kinds of programs can do their work throughout the year in between the hundred-thousand-dollar adjustments that important committee meetings like this are making it would be such a blessing it one point in just our City's history going forward that we have the necessary revenues to do the work the good work that you're doing without you having to come. Back two or three times a year and put a full-on effort to say this money is needed in a sustainable way. I'm also going to be coming back and asking all of you and the work you're doing to help us figure out how we get more people inside the 24/7 kind of shelter. That's a bridge. That's not the end-all. We all know that but getting people and especially if we're talking about the RVs here very soon. I need to have places to put people I can't just say it's going to be okay to put them back out on the street. So I look forward to working with you on this too. I do too. I appreciate that and council member back. Should I have some ideas but I'm happy to share radio. Good Allison. Thanks so much. Okay, that's the end of public comment will get going into a first item of business Allison. If you'd kindly read that in happy to have never won councilwoman 9603 and ordinance related to the transfer of City real property for Housing Development the clan the property located at 1314. 1326 and 1336 Yakima Ave. South surplus of the city's means very good. Thank you for that Tracy. So glad to see you is always and so Emily is not here, but we have to stand in. So if you don't introduce yourself, sure Traci Ratliff cancel simple staff, good morning, Erica Malone and senior home ownership specialist with the office of housing. Thank you. Good morning, Jennifer the brick office of housing. Great. Thank you so much. And in advance for this great project that you bring forward to a so disposition of Yakima Avenue and the new Townhomes. Great, so we are here today to talk with you about this position of the Yakima property for the creation of permanently affordable homeownership. This is an exciting project that uses publicly owned land to Advanced affordable housing in the city. And as you know, this is one of many actions that the mayor is taking the summer to advance housing affordable housing for low in middle-income households. And at that point, I'm going to turn it over to Erica to talk more about the property in the disposition process. So we have come several times before you who is this property in today or exert of closing the final Loop and moving towards disposition. I'm just a quick reminder reorientation. Here's a zoomed out map of the property location just north of I-90 West of MLK and east of 32nd in the Leschi neighborhood adjacent to Judkins Park in a very short walk. The soon-to-be opening in 2023 Judkins Park light rail station. So we're really excited about that. As you recall. This is a piece of property that's been owned by the city for many years under the jurisdiction of fas on the corner here of Yakima Avenue South and South Irving Street. We first presented to the council back in 2016 after FAS circulated access property notice to all the city departments office of housing was the only Department that expressed interest with Council direction. We publish a request for interest to gauge whether or not permanently affordable homeownership are affordable home ownership would be feasible on this site turns out that it is and we were trying to 2017 with the draft public involvement process, which is now complete and with Council direction again issued a request for proposals through that RFP process. Office of housing selected a joint proposal submitted by Homestead Community Land Trust and Edge developers original eoh had determined or estimated rather that there'd be between 7 and 9 Townhomes built on the site. The selected developer was really creative with the site and is now able to put 16 townhomes on that piece of property square footage is more or less of these of the homes themselves. I think probably about 1200 square feet. I think that you got to head the week and get back to you on that. Typically. I think we've got a wave back there. Go ahead and speak up. Okay, thank you. Thank you. Thank you. So there will be 10 of these 16 Townhomes 10 of them will be permanently affordable affordable prices to households making at or below 80% of area median income and six of the homes will be market rate. All of the net sales proceeds will go to subsidize those affordable home. And it will working through Homestead the land trust. So would you just give us a quick example. So a family comes to you and wants to buy this. How do they how to set WhatsApp next process? How do they find out about it as a loans work? How did the financing and how do you keep thin and retain them as permanently affordable? Yeah. So so Homestead is engaged in partnership with africatown Community Land Trust to do abroad affirmative Fair marketing effort with the hope that folks will who have maybe even been displaced from the neighborhood be able to return Homestead also has a applicant pool of 400 households who are Income eligible and ready to buy so they would find out about the opportunities through Homestead apply to Homestead for to determine income eligibility and then they get a mortgage from a conventional lender. That's a monthly cost that they can afford and the the home prices the to 72 to 90 is what is Affordable to household of three or four at about 65 to 70% area median income so they would go through a sort of a normal if you will home buying process and Homestead will retain ownership of the land have a 99-year ground lease with the homeowner. The city's regulatory agreement will be for 50 years. Do you mean those homes to be resale restricted? But because of homesteads long-term affordability model, it will be affordable for much longer serving low-income households for generations to come will individuals who have been displaced from the neighborhood have any first priority priority to come back or how are you making sure that that's fair great question. So the office of housing along with The office for civil rights are working on a community preference policy or guidance rather that will inform this process as well. And I think the details have yet to be determined but. The hope is that there will be some priority for folks who have been displaced with historic ties to the neighborhood and thank you. So at the time of resale if a family when or if a household is ready to resell they do so at a price that's affordable to the next buyer taking with them some of the equity that is a crude, but not at the expense of pricing out the next home alone there. So the the resale formula that's embedded in the ground lease is to balance the need for stability security equity for today's home buyer while offering that same opportunity to households in the future. Like you said them the location is so perfect for families next to the park and with light rail coming in and just a couple years now a couple 3 or 4 years. So the legislation quickly just does chew things mostly asking for a jurisdictional transfer from FAS to the office of Housing and authorizing the director of the office of housing to enter into a purchase-and-sale agreement with the developer. The the transfer would take place at such time that the developer has all necessary permits and ready to go forward with construction and they're in the permitting process right now. Thank you so much. I want to thank you for taking some of the items that we have been working on and including them in your Jen. I know your agendas packed. This is a really exciting opportunity there for us and I wanted to frame it up by an elevated some of the things that you talk about the 90 release the ability for people to actually have access to homeownership Opportunities. If you look at the slide, I think it was five two or three that shows the broad and out math. And the area that we're talking about this is an access to high opportunity neighborhood and relatively expensive as well. So when we talked about offering the homes to people and the 270 and less than $300,000 and credible incredible opportunity for families that have really been priced out of this Market. I mean average cost of a home in this city is around 720 $740,000 even in the area just south of this in in Columbia City in the South and we think of it as being more affordable and it's still an average cost of $650,000 that this so Out Of Reach for family. So this in combination with the affirmative marketing and the way in which we've engaged with our nonprofit developers around Community preference in other ways around the city, I think this is a great asset to bring forward and it could be seen as a routine transfer, but I think it's really an opportunity for us to show what it looks like to have a proactive project Cooperative Cooperative partnership with the office of housing as we create more home ownership. Opportunities around the city. So thank you for allowing us to have this conversation in your committee. And I really think it's exciting also do I look at the proximity to the parks as we create this density which we want density density density continue to create density around Parks cuz they'll be folks new backyard in new places for kids to grow and seniors to enjoy their retirement. So I'm very excited about this and I want to say thanks for the work to see you've been working with us for a long time on this as well and thank you for having this in your committee today, Remember if I could I'd just one thing around Green Space. We are based upon just looking down at the photographs were taking out a lot of trees to put in this and I've just want to acknowledge the fact that we are reducing the existing canopy and I'm hopeful that as office of housing is doing the designs and overseeing that please make sure that we are getting as many trees back in and good sized trees the so I know I Choose You Say to people sometimes St. John's Wort doesn't count. You know, it's green. It's on the sidewalk, but I'm really looking to put back some of the street trees all around. The area just makes it a nicer place but also helps us keep the numbers up as far as the trees were taken out of the land real quick. Yes. Yes, and can you point to us if you can wear Judkins Park is just directly south. So I think that's important. Also just a note in the context of not just creating opportunity for opportunities. They can create a equity so people can get out of generational poverty, but that map really illustrates the past areas that had been previously Redline the homes that are situated in and around Judkins Parks were previously Redline neighborhoods. So it's interesting to think about the work that we're doing now and in comparison to We're trying to do to move forward that redlining the discriminatory mortgage lending racially restrictive covenants and even all out exclusion ordinances had previously precluded people from living in this in and around those areas including on Native American population explicitly. So I just wanted to call that out as a way for us to write historic wrongs and to be really explicit when were doing so. This isn't just a nice to do it's the right thing to do to fix those past practices and maybe we can talk a little bit more about that on Monday when you bring this forward, but I think that that's really helpful to have that map. So we appreciate them. Thank you from any other comments or questions on this. So again, this is a fantastic Tool & R tool box, and I know that Times we look at this one just like, oh, it's so slow. But if you look at how many units that we have brought on board in the last decade. It's it is life-changing for the families. It's also really improving and making our city and more Equitable place to be so I want to say thank you both for your good work. So if there are no other comments, I would move to that we pass Council Bill 1196. Anything else has been moved and seconded all those in favor. Say aye aye no abstentions. Good job. Thank you so much. Okay. As we just said it's past and it will go forward in September after our break, okay? So I would you read item to in place happy to and have our presenters. Please come on up to the table item number to councilwoman 9574 and ordinance authorizing in 2019 acceptance of funding from a non City sources authorizing the heads of executive departments Seattle Police Department in Seattle City Light and the department of Parks and Recreation to accept specified Brands private funding and subsidized loans execute deliver and perform corresponding agreements that we're going to review and consider this first one is the grand acceptance ordinance. We talked about this at our last meeting these are grants that come from outside and they they come to various department, but we have to accept them officially. So I think they're both thank you for being here Tom and Lisa will go through and explain what they are. This is routine. We do this annually. Thank you for you want to dive in? Thank you madam. Chair, I'll just I am Tom mikesell with your Council Central staff. And as the chair mentioned the first item that we have today is the grand acceptance ordinance. So this has dated formally accept grants. We need to accept them before we spend them and it does that and we provided a memo which covered is this piece of legislation as well as other topics on today. Today's agenda. There is one amendment that has been submitted for this piece of legislation which refers to some technical Corrections identified by the city budget office after it was introduced. why so skip the first day there are two differences one amendment that accept student in different brands of one is actually prefer to the extra lemon $225,000 from Amazon that goes to the Department of Parker Rec Parks and Recreation fund. So this one was actually included in the supplemental budget, which is later on in the discussion today, but we have to accept it so I can spend it and this is for scholarships as I understand for summer camp for kids that wouldn't be able to otherwise go correct, correct. And so that's 225000 to the park and recreation fund. The other one is a transportation Improvement aboard grant. That is 400 $500,000. Excuse me. I'm going to provide H. Friendly Sweet Escape in the Delridge neighborhood. Now. This one is not actually in the supplemental this it will be once it's received that included in future supplemental budget adjustment according to CPL. However, we do need to formally accept the grand to be in compliance with the tid process routine. I don't have any reason to think that we shouldn't accept the grounds. So two things one is we're going to move to accept and assuming it passes. We are going to have a second motion that will allow us to bring it forward next Monday at full committee because it's really important that we have the money in order to spend it. Okay, so I'm if we have no other questions then I would move to pass Council Bill one 19574 Sorry, okay. So the amendment that we have here is it's a it's always a grant acceptance for this addition to the other grounds. We've already discussed. So I would like to move Amendment 14119574 all those in favour. So now we have in front of us and I would like to move cancel Bill one 19574 as amended. Okay, all those in any other questions all those in favor say aye aye then opposed no abstentions. So that will move forward. So now that this is past I would like to move that. We have a special recognition that this will come forward this Monday August 12th for review and approval by the council second. All those in favor. Say aye aye good and opposed no abstentions. So we will bring that item in front of full Council on Monday. Thank you. Tom think I'll send for reminding me about that. Okay, so Item number three. Thank you. And I'm number three accounts well-woman 9575 an ordinance of Mendon ordinance 12572 for which adopted the 2019 budget including the 2019-2020 for CIP a change in preparation to Barry's performance and budget control levels and from various funds in the bucket so that we're going to be spending a little more time on this one then our other items because we're going through one by one and then with the Amendments that we brought forward. OK Tom. Do you want to explain this to us a copy of the memo that was distributed because it'll help Orient as we walk through green teeth in the Amendments on this isn't the only other piece of legislation with amendments. So just in terms of orienting Time we will start the Amendments on page 2 of 19. So it's it's essentially that have to be moved past the grants. It's the third the third piece of paper in the memo. I'm sorry. Yes, and so they're thank you Allison. So there are it would be on one of 1900 Corrections and this is again and kind of to the preface the city budget office and they're and their departmental colleagues are doing this in their new budget system for the first time. So I think that's kind of the the reason that there are a number technical technical adjustments that they have sent to us. And so the first three one that will be talkin are technical in nature sent To Us by the city budget office. And also in this technical amendment, I think we change the name of the fund. So it had previously been KeyArena Fonda now at Seattle Center fund that's exactly is the defend title and and the Beast BCL where the money goes otherwise, there's no substance sensitive change and that is Amendment 1 a in the packet of these individually any questions on this right? Then I'm going to move that we accept and then that one a this is a technical adjustment regarding the Seattle Center fund II all those in favor. Say aye if this passes Amendment 1 a the technical adjustment fund. Alright Tom, please keep going on to win b41bus on page 2 of 19 in a similar vein. This is a technical correction. And in this particular case, it's correcting section 11 of the supplemental bill. It's aligning the position totals in in the table and a section 11 with the other elements of the supplemental where where there's either Appropriations provided or other elements of the ads discussed. So what this does is it increases the position table by 1.5 position totals MN Department of Human Resources for positions to provide work supporting HR. It also adds language that allows the Department of Human Resources have said the human resources department director to hire these positions, which is the technical requirement for This type of an ad any other questions. It seems pretty perfunctory. Correct. There's nothing here that we need to be concerned about. I think I'm going to move Amendment 1 all those in favor. Say aye I'm going to post this motion this amendment passes. Thank you. You want to proceed to 1C. So once she is on page 4 of 19 and similar this this goes in the other direction it update set position table which deals with the exempt position category. It actually removes a position on one session from that table cracking the toll from 4 to 3. I cannot send some of the same tactical adjustments identified by CVO after introduction. All right. Once again, this is an amendment that provides technical change to the positions in our human services department all those in favor. Say aye aye to post abstentions Amendment once he passes so so moving through the agenda. So now we are dealing with Council proposed amendments amendment to it deals with the Central Area Community preservation development Authority on proposed by council president Harold on the top here. Can you tell me what pages were talking about 5 of 19 for some reason my printed with a half a title, so thank you for just keeping me updated funny. I got a new copy. Thank you so much. No worries. I'm following on I got you. Thank you madam chair. Thank you. Please continue this amendment. So Greensheet 13 for B1 from 2019 creates a money and finance General in the general fund for a feasibility study to form a new Central Area Community preservation and Development Authority. It's much as funds from this day. And from the county. I told me $250,000 for support initial plan Outreach work and what this amendment does is it moves the money from Finance General to the legislative Department to engage in that work? So I will move amendment number to which is our Central Area Community preservation and Development Authority 2nd and paper say hi. The next one is our downtown Emergency Services Center nurse if you'd like to introduce it, I'd like to say just a few words about it. Okay, what does amendment does is it does not an ad to the budget? It redirects some salary of somebody savings within the addressing homelessness BSL. It sounds Rex 44,000 $44,000 to a Proviso to provide medical care during evening or overnight hours at a shelter for people experiencing homelessness and its proposed by the chairman metal chair. And it is because it is just repurposing funds that our existing it is her net net zero increase. This is a really important step that follows on the work that we did with our first responder Health one last year when things that we know is that in the shelters are people who need immediate medical attention, but they don't need a trip to Harborview the $2,000 trip as we refer to it as we have people that are available i d e s c has somebody that is on staff during most days, but they recognize that having somebody who is available in the evening will really reduce. The number of calls are fire department First Responders fully support this with $44,000 $44,400 last year that we had budgeted and passed for hand washing stations, but interesting ly enough neither Park North Seattle Public Utilities felt like it was something they wanted to pursue because it was really would be temporary. They were concerned that it really wasn't solving the problems. So nobody picked up the money so I grabbed it back. So we're going to apply that for this nurse till the end of the year and I want to say thank you to me are gherkin because not only does she concur with is she told me that she will put money in her budget to continue it and the Delight is is that other organizations are seeing this as real money Savers because we we don't have our firefighters having to respond with two drugs a firefighters to take care of one person. We were really able to use the nurse to help us through that Union Gospel Mission came and said the same thing they're interested in having on-site it'll reduce the number of calls are too so thank you for setting this up. Do you have anything else you'd like to add? It's just purely technical to ensure the saurians to our accounting system in the budget summary level bco code column. The defined was left out. So where it says instead of so essentially The Voice Mentor is instead of b o h s. H3000 use 00100 - b h s h 3074 doing that goodness knows I've never would have picked that up. So I appreciate your help. So now we have amendment 3 that will provide this 44404 an emergency services nurse, and we've got the correct numbers here under the PCL code. So I'd like to move that we pass amendment number three. All those in favor say aye aye NE post none. So we'll move forward with that. Thank you very much. And thank you Central staff for helping us identify that sore. So appreciate it. Okay Amendment for is our lead law enforcement assisted diversion database if you'd like to introduce it. I have a few things. I'd like to add as well so hot, so this Essentially transfers $137,000 from the general fund to the Seattle it Department to hire temporary staff on a short-term basis to work on the delete database in essence good and we had Tracy Tim and Katrina this morning from lead speak to it. I don't think they are still here at least somebody still here. Thank you very much. And Jesse's here to thank you. I'm going to see you again. Welcome home. I just want to acknowledge how important lead is and we know that has harm reduction model is something that is working. It's getting International attention. And at the same time we continue to hear well, We're not sure about the outcomes that hundreds of people are engaged in this but there is concern that we're not getting the results or at least we're not seeing the results and that sometimes case managers don't get hooked up with individuals police are sometimes confused about if an individuals involved in the program and there's further concerns what they can do. So, I think this database is something that everybody is asking for we want to see it move forward again. I want to acknowledge our King County prosecuting attorney Dan satterberg for his work and help him this and this is this is a real creative effort to try to get people who are currently on house or are finding themselves with drug addiction with low-level prostitution finding just a difficulty in living that this is one way or city is able to put our arms around them help improve conditions for them and for the streets In which they're living? So I am a huge fan of lead want to see us move forward with this and this will give us some additional money of $137,102 to help with the administration within our IDT our information it Seattle it Department to help them coordinate the work with the grants that leads him delete program has already accomplished. So with that I would like to move amendment number for all those in favor. Say aye aye any post extension and we have no Amendment on that one, right? Okay. So I'm in the four passes. Let's move on to AIDS Memorial pathway and I can speak to this as well. They just for purposes of orientation is on page 8 of 19 link you for that sounds really helpful. So what this does is it appropriate to a hundred thousand dollars from the Department of neighborhoods to support the 8th Memorial pathway phase two narratives project. I want to extend things to council member her Bowl who has been working with me on this and our former colleague councilmember. Tom rassmussen is leading this code cherry eye on Capitol Hill. I met with him and Michelle hasson recently. This is going to recognize many of the personal stories of all of the both the impact on the Capitol Hill Community with those who have AIDS and HIV AIDS. This is a phase project that will be up near Jefferson Park, so I think that just recognizing the trauma those folks who have survived this terrible disease and the impact on the community. This is an opportunity for us just to recognize the what the community has gone through and many of the stories where people have prevailed so supportive of this we're going to be putting in $100,000 to let them move forward now not wait until the end of the year and I believe that the mayor's office is also supportive and will add that to her budget could any comments? Okay, very good deal something I sleep notes in the narrative. It says 75000 so just know that it is a hundred thousand. As the actual Amendment says about any of The Departed said 75000 I found out that we would have access to a hundred thousand dollars working within Noble. So we just want to make sure that the project could move forward. So with that then amendment number 5, I would like to move to pass this today. Okay, all those in favor say aye no sentience. Thank you for that. And again, thank you to councilman former council member Tom Rasmussen. Michelle has sinned and all those that are supporting his project number six is a Proviso on funds that are provided for Human Services contracts and council member was created. This is yours, Tom. Do you want to introduce it? This is on page 9 and 19 + what this does this does not result in a net budget increase it just establish has a Proviso on on a $268,299 in the Human Services Department in the general fund and it restricts those funds for used to support Human Services contractor Fighter 4 inflationary increases for dulwich a contract that are not supported by the general fund. That's why I'm asking you for your leadership and their support as we've been working to get the hsd inflationary adjustment included not just in one year's budget, but to have the base legislation, you've been very supportive and also have asked all of the right questions about making sure that we are looking at continuity and stability for the fun. I'm very excited about the work that the community has done. It's been 10 years of effort as we've heard over the last year or so that people have been asking for this inflationary adjustment to be included. So we're really excited to bring this forward. We've talked a lot about this over the last year so I won't go into the details, but this really is exciting to be able to make sure that with a small set of that. There was a set aside that we had excluded for a small set of contracts for various reasons last year, which is approximately $268,000 at that was unused. So the exciting part is that were able to now apply this to the agency contracts going forward and in Sure that the legislation as desired as applied to the CPI increases for the provider contract and at the same time reaffirm our commitment for the work that these organizations do the workers who are conducting the services and the critical social safety net that they provide to those who are on shelter who are Elders who are youth who are experiencing domestic violence on sexual assault Survivor. I'm so just a huge amount of appreciation for their ongoing presence here today and on and over the last year and 1/2 + 10 years. Thank you for that any for the comments then I'm going to move we adopt at number six very much Amendment 6 passes. So amendment number seven is the Highland Park intersection improvements. I know this is councilmember herrboldt with support from council member Gonzalez's so a page 10 of 19 Amendment 7 does not affect the current Year's budget, It does make changes to the CIP and then includes attachments of those changes. It updates the title and description of the Highland Park intersection improvements VIP project to reflect the design Options under consideration by the Seattle Department of Transportation and Community. I'm soin Premier Transportation rest. Has identified 300,000 of local matching funds to support state Grant applications anticipated for this year. The amendment shows the local match in central Branson 2020 and it shows a decrease in division 0 c i p project okay, I don't think there's much here that we I need to discuss it. As you said it is an effort to improve the neighborhoods. It was has been planned has gone through various Community processes and it is a vision zero Capital project. So any further questions, okay, if there's no further questions, I'd like to move Amendment 7 all those in favor. Say aye aye no extensions. Okay, next item is attachment 8 and we do have another one of these budget number changes that I might as well bring it up in the beach in the ESL. I could so attachment attachment a we are we are we are praying for moving. So those were actually just the CIP project pages. So if we move to page 15 of 19, I get to the next because of attachments were associated with the bat that I have Amendment 8 hear that there was another another change, okay. Towing on page 15 of 19 great. Okay. This is yours. So this appropriate $125,000 on from the general fund to allowed. Department of neighborhoods to support accessibility improvements to nonprofit Community Center. If I smoke alarms cultural and educational groups is free and reduced rental space. It would be supplemental to a State Department of Commerce Grand and private donations to construct the the elevator at that site. Did you wanted it have his change the the BSL the Beast BCL code on this one? So I think that you will have an attachment here and instead of b o d m 13300 use 0 0 1 0 0 1 3 3 0 0 IV due to budget 8, I mean Amendment 8 under the budget summary love. And I just want to speak very briefly to this. I think Council colleagues during public comment a number of his folks out there spoke very articulately about the need for the elevator to provide access and this is not only an ADA approved but just from all ages and abilities that we are promoting making sure that that buildings like this with your such a community gym have access and they're available through when you talked about the grandparents that want to come and see they concerts her to see the dance recital. So I'm a fan of this. I would like to move forward to out with amendment number 8. Okay all those in favor. Say aye aye. Did you want to speak to it? Because it's your District in to it but to I wanted to clarify with you because one of my district office is inside the University Heights Center. Do I am staying now? I know but I do want to speak to the University Heights Center at the University Heights Center is not just words. It's been a community treasure for district four but also for the Northeast Seattle and so this is one of the first request that we had received in our office with regards to the importance of it. And so I'm really excited to support this and I got a Thang Thang as well for her work to during public comment, but one of our speakers talked about a little girl who was in a program and couldn't get up on the lift because the lift was broken and I had to literally crawl up the stairs a multiple times. I mean, it just breaks your heart to even imagine that Vision. We're moving forward with this. I'll take a boat again able thank you for speaking can't remember most of the comments. I just want to thank you for your at the opportunity to include this in a supplemental budget. We've been trying to go out to each district of corresponding with the month. Of the year, so we were in D for 4 month for and had the chance to meet with the folks at University Heights then and heard about the need for this lift that will for a actual elevator to be included at University Heights and I was really excited to help work with them and the Now new representative of District 4 to be able to bring this amendment forward. I think it's important to note as well is that we're working in partnership with some of our state partners and our local Community Partners. They've raised 70% of their campaign goal of the 700,000 that's needed and they just have a little bit left to raise. So this is an incredibly important way for us to be a good partner from the city to the state with the state and other local Partners as well. And I did have the chance to listen to your testimony. I was on my way out here and I heard the story about the individual crawling up the stairs, which is just heartbreaking some of the stories that they also mentioned when we were meeting we're talking about how this is the lack of an elevator is truly a berry or not just for people who want. Take a class there, but maybe for the grandparents and the parents and the siblings that want to come and watch the kiddos or the parents who taking part in some of the amazing classes. They have their they host over a hundred and sixty Arts cultural and educational groups each year and are home to the 14 organizations and our Good Counsel colleagues office apparently wanted to make sure that it's truly accessible and then it's a community gym that's accessible to the full community. We're really excited to bring this forward and just one that also underscore our appreciation for the work. They they do to make the space affordable at 50 to 70% below market rate for these spaces for Community organizations to have space in this facility is it is such an important asset to increasingly expensive city including for nonprofit organization given the cost of retail space in the city and applied them for the work that they did last night cuz Maravich Echo and I have the opportunity to participate in a community Forum about what it looks like. Safe parking lots and why it's so important to have this as an additional tool in our tool kit as we try to address getting folks into safe places to sleep at night if they're unsheltered. I think they've shown leadership already with the type of work that they do inside the building and now they're expressing an interest in showing leadership for how they use their full space outside the building as well and have been inclusive and I think proactive and engaging Community. I'm on what that looks like and why it's important across the city. So nice huge huge turnout last night a standing-room-only and I appreciate that their leadership in excited about this amendment. Thank you. Thank you both of you and councilmember Pacheco. I just want to say it's been a absolute pleasure working with you since you have been brought on the council. Appreciate all you're doing for District 4. All right with that would you like to move this? Please remove the number 8. Thank you. Okay, all in favor say aye opposed extensions so are University Heights accessibility Improvement has passed and that will go in front of the full committee on Monday and congratulations big thanks to all of you. All right. I'm at number nine is our food bank support. Amendment number 9 is on page 16 and 19 this actually modifies the supplemental are the supplemental ordinance as transmitted so that piece of legislation included 1.2 million dollars for food bank facility improvements. What this does is a proportion of that was was unallocated and allocates $85,000 of that amount to provide support to Food Bank organization benefiting the nutritional needs a low income people in Northeast Seattle. Do we have any comments on this guess councilmember Pacheco? It's yours for the U District Food Bank, which has a fantastic job offering with Community pantries like these trees like this like these and I think of this is just the type of parts. We want to see the increase fresh food place with such Limited. like Madison Park there it spread between a district for District 5 and so we know it's a food desert and being able to provide for those low-income families that are in Madison Park is of importance to us as it's alright, would you like to move him and I Okay, and I'll second all those in favor of amendment number 9 say yes, then opposed no abstentions. Alright, so the human services department will have some additional Food Bank support in a pretty large amount. I just want to ask here. We've got 1.7 and then we have one X do you want it is we're still in a minute number. I just clarifying page 3 and how this is working. Yes, I can speak to that. So the the the first step in this is to reduce the bill as proposed by $85,000 on which isn't it wasn't existing up up a line of appropriation in that pill. So it reduces it from 1.2 to 1.115 thousand and the next step is to add the new appropriation of $85,000 which is which is added to this amendment 1 budget item to another with food banks and left at Broad. So this just for braids of that 1.2 million dollars 85000 of it will be used directly to University. So it does not harm the balancing of the budget very good. Alright next. We have a green janitor education program. This is amendment and Tom, would you introduce it, and then council member was scared if you'd like to speak to it, so page 17 and 19 this adds a $35,000 from the general fund to the office of sustainability environment to implement at Green janitors education program. Thank you friends of the green janitor education program. This is an opportunity for us to Pilot what it looks like to lead by example. I'm outside of just City buildings and to work in partnership with Green Building owners and with our labor Partners. I want to sync Arena Bowl and Yolanda. Hello from our Council Central staff who've been working with our office with Seattle 2031. SEIU 6 pictures on stage and got green. I'm who all helped to bring forward this concept, you know, Seattle's been a leader and how we Institute Green Building policies internally for a very long time. We've had the opportunity to lead the nation and establish the municipal Green Building policy in 2000. We were acquired the city funded projects projects and Renovations over 5,000 square feet of occupied space achieve Leed silver ratings. That was a huge huge win. And I think that it also was a pat on the back to Seattle for the effort that we mandated in 2010 to create energy benchmarking for reporting on non-residential and multi-family buildings over 20,000 square feet. And here we are past some updates to our ordinance requiring building tune-ups in 2016, and we did some work last year to make sure that our Energy Efficiency standards were met as a special. Seattle City Light on property. So we've been a leader in many ways especially looking internally at our own buildings are clean energy standards and are Green Building standards and the really exciting part about this project is it allows for us to expand that kind of vision to our private sector partners and work in partnership with labor unions and environmentalists as you heard today from Stephanie's cell from the blue green Alliance who works in partnership with environmental work at Justice workers and the labor movement to try to figure out how we can continue to advance this. So this is a very exciting opportunity for us to change to train around 30 to 50 janitors and three to four Leed buildings in Seattle with a 30-hour curriculum on green cleaning including energy water at landfill in landfill reduction Technologies and improve the health and safety of janitorial staff. I think it's a really good that we're moving forward if we are able to today to make sure that we have this pilot up and running this year because if we Able to get this private up and running this year and accomplish some really great benchmarks before the end of quarter one, then we can hopefully take it even more to scale next year. So really excited about being able to follow Los Angeles is lead 2014 is when they started that program and are ready 500 janitors have graduated from the program. So this is a huge opportunity for us to improve the health and safety of workers and health and safety of our buildings and meet the goals that we've established for a long time in the city of being a leader on the green energy and supporting workers. I want to thank specially the office of sustainability as they are enthusiastically supportive and appreciate all of the support that we received from that the mayor's office and the agencies as well as we flew the best through the lens of not just reporting workers, but supporting our entire City's commitment to workers and the environment. Do we have a similar program internally? So do we train our own janitors and custodians on this? Is there somebody from SVU? The folks I would love to make sure that we've got a similar program. We should be leaving first by example play I will follow up with the office of sustainability. And of course, I'm going to support you in this but would you describe why we are paying for private employers to do this just to encourage them to do it. Is it as contrasted to saying now shalt and thank you Matt. I'm sorry for that. I do wonder if I might be able to ask our friends who are in the audience who were working on this Partnership if they might and please ask him to step up to the microphone. My question was where budgeting $35,000 essentially for the benefit of private employers to train their janitors and custodians in this and I'm wondering What is this an appropriate expenditure of broader taxpayer money to give to private businesses and buildings to do this training. So maybe you can talk about how we're leveraging turn back shot members of the committee has a seed to help me Seattle's goals as a cast member most data said this is a pilot project that we want to lift up off the ground with plans to sustain the program move onto private funding and an employer back training so that this is really the The spark that gets that all movie. Okay, so it really is a pilot that we are helping fun than we will take that up to scale is another time is that your intentions that's my intention and looking at Los Angeles example when they implemented their program in 2014 and Los Angeles, they showed up there green janitor program reduce energy consumption and reduced water used for building owners and has a positive impact on Taxi the sustainability of their Energy Efficiency in the city. So also wearing my hat as energy chair with Seattle City Light. I think that this is well in alignment with our goal is to help building owners who are in the private sector be more efficient with their energy consumption and while I don't represent spu and then that's comes Mariah herbold who has water in her committee. We're all looking for ways to help reduce consumption that might be unnecessary so that we can be better conservationist and thus insides Bringing this forward any other thank you for stepping up the microphone to ABC. I know abstentions. Thank you for the green janitor education program council member schedule for bringing that forward. Okay, I'm least thank you for being here. And if you will describe Amendment 11 for us shirt, Tom just had the subway from minute 100 thousand dollars in general funds to pay for some one-time Capital Improvements to an organization that provides culturally responsive services to Native and ended indigenous communities. And this is sponsored by councilwoman Westgate a very good and a couple of questions you and I talked about yesterday. If you can cast member was scared to tell us whether you connected with council member war is his office if that was possible and then Also that this is one time not ongoing. Yes. So we have amended the consideration today to really focus on just the capital construction projects and not the ongoing operating costs. We do know that there is a robust process that each of our partner organizations go through and wild he's the Seattle Indians. I'm sorry, the various native group that we do partner with including Folks at United Indians of all tribes. They do have contracts with hsd. I think it is important as you suggested Madam chair to look at the one-time funding recognizing. We don't know what our budget will ultimately look like at the end of this year. So on the first question you asked about whether or not we had at one time finding hear what you see in front of you as a request for $100,000 83000 of that would go to restroom Renovations, which includes Renovation of the men's room downstairs and Renovations of living room completion of walk-in freezer and installation and standing freezer. That's an example of what potentially could be done. If you looked at Daybreak star exactly. There is also an opportunity for us then to look at the $17,000 for appropriate freezers and refrigerators and stove. The folks have been to Daybreak star at as an example. They know that it hasn't been updated since the seventies and it's a really Brave and cultural Jam checking in to see if our team had had the chance to talk to a customer Juarez. It doesn't sound like we have I'm not sure if Central staff had the chance to hear that request either and I apologize for that but I did not have the chance to do that. I was busy. I'm going to go out on a limb and believe that councilmember Juarez will be supporting this Daybreak star and I will definitely reach out to her immediately after this. I just let her know that We're moving forward with this is just a request that sometimes I want to make sure that as we're going forward with something like this at the community supports it cuz we know that there's some folks that might think we were picking favorites here from a capital standpoint Daybreak star is something that the community is welcome to we use it a lot. I want to acknowledge this and think the worse than the fact that they open that Center during all the conversations. We had at Fort Lawton. So, I think it's appropriate for us to move forward with these Capital Investments. I'm going to support this and I'll come over to check or do you have any other questions? You have pleased to meet one time? Thank you. Thank you. Thank you for noticing that. Chuck-E-Cheese strike in ongoing and provide just a one-time to provide One X support. Thank you. Thank you too. Since this is in the effect box that you can just fix it before Monday for catching that I just as we were talking about the Discovery Park creation and the creation of Daybreak Center, for example, she had a pivotal role in the creation of that cultural gem. So we will definitely reach out to her and what I acknowledge all of her work on that. Thank you. Thank you very much. Okay, one more Lisa with your permission and doing some further investigation to make sure we have the right budget summary level on this phone. Very good, so you can just resent that on Monday in front of full Council. Thank you very much for eye tracking that Allison for cats in the one time. That's really important. Thank you for acknowledging the work. I'm the council member was has been doing to appreciate this. Okay, as amended one-time Capital funding that will be used for such things. But we're not necessarily time their hands to this but as restroom renovation kitchen renovation, and they will come back to us with the list. So it's not like we're handing him a check then I will move amendment number 11. Okay, all those in favor say aye aye going to post no extension. Thank you very much for that. Okay, I think that there's going to be a change in Amendment 12 and I'll let you speak to that and then I'm going to add some things to do. You want to brief us on what item number 12 this man was going to add 400,000 to the human services department from the general fund to provide application public-facing dashboard metrics for Investments and homelessness to explain what your what your intentions are and what is going to happen going forward. So again, thanks my timeshare for your leadership not only in this committee, but your leadership on the select committee on housing and homelessness over the last eight months. We've really been talking about the desire to see Apples to Apples beat up points on recognizing sometimes data can be used in a few. Give way of especially for our organization who are trying to serve a really diverse and a hard to serve population. We don't want needed to be miss you. But we also want to have Apples to Apples comparison month-over-month to see how we're doing as a city part of the conversation. We've had with the public with our Community Partners. And with the Press have been to say we are doing a really good job in many ways of trying to serve individuals with the services that we have and we know they're still 5500 unsheltered folks outside who don't have a place to sleep inside each night and trying to get them into shelter or a safe place have been very challenging if we look at just one data point being that last time we've asked for the point. I'm sorry, the number of vacancies a month on average. We know there's only five to six enhance shelter beds open a night which helps put in perspective. Why folks? He's so many people sleeping outside. I would love to have a month-over-month data set that. Buying all home data Seattle hsd data that we received and a couple that with potentially what we've heard from Community Partners about what could be more appropriate ways to measure success such as with somebody able to stay with her case manager. We're kiddos able to stay in the same school were people able to access their medication if they needed to get their health card some of those things we've heard from Community Partners are more accurate representation of the types of services, they provide and importantly on the prevention side to how many people were allowed to stay in their home or their apartment without getting evicted because they got and you just $200 that month and didn't get kicked out on the street. I don't pretend to have the exact formula we've suggested about 15 metrics to our city partners and in recognition that the city is working in conjunction with the county to create the original access plan. That is forthcoming a we've heard from our County Park. That they would like to continue to pursue this idea but need a little bit additional time. My hope would have been that this work would have started in December when we started asking for it. I will be pulling this amendment today with the recognition that the regional access plan will come to us for consideration in September and I think that well there is some numbers of vacancies that have allowed for us to identify a $400,000 bucket. What I'm hoping folks will do in the future with your support is that we can continue to direct either the regional entity or our city Partners to really incorporate more of these community-driven data metrics and that we can have a visual dashboard that's presented to us month after month. It uses the same type of measurements so that we have the same methodology applied each month. So we're not actually scrambling to compare numbers that might not be able to Apples. And so while we're not potentially moving forward this amendment today. Desire is still there are pulling of this does not should not indicate that we're not interested in this type of coordinated data across the county and across the city and for that data at some point in the very near future, hopefully before the end of the year to include those metrics that we've heard from Community Partners are so desperately needed to more accurately reflect the type of services and the need for more services out there. So that were able to properly or appropriately a direct Appropriations in the future where we need to scale up or maybe where we seen something work really well at how we're doubling down. So I will be pulling this amendment. Thank you for that. And I also I want to appreciate the fact both of what you're trying to accomplish and the fact that we did get this early memo this morning from Ben Noble in from Jason Johnson. I got an email from Mega also that just said we got a lot going on. All home has a program performance metrics that they're building has taken them 18 months to build out what they've got. I want us to build on that and add the kinds of things and the criteria that you're talking about. And I also one of the things that I've been struggling with with some of our partners, we need to be able to identify individuals and be able to make sure that individual by individuals are getting the help. They need other cities have done this through a form of ID and we're not trying to be big brother. We're trying to make sure that the individuals who are out there are getting what they need. And that is a bit of a side from your dashboard but to make this effective and as our regional partnership is coming together. I think we've got some new opportunities build on what we've got not start over but at the same time you a lot more effective. So thank you. Thank you for pulling it and I know that hurt but I appreciate you doing that. I'll ask for that memo. Actually didn't receive a copy of that. I think it just said just float in this morning number or Madam chair so that we can I follow up on this whether it's in this committee or whether it's in our new view Channel governance entity. I really appreciate your support for that action that we're calling friend very good. Okay, so that's pulled we have just gone through a number of amendments and I think we Allison go ahead. Making a motion to refer to Monday. Very good, and we've already we've already said we're going to do that, right? Not every single Amendment. Oh fine. Okay, very good. Thank you. So we are now at Council Bill 119. 575 and we've had multiple amendments that have been moved in past and doing move first to put it forward to the committee on Monday. All right, so I'm going to move that we agreed to On a special fast-track schedule to move this amendment for our budget and with the other end of the additional amendments to full committee this Monday. Dollars in favor say aye aye and a post no abstentions. So we will go forward now we're going to move to pass one 19575 as amended. All right, all those in favor say I know I'm not a post and we have no abstentions. So that will go forward to our full committee on Monday. Thank you so much for your patience and your work through on this number for 11957 to do you like to read that in 47493 which men of the 2018 budget including the 2018-2023 is VIP. Very good. Okay, Tom you're on this is a station with this refers to is the 2018 yard and exceptions. So by law we are required to expenditures need to be below the level of butter. Authority and in the Abundant level of cases that is the case. However, there are some rare exceptions and what this ordinance does is retroactively increases the 2018 budget appropriation to provide the Authority for those rare exceptions to go under the threshold specifically serve pass-throughs. The total impact is 13 million dollars. The largest The Lion's Share of that is and the customer requested tenant Improvement program in FAS, which is just past due Authority for the FAA has to do work on the behalf of other departments. So that work has already been done. The money has already been spent this just increases essentially correct for something that would have been done in the fourth quarter supplemental. However, it was missed that the Scott Pryor. Okay, so I will move Council Bill 11957 to all those in favor. Say aye aye. Miss one here, but we're still we still have a majority were passing. Very good. Thank you. So, I don't remember 5, but I'm sure if I could so I just pointed out that we did that one. Anyway, I think the intent is to discuss on Monday as well. The exceptions to suspend the rules to allow us to put it Forward on Monday, August 12th. All right, all those in favor. Say aye aye. Thank you for keeping us on track. Item number 5 Council, but one 19576 Sonoran and cementing ordinance 12572 for which adopted the 2019 budget including the 2019-2020 for CIP? Okay. Good. So will we continue on item number 55776 so this is the capital and Grant abandonment ordinance within the similar vein as the exceptions in some cases. Departments recognize that their appropriation Authority. This is no longer necessary. I'm for bride a technical reasons and this is just a request to decrease the authority to match what they think their needs truly are killer case. Our budget has been reduced any questions. We went through this pretty so so we need to move to suspend this one as well spend our rules that will allow us to put this word for Council on Monday to drop all those in favor. Say aye I thank you for that. Now we will move item number five. I will move when my 9576 all those in favor. Say aye aye to post abstentions. Thank you for that very much. So now we're moving off of budget all of those six of them. Are we still have one more for which adopted the 2019 budget including the 2019-2020 for CIP? So should we first move to suspend the rules see if we've got this right yet. I'm so I will move to suspend the rules to allow Council one 19573 if it passes to full Council on Monday all those in favor. Say I please speak to cancel Bill one 19573. This is the 2019. Ford appropriation. So what this does is in some cases there was was appropriation Authority that was provided in 2018, However The work that that Authority was provided for was not complete there is still a cash available. However departments need the authorization from Council in order to spend that to complete that work. So I'm in a nutshell. That's what that's what this does is it it moved the money and appropriation from 2018 to 2019 to complete those projects. Thank you. We talked about this last week as well. These are items that we're budgeted for just moving the authority to pay for What's already been done? We have 14 pages of this. Cracked and I don't think we need to go through it again, since we went through it at the last meeting unless you've got any particular questions. Alright, so this is already been approved that we suspend the rules and if we are ready for the boat, I'd like to move to 80 past. Cancel Bill one 19573 all those in favor. Say aye aye no post no extensions think you are able to move on to our last item on our budget predatory renting of extensively damaged Vehicles no vote on this, but we're going to get our first briefing me. I invite folks to come up. Jeff guess everybody, please. Please. Please seven extensively damaged Motor Vehicles ordinance briefing briefing and discussion. Nice to see all our friends coming up. We could probably would have been simpler if we just came out to you since we got to have to have the audience moved up. Do you want to come join us? Come on, we love that for you. Okay? Very good Jeff. Would you like to start introductions? Sure, Jeff Sims Council staff. Calvin Goings Kevin Goins Director of Finance administrative Services sure, I can provide a brief introduction to the Statue of do most of the discussion on it. So as council members knew approximately 1/5 of the people experiencing homelessness in Seattle are living in vehicles about 7% of it right now in Seattle in all of King County about 7% of them are residing in RVs. This ordinance would deal with vehicles that are extensively damaged so they would be unmovable frequently do not work. So they only have the option of if it's an RV, they don't have the option of dumping that sanitation into sores things like that. It would make it illegal to rent these vehicles extensively damaged vehicles vehicles out to individuals and also lays out the penalties that would be associated with that violation. Okay, and I look forward to hearing from the mayor's office on this and I I did have a chance to talk to the mayor earlier this week and I I want to set up a frame on this of looking. Prince really three things one. We don't want people to live in horrible substandard housing of any kind and a place and so I would I do want to acknowledge that I believe that that's really first and foremost in people's minds of no, we don't allow people to live in Rap Rat infested or mold where we've done our best over the years to really take a firm position that we're not going to allow that kind of housing to be rented to anybody or any family and I also recognized that neighborhoods have said these dilapidated things should not be allowed to remain in the neighborhood third big item for us I know is to be able to find it spaces for these folks that we don't just take what is probably their last-ditch effort as a place to survive but Define or angle. We're going to have to create some more 24/7 places for them to be I believe so with that frame up, please Calvin really nice. You can so please introduce it. Thank you very much for the chance to be here today. Good morning members of the committee counsel Calvin goings Director of Finance and administrative Services. As you may know oversees the tow Administration contract for the city of Seattle in the budget oversight really do Towing an RV a disposal. And so therefore I'm here before your committee, which has oversight of fas hate to discuss legislation that would prohibit predatory rentals of vehicles that pose health and Public Safety rest of the occupants and the broader public in the course of our work with people living in vehicles and their communities staff across multiple departments have come together to recognize that there are conditions where people are living that are extremely dangerous many of the people living in these conditions are also pain to do so lacking protections under our existing laws staff work with our partners at Seattle King County Public Health the city attorney's office to develop legislation that were here to talk to you about today and appreciate the chance to do so. Before I start I do want to note that we're here today to talk about the predatory rentals of unsafe Vehicles the predatory rentals of unsafe Vehicles. We recognize this legislation does not solve the broader vehicle living challenges, but we do think this is an important step in making conditions safer for everyone with this. I'm going to turn it over to edre Beauregard at from spu to give an overview of the situation, but also give a brief overview of the city's work regarding vehicle living and trash Cleanup in the right away through the RV remediation program. Thank you, and thank you for coming the table. Thank you to spu and FAS in the mayor's office for bringing this interdepartmental team together. I think you could Money Tree spell regard Seattle public utility. I'm over the past few years has been an increased of recreational vehicles parked in the right away, which has led to a prolonged. Of time. Would you like to essentially a lot of trash accumulation and debris build-up based on the circumstance that we're dealing with we had went to put together the RV remediation pilot, which was initially brought together in November of 2017, which ultimately expanded to a Citywide we started off in the SoDo District. Based on that it's on several City departments that came together as Calvin mentioned them including Seattle Public Utilities FAS Seattle Parks and Recreation Seattle Police Department's community policing team. The pilot was essentially designed to work with RV occupants and have them voluntary move their vehicles in a way that would enable City cruise to come and work together to clean up safety public health and safety hazards around the RV vehicles. Do this work teams came across several different type of public health and safety issues that they encountered and they fell under four main categories those categories being an adequate sanitation environmental hazards fire hazards and inadequate production from weather as we have here to protect from weather. What did they seen often times has during the RV remediation pilot. They would come across recreational vehicles that were dilapidated the roost pouring out. The structure was real week for posing a threat to all type of weather weather was rain snow or ice conditions that led to mold build-up and other concerns within the RV and self stuff for what you just said, and I'd like to know how it how does this differ when we run into people who are living in a tent mean that's clearly an adequate shelter. It's going to be an environmental disaster. I know that we remove tents from underneath I-5 cuz we were worried about fire and clearly inclement weather. So how are we how are we differentiating the den of the icky living conditions inside a mobile home or a car from the bad conditions for people living in tents. Well, that's a good question. I'm we put Let the navigation team handle on how they address the living conditions within the tents navigation team awkward Works directly with the human condition that they are experiencing homeless encampments for us. What we've done is on in order to determine what the public health and safety risk were based upon we partnered with Seattle Public Health in King County in order to establish some criteria, but Identify some of the risks that are involved that language was developed using the initial junk vehicle after David, what was already created the criteria from the Department of Licensing and also information from the city of Seattle Housing building code along with the city of Seattle stormwater code. So some of them are some of the ways that we've established some public and health and safety criteria, and we're applying it to the RV's itself. Some of these are Under the categories what we do come across when they're out in the field working with the RVs are some of Lauren conditions which include infestation of insect rodents rats other pests large amount of garbage debris that also includes air quality hazardous as we mentioned from old exposed insulation or other pollutants a large amount of urine blood needles human waste lack of properly working RV sewer systems and hurt hazardous waste from improperly placed propane tanks batteries and chemical motor oils. Are we talking specifically about RVs that are being Ranch to least out are you talking about all RVs here noticed in the field is based on the RV remediation pilot. So our staff spu staff are parking enforcement staff of coming across a large amount of RVs and these are particular to the RV and mediation pilot, but other parking enforcement staff have also come across RVs that were in similar conditions in most commonly the conditions that we were in a car crash with the RVs and the remediation pilot are inoperable and these people are extremely poor so they can't afford nice of you so we get that but I guess I'm curious. My understanding is the impetus for this is about the issue around people leasing out RVs. I can't tell if you're talkin about specific subset of these that are least have these conditions. Are you just talking about Bradley? We know the RVs in pretty bad condition causes extremely poor people that reason RV radiation pilot. So in the course of this work, we have developed the language in order to identify the risks that are involved the public safety risk, which are inclusive of these are some pictures that you can look up to but we've also noticed working on the RV remediation pilot, the extensively damaged RVs and the behavior of the predatory behavior that was praying on vulnerable communities subsets that are living in the RVs, including the branching and Leasing and trading of certain services in order to be able to reside in RVs that Something that are RV remediation teams have noticed in addition to we also identify gaps in our current city towed system in the way that we are Towing the vehicles after they left behind during the RV relation pilot and often time about 53% of time. We seen the same Vehicles show back up in these clusters of RVs that we dealing with. How much you got your last I talked a little bit about what we're here to talk about today, which is the proposed legislation. So essentially in the course of the work that s p u s p d h s t i n f a s are doing related to RV. They've come across a number of conditions where residents are reporting that they are actually paying to live in this condition situations where people don't have the keys to their vehicle to move them for pick up situations where people are worried about the security of their their belongings Within These are viewed the purpose of the legislation. Do I have to question the keys? I've never owned an RV but there's an ignition key which may be used for not that there's a key that locks the doors. It's probably a separate key. I don't know the answer to that are unable to move their vehicles because they do not have the keys. Mission of their agreement knowing if they have the keys to lock their belongings cuz that's how you know, when I read the article about So today we're here to talk about two things one is at work here to address two issues one is that we have the situation. It's a predatory behavior tracking Bonnabel people were not talking about private renting of RVs were talking about prohibiting renting of dangerous vehicles vehicles that the health condition poses a challenge to the people living in those vehicles and a challenge to the people in the surrounding neighborhoods. So should do this and I think he just has a few pictures up here of some of the conditions that were talking about. I think what you can't see here is the situation with mold on the situation with rain coming into the building. The insects that the Vermin it's pretty substantial and I think I'm also know where they just the situation of not having any type of working bathroom or running water in this condition when I stepped out and did you answer the question how many people you think are impacted by this? Is the question how many people are infected renting in a condition like this or leave it mean if we're focusing on the predatory approach of people living in some and if something where they're having to pay rent and you're going after the ranchers do we have a sense of how many people were talking about it? So I think we have heard of somewhere between two and five people in a fluid situation who are in fact renting these vehicles out to other people at any time. There could be a variable amount of people who are living it in one RV or many RVs are the actual measuring that particular thing is is incredibly fluid but we do we have heard of 225 ranchers who are okay. So I know we had talked just before you came in council member O'Brien and we're trying to address a health problem. We're also trying to find places for people to go. My real concern is trying to get a sense of if we if we Not this legislation as recommended then how many people are going to be over, you know goodness knows we don't want people living in these terrible conditions, but we have to have a place for them to go that's going to be better. You don't really run back out on the sidewalk and cardboard boxes doesn't strike me necessarily as being better. So as we're going through this, I really appreciate the focus that you all have done on the public health major for this. I want to know how many people are we going to need to accommodate? I believe that the mayor told me what they're offered shelter. But if it's just overnight shelter, we still haven't solved the problem. So I'm just hopeful that we're all on the same team here. I don't need to address the Public Health crisis, but also make sure we've got better places for people to go. So I think we ought to get Spell presentation with this group. I apologize. The legislation essentially is is pretty simple. It prohibits allowing another person to occupy a vehicle health and safety threats to those individuals into the public and it defines such a vehicle as being apparently inoperable. I'm so things like missing tires missing engine block having an adequate sanitation things like insects accumulation of garbage problematic Wastewater systems health safety and fire hazards, which we are increasingly seeing within RVs and then finally on the weather. So in order to meet those criteria a vehicle would have to meet two of those four specific criteria to qualify and then Is for the owner of the vehicle and the person who is essentially letting the other person occupy this and those penalties are a civil infraction for the first occurrence a misdemeanor for every occurrence there after it also include the $250 fine for each occurrence as well as up to $2,000 in restitution for the victim. The tourniquet asked them to speak a little bit more. This is the meat of the conversation. You have a piece of legislation that does not distinguish between an individual that is renting out these these vehicles in a predatory nature. There's nothing in this legislation that directly talks about the penalty being applied to those who are engaged in a market because there is no other shelter opportunity. I think we can all agree especially from a public health perspective that all of the ways in which we have seen the individuals living in these very unsafe conditions is not only heartbreaking to see but we know from a public health perspective is immoral to allow individuals to live in those situations, but the reason they're living there is because we do not have other options they're living there because there is not the ability to occupy a bed with shelters that allow for families to stay together that allow for couples to stay together that allow for people to be with their pets that allow for them to stay with their belongings. People are opting to use These items because we have not created an alternative. So I understand that it is an unsafe condition that many individuals are facing. I also understand from The public's perspective that they see unsanitary conditions and they want those Vehicles moved off of the street. I get it but we have not created an alternative to these vehicles. That's the point that we should all underscore. The second thing is specifically to this legislation. It does not specifically identify who the penalty goes after when it says no person shall allow another person to occupy does not clarify that we're going after the predatory nature in which many of these entities have engaged in marketing or renting these deplorable vehicles or RVs to individuals who have no other option when you look at the enforcement and penalties section, and then I'm sure I'd love to work with you on this because I know it we share an interest in making sure that people have a safe place to live in a safe alternative to living in vehicles and cars, but none of the language The enforcement section is directed at the predatory lease or or the predatory renter ossify in the legislation with a misdemeanor goes to where the penalty goes and it does actually leave up to question whether or not the individual in the car is going to get penalized or if we're that is not our intent to clarify if the intent is in fact to penalize the person who is profiting from this is predatory behavior. And then if that is the case, I just want to follow up question because I'm afraid I do have a hard stop here in a few minutes, but that would clarification will be extremely welcome. The other thing is if there is not an alternative for them. What are we offering these folks? The folks are living in these vehicles clearly are doing so as a last option as a last resort. So given our ongoing conversation about the lack of vacancies at enhance shelters or tiny homes, or you know, even better affordable housing. What are we doing as an alternative if we're going to be taking away this last opportunity for them to have a place to feel safe because many people don't feel safe in our Matt on the ground shelters and they don't feel safe intense and sometimes a vehicle give them the ability to lock the door as you talked about. It is incredibly important for people who are escaping violence and need to feel safe though. I understand from the public health perspective why these are not a healthy option. We need to offer them an alternative people who are renting these vehicles not necessarily about the people who aren't there. So the penalties occurred to the people who are renting his Vehicles out to other people. Are seeking clarification and this legislation before it moves forward. That is something that absolutely needs to be clarified in the legislation as well. I don't read anything in these two sections on that actually talk about the rent the type of vehicle. I'm beyond its deplorable conditions. We all can acknowledge the deplorable conditions and what you just showed some pictures and we've all seen on a daily basis. I see commuting in on East Marginal Way. I see it on my commute to go enjoy recreational activities along Alki. I see it. We know that this exists and we also know that from our friends at DIA and so they see it on a daily basis to we know it exist, but there's nothing in the legislation as I read it that specifically talks about just those Vehicles were people have rented them out in a predatory way and that clarification really need to be clear and I would also encourage if you haven't already to discuss that specifically with the city attorney's office as well as make sure that we're clear on on specific language and that we have a car. But I'm hearing that you're open to adding clarifier. The foundational question is does the council agree? This is a problem. Does the council agree that these conditions the squalor conditions are not fit for our fellow citizens? And if so, when I think you do work with us to protect this legislation, I think the chair brought this here is a draft for partly this reason until we're very interested in getting this right and working with Council staff. But this is the difference between the tents and some of the other conditions is this is an issue. The city has a role in currently. There is an inhumane supply chain of RVs that are putting our most vulnerable citizens at risk and the city has I believe a moral obligation because we are involved in the supply chain to say that's not acceptable and to put forward our best proposal to remedy that situation and so we're very interested in working with the legislative branch to perfect this legislation because I I think you share our shared values about the citizens and that we should not be part of a system that allows for Folding door predatory system with RV Ranch in the city of Seattle. I think it's important and it be helpful when we're talking about it. We're talking nearly about just the people that are being predatory least to those implorable conditions everywhere and there are plenty of people that are sleeping without sanitation and all those things and if it's the article talks about two people one who I think was out of the business and when was down to one RV, you said maybe to defy mean of the 800 RV's around there when I can only talk in five because this isn't a situation they were actively enforcing on it's it's difficult to do a census of that's what we have are anecdotal reports. Do we agreed is the problem if it's three RVs that are being predatory least for $40 a week or whatever that is not the most important thing right now and if it's 300 it is Maybe on the list and I would expect someone to get that information and I didn't read, you know similar to read the legislation or look at the summary here. How are you going to distinguish between the pictures of these are deplorable, right? And you know, there's there's these look completely completely uninhabitable and I don't know if someone's actually living in those at the moment. I've been through RVs that doing Outreach stuff and I see ones that are much more livable would probably fail the test. They I don't know if they have a bathroom that works. Most of them don't seem to they may not be operating but it still providing shelter that I would say is a significant upgrade from a tent but based on this could be subject to be confiscated impounded and similarly. There's people that you know what I look at some of these pictures they remind me of people that are hoarding and houses and everywhere else in Edgewood swing surprise me, if there's significant mental health issues and the idea that we're going to impound their vehicle and put them on the street as opposed to make sure they had access to mental health treatment. And I think that point council member in and I know test was hoping to get to their butt to talk about to your concern and others. I think all of our concerns if this proposal was to pass and if these deplorable conditions these predatory these unsafe squalor RVs were to be where to be appropriately jumped. What are the wraparound services and I know Tess has been trying to get to that point and I'm not sure Madam chair of time allowed for the fifth time. You've been in front of us and it seems like we always jump the gun and don't let you do your presentation. I wonder if we could allow you to do that at the same time. You can talk about I in your mind in the team's mind. How will the process be initiated if somebody is is it is it somebody internally who's living there? I doubt often times that they would have either the they would be worried about getting tossed out if they were too. I don't want to see if they were to report. The person who is renting so maybe you could just walk through and tell us what it is that you all are thinking about how the process works and then we can respond again after he hurt her more. Thank you very much. Again Tesco. We with the mayor's office. So we definitely been talking about the goal of the legislation in terms of stopping predatory behavior that have folks who are allowing people to occupy RVs that are supposed to health and safety hazards from circulation off and causes the occupants to seek alternative shelter. What are bees that are occupied are toads system Navigators are available to begin Outreach at any time within the 72-hour. Including their there on the day of the clean they do in the same way that they work with folks who are living in encampments. They offer services such as reconnecting people to their case management, which is actually the the primary service that people are asking for is to get back in touch. The folks that they already have a relationship with and those are the folks who can actually long-term help them Access Behavioral Health programs Access housing and help them generally become stable The Navigators, of course also offer shelter. They know which shelters have available beds so they can refer people to shelter and that shelter includes Villages and we know that the villages are in fact, the the type of shelter that is most often requested. So and that addresses to impart the issue of people being able to keep their pets with them or couples being able to find a place to stay as well. I will say that the navigation Center also addresses those needs that admittedly basic shelter does not address when a referral is accepted The Navigators can offer transportation and they often do the transportation themselves to make sure that people have access and are able to To the shelter as an example of how this works in real life last month's the RV remediation team encountered a known car Rancher during a cleanup event in Georgetown. The individual was also living in a vehicle with significant debris and infectious waste that first of the individual was very confrontational but became a calmer when the navigation team was called to make contact and offer Outreach Services eventually, they accepted shelter and we're transferred to that shelter. So it's also important to keep in mind that people who are occupying RVs generally don't consider themselves to be homeless. And so acceptance of service is our shelter may not happen regularly, in fact and data that we've seen recently. It happens somewhere between 10 and 15% of the time. That doesn't mean that that we give up on them if they say They don't want Services The Navigators continue to work with everyone to ensure that they know what their options are that they can help them find an alternative safe space is in addition to providing support to occupants through the system Navigators. We wanted to make sure that they have access to reimbursement of costs that are incurred such as those for relocation again, understanding that they are going to need to look for alternative shelter. So for that reason, we have included a restitution requirement for up to $2,000 for violators that helps his realistic. Do you think the Ranchers have money? I think some writers to the people living in the vehicles have the wherewithal the tractor Ranch. Essentially gives us the ability to work with them to and the court system to have that happen and absence something like this. We do not have that ability test. Thanks for doing the Outreach slide. I think you were you're outraged elements focused on those who've been victims of this type of predatory rental scheme is important and would love to see that type of language included in the legislation. I think that's an important element However the fact that when we talked about Outreach and an enforcement, we really again focused on the occupants of these vehicles these RVs underscores to me that were not thinking about the individual entity or the individual person who's engaging as a car Rancher. I'm in fact, we haven't even defined what a car Rancher is in this legislation or Define the type of entity or individual that is renting out or marketing these these unsafe products. So if we were This legislation to be focused on the predatory nature and the predatory crop up industry or Market that has become a huge I think problem point of concern for us when we look at these pictures anecdotally, but we need the data is councilmember O'Brien said to understand whether or not it's huge in terms of presence in our city. That would be very helpful to have definitions of what the car Rancher is or the renter or the market vs. Saying no person shall allow another person to occupy about vehicle. I mean, I worry that that is so incredibly broad that people may take it upon themselves to say. Hey, you can't be here because that ordinance passed we really need to be specific in the legislation about who it is that this type of penalty should apply to and with the intent of this penalty is in addition to the good hours that you just outlined. I appreciate that for the folks who have been victim to this type of predatory marketing and get them to the fact that we haven't Good enough shelter around the city and I do have to go at the doors are going so I just want to answer your question directly. You asked the question is does the council share the concern of individuals living in this type of situation and I think from the last year-and-a-half that I've been on Council, it's very clear to me that the full Council shares the concern of people living in unsafe conditions. That's why we call for additional funding for housing. That's why we called for additional funding for enhance shelter. That's why we've done more to try to make sure that people have access to health services across the city and frankly why we've even even though there's other services that we know need funding. That's why we continue to invest in the robust request that they have come from these executive around the navigation Services navigation team specifically because we want people to get access to this Human Services element of it and all of that should underscore a shared interest. But when you ask does it matter or do we share the same level of interest when we're looking at specifically? Inflation we have to look at the language here legislation matters the words in that legislation matter and to the extent that were not being specific enough to the industry the marketing the targeting the I'm predatory nature that has cropped up then it really does leave open the question of who we are trying to get at and what the consequences will be on The Incredibles speaker that I had the chance to sit with that you had yesterday. He's a priest he said when he looked at this legislation, he saw that this was directed at the vehicle and not the people and yes, if we want to look at the type of vehicles that are being rented we have to look at who is renting those vehicles, but without at clarification in this legislation it is I think it's sending the wrong message across our city that those who are living in this type of situation. It is the people within it that will suffer the consequences versus US intentionally going after those who are preying on people who have no other option. So I look forward to working with you on amendments. I'm not clear. If this is as council member of Ryan said the right approach to getting at the concerns that we see but whether or not the council shares our concerns about people living in this type of condition unequivocally we are concerned about this unequivocally. We don't want people to be living there and unequivocally we will work with you all to find alternatives to that. I'm not sure that this is the right vehicle if you will to get us there and I appreciate those comments council member and my comments were directly at this legislation and I appreciate that context. I think we should be very clear about were talking about. These are inhumane conditions run by slumlords on wheels. And now these conditions are not fit for a dog in a part of it. FAS is over side is animal shelters. If there were animals living like this. We would seize those animals and please tell me that Seattle is not a place that would allow would not allow a dog to live but that we would allow human beings to live. So we are absolutely committed to getting this Pitch Perfect cast member and with very much welcome working with you and that's again why I think the chair rightfully write this legislation as a draft to engage in this dialogue and look forward to doing so Thank you. I tested you want to continue? I think you had some other guy. I was the first one to interrupt and I apologize for that. But do you want to continue cuz where I left off was whether or not then where I'm going to use the term ranchers actually have the money to pay so So again, we believe that they do we think that this is and we also think that this is an important message to send to ranchers and a disincentive to continue to do this but we believe that this is the appropriate level and there's a lot of frankly there was a lot of conversation in the interdepartmental interdepartmental team meetings about how to ensure that the legislation is also drafted in a way to protect and well to protect the folks that are being preyed upon and we believe that this is the right course to take do we have money in left over from the last time we asked to have another Village built just this week. I've talked with a couple of individuals were reaching out to some of our faith institutions that are saying that they were willing to reconsider putting some tiny homes in their parking lots. I would feel much better if as part of this We could have set up an advance places for people to go and I know we argue all the time that tiny homes are inhumane as well. And I I hear that nobody says we want people living in tiny homes forever. But as a bridge better than 1/10 better than this dilapidated mold-infested, whatever you've got. I would love to be able to say that this individual we think that this is an inhumane place for you to live. We're going to offer you something better. Is it perfect know? I wish I could get it inside but I'd rather have somebody have something with running water clothes with cooking facilities close with a roof over their head and a door. They can lock and it take up cost us $5,000 a piece or some of those modulars were looking at I'm really believe that we need to be as a parallel path good place to set up so we can direct people to go. But thank U council member that's exactly the reason that the mayor stood up five hundred additional shelter. Just because and exactly why our emphasis has been on and hands shelter and on supporting the existing Villages completely agree with you that it's important to provide shelter that is provides all of the the basically human needs and if necessary services for folks, we think that the knob seems approach with a system Navigators making sure that they have offers that they know which shelters have Beds which Villages have space but that's critical to the success of this and I'll note that Bose enhanced shelter in the navigation Center and in villages. There are case managers their staff available to really help people take the next step towards housing. I guess the question is are they full? Do we need more can we accommodate with the 500 in and bless you and bless the mayor of for having a sport 500 more beds. Do we need more to be able to have open? Open spaces for these individuals if we're going insane that RV is impossible and it's clearly one that is being leased out inappropriately that can we say to that individual he look we've got a bed but not just an overnight shelter, but we've got a place for you to go. Is there space now or do we have to do a fast-track say we need 50 more? Just tell me where we are. So what we've seen now is a particular moving to enhance shelter is that the throughput if you will has definitely improved so that it has shelters have a much better right now is exiting people to permanent housing in The Villages are also improving in that and so that does create opportunities that throughput then creates vacancies and beds and opportunities for folks who are living outside in this case also for folks who are in this kind these kind of inhumane situations and so in RVs and also as you know, the navigation team that's working in encampment have a similar opportunity to offer people into shelter. They only offer it when they know that there are shelter beds available. So that's part of the the began the rationale to really moving to a shelter system and a shelter model that has more heightened services and is much more focused through their housing Navigator. I'm moving people into safe stable housing event council member on the last one to 2% vacancy rate. Is that still roughly accurate? Because there aren't beds going wanting. That doesn't mean that On Any Given night. There are that all the beds are utilized then the which is why there are regularly beds available for the navigation team to refer the some of those beds get held specifically for folks that are being referred to them. But then if quite frankly, they don't get filled by the navigation team. There are people still available to fill them. So that really is this may sound counter-intuitive for the conversation that we're having but the goal is to make sure that their space available for the navigation. And to make sure that those beds are filled so that we don't deliberately have people sleeping outside and we have people to fill them out then we may prioritize a certain population at different times, but we're not a bunch of dads and we're struggling to find people to get in and similarly on the affordable housing side. The last I understood was there's a really long wait list to get into that again on any given night. There's turn over and there may be a few spots while they could do people to move in but there's we don't have a problem of affordable housing or enhance shelters that we just can't find people to go into the challenge for me station. And then maybe I'll get a little feedback but I don't want to see the two of these four to these conditions is is that only in the case of a vehicle being Ranch tour is that any vehicle that they would need to be? Somebody would need to report in fact that they had been infected to Mysore that somebody had engaged in this this Behavior. Can anyone say that but in order to I will also ask that you probably should direct some of these questions to law because some of this will play out, but I think the way that we are seeing this happen on the ground at least in terms of how our staff interacting with people who are affected by this. Is it an individual will say hey, I am a victim of this this condition. I don't know what to do or should have had one address the situation in that case. We imagined that we'd said this this is a vehicle for you to pursue if you are interested drivers than could be filed against the person who is in fact that the owner of a vehicle so it sounds like the process in place to determine that and I would love to in advance of of passing this legislation that process play out a little bit so I can determine like again How likely are we to be using this cuz that would be really informative conversation but we have had reports that we didn't have an opportunity to answer that earlier but it's not one or two but I guess I will just stress that given the nature of other living it is a changing situation on on a daily basis so there is in this earlier there is a benefit to having us in the book in terms of how it would discourage the practice from proliferating in the future The sewing another question, so it'd be great to get a little more data on that. So as we move forward the soul of clarity on if the tenant is like I don't want to lose this. I wish I weren't paying $40 a month or week or whatever for this. I think 10 is more fair or the landlord won't give me access to this or being abusive or the article talked about drugs sex trade those types of things for this which obviously is completely illegal in inappropriate and we should act on that if that's going on, but I want to be clear if this is going to be a tool that someone says I suspect this is going and then we're going to take away someone's housing or it's only going to use the case when the person living there says, I need you to help me get out of the situation and if the result is this gets impounded, that's okay, but the with the way it's drafted to be interpreted feels like people are going to impose this app on tenants and that is not that time. So I think it for us to the word occupy. I think it's come up a little bit and I just want to stress that we opted to use the word Allah. When to occupy in order to allow a person who has been victimized by this condition a little bit more leeway and their ability to prove what the what the conditions out of there an agreement were with us to the bodies of a vehicle at home but understand the policy and we can discuss that here of the occupant would we pursue this advantage and and there's a question about this occupied. So if like, you know, let's say I had an extra RV and the said you can use it for free and I'll move it around every 3 days. I don't do that people out there watching but if one want to do that, they're not paying rent. I'm not profiting off this But that it has been a question raised about do they have to pay rent or not. I suspect if I could describe the maybe you can clarify that they may not be paying rent. But there will be other forms of compensation like sex acts drug trade those types of things and you wanted to include all of that. Is that a damaged public health hazard? So it's it's a very specific subset of you that were stealing narrow what you're trying to accomplish was 3 or 300 probably in the dozens and we feel that being aware of even a half dozen or a dozen people who are being victimized in this revolving door. This predatory cycle is too many and executive really wants to work with the council to get this right but to address a small piece of the piece that we can address today here now, To a suggestion would be appreciate the clarification cuz that's how you had to write this and with law oversight and is being introduced but Clarity around all that is going to be really helpful suggestion and I haven't thought this through positive angle and say if someone is renting a place we're going to set up a you know, a vehicle inspection program just like we do with metals and if someone says yes, this is not my vehicle are there is a landlord and compensation monetary compensation or something else whatever that is and we can say okay that's the case. We need to connect with the landlord and I never be a sticker that goes on the side. It says it's a rental vehicle and it's been inspected and it's it's good to go and some healthy if a rent a landlord fails to go through that. The article that talked to a couple of these, you know, I haven't I haven't met any of these ranchers. It's hard to tell what their motives are forcing the past eight. They sound like somewhat generous human beings that are trying to make a few bucks not a lot out of bed, but really just kind of help some people get some housing. So, you know, some pretty awful people. They're taking significant Advantage people that we want to shut that down but some program that's a little more feels a little less threatening a little more. Hey, there's a path to do this if you want to rent them out and this is what we require if you don't do that, then we won't force and we will find a housing for the other folks and make the end of the day. I think this is this is sounds like it's a fairly narrow program in this legislation. Is there a problem this legislations intend to send nearly to find that and we still have hundreds and hundreds of vehicles out there after this is done many of which are probably most of which wouldn't Our standards of acceptable living maybe not as deplorable as those in the photos, but still this is not a long-term solution and I think the best way for us to solve this crisis is that we give people better options and when we're taking away the best option they have that's when it just feels I look at it. You show me the picture Calvin of Mike that is an awful option. And if that were my best option at the moment taking that way makes me even worse off at a few people are making bad decisions because they have mental health issues that we need to get in Fremont. And after simply this is the best option they have You know, how do we get him into something better is the thing that's going to really help. And that's a challenge and I think I would just point that this particular legislation create an option to actually get some restitution interpreted as I transition to something a little bit more substantial and currently we do not have that what I would suggest I believe someone for feedback would be that the city would provide the restitution and be responsible for collecting at cuz kicking a tenant out and saying yeah, they'll be a court process and someday you might get some money but you know, the one guy that was was just evicted in the article. I can't imagine he's got a bunch of cash. I'll just have a judgement against him and he sounds like he's living in an RV to so he's part of the problem in part of the other problem. So if the city feel strongly about this When this happens, if you're being abused, we will we will find some money to do it and we have will put mechanisms in place so that we can recover that. We'll see how much that we actually recover but I should be on us not the not someone is already living in deep poverty to have to wait for a court system to produce something when they don't have attorneys. So so that would be and what I hear is that there is General agreement. This is a problem and there's some fine-tuning to be done on this narrow slice and maybe some opportunities with a longer-term conversation about the other 750 certification inspection program. That would be an interesting conversation to have Just in the morning the same as it would be really helpful for you to say this is a problem. We know renter has 12 these at least in the field. Cuz what I've heard today is we think it's two to five people and I saw an article that said one of them is out of the business and one of them has one left and so one is too many but agreed. I also don't know that we in the whole city infrastructure needs to be spending a big chunk of our resources on a problem if it's just a handful, but if we can investigate in track these down and talk to the you know, Lincoln Towing who's selling these and figure that out. And then yeah, let's figure out the best way to get them out of that business without damaging the people that are in there something more evidence. That would be really helpful. So we have another conversation scheduled on August 14th, and I think Jeff you written a good memo on this and we can go through it what I think I'm hearing and 7 clear from you is we want to make sure we have information rather than spending a lot of time on legislation if we're spinning our Wheels. I'd much rather be targeting. Okay. What are we going to do? How many people are involved? I like what you're suggesting about having the city being able to help find other spaces for people go after if there is real restitution City to be able to do that. I completely concur with you somebody who has no resources or maybe is really struggling with mental health behavioral health problems isn't going to have the wherewithal to run through our legal system to recover that. I hope we can take another conversation on this and really want to come back to the idea of where a team here. This is not 7th Floor versus second floor. I want us to be figure out what's the problem. We're trying to solve and what I know based upon conversations with councilmember misguided to we need to add more places for people to go. I just do now. Want to say we're taking this icky horrible thing. We're going to destroy it and good luck to you. Mr. Tenant. We've really got to find a solution to that next step as well. But I'm willing to work with you. I hope that counts member Bryan that you're willing as well. I know that Jeff you've written a great memo is a start will have another conversation on this in my committee on the 14th, which is next Wednesday, and I'd like to pick that up with without people saying this is you know, what this is garbage. Let's save how we had we care for the people and take care of the problem as a collective effort. So that would be my proposal anything else really many. Thanks for coming together around this. I just keep feeling like we're chipping away chipping away if we had tons of resources. Unfettered I think we could make some faster progress, but just getting people inside is important to me. He probably sensed a person frustration for me and I want to just say that but we've all stated multiple times that the challenge were facing is a really hard one and I don't question. I'm trying not to question the motives. I really appreciate the clarification which helps a lot having this conversation. So thank you for having that happen. And you know, we're doing some amazing work, you know, the mayor added 500 new shelter units. We are going to open close to a thousand new units of affordable housing which is three to four times as much as we did just three or four years ago and that seems to be an ongoing so, you know when we're getting more throughput because of that all those things are good and yet We still have thousands of people entering homelessness every year because of a failed system. That's not working on the other in our whole economic system in those things. And so, you know, we are all trying to do really good work. I would argue that we are doing amazing work and the results show it but we were still overwhelmed by then input and and then it looks like we sit here and argue with each other on these failures, and I think I think it's more just shared frustration that like, you know in a city with so many resources not just the entity, but everyone here that we can't figure out how to house everyone. It's it's thank you for anything else. You want to wrap her up. I have nothing else to add. Okay. Thank you. I appreciate this good first conversation good dinner. Just putting things on the table. Let's like let's have an understanding about what the problem is. We're trying to solve a very good. Thank you for that. Thank you. For having an IDT. I just am very respectful that all of you were talking together. This is our last agenda item.", "end_time": 9225.7}]}