{"format": "raw", "annotations": [], "confidence": 0.945277765122327, "data": [{"start_time": 0, "text": "Good afternoon, everybody. Thank you for being here in City Hall. One of the best-looking audiences I've ever seen since I've been here. So thank you for being of the July 15th 2019 full city council Seattle City council kind of words to PMI Bruce Herald present the council with clerk. Please call the roll. So What by Sean Gonzales introduction and referral calendar will be adopted. You know Jackson today's introduction and referral calendar is adopted. If there's no objection today's agenda will be adopted. Hino jection today's agenda is adopted the minutes of the July 1st and 8th 2019 city council meeting meetings have been reviewed and first no objection. The Menace will be signed. You know sex of miniature being signed. Clerk Presentations I have a presentation. I'm very honored to make this presentation. This is relative to Carolyn Riley pain and we're calling today is Carolyn Riley Payne day, and I'll just say a few brief remarks in any of my colleagues would like to join in feel free to but it's absolutely my honor is a member of the council and his directions to the city to quite candidly honor this kind of talent in his eye when I say what I mean by that is many of you in the world of civil rights and human rights and an education know the work that I miss Riley pain is done throughout her. Decades and decades in the city, but her style is one that I think is magnificent because many people may not know who she is because she's not that kind of leader that pounds her chest and says look at me and look at all the work that I've done for them. She's done it and there are literally hundreds of people particular in the African American Community are the beneficiaries of her work and a commitment to education our commitment to civil and human rights. And and I think that many of us have grew up in a city with a touch of the work. She's done leaving those that are welcome Anubis her to speak would realize her work for in the different organizations that are described in the proclamation. We should all be very very proud to us in honoring her. We should honor the best Inn in ourselves and in a community. So let me read this Proclamation has been signed by all 9 council member so just write a pain. You're one of the few people. Got us to agree on everything word for word and and let me read it, please. So whereas Carolyn Riley Payne was born in Durham North Carolina and was one of eight children of Roberta and Joseph pain at the importance of activism and education was instilled and Carolyn Riley pain at an early age and Carolyn was vice president of the youth Council of the n-double-acp along with other youth groups in Durham, North Carolina and understood that attending college was expected and Carolyn attended Bennett College, which is a historically black college for women where she earned a bachelor's degree in special education and SRI calls what our professor told her when she graduated and I quote you have been taught. You know the theories of Education go out now and put the books away and love children but teach them and whereas wherever Carolyn has been she has touched the lives of people around her character has a great sense of humility and never wants to talk about what she is doing for others. And where is mrs. Riley pain is a transformational leader one who left her mark on every part of our city. She has advocated for children work with the food with food banks establish a Consulting Group as well as provided leadership and unyielding support to the following groups and organizations Cascade chapter federally employed women feu region 10 blacks in government. Jubilee women's center Southeast Asian compassion assistance Network. Otherwise known as C can the afro academic cultural and technological and scientific Olympics otherwise known as act so and I must say that this Saturday at First AME Church where hundreds of people attended this great celebration, there are many well-known beneficiaries in participants in that program. My name is Riley pains leadership. She's a member of Delta Sigma Theta sorority and the local branch of the Seattle King County n-double-acp and whereas city leaders as city leaders. We Endeavor to seize every opportunity to honor the too often neglected accomplish accomplishments of men and women in our communities, and that said we believe Carolyn Riley paying to be a phenomenal woman with an extraordinary commitment to public service now there for the Seattle City Council Claims today as Carolyn Riley Payne day. And unless any of my colleagues wanted to say any words. I like to suspend the rules and we can hear from its Riley pain or any other people that would like to speak on her behalf or during this part of the program. So I don't want to hog. All the great remarks if anyone is good. I'm going to proceed to go out here and if I'm lucky I might even be able to get picture with her. So, okay. Do you like this? Good afternoon. I'm indeed honored and humbled by this recognition and his Proclamation. Thank you so much for taking the time to looking for that. I have done working with all the organizations that I worked with. I didn't do it alone. I stood on other people's shoulders. But it took commitment who does 40 Years of anything. Only somebody who will some people would say a little bit crazy, but somebody who is committed and love what they're doing every organization. I work with has the same kind of scene helping and empowering did women transitioning from homelessness or children trying to find who they are. So I'm indeed. Grateful for the opportunity for God to have blessed me to be able to do that and to have the support of family church. And the community to make whatever I've done happened. I was humbled by all the good things that I've heard that I've done and so I say, thank you and I do hope No, I'm not going to say I do hope I have another 40 years to do that. I'm going to have to find something else to do and I do appreciate the recognition. Thank you. Well, the rules are still suspended Miss right as you want to say a few remarks would love to hear from you and as mister, I approach the microphone part of our legislation day. We are I'm going to anticipate your going to confirm her new Department of Human Resource director. Robert Humes, otherwise known as bobby pins. I'd like you to stand up. So and so So he said during the confirmation process that he has an open-door policy, but in all seriousness, we look forward to that process. I led by one of our colleagues and I did again I wanted Michigan shoes relatively new to the crew. I said relatively new to I make sure that he knows some of our community leaders. Mr. Riley ever florastor. Korean Odyssey has a lot of support. So I think he's off on the right foot I want to say is that my daughter Angela was an actual participant a national winner. I was a classmate of Gonzales is clu a class that they were seatmates and floss school and remain friends since then but Miss Carolyn Riley pain, like she said for 40 years has just been outstanding and the tribute that was given to her on Saturday at first Sammy was just overwhelming and we do appreciate all the support that she is received and she is worthy to be praised. I still can't imagine why anybody would want to put on the sidelines for back so cuz she is act. So not only in Seattle and Martin Luther King jr. County, but she's actually cross the country. She has that reputation, so I want to thank the council for recognizing her work and hopefully someone will step in and try to take your place. But thank you very much. Thank you. Mr. Rye. And again while the rules are suspended. I know we have the state director, mr. Hangers and mr. Hangers. Did you want to see a few words or I know, you know strange that microphone, sir. So please Be Our Guest I know that's funny that the microphone I know she always get nervous. My name is Gerald Hankerson omnipresent of the n-double-acp for Alaska Oregon and Washington, but I recently served for 6 years after the n-double-acp president for 6 years ending in January 1st, which was Carolyn Riley Payne was our first vice president. That actually is responsible for my leadership. So whatever you get mad at me about blame her but you know, she is just been more than just an actual person. She have been a mother to me and my leadership role both of the local of the state level everything that I've done has been largely because of what she has provided so don't think that just because a bunch of kids out here that's glowing because of Carolyn Riley Payne that's a lot of us adults that she have actually educated in prepared as well. But I want to acknowledge her for her work 40 years. I'm only 50 years old. So when she started this I was ten but we're the oldest civil rights organization in the nation. She's headed to the National compete with other kids as early as in two days for now bring home to go see But I want to acknowledge her for a leadership or mentorship as well as the expertise that she has provided much of us in our community, and I want to thank you for not only for my professional development, but also for my personal life, thank you. Thank you. Thank you and thank you for the council for recognizing this lady because ultimately that all about kids out here that successful as a larger than once because of his Kayla Riley paid. I got a call. So forgive me for my allergies. Thank you so much. Thank you. Leave those remarks and I'm only 40. So when she started I was Zero. Okay, so at this point will take public comment on items that appear on today's agenda the introduction referral calendar and the city council's 2019 work program in Williston Public comment for 20 minutes and I'll call you out an order of what you signed up. And we have eight speakers signed up. I'll start with Andrew. Is it cook or Coke and I can cook and Ruby first and then militia militia marks followed by Hilary keys. A good afternoon to the council. My name is Andrew and I have 5 days for now marks my four years working at DSC helping the most vulnerable members of our community that the committee discussion on the Human Services legislation. You are considering we got to hear from people who benefited from consistent and knowledgeable case management Tristan spoke of Joe and his unwavering support and encouragement while homeless is a youth Susanna spoke about Mina a guy and the guy that she provided to help Susanna who is a caregiver to your adult child with disabilities. If someone who has worked as a case manager, these are wonderful stories to hear. Is this powerful testimony also made me think about the names that I carry with me. I have many happy memories of congratulating a client on finding worker housing. But the names that immediately come to mind are Scott and Barry Scott was one of my first clients back when I was about 95% enthusiasm and 5% knowledge. I'll never forget Scott. He was the first person to ever cheerfully beg me to help him find housing because he did not want to die in the shelter. I was not able to make that happen for Scott. He died a few blocks away at Harborview. Berry was a big guy, but soft-spoken and interested in film and philosophy. I enjoyed getting to chat with him sometimes about the subjects. I don't know for sure. But I suspect the philosophy was him trying to find comfort in a life. Where is genetics overcame him in the form of a bad heart. He was too sick to work but not quite sick enough for hospice. I never got an official report, but the friends he had made in the shelter told me he died alone in abandoned building down on the waterfront. His ashes were laid to rest July 10th of this year are the King County judges remains program. It is my hope that both knew that they were cared for and that they will be remembered. Is in that spirit that I stand before you today to ask you for your continued support this vital work. Thank you. Thank you. Please good afternoon council members. My name is Melissa marks, and I'm here on behalf of you cares board of directors. I've served on you cares board for almost 2 years and I'm deeply passionate about ensuring that you care can fulfill its mission to end youth homelessness and that hinges on supporting its staff and its infrastructure. This legislation is important to me because I worked in the non-profit world for many years have a particular sensitivity to miss representation of overhead and administrative costs put simply this work cannot be done when the buildings are crumbling when the computers don't work when the laundry machines break and 1/2 the positions are vacant because staff can't afford to live on poverty wages. Youthcare serve some of our most vulnerable young people in our city 13 year olds who have been trafficked and sexually exploited 19 year olds who are experiencing their first episodes of psychosis 22 year olds who have developmental disabilities and struggle to live on their own. Committee staff experience secondary trauma will doing this life-saving work, but they don't have the Privileges of self-care or even a meeting their own basic needs people who go into career service should not have to sacrifice their well-being in order to do this valuable work $22 per hour. It's great that the city can provide that living wage for its dad. Why should Human Service workers get anything less? The Seattle is facing a homelessness crisis to execute our plans to address this crisis. We need to make sure that the people who are doing this work can do it. Well, I ordered your support and thank you for your time. Thank you. Hillary before you begin. Let me read three more names Cory ghielmetti, Alicia Glen well and Kelly sube, Cory, Alicia and Kelly in that order. Thank you. Good afternoon council members. My name is Hillary keys and I'm here today on behalf of Youth Care and support of the inflation adjustment for Human Services contracts. We serve kids as young as 12 and as old as 17 years old the vast majority of Youth come to us with a variety of mental health issues. But the ones we see the most are anxiety depression and attachment disorders. These kids have been forced to take on the emotional burden of the adults or supposed to be caring for them. They have been rejected and pushed out so many times that they arrived at our shelter expecting to be rejected expecting to feel unwelcome and the short amount of time we have with them. We need to create a sense of home. That is calm welcoming and safe. That means clean clothes everyday snacks in the pantry and healthy food on the table for every meal. It means engaging activities and outings that build life skills and a sense of community. All of these things are essential and they all cost more each year. Think about the price of a movie ticket even within the last 10 years those tickets have almost doubled many people have reference the impact of turnover on clients life for 12 year old who may have never had a trusting adult in their entire life having someone leave unexpectedly can be devastating if we're burnt out to staff if we're stressed because of our own finances, then it's hard to bring a hundred and 10% are job every day, which is what those kids really need. The reality is this is the lowest paying job. I've had since graduating college in 2014 and I was a school teacher for four years before this job, but the stakes are so much higher when staff leave it only reinforces these kids beliefs that adults will abandon them at their bad kids and they're not worthy of love and other words when we don't pass inflation adjustments like the ones you're considering today. We don't just cause harm would cause lifelong trauma I order support School teacher part of her she's cut it when she saw that clock running and she just cut it right there. That's leadership. Thank you. All right having said that Corey Alicia and Kelly. Good afternoon. My name is Cory Gilmer and I'm here along with Tim Kendall and Jesse Rollins on behalf of the public defender Association. I'm an attorney at the public defender Association and I work day in day out with case managers at reaching Evergreen Treatment Services to help clients who are members of the law enforcement assisted diversion lead program and I would not be able to do nearly the quality of work that I do without the important case managers at reach and could easily be taking jobs that pay more that have less work that lower case load for choose to help our clients without their help and without consistent case management. I would not be able to help clients who face legal needs. And so I am pleased at the council has this legislation before them to provide cost-of-living adjustments to case managers so that cuz I know that when case managers are able to stay with clients in a long-term that they're able to provide better services. Clients are able to achieve better outcomes. Thank you counsel members as stated. My name is Tim Kendall and I'm representing the public defender Association in my previous life before PDA. I worked as a reach case manager and can attest to specifically what I would like to talk about is burnout people burn out relatively quickly. I was able to make it for years which was tumultuous and what burnout looks like is literally coming home every day and not getting sleep and crying yourself over and over and over and you literally want to Port pull your hair out and you think about self-care they always talk about self-care in the social service field when you're constantly having to cut Corners when you're constantly having having to eat red beans and rice every single night and dowsing it and Kraft Italian dressing to give it some type of flavor. That's not self-care. You're not able to nourish your body. You're not getting any sleep and is capitalistic as it may sound money. Is that way to help self-care it puts nourishing food in your stomach. It puts a safe neighborhood in roof over your head people. Ask me why I did this work and why my biggest in first response was my compassion and love for individuals is also the Stark reality that I was a paycheck and a half away from being that individual out on the street that needed Outreach Services and basic needs. So I encourage you to pass legislation. Not just for the people that we serve before the individuals that are doing the serving as well. Thank you. Thank you. Good afternoon council members. My name is Alicia Glen. Well, and with the Coalition ending gender-based violence on the steering committee of the Seattle Human Services Coalition and I'm here speaking today on behalf of that s h St at HSC members provide the services that support Seattle residents to thrive across their life span from use of element to senior centers gender-based violence response and prevention to community clinics Human Services billed well-being. We appreciate the unanimous vote in support of an automatic annual inflation adjustment on Human Services contract that move this ordinance to full Council today. Thank you cancel member automatically adjusting human service contracts for inflation so that we can maintain the services and infrastructure that we have built together makes sense cost to provide services include technology for evaluation and Reporting facilities energy Transportation as well as wages recruiting training and health care benefits when these increase we must pay those cost. Or we will not be able to maintain current Services simply put you undermine our capacity to reach our goals when cost to provide services rise, but your investment simply does not keep up. This measure is also fiscally prudent since the city's general fund Revenue increases have substantially out. Please inflation over the past 20 years even taking recessions into account. We have the means we are heartened to see your support to solve this problem once and for all consistently adjusting for inflation is an effective Common Sense business practice. We ordered you to implement to stabilize your investment in human services for Seattle resident. Thank you so much. Kelly Larson with Plymouth Housing. We provide Supportive Housing for a thousand individuals in Seattle every year. This is common sense. I heard at the rally the chant was the economy is thriving. Why aren't we surviving? This is critical work is important work. Our staff are asked to do a lot and we are operating buildings that are really struggling. We have elevator contracts. We have electricity water garbage sewer huge cost increases every year we ask for your support. We need this, even if we can raise private funds we have a lot of people that are doing excellent work bringing the private sector and to help us. We rely on government. We need you to help us, please step up and make sure this happens for us. Thank you. I have two more speakers signed up Megan Murphy and David hilde, Megan and David. I was just at the Amazon spheres where we delivered. We got through and delivered the message to bae's house to to shut down ice and stop using surveillance and I'm thinking human service jobs are so important. I thought what if like the job creation of ice was turned into human service jobs and like how we go here and Seattle. We have like all the information on the homeless in the system. And then we took the people that were crossing over and Ice would check if they would change their name and they would check into the country and see what kind of militia was happening and why they ran and try to communicate back and forth between the countries, but that's like a hundred years in the future. So today, it's not I don't know. But today I think I'm Human Services for some reason or undervalued and I think it's really important to adjust for inflation and add value to building relationships within the community. I'm so people that have had a rough go in the society can transition into a more Humane circumstances, and thank you. Thank you Megan. My name is David heldi. I'm a housing assistance case manager at dese and I have worked there for a little over four years. Now. Obviously homelessness had a huge issue in this city in this County in this country the population that dese specifically serves is not representative of the homeless population in general. They are specifically some of the most vulnerable people in Seattle people that are Repeatedly involuntarily detained for eating their own feces. I know a woman that did that the people that that are making these decisions to get in touch with the crisis responders that involuntarily detain them are making barely over minimum wage. These decisions are a far more difficult are far more clinical. They require far more training and education than than the people that are currently making them. I've seen the people that are making them they're my friends. They're my co-workers. They I don't know what to do. They see people in pain, they see people that are suffering and and they want better and they simply don't know what you and we can't provide something better for for these vulnerable people unless we get more educated or trained people in these positions. This is a wonderful start if it passes. Thank you, sir. What are public comments section please go to the payment of the bills and read the title 6-8 removed and second the bill pass any comments or questions. Please call the roll on the pastor of the bill. I watch a co-president the report of the finance neighborhoods committee agenda and one appointment 1370 appointment of Robert Humes as director Seattle Department of Human Resources for term to June 1st 2023. The committee recommends that the appointment be confirmed by badshah. I am very pleased to present to you Bobby Humes as director of our next human resources department and you to think you were standing up will give you an opportunity to come the microphone in the moment. I'm Bobby I have been delighted to be working with you first of all to our Seattle City Employees Retirement System. You are a wonderful addition on that board and it's been an honor and I also want to acknowledge and appreciate the fact that you and I've had many opportunities to talk about this new position for you how you've come over from the Parks Department. But also you're very impressive history prior to that. You've been working with school districts. You also had a long stint with the military and you're bringing a lot of skills to this human resources department to thank you very much for that. I also want to acknowledge to my colleagues that I feel very strongly about your commitment around equity and empowerment and reaching into your apartment both to empower the people there to do their best work. But also encouraging them to rise and other positions that something that I feel very important as a manager and I know that you will do just exactly that so I personally am looking forward to working with you for the remainder about the next five and a half months and to my colleague and I just cannot applaud him more and appreciate what you're doing. And I also think I have to have a motion here because we need to add the expectations letter which is now been served. Deleted all of you have had an opportunity to add to it. It was not attached to the agenda last week. So I'd like to move to amend this appointment 01370 to add the expectations letter. Okay. This is just the vote on the amendment not the confirmation all those in favor of the amendment unsubscribe accounts were back sharply. Say aye aye those opposed the eyes have it. The package has a minute to include expectation letter with your marks get it any other colleagues want to make any remarks before we vote on this legislation customer mosquito. I'm high recommendations. Very excited that they were both involved in the process and the optimistic Outlook that they have for the Department in the city with your leadership. So congratulations and thank you for in. working with us in serving the city of Seattle a comment then during the first curing where you were presented to the council. I received some feedback that perhaps I was a little hard on you is what what's what's feedback was and the reason I was little hard on you I perhaps because my expectations were higher than I have for a lot of people and when I asked for your vision of what the city can be particular with respect to its employee base and I wanted to hear the words and the commitment to diversity just ring out and I was concerned that I wasn't hearing the passion with which I like to see it particularly in a person that will be in the position you are as head of the HR Group that diversity achieving and is very intentional. How often do we hear? Well, we couldn't hire diversely in a diverse way cuz we just couldn't find the right candidates. Will you find them by looking and we had our one-on-one and and I became fully convince you it right person for the job based on your prior performance in the commitment that I I heard from you. I will be in office when many of the personal decisions that you will no doubt lead will be in effect. But but I'm not going far from a keep my good eye on you, but I'm very pleased with both. I want to come in the mayor and the administration for selecting after very competitive search and I look forward to working with you the remainder of this year. So having said that I'm going to move to vote. Those in favor of confirming the appointment, please. Go die. I was opposed both know the motion carries an appointment is confirmed and Mister Humes would advise you to Mike to say a few words. Wow, customer back shows handing you the expectation letter. So some of our numbers, I think you council members some of our numbers say that there's a 11,000 employees in the city. Anybody else got a better number to take that number 10900 something each. One of those individuals is a story each. One of those individuals has a purpose and meaning to our system into the value that we want to provide the people of the city of Seattle. That's a unique job in HR. We get to support those who need jobs. I take this appointment very seriously, and look forward to providing customer service and value to our employees to make their jobs in their lives better while here is a part of this this this team, so thank you for your confidence. I look forward to working with you all for the people Seattle. Thank you. Thank you much. Play please read the second dungeon item for the shirt title, please. To cancel both 11955 Xavier Lane to the funding for housing community building programs to commence a bill pass. Avatar Last of financing committee neighborhood committee. You will remember that. We were looking at the 2019 annual action plan. And what happens here is that it is a grant that we will be able to accept. It's roughly $2000000 more than what we had identified during our budget for the Community Development block grants and four other housing opportunities for persons with AIDS and a couple of others. So the recommendation from the committee as that, we approve the Grant and move forward with accepting 21167444 dollars. Sounds like a good idea to me any other questions or comments on this bill. Not please call the roll on the passage of the bill. Mascara jco Salon Gonzales for the housing Health Energy and workers rights committee Department providing that the Seattle Human Services Department provide a cost increase when renewing a renegotiating contracts to address escalation and clots and specify how and when to apply the increase in many section 20 points 60.102 of the time. It took her to the Human Services contracts from the provisions of chapter 20 points 60 and adding a new Section 3 point 2006 to Taylorsville code. The committee recommends of All Passes amended skater support you in your Amendment if you'd like I could either Second Amendment. Okay, so we'd like to come in first for the base Leslie. Okay, so I will move amendment. I guess I'll call it amendment number one. And in addition to have a copy the memuneh was probably circulate in a timely basis and I think central staff for that. Basically. What it does is where a lot of tests me about how underpaid the the employees doing this kind of work are and I don't think it was any disagreement. However, it occurred to me that some of the language I thought in the bill could have been a little stronger to making sure that is clearly our Enchanted. We understand that they are high fixed costs of these nonprofits and other costs that they just don't have control over but I thought I was strong policy statement saying that we get that too. But we also get the fact that these are underpaid jobs and we want to recognize that. So that's what the amendment does number one and number two. We've had some of us have been around where we've had real tough times. We're in a recession in. Where we had a really sharpen a pencil to make some tough cuts and a some policy statements that we had around 2008 or show some policy statements that we said during then were while we have to make these real tough cuts that the work that you all do the work the human services. Do we are preserving that if the work is so critical to protect your most vulnerable that in our budget deliberations. This is so critically important that we recognize you have to preserve if not even enhance the funding. So the other language of this amendment captures that and I think it's red by say I changed at the critical role. We recognize a critical role that Human Services organizations Phil and it's our intent to find any adjustments in times of both economic prosperity and economic hardship. So that's what the amendment does and I will formally move it move it consists with what I described. how to make mosquitoes second it any other comments on the amendment the boat cast members must have really smart idea to make sure that we express the council strong desire that these annual adjustments are received by a provider organizations and in dealing with the fixed and variable costs as we create greater stability for the organization's our desire is absolutely in line with what both the CEOs executive directors in the front line staff that we want to see wages stabilize. We want to see workers stabilize and the turnover and vacancy rates address. So I really appreciate you underscoring that in the amendment. I also think it's important that we underscore our commitment to investing in the critical role that these human service provider organizations Frontline staff and their leaders provide to our city and by filling the city's intention to find the annual adjustments in times of both economic prosperity and economic hardship having really recognizes that more people are going to need these various Services, especially in times. Economic hardship very much. Appreciate you bringing this forward and working with our office on this and I will be in enthusiastic. Yes on your Amendment does wedding vows for better or for Worse any more comments before we vote on Amendment? Okay, it's been moved and seconded all those in favor of the amendment only just a minute, please vote. I opposed the eyes have it. The legislation is a minute. I'll turn it back over to catch my mascara to the council inflationary adjustment legislation. If it pleases the president, I need to wait to make my comments at the very end time to talk about if you like give you the option talk about any comments, you say before customers get it closes debate on it. Now, wait cast member badshah. Remember Carol thank you for both bringing the amendment and for your staunch support and I want to say thank you to all you and the community for the tremendous work that you do. We know that people that are suffering on the streets people that are suffering from behavioral mental health. They need your help and that warm hand-off is more important than anything else that any of us can do so I want to acknowledge how difficult and challenging the work is in for our friends in the public defenders for the work you're doing on lead. We know that that makes a huge difference as well. So I want to say I support this I had brought forward an amendment that I was really more focused on the budget to make sure that future cancelled had an opportunity to make decisions about what was going to be required going forward. We know that that meant Amendment didn't pass. I am in full support of moving forward in support of you and also acknowledging that in the future if difficulties her face because of budget The budget climate whatever it might be future kept council's and the executive can make their own decisions. So I do want to acknowledge just how strongly I feel about the work you're doing and I also want to respond to somebody in the audience. Who said it's a good first start Lashley the good for start with last budget when we did add an additional 1.75 to 2% for this exact thing. So now we're adding another 2% I'm proud of that and just godspeed and all your work. There's been talk about the council exercising budget budgetary discipline and it's my opinion that this piece of legislation is actually an expression of our budgetary discipline This Is Us saying that when we enter the budget negotiations this year that this is art Priority and it's very similar to what we've done in previous years it precisely and tough Economic Times when prior councils have passed resolutions or budget priority letter sent them are saying that Our intention was to hold a human services harmless to two cuts in past years. This is this is a piece of legislation is an expression of our values and future councils may have different values, but this is an expression of our values at this time and my values for as long as I'm on this console. So, thank you. Purple. Any other comments before we turn it back over to customers who want. Thank you present. Oh, I'm glad to be voting. Yes on this ordinance to to prevent at least help prevent Human Service funding in our city from falling even farther behind than it already has I really am grateful to all the organizations the workers and the unions that I have advocated for this including SEIU Healthcare 1199 Northwest. This bill requires human service provider funding to be increased with inflation and let's be clear. This is not some kind of largesse if the funding goes up in step with inflation just means that they break even and as the speakers in public comment have stated not only today but on other occasions that not only are the wages not keeping up with inflation is also the other costs that are nonprofits face including utilities, which day are on the hook for they can get go to City Line and say we can pay the bills they have to pay those bills. So this is absolutely the bare minimum City can and should do as I've mentioned in the committee meeting discussing this legislation at the heart of this problem. Of course is The Chronic underfunding for social services over the past several decades the federal funding for housing in mental health services that was eliminated in the 1980s has never returned and we are reeling from a vicious cycle downward Social Services has have been outsourced in multiple cities have been outsourced from the public sector to nonprofits and once the political establishment of Lords and responsibilities, they systematically begin underfunding these nonprofit organizations. And so you have the situation where a corporation like Amazon pays no federal taxes and instead gets 129 million-dollar tax rebates on the times for the Trump tax cuts Social Service workers homeless service workers are so underpaid that they cannot make their own rent. I think these stories are really point of of Human Service workers being a paycheck and a half away from being one of the people in need of the services themselves. And I just wanted to quickly in terms of drawing connections between different struggles. Also wanted to congratulate the Amazon warehouse workers around the country who are courageously going out on the prime day strike to protest dangerous working conditions and inadequate benefits and a really against even you know, having insecure scheduling and they are being joined today by tens of thousands outside where in Johnstown the streets protesting no tag for ice against Amazon's contracts with ice. So I think these struggles are tied together and we have to be clear also the problem is not that some workers like that workers are paid more than Human Service workers. I think all working people deserve a high standard of living the problem at the biggest. Other than the billionaires are amassing the wealth of society into fewer and fewer hands. Under capitalism economies have a cycle of booms and busts when the economy is booming. Big business makes massive profits the wealthy get wealthier and when the economy falls into a recession. Then I was just show them that cost under the Falls Logan of shared responsibility. We should reject this kind of Mythology and understand that we have to fight for our rights and whether it's a recession or boom. We don't accept a living standard for the workers who make our cities and our services run. We need to fight to fully fund Human Services, which means that in addition to today's measure be urgently need to tax big business and the super-rich to provide those funds. I would also say the council members who have expressed concerns about so-called fiscal responsibility should not have repealed the Amazon taxes, very easy way of addressing fiscal responsibility, but just expand public revenues in a city with the most regressive tax system in the entire nation. I also think as workers we should know. This pronouncement of The Bean made the future councils and Mayors made do other things. Yes, that is true, which is why we have to fight for our taxes on big business today and and shine it into law. We also need to fight for rent control to address the alarming rate at which people are being forced out of their home simply because that rents are going up out of control and further overloading are the responsibilities of Human Service organizations so far the Human Service workers. It is not going to be enough to increase wages because if those wages are taken up by a disproportionately high rent increases, and it still doesn't help so we have to fight for this Saturday, but also, please join us and me my office at Tenants Union of Washington state and other organizations in the rent control movement, and specifically I would like to invite you all do our rent control rally at the old Pilgrim Christian Church on Broadway at 500 Broadway East at 6 p.m. This Saturday, July 20th. Thank you. Any further comments before turn it back over to cancel RuneScape store to half a dozen Community meetings just this year alone. I'm really excited to bring forth this legislation today and it's amended version for final passage. I have to say that we've been working on this for a half year, but you know, you have been working on this for over a decade. I see Allison out there and at the rally I said, you told me that this was something that we've been working on for for 10 years and she said at least 10 years. So it's very exciting to be able to take this initial setup and councilmember bags. That is correct. And I want appreciate her leadership in last year's budget where this full Council was able to include a 2% increase for both and non general fund and the general sign in last year's budget that was incredibly important First Step, but we also at that point committed committed to a passing legislation to The cycle of uncertainty the uncertainty for providers as Frontline workers as the leaders of these organizations and frankly directly for your clients the folks that you serve that have come and testified here time after time about how important it was to have case managers and reliable staff at these organizations who have the trust and experience who can stay and these organizations and help stabilize folks. This is about making sure that we follow through on that commitment and I want to make sure that the folks were watching understand the type of folks and services that you're helping with your helping. Yes to make sure that people who are most vulnerable get the services that any other country would funds through progressive tax measures that any other country with lift up and say we have to invest in these here. We are in this corner of our country trying to make up for a fact that we don't have the revenue that we need to invest in the very fabric of the social safety net that you all actually make possible you provide food on the table for seniors through food banks and meal programs. You make sure that our youth development Pro. Rams I'm get funded and that people have a safe place to stay at night when their youth you make sure that those who experience domestic violence and sexual harassment and assault get the treatment that they need and sometimes more importantly the prevention that they need so that they're not in that situation you make sure that people have a warm safe place to stay at night and you prevent people from falling into homelessness as we said at the rally you are the backbone of what makes our commitment to serving the most vulnerable possible. And today we're showing that we have the backbone to stand up for all of the services that you provide to those most vulnerable that you had done had been within a department at the city. If you were city workers every year you would receive this inflation adjustment departments Frontline workers here at our city. They get adjustments in the cost of those are operational costs and the dollars that go to staff we've intentionally decided to contract with you the city has intentionally decided to contract out this work not because we believe in Contracting out. This specific case because we believe that you are the most equipped the most trusted you have the experience on the ground level to actually serve our most vulnerable in a way that can be heard and will receive the help stabilize folks. You are the individuals that we have invested in and we need to make sure that the contacts that you received received those inflationary adjustments at the bare minimum to keep up with the cost of living. So the really exciting opportunity for us to show that the city values this work that were investing in the world that you provide the strong relationships in the community connectedness that you provide at the ground level. And we stand by the principle that nothing should be contracted out just because it's cheaper. We should be contracting out for the very reason that we are which is because you are our valued Partners, so we will continue to make sure that we look at this historic under fun that has been mentioned earlier. I'll buy my Council colleagues know that we can't publicly State our commitment to making sure that the humans Contracts the services that were provided to the most vulnerable and the workers are valued if we're engaging in a process that forces these organizations in a race to the bottom. Nobody benefits from that and if you're starting off at a an amount that is already historically low if there's a historic under fun for many of these programs and services you're already at a detriment we heard a year ago about chemical dependency counselors have master's degrees in chemical dependency assistance starting out at $33,000 a year. It is no wonder that many folks are struggling to survive on that wage. We need to address both the historical underfund in the future. And today we take a really important that by making sure that all of your contracts are tied to the Consumer Price Index inflation adjustment that we experience every year and that those contracts keep up. I really excited that this a piece of legislation was coming forward now and I just want to say a few things use I think the council member her beloved for continuing to support this and standing there at the rally last week of Summer bags. 4 amendments on the report back and that the reflection peace in their council member Harold. I come to present a house for your Amendment today as we look at the fixed and variable costs. We know that in many cases many of the leaders in these organizations are making heartbreaking decisions about not filling rolls because they have to pay for rent. They have to pay for utilities. They have to pay for the increased cost of operations and the folks who bear the brunt of that are the Frontline workers and directly the folks that you serve. So excited to have an intent language included so that we can really looked at that variable cost which unfortunately has resulted in high turnover rates, 40 50% vacancy rates among our organization and to provide that stability that we need to address as a city because it's a value statement. I can't do this anymore Justice and their workers already. Have you heard them speak today? I think you've heard them speak about a half a dozen times over the last six months and they've talked about the importance. By the way, in which we have I think Ty the inflationary adjustment to cpi-w is a very common sense approach. Somebody said in their testimony today, and it is I think the the the value statement that we put forth today in this legislation will have yours a benefit to come so we look forward to working with you. I had to making sure that this is providing stability and and also continue to address that historic under find that I know council member O'Brien has continued to bring up and we look forward to continuing that Legacy. So just to reiterate what's been already said, this is not a budget exercise. This is a policy and value statement that is embedded in this legislation that the city moves forward today, and I wanted to see if you think he's mr. President and I will be done. Okay. Thank you to Allison eye surgery Hillary Coleman from the Seattle King County Coalition on homelessness Juliet from the Seattle Human Services Coalition Lawrence from DSC. Jesse and Lindsay from SEIU 1199 Larson from Plymouth Housing Aaron Moore from West Seattle helpline flow from Catholic community services Jennifer from Ballard Food Bank respond from Muslim housing Alex and Angie seiu775 Kareem from are you look like all of those organizations not just those individuals with all the folks that you've turned out in the front line staff the workers the people on the ground level. I'm who have also had those relationships. Were you brought in the client's themselves to testify that this very table and their words were incredibly powerful. Thank you again to the all of the organization's SEIU 1199 7750 p i u local 8. I'm especially the Human Services Coalition in the Coalition on homelessness. Thank you all for continued to come forward the folks that you scare. We could probably not have done a better job of articulating those sticks in. Will cost without that incredible demographic or graphic that you shared with us. So thank you for sharing all that information and internally and just Sims 4 my central staff have been tremendous on this Jesse. I know you're no longer with us in the city of Seattle. Thank you for your ongoing work where you currently are in for what you did at Wisconsin Amber O'Brien staff and Leslie as well Mark kazaky from neighborcare on Roatan incredible op-ed that we're really excited about that highlights the importance of this work and Katie and Nicole from MLK labor. Our Communications team has been all over sharing the incredible turn out that you guys have done. I'm in this room was packed how many times 6 times in the last 6 months? So thank you and with that same the work of the security guards, so thank you to our security for helping get Folks up here and continue to move folks in and out, especially in the evening meetings. I was going to say if we can station for those folks and stage of chief of staff. For all of your work day John and mr. President was that let's do this. All right. Thank you catch mosquito or make sure we covered all bases here. Thanks for all of your comments. Thank you for your leadership for that. Please call the roll on the passage of the bill was President Harold. What time is it? All done. Please read the next and our last such an item appointment of Victor M Lozada as member domestic workers Standards Board for term to February 20th 2020 to be confirmed that this is our last appointment to serve this initial round for the domestic workers Standards Board. This is its ninth and final member for this point in its creation. I'm delighted that the board has chosen a domestic worker and it's pick for their board as someone who has first-hand experience that is needed to make sure that we fully implemented domestic workers Bill of Rights. Victor has been working on Garden oriented work since 2003 and has been able to bring to the conversations already and will so in the future his experience on Mini domestic workers issues in the industry. He is an immigrant. He has a first language Spanish speaker and he is an incredible Advocate as Those of you who are at our committee saw last week. He's incredibly excited about the ability to serve on this board and work grateful for his time in service to Lozada as found in to be a delightful person is really a fun interview. Look forward to supporting those in favor of confirming the appointment, please go die. Those opposed know the most important is confirmed that concludes our agenda for the day of the knee for the business card for the council. If not, we stand adjourned they would have a great rest of the day.", "end_time": 3629.7}]}