{"format": "raw", "annotations": [], "confidence": 0.9462872549544933, "data": [{"start_time": 0, "text": "Good afternoon, everyone. Thank you for joining us today. This is the financing neighborhood committee. Its 2 p.m. Friday, March 22nd, 2019, and we're very happy that we are moving forward with just one agenda item today. So A regularly scheduled committee meeting on March 27th has been cancelled since we're having it today and we are going to have our next meeting on April 10th. So thank you again. We have two people signed up for public comment. And then I'm going to ask my Parks friends to join me at the table David Haynes and Alec Zimmerman you two are up. Councilman Bagshaw city council needs to reject the Shady deal to hustle taxpayer money popping up artificially inflated rent located in front of a toxic cold and gas trainyard the Parks and Recreation Department doesn't need any more employees sit down on the job distracted by rumbling horn honking trades. We don't need corrupt political donors tie to President Trump blowing off our local politicians to abuse tax dollars propping up, commercial real estate speculations getting Wealthy overcharging on Lisa's every month. Well, the same government celebrities have squandered property tax to buy more votes city council must reject his deal because it further drives inflated cost-of-living or pressing this city by corporate welfare subsidizing Martin selig and his banking donors laughing at their artificially inflated capital gains every 3 months ripping off Parks and Recreation budget, perhaps we should investigate city council lucrative retirement favors from their work financing rich people ripping off the city every month. Collecting of rent. We need Parks and Rec to stop ignoring all the trash in the city as they refused to get out of their trucks as if blaming the home is guarantee sale AZ Workforce protected by a suspect unit. We don't need to get Parks and Rec a waterfront interrupted by coal and gas train view while giving charity to Martin silly cuz he chose a bad location where no one wants to rent because it causes PTSD by toxic rumbling horn honking trains that Echo throughout Martin selig building noise polluted throughout his buildings causes frustration and it to rails to productivity. So we demand that Martin selig take a zero off his perception of value and noise Abate the building before anybody else is forced to rent and inflated costs. And remember Ed Murray still has influence on the Parks and Recreation the bus because it's husband controls it. Mr. Zimmerman Hi. Oh, my sweet sugar make me a little bit complicated when we have something agreement with private Corporation because my experience for 30 plus years government like a business consultant and businessmen. Show me something situation. What is cut up till 3 right now? So he's in control by criminals is exactly what the payment be talking about the billion and billion dollars and nobody investigate. Constitution right now because many console right now. Grinch to me right now, I don't do this in for example by in first place just consulted care for example cost of Johnson go to pick up personal interests by law. You cannot go in working for 1 year so contract what this week in Seattle supposed to be going jail in exactly the right now so my proposition establish cam country Olympia Manet, I'm not even nobody listen to me of government corruption of government. America right now. Thank you very much. space of lease Thank you and Allison, if you would kindly read in Council Bill 11948 5485 and Parks and Recreation text go to lease agreement between the city of Seattle in the sea like holding company. Thank you. And would you like to start off with introductions Miss Tracy Tracy Hamilton finance and administrative service? Thank you. Thank you. Thank you all for being here. So Tracy you're going to give us a little. Overview of this and then Michelle maybe you can talk about how several months ago. We were going to be in a different building and why we're doing this now very briefly happy to have the legislation in front of us to operationalize a new lease, which is seems like it's taken many months to actually came to fruition. So happy to have that here in front of you today and I'll think they'll have them go through all the details about lease agreement. Great, we're happy to present this lease for your consideration today. I want to thank our colleagues at the finance and administrative services division who has our department who have helped us find a new site and go see it this way sand do some preliminary space planning is you know, most of our administrative staff are in three locations are Denny headquarters are Westbridge facility down by Marginal Way, and then this subject Group which is at rrta building in the International District in Chinatown. So we have a few other staff at Community Center. Is it across the city but most are there and in this particular case we've had staff in the RTA building in the International District Chinatown for about 20 years about hundred thirteen staff are down there and they lease expires at the end of this year. So we've been analyzing whether to renew this lease which is why it's been taking some time understanding our options visiting several properties comparing rental prices and other fan. End the course of doing this week included the best option was to move photos from an operations and cost perspective. So we've found a location that's actually very close compared to where our current site has to the our headquarters building by Denny Park and we're going to be able to with your approval. We be able to move the staff down there as well as move a group of Staffing out of the Green Lake Community Center, which is a goal of ours as well. So this team of spr Staff FAS staff commercial real estate brokers and attorneys negotiate his release that we're presenting today. We believe it's a beneficial transaction for the city and I'd like to ask Max and Hillary to give you the details very good. Thank you. I'm just glancing through the charge. Maybe we can talk a little bit about your efforts to renew the lease down in next. It's off of Airport Way right where you are now and why? That was not successful and why you're recommending this. Thank you so much for having us today. And I want to Echo the deputy superintendent. Thanks to FAS that the real estate team led by Hamilton and also the construction development team led by David ahlberg have just been fantastic partners. To answer your question customer bagshot. We we reach out to her landlord as part of our site Search & Win the primary early. We started the site search for the purposes of having a strong negotiating position and having some strategy in our back pocket so that I think we were probably assuming that we stay in there. They building frankly working through Brokers. We reached out to the landlord and heard nothing for an extremely long time. So as we were looking at other options in order to understand the market understand what what are sort of what we should be negotiating from. We it became clear throughout the process that we are probably going to need to look seriously at moving the landlord actually weighed in at the very end of our way late in the process with a kind of a casual email about being willing Entertainer renewal, but it was extremely extremely constrained first while they sold the parcel where parking is who are flea parking was going to go away so I can leave if they had been kind of flirting with possibly selling the building as well. And so they said they Only renew for short. Of time 3rd there were going to increase the rent dramatically to Market rent Witchwood event in competitive with some of the other sites. We had seen that were way better and then for their words are not going to be willing to entertain a renewal. So we kind of knew we were going to have to move anyway in the future probably in a higher rent situation. An end so just briefly in the in the process of doing that. We kind of the initial work is to develop our requirement so we can tell the Brokers what we're looking for. So we looked at not only that number Staff we had their current building but also as the deputy superintendent said we had some staff and some other facilities that were intended to be temporary. We really need to bring them into a Amor kind of up to the office environment. So we had a staff need of approximately 130 was the RDA staff Quest a couple of other folks and a little bit of of Staff growth and we use that to start looking at the market. We wanted to be close to downtown. We wanted to be close to City Hall in an smt. But also close the parks headquarters and we were very cognizant of the of the need to not be driving back and forth through downtown currently a lot of Staff travel from rrda building in the International District up two parts headquarters. It's usually a good Half hour one way so every time there's a meeting there. There's another hour of travel time. We also wanted to have a lot of Staff involvement in this process. We were very deliberate to make sure that folks who are going to be affected by a potential move kind of had a voice in what's this going to look like and how could a space be sort of optimally designed so that it would be kind of intentional because after 20 years in the RTA building the space it evolve kind of organically, but it wasn't necessarily optimal for the the way workflow is happening nowadays, so I think I think that's pretty good for the requirement part. So I'm interested when you say need sleep parking and good Transit options. I know about the transit options. The best goes right by there. What else for their Fleet space? How much space do you need? And does this building accommodate what your needs are get one star per thousand square feet. So this building would give us up to 28 parking stalls, which is more than what we need. We're going to be looking at reducing our Fleet possibly and also a nice thing about this building is we're going to have electric charging stations included in part of the ten Improvement build out in the garage and thank you and the secure bicycle storage. So it's kind of a little bit more modern in terms of multiple modes of transportation. We're going to have showers for bicycle commuters in our space suits going to be Really helpful for lots of different modes and monorail and electric charging stations. That's great. Remember electricity for those of us who are writing e-bikes. It's nice to have access there. May I ask a question in terms of us summary in fiscal note the tenant improvements that you just described is that included in the summary of fiscal note. Can you point me to it just so I can get to it on a mandolin and actually cancel this deal that the 10th improvements are being paid for by the landlord. So there's not a dollar figure in the fiscal note. What's in the fiscal notice our budget which was in the 2019 budget for buying furniture equipment the it connections and some of the other the actual move it self. So are caused the city's Kaiser are those which the landlord is not paying the landlord's cause the actual design construction of the space is is going to be borne by the landlord. I appreciate that. Times I miss things in the summer and fiscal now and so we when I heard you talk about 10 a.m. Provement. I thought maybe I didn't see it in San Francisco and we wanted to give you an opportunity to put it out. But I really do appreciate knowing the additional information that that is a cross that's actually going to be picked up by the landlord, which is a savings to the city. Okay Parks reached out to finance and administrative services to provide assistance. First of all with searching for a site as we do typically with larger spaces. This was about twenty-eight thousand square feet is Max indicated. We did bring on a brokerage firm that works specifically on tenant representation. They their goal is to represent the tenant get the best deal for the tenant. They started out by searching pretty much everything from Fremont to Georgetown and looking very broadly at the class A and Class B office space so that we didn't miss anything when you get into class play the closer you get to downtown. It's getting almost impossible to find a floor that's available. Their goal wasn't really to be downtown but as Matt said to be close to headquarters and with good access to Transportation has a lot of traveling around the city all day every day to buy Cards and so on the chart that's in the presentation shows some of the finals contenders that we looked at with parks at orbis done. They Hugh mostly North and South directly of downtown. There was one building that came to our attention in southeast Seattle. So we took a hard look at that. Unfortunately. The space available was primarily in the basement that and wasn't very good work space. so after some trials and tribulations Landing Office Park was a good solution. It is comparable in price and all of the other needs the criteria $33 a square foot is the rental rate Max. We'll talk next a little bit about how that escalates overtime. I think it's very competitive. But that was a question. I was going to ask you, and thank you for bringing that up for the $33 a square foot and it's somewhat breathtaking in this market, but if that's competitive that's what we needed to know. Yeah, it's you can see the buildings that are arranged in the 30 to $38 range. If you were downtown. We're pushing 50 now in the 40s and 50s. Thank you, Hillary. Alright Max. What else do you have for the next lights just showing the location of the 300 Elliott? So it's it's really quite close to Parks headquarters. It's also fairly conveniently located to downtown. It's a little bit of a different location, but it helps folks not have to cross up and down through downtown going to the headquarters building. So that's actually really big plus a little a little bit more than half mile, but it's right around just under a mile. And then the key terms at least just really quickly. It's twenty-eight thousand square feet is a tiny bit bigger than our current space. But this is really a deliberate attempt to create a an office space. That's really going to work for the Department. It gives us a little bit more flexibility. It's going to accommodate all of our office needs and also with a kind of a strategic I to Future needs. We have one feature of this lease, which was the result of a lot of negotiation was there's going to be additional grow space a 4000 square feet that's bait in Italy. So at the within 6 years of beginning the least we will add 4,000 additional square feet. So making a total of 30 mm. The rental rate as Hillary said is is $33 a square foot to start at its very much sweat all the other properties were we're asking for it with a $1 yearly rental increase and that's pretty typical as well for square foot. Right? So the rent goes up Here which is standard the operating expenses this lease and and I think pretty much every other least we looked at and it seems to be the trend in the market now is what's called fully serviced, which means the operating expenses are included in the first years rant. And then the tenant pays the Delta between the base year rent in the base year operating expenses in any increases over time. So it for example the the in the first year of which is 20/20. They'll be $0 for operating expenses. The second year will pay whatever the incremental increase was which can you give me an example? What are the operating expenses that you're going to pay? Absolutely. So basically every utilities cleaning maintenance everything that has to be done to keep a building working taxes insurance. So pretty much everything some things are excluded like major Capital cost to the exterior of the building are not considered operating cost but the the cost to keep a building functioning as Stop, there's about 15 items that are traditional operating costs including those that mention a really simple lease structure because you pay a fixed rent plus all your operating cost whatever they may be so that the problem with that is you don't know from one year to the next what's total cost is going to be but the rental rate is always it's it's whatever the lease says and usually it it goes up. Just like the in this case the difference. Really with the base year model is that the the bulk of the operating costs are built into the rent. It's I mean at the end of the day that is very very similar because either way you have to look at the operating cost figure out what the actual cost where in figure out. What portion is yours. Is it only difference is you have to then back out the base your portion frankly if your landlord it's a little bit harder triple Matt's easy cuz you just pass on all the Crosstrek with the tenant, but that seems to be the trend now in the office. So just so I'm clear the market rental rate if we go for the full twenty-five years has 15 + 2 5 year options to renew takes us up to $58 a square foot. That's I didn't I don't know the math right on her exact but what's the projection 25 years out is this you think this is reasonable is always difficult because nobody knows what's going to happen the market but one thing we can say trending decade after decade is real estate prices go up. So we are very very confident that that this is a good right now and it's going to Trend at up an acceptable rate. If it's probably much better than seeking to find a new rat a new lease from scratch five or ten years from now when the rent could be much higher. That's that's a good answer. Regular escalator like a dollar a year is that when you get a renewal you're already closer to the market if he were planning for five years, you're going to have a jolt when it comes time to renew. I don't have the lease with me but it's not unusual that at least we'll reset to market during a renewal ring on this. You describe the building. I know where it is and you're taking the first floor is that right entire first floor room. It's going to be used by other tenants including the city so we don't have to pay for it. It's actually a really great situation because we can have public meetings there. We can reserve it 30 days or more in advance so we can notice the We don't pay for it, but we get to use it pretty much whenever you want. So other tenants in the building will also be able to use that. I don't know yet but the weather all right, and we talked about it being closed to public transit right out in front. You got your bike storage conference space Market rent term. What else do we need to know? I don't think we need to know anything else what we feel really good about this least. It's a great opportunity for all smiling. That's nice. So many reasons why we shouldn't do it. I frankly and confidently no, I think it's a very very good decision for the city of the questions. I know you'd like us to vote on this today and I'm going to recommend that we do. So I would move to pass counselor 11948 5 which will authorize our superintendent to execute the lease agreement and information Tracy. Did you have something you wanted to add and I was just asking whether she we are planning to bring the full Council on Monday or just wait the week since we missed the cut off. We could move but there's nobody here to oppose or do abstain. All right. So what's your what is your timeline? We would love to have this approved as soon as possible cuz I'm right now and we have a very very short timeline to build design and build a space Monday this Monday if if you are so inclined to make that motion think you very much I appreciate that and if you feel comfortable with it, then I will move to suspend the rules that would allow us to recommend since it was unanimous allow us to recommend that this go forward this coming Monday the 25th. Thank you. We will do that. And I think the only time we can suspend the rules is if there's a divided report, correct, correct. Alright is my understanding. Okay. Alright this meeting is adjourned and thank you all so much.", "end_time": 1502.1}]}