{"format": "raw", "annotations": [], "confidence": 0.9488353338979539, "data": [{"start_time": 0, "text": "I am really excited about today because I get to sit down and I'm going to learn a lot. I've been involved in transportation for probably about 20 years. The first 10 years is a volunteer with the Sierra Club largely focused on transportation and how it overlaps with climate interest when I ran for city council first time ago. It was the first time I really started to understand how our transportation system just like all the other systems has massive inequalities and how different communities are impacted in different ways by the transportation system and I continue to learn about that every single day as I move forward and look around communities in this country and around the world for people that seem to understand that and get it right and the butler is one of those amazing folks. And so I am so thrilled that she came to Seattle and Asthma share some more wisdom. What week is the director of equity inclusion at tool design, and apparently she has a bunch of other titles to but I'll let her introduced to sell. I want to really quickly do a quick shout-out to get a lot of work to fill the room today and get to wake up here. So, thank you. I also want to thank Seattle Department of Transportation is a big organization that does a lot of work and frankly the doing some amazing work trying to make our system more Equitable. And so thank you to all the folks a mess. Who are here for the amazing work you do within the system for helping organize today's event that I am going to sit down for there till the very end and hand it over to me at 4 to run the show. Thank you all. Thank you so much councilmember. It's such an honor to be here. And I also want to share my thanks and transportation choices when you invited me. I had that same feeling especially just 10 minutes before the start it when it was fairly empty and I noticed the empty chair in the back, but other other than the case chair many of the seats were full. So thank you everybody for spinning a little bit of of your lunch with Regina and me today will try to make it interesting minutes. Hopefully sometimes I struggle but I'm going to talk very briefly and then Regina and I are going to have a little bit of a conversation when everyone walked in you had cards on your chairs and So if you have questions that you came in having you can start collecting. So please don't hesitate we're trying to leave as much time as possible off for questions. And then the only other group I want to thank is on the tool design on Seattle office. They hosted me yesterday. I came up a day early. We had a fantastic just three of us had a fantastic dinner in the sunshine and for like a brief of hours. I would like to live in Seattle. Thank you to the to the tool design Seattle office. And I apologize in advance because some of the things I'll say today is already heard yesterday. So just be surprised and pretend like it's it's fresh for the first time. So I took this picture of my wife Kelly and my child at a every time to just kind of foundation Lee set the premise before we talk about issues of diversity equity and inclusion. I like to set this premise for a couple of reasons looks like we're all just people I think sometimes there's this idea that they're experts on a topic and that day they have some refined are but I'm just a person who has this work everyday because I really care about my wife and kid and want them to just be able to get from from point A to point B as Equitable way as possible as I shared with our Seattle office yesterday. Also share this picture because often when I give talks about Equity inclusion and especially if I go a little hard I always have them white folks come up to me after and ask why I don't like white people and I always ask them. Why don't you like black people and then they often say something about having black friends. And so I've just started including a picture of my white wife because like it trumps friend's wife is also Canadian Sushi super white. So I've I've been very nice. So I've just exceeded there and then other reason why I like to share this picture that happens or four people have a disability if you're not The other group or whatever the conversation is one of two things happens, either you talk a lot and you take up a lot of space that I feel like I'm here to listen and I'm just going to sit back like I don't have a role to play. I don't see color. I don't I don't have culture on that the other so I'm just like I don't know what my role as but my role is to just kind of sit back and listen and and do nothing and so I share this picture of my wife and my son to say is is a young young man of of mixed race, but we are raising him as a black man. We had many conversations and are very aggressive family with gender-neutral pronouns. And ultimately what we decided is that that would be irresponsible because the world is going to see him as a black man. And so he needs to know what what that means. Women I am somebody based on my representation in the way. I dress that people often think I am a black man when they see me and so I know firsthand how dangerous it is to be a black man in America. We don't want him to be confused about that. And also we want him to have you know black case we will support and love him but we have a responsibility for him to know what it is to be a black man in this country. But that is not my job. Solely is the black parent. I can't be the parent who's in charge of those things only once this decision was made that we were going to have a child and we spent a shitload of money on it. We both need it to agree that we were going to raise him together. And so when white folks are like what's my role in this I always think about my wife she has to do her own work. Sometimes that means I can be And I can support her. Sometimes that means I have to say to her. I I care what you're going through. I need you to go find a white friend to talk to that about because it's not my burden to do that work for you. And so all of us to show up in this room where all people we all inhabit multiple identities, but whenever we start to think about this work remember that we all have a role to play it's not going to work if one person just sits back and says, well that's their work to do and so often and our organizations in our communities, we rely on the people of color to do all of the work for us and as I always say to Kelly like I can't raise a day on my own and she's really stepped up to the challenge. She has really done everything you can and continues to do and she makes mistakes and she gets it wrong just as I do as a parent, but that never makes her disengage or stop and so I ask that you all enter the space in that same way. So a little bit about till design I am the director of equity inclusion for Tool designed for walking 3 months. I'm also the director of California all over the country and about a year ago. We started this internal effort what I love about school design in one of the reasons I went there as we are a woman left company and majority of the people and Leadership positions are running a practice areas are women and we have really figured it out when it comes to women, but at some point our founder and CEO Jennifer pool looked around and realized that we were really white company. I always invite people to go to our website and look at our our staff page. I'm we have beautiful headshots of everybody on staff and it's also very white company with a few like chocolate chips in the middle of of the sugar cookie and Jennifer's credit. She looked around here and then the The Way We Were intentional on gender she's like let's figure this out and so we started an initiative to include increase our diversity equity and inclusion and really examine what we were doing well and what we could do better and when we started that process we did a survey of all of our staff and this is something one of our staff members dead and I think you can change out that it's not just important for the future success of our company, but for our industry for our cities for our country, like really tackling these issues of diversity Equity inclusion race, all of the enzymes are really important to our success at all. The other thing we did this is articulate a mission statement. This is a very long mission statement people say they want to do something but they don't actually want to articulate that and put it in writing and so when I go around the country and I do these trainings with our stuff we have internal training one of the He asked everybody at the end. It's think about one thing they want to start doing one thing. They want to stop doing and one thing they want to do more of and we ask people to write that down. They don't have to give it to anybody. They don't have to show anybody but I think you would be surprised by sometimes when you write things down and actually articulate a commitment to something and then what many folks in the company has started doing is sharing it with a buddy at the company because then once you make it public and you say you're going to do something you have to be held accountable to do it. These are few cities where we have offices. We also have offices in Edmonton and you don't see Los Angeles up there or Oakland up there but these are just is we're working in totally different communities and often times. One of the questions people say to me is like Unity your n it's different the Dynamics are different the demographics are different and there's no one-size-fits-all effort and some part of doing this work right is being willing to look at what's an approach what's different and do that work in a way that fits that specific community? So when I was asked to do this talk, I was asked to share a little bit about the exciting stuff that that's going on in California and I was surprised to be asked that question because what I often hear is that people specifically in the Pacific Northwest really everywhere. I was just like, oh my God Californians are so arrogant and that is 100% true. I'm actually in Nebraska and so so I can say this and yes black people live in Nebraska Nebraska and one of the things that has been so interesting for me is how definitively people in California feel that everything they're doing is better. I like something but like everything I was specifically asked to just before we jump into questions give a brief primer measure measure m r Transportation ballot measure that passed The same election mezes that the Trump election and what was really interesting about that wear as a country. We were perhaps going in another Direction and LA County. We actually voted number of things and decided to tax herself in a number of ways to measure M was a transportation ballot measure measure a was a park Equity measure. We passed a measure JJJ which was all around transit-oriented development. And then we passed several measures around I'm helping folks experiencing homelessness and building housing around homelessness. So as a region, we had made a very definitive decision that no matter what was happening elsewhere in the country we were going to do what we could to provide for it for other Angelino. So I guess in that way we were better this this report in the middle measures matter is a report ran by the pier Institute out of USC, which is specifically about how you can enter great Equity into Implementation of measures and they use the Sparks measure and this Transportation measure is a way to talk about it. And so what was measure M measure M was a self text that will never Sunset that will provide a lot of lot of money for transportation in Los Angeles County. I'm going forward into the folks. You don't know how late well la is a city but it's also a county and is a county we are 88 cities and unincorporated area. So it's a fairly large County. I think like the fifth biggest economy in the world. So so it's a huge region. This is a lot of money and this is a picture of me with the mayor we were all over to get this thing pass. This is on Halloween. We were at a Transit stop passing out Eminem's to people and trying to encourage them to vote for measure M measure was was so I'm transformative. The first time in explicitly talks about active transportation. That was the first time the region had did a bottom-up strategy where they actually went to to local Council of governments and asked the cogs to do community engagement at the local level and then built the policy from the ground up and figured out how they were going to split the income. The other measure that has the same time with measure a and measure a is a parcel tax the difference with this one. It was also bottom up but this one was truly community-led and I say that to mean that with the county did in this one is they actually hired community-based organizations to leave the Outreach process as they were building up with the measure would say it's so different Community groups that represents the different supervisor districts and we have five they were hired and they were given funds to do community meetings. And in the meetings, they talked to folks about what a pleasure it would be what it would include and then specifically said in your region. What projects do you want to see on Parks simultaneously what the county was doing was creating this map of South Park poor communities. So the communities and red have a very high Park need and the communities in green have a very low Park need which means they just have more access to parks and open space. But so then the campaign became how do we turn the red areas to green? And after the measure was passed what you saw as you already had a ton of community-based organizations, but also community members are already supporting what was happening because they knew that they had been engaged from the very beginning and that meant that some of the projects that they had explicitly mentioned. We're on a list of products that would be completed once this was passed. And then the last piece is just so what's happened since we had this transformative election where we all decided that Equity mattered R5 board supervisors have pretty much everything they're doing it's unanimously 5. There's really like the most powerful supervisors and they're really pushing to make sure that there is an equity framework and an everything we do in the reason I say framework and not Lynn's is because a lens of something you can just put on and take off a community-based groups. I was at Community groups when the stuff was happening. We weren't just hoping for a lens that they could like, you know, when you're at the eye doctor and they like or like this what are this one this one or this one? We didn't want just the equity lens to be like, nope. Nope. Nope, right. So we actually wanted them to incorporate this Equity framework, which was something that was a little bit more permanent. Which is our regional MTA in the folks who said on the Metro board are actually all five of those supervisors and then a few other folks were hit from throughout the region. They formed what they called a policy advisory Council and this Council was community-based organizations. And this policy Council which was very much led by Teresa McMillan used to work for the Obama Administration and now has moved on to the Bay Area. She brought folks together and essentially the Papas advising on everything from our long-range Transportation plan to Metro has just decided to hire a chief diversity officer and the pack has actually been commenting on the job announcement. I think what we've really seen is tricking and why USC published that report on implementation is it You're so much energy and getting stuff past but implementation is where it's really tough and part of what makes implementation tough is tracking the money. So we have all this money. Is it going and in California? We also passed a Statewide gas tax that is going to bring a ton of money to everywhere in the state but also LA and so now that we have all of these multiple sources of money coming together. It's become a little murky or for folks to figure out where that money is going and how it's being spent and what Equity actually means the other thing in a region as large as l a r e means different things to so many different people as what's been really hard kind of like nail down that definition and then Metro is out there as you can see on the Bottom Metro Hospital Equity platform that they're really trying to lay over everything they do they've done that before diversity officer and then like is a diversity officer in charge of Are they not in charge of that? It's going to be the chief Equity officer. But there's just all of these moving parts that make implementation and especially for folks who are tracking it and who care about it that that lack of transparency is just getting thicker and thicker congestion pricing. I know something that's on people's mind here. It's also something that's happening in LA Metro has just released their first RFP and they've made Equity friend Center. What does that mean? Is it equity and where the money goes is it equity and how the prices are set. Is it Equitable to do it at all in a region where housing affordability and the disparity between the Haves and the Have Nots continues to grow as low-income folks of color have been pushed further out to areas that aren't service by public transportation. Is it really fair? Then charge them to get back to the job centers. So all of these things are starting to percolate. She's fifteen ability office. I think a lot of people think of and the environmental but they have really embedded me about water whether or not you know, they're talking about our transportation Equity is the common theme and they really started with talking about equity and incorporating what that means for indigenous folks and really the basis of how LA County ever came to be and so it is something that again the county is trying to talk about I'm trying to do more of that. The implementation is still a little bit up in the air and then this is a quote. I just always end with an especially as we go into conversation so often so many of us come to this work and buy this work, I mean Transportation work saying what word Transportation planners where Engineers that's what we're here to talk about it when we have meetings are working on a project the people who we say we're there. Aren't just there for transportation. They're coming to that space with so many other issues and so many other things on their mind and so we have to start thinking about this work not just a single-issue work. But how is this work tied other aspects of work? I think that's why a lot of us have started talking more about Mobility Justice. How do we make this work? Just and how do we tie it onto these larger issues social issues that are going on in realize that multiple types of Oppression are tied to one another so I will end their I will leave my my contact information up, but hopefully we can just move into conversation. Thank you Tamika. Does everybody hear me? Okay on this Mike. Okay moving to some questions. I want to reintroduce myself. My name is Regina with transportation choices Coalition. I'll be moderating this conversation today with Tamika you shortly we'll be collecting those and I'll be able to send it to me first as you hear the conversation and hopefully that'll help Inspire some of your own questions later on. She wanted to start with what you were talking about earlier regarding equity-income invitation during the measure planning process. So based on your tool from what you see and what your experience was before tool. What are some of the effective ways from, California. Change the color to participate in planning efforts, but Shifting The Practice to Resource black and brown and other marginalized committee members as experts on the planning team. That's a big one start. We're working this out as we go as we go a couple of community engagement and I think that's like a First Fundamental step. I think often folks want to do Equity work but in doing Equity work, we've getaways that to just Outreach, right? So as long as we're doing Outreach we've done equity and we have to start conceptualizing a world and which Equity is part of everything. We do. Just the Outreach and he's the other pieces. We have to realize that Outreach and engagement are not the same thing and too often the communities who were trying to help our we say we're trying to help they are experiencing Outreach, which is just us coming and reaching out and saying is you going with that great cuz we already decided which is very different than engagement and actually in an even you know, I I get it as as someone who works at a private consulting firm now I get it intimately. There are timeline their budget you have to spend this money by this time. So there might be things you come to the meeting with and say like this is what we going to do cuz this is what we have to do. But is there anything planned that is open for engagement open for changes open for your mind to be different and you know something we've been talking about and in our training we've been doing an from office to office as we've been talking about white supremacy, which I think is really hard for a lot of people to talk about because I think white supremacy equals white supremacist Supremacy is is this way of thinking and one of the traits that is often and white supremacy is this idea that there's only one right way to do things. Right? And that is something that many of us benefit from right? Like I benefit from that aspect of right Supremacy because if I can learn the right way to do it then I succeed and that's really hard when you're doing true Community engagement. True Community engagement is acknowledging that there might not be one right way to do things. And when we have manuals and end things that tell us this is the only way to accomplish that breaking out of that Paradigm is hard and I think you know just one example, I'll share as in La we worked on this project the Metro Blue Line project when I was at the LA County Bicycle Coalition, if you just Google LA Metro Blue Line brings up a web page that has like our final report and and all of these these different things and why that project was so transformative is because the blue line is our oldest rail line and it goes from downtown LA to downtown Long Beach communities of color and blue things that people have heard of like, what's right and as it goes as it goes through these communities are job working with Ferrin Piers was to do Walk audit of every station a first my last mile walk audit and then come up with ideas of what improvements we think needed to be there. And then do one pop up Community event and kind of get community feedback on the ideas. We had come up with and that process. I think it was really hard for Metro was really hard for fair and peers because that's the bike Coalition. We ended up bringing together a diverse Coalition of a bunch of different community-based organizations, and we paid them for their time, which I think is a best practice. It's it should go without saying but pay people and we brought them together and all of those groups were Transportation groups, so they weren't all of hurting it from Plymouth Transportation Lynn. So when we were talking about The Intercept survey about why don't you use the train there were people who were like you're afraid of ice agency like we're not asking that question. We have to work together to get there and I think in the end it was a process where we were all able to grow from it never was able to learn that you can't put advertisements on the side of bus. That's a summer of the blue line with music notes and food, but then tell us because of the funding there's no budget for DJs in food while like don't put that on the advertising that's not our problem. We need DJs of food. So small things like that that I think just the process of having all of those groups go together and being able to push back and have open dialogue. I give Metrolina credit. I get fair and Piers a lot of credit and frankly, I give the community groups the most credit for not just saying we're going to learn their language and meet them where they are. We're going to bring them along and teach them where we are and that Metro Equity framework was actually only created after that being my process where Metro is like of this is how we should do things until I think that's a good example of Going into the project with what your expectations might be. But trying to create space for everybody to grow in the process. Thank you for that example to you in the room. Probably Seattle just announced it is starting to look into congestion pricing and there was a report released. Was it this morning or yesterday yesterday on this policy? And how are Equity concerns being addressed congestion pricing is is really tough for me personally, but later the transportation Advocate because I think that you you know, you will get food out of the room if you are a transportation at work and you're like, I don't know about congestion pricing because it seems to make so much sense like it seems to be a no-brainer and you know an LA the CEO of of Metro his big thing is like this is not just about you know, I want to do this because I want to do this like a traffic. This is how we're going to fix it. Is this the income it will generate will allow us to have free transit for everyone. And will allow us to accelerate a number of projects has have more biking and walking infrastructure. So his argument is really that like it's also not just about you know fixing traffic. It's about the benefits of what we're going to be able to provide people once we get this money until I am I am I am I know he cares about Equity but I think the reality is for me congestion pricing is one of those issues that too often is viewed just as a transportation issue and you can't think about congestion pricing without thinking about housing affordability. You can't think about congestion pricing without thinking about housing, you know, people experiencing homelessness and people who have insecure housing like you can't think about congestion pricing without thinking about minimum wage like congestion pricing is so tied to all These other social issues because the folks who are going to be most heavily impacted are the folks who have the furthest communities and the folks who have the farthest commute are often low-income folks and spokes of color and that is especially true as like this urbanist movement is coming back of you know, like young folks with perhaps more means moving into urban centers and I think that's especially true and a lot of La cities. I think that's true here in Seattle when you think about the tech industry and the the issues that that frames it may create jobs, but who is it creating jobs for and what is that doing to the overall economy? And so you know where we're at is that we have is RP Metro has releases RFP. They made one whole task in the RFP about Equity. They said very publicly to anyone who listens that the group. This proposal is going to be based on how they talk about how they're going to address equity and there's a screw pin in in Oakland and San Jose called transform this community-based organization in the favorite in this report that I've brought pricing roads advancing equity and it's a pretty it's a pretty good PC though. I think people who read it might find something there that they might not agree with but it's a great place to start if you're thinking about equity and congestion pricing and then the other thing I would say is that we need to be thinking about this not just in our individual cities, but how transformative would it be if groups in Oakland got together with groups in La got together groups in Seattle, like instead of all trying to figure it out on our own. I think we all really have to start thinking about the fact that there are some similarities in our Western cities and there are some things that were all experiencing and that I'm not I'm not quite ready to say congestion pricing is the answer. I think it probably is but not unless we do it well and is a black person in America. I have just seen too often that the best ideas often don't benefit my people but not often. My people are at the table when those ideas are being conceptualized and then afterwards we like to talk about the unintended consequences of the policy decisions he's made but I would argue that the consequences are completely intended and so I just want us to be clear about how we don't continue the historical and justices of planning against certain communities and that we really think about this because when we think about Equity, what we've been trying to do is retrofit it we've been trying to retrofit equity on the policies that are already existing and congestion pricing really gives us a chance to rather than retrofit do it from the beginning because retrofitting often doesn't work. Thank you. I think what we can do we can start collecting some questions. I'll have one more question to ask Tamika. Okay, thank you. In the meantime. I wanted to ask another question. What is one of the biggest challenges you faced in developing Transportation policies with an equity lens? One of the biggest challenges is just that everyone wants to do the work and they want to have the results without actually doing the work and said something something I shared with the folks in in our office yesterday. I sure the story about my wife. We're on my wife is a partner at a law firm. I'm she's she's a lawyer. I don't know if I mentioned it. She's white and and one of the things when I've really struggled and work. She always says, how are you going to fix it? And so she always wants to get to the solution of how to fix it. And what I've really had to push back on her is getting straight to the solution of how you fix it. It's such a position of privilege because folks with privileged are able to identify something that is a problem and just fix it and I think many of us who don't have privilege have been in countless situation. Where we can identify a situation that is unfair or unjust, but we don't have the power and we don't have the privilege to affect it. So we have to just sit in the discomfort of knowing something is wrong as a gay person at the sit in the discomfort of knowing it was wrong that I couldn't get legally married until the folks with power who were you know, this supreme court of all dogs are people decided to allow me to have that right so I couldn't just like I couldn't just get to the place where I fixed it like eventually like, you know, the queer Community organized and we did it but like to a certain extent we have to sit in that discomfort and I think that one of the hardest parts of doing Equity work in the transportation world is that folks don't like discomfort and we are professional people who wanted to fix it. We want to just make the commute better. We want to just put in the bike lane. We want to just fix the timing on the signals and and to do true Equity work. Sometimes you have to first understand what is an equitable. And that's on comfortable and no one wants to sit in that it so maybe that's like to soft of an answer. But I think that's one of the parts that's made it hardest. All right. So now I get to the Amigo answer some audience questions that we just collected right now. There's some really great ones already on the top, but I'm going to just start rolling through we just want to just go through that one is how can our streets be redesigned to promote Mobility Justice? So many ways answers. How can our streets be redesigned to support my Mobility Justice again? I would first start before we try to do the work externally with doing the work internally is a profession and I would say we would include more people in the in the process. So how can we have streets that promote more Justice having the people who play in the streets and who designed them having more of those folks who have a different view of what is accessible and what is just be part of that discussion and I think that's a huge huge piece of it. I'm understanding the difference between diversity and inclusion understanding that it's not enough to just have you know, those exotic diverse faces at the table, but actually you have to listen to those people that allow them to impact the decisions wet someone with a disability actually be part of determining what is accessible and not accessible. That would be a huge huge for step. Something else but agencies and people were doing like a community outreach and saying they want a community, but don't know how how how can they make space or give up power in order for those voices to arise within the planning process? Yeah, I think that's so tricky because sometimes sometimes to to make change we have to individually lose something and then the framework I've been using is is that the difference for me between an ally in an accomplice? So when folks are trying to think how can I do this work? And how can I do this work better get from that place of being an ally to getting to a place of being a, what's the weather is an ally I think and and popular culture and allies the person who like every time someone is a press you like write a new status update. That's like I support you is actually someone who takes an action and so that helps makes it tangible for people is if you're in and there is a woman are person of color who speaks up in the staff meeting and says something you agree with after the meeting you send that person an email. Are you pull them aside? And you say I know everybody's not receptive but I really appreciate that you did that. That's an ally like Actually done something to be part of that space with that person. But an accomplice is willing to risk something. So an accomplice doesn't just safely send the email or have the one-on-one conversation after we're no one else has to know you've done it and so you don't have to risk people not liking you are thinking that like you're too radical are too aggressive like that person gets every time they say something and a compass is the person who in the meeting raises their hand and says, I just want you to know I appreciate that you said that I agree and so I think when people are trying to create space it's not feeling bad for the privilege you have or the access you have are the power you have it's using it to be an accomplice. It's using it to make sure your you know, maybe taking a little bit of a risk putting yourself out there and making sure that you're providing more than just a lie ship but actually doing something and risking something in the work you're doing. Many people get confused on the difference between equity and equality sound Transportation Solutions have focused on an equality framework rather than Equity. Can you provide further guidance or thoughts on this? Equity is hard Equity is hard and particularly in a political context because if you are someone who holds an elected officer an appointed office you it is really difficult to be in a position where you say we've had enough of those guys over there like me. It's it's really it's really hard to do that and I think that's why Equity often gets default it to the quality and I think particularly what we often see is people lead a conversation with equity and then it quickly devolved into Geographic equality where we just want to give a little bit to everyone and I think that's the difference between the two to the point of the question is it's not giving the same to everyone. It's actually making the hard decisions to say like there are some places that have his store. We not gotten a lot and they're going to get more and they're going to get more because it's the right thing to do now is really easy for me to say that as a private sector planner or is the person who works at a community-based organization and I think something I get asked a lot when I do these taxes if I will run for office, I think some people really believe in me and want me to run for office. I think other people are just like you articulate Blake and black like you should run for office to sit here and be like qualities do Equity, but then turn to the council member and say good luck with that. How can I support you as individuals? How can we support council members or people who are willing to be brave and do we have to show up? It's just like Yelp like Because when something goes wrong, you're more apt to say something and I think that's also something I've had to learn as a person of color in the space. I am really good at calling out white people. I'm really good at calling out man or people who are weird. But what is even more radical is when they do something right and maybe it's not enough but it's still right and going to that person and say I know that was risky. Thank you. I know there's going to be this really heated meeting and I'm going to show up and I'm going to show up for you and I'm going to go hard for you because you're not as far along as I would want but you've done this thing and it's really important and I think sometimes we have to remember it takes more than just criticism to get to where we want to be. So is card is kind of cryptic, but also kind of want to answer to so it was an equity driving cars. I appreciate your brightness. Is there more of a question? Cool cool. You know I was our Communications team actually had a very similar request for me. Okay, AOC made the statement about how tech companies are giving data to police departments and it's disproportionately identifying women of color study that said that are better than taxis. But like we still have the rides cancel more often and it takes longer to get them self-driving cars and so has a very similar question. It's so what ultimately talked about is that technology isn't going to save us like I'm all there for technology I went to Stanford. Started their own company or did their own thing and so I truly believe there are people in emerging mobility in the tech industry who are trying to do what's right and doing it because they really care. I also think that is an industry that is super white super male-dominated. And so when studies come out that say autonomous vehicles on can't recognize darker color skin. I'm not surprised because the people sitting around writing the algorithms to make the autonomous vehicle. There aren't those folks in the room when I read a study that says that like the soap dispenser are the the, you know faucet that is automatic. Like literally the science in the way. The sensor works. It is harder to see darker skin than lighter skin. I remember telling this to my wife and she's like, are you fucking kidding me those things never work and we know we need to fix that, right? So like I think there is I think I think the reality is is that like emerging technology is important, especially when you think of scooters, right? Like I live in a predominantly black neighborhood kids and moms. Like we have buses that never come on time in our neighborhood. And so it is really effective to be able to pick up a scooter that you know will always be there in like go to the next stop or get to where you need to be. So I don't want to write these things off is not helping folks. I do when I have now is that the folks who are currently deciding many of these emerging Technologies are not always thinking about folks of color and especially if they're ultimate goal is to just get Acquired and make money like they're not necessarily thinking of us. And then I also want to have now is that many of these new technologies are providing Solutions like it is easier as Tamika to catch a lift. It is to catch a cab. So I want to acknowledge that that's true but also say that when we think of things like scooters, especially in places like this where there are helmet laws like those things are being an Forced at a different rate. And so I I just want us to not think that just because there's some new new that Equity doesn't matter. It has to be incorporated into all of this work. How to use specifically recruit to diverse diversify your staff we've updated job description requirements. How do we get people of color to apply for our transportation jobs? So this is this is one of the struggles are also having a tool design. We recently started a policy that for any position from entering his to Super senior-level. If if we're interviewing folks, you have to interview at least one person of color some folks who who understand Sports in football the Rooney Rule any new coach, you have to interview at least one candidate of color. But this last season in the NFL like the black coaches almost all the black coaches were fired and in every new hire, it was almost always I think there was one new hire that was a person of color, but every other position was a white person and so for me, this is a two-fold thing like and Anna should sound like a reoccurring theme for me before we're just expecting results. We have to do that internal work. So is a person of color who has chosen to work at a majority white company like I love my job like I encourage everybody work at 12. And I'm having a great time. I have to acknowledge that everybody is not me right like everybody is not Tamika Butler who grew up in a very white State who went to a very white law school and has learned how to light code switch and navigate in these different situations. So I think too often our focus is on hiring a focus should actually be on we can hire all these folks of color but then if they get here and we are just going out with people uncomfortable. We can really try hard to hire a bunch of trans folks. But like if every time they use the bathroom it's uncomfortable because everyone's looking at them and no one's ever talked about it and we've never figured out what we're going to do. What's that going to look like? We can say we want to hire as many working mothers as possible. But then if we don't have a place where they can pump when it's time to go back for work. Paper up in like that is really awkward. So I thinks too often. We focus on hiring without thinking about what happens after those folks get there. So I think the first thing is to ask yourself. Are we a place where folks who are different could even Thrive and if the answer to that is no that maybe spend some energy. There are also trying to get diverse folks into the door. And then I think we just have to be ready for the idea that this might take longer this might take longer and it might take longer because it's been a long time since we've actually tried and so it is showing up at different places. It is changing job descriptions, but it's actually being really really intentional and too often in the professional world. We wait until we're hungry to go hunting. That's probably a bad example, but like if we wait until we go in till we're hungry to go hunting. We're going to look for that person to join our hunting team who knows how to do it who's done it before who is going to deliver immediate? Results and if we're not working on it all the time consistently only when we really need somebody then the default is going to be to go to the person who just like everybody else so we can just plug in. So you made a comment earlier about a best practice it which is compensating seabios and committee members in the planning process. This question is can you think of other good ways to Resource community-based organizations when designing the ability pilots and permits for example scooters. So something that Metro did LA that we were all really really excited about as they put for there to be a training for seabios on how do I join us a bitch and how to be able to better participate and like these government calls for work, but part of the RFP was also training Metro Staff on how to better work with community-based organization inform me. That was the Realty I think too often we're expecting folks to like meet us at our table or like how do we get more people to the table? And at some point we have to be like this is the wrong table. They already have a table or a stoop or you know, whatever it is and we have to go to them. And so I think one of the ways one of the best practices its first figuring out what's already happening in the community and then what are we going to do that's culturally competent linguistically appropriate like what are we going to do to meet them where they are and like how are we as the professionals going to be the ones who are Forced to code-switch instead of expecting them to do it. Okay, so we're going to start wrapping up a little bit. I have one more question here. Then I'm going to ask so we can get to all of them today both thinking about brt and Light Rail improve values and homeowners associated with Transit Investments. This is a tough one to be the last one. I think. So, you know, what is the things that I've been talking about a lot especially in our current political landscape that has made this Equity work so hard to go back to an earlier question is that we have just divided ourselves into what's right and what's wrong right? We can't talk about racism because racism is wrong. They are not being someone who was racist because it's just right or wrong and I think it's the same thing with gentrification and displacement like we've we've decided to rotation and displacement is wrong and so it just fits in this one box and it makes it hard to talk about now. I'm not saying that it's not wrong. I think it's one hundred percent wrong, since we on gentrified and displace indigenous folks in this country, right but this idea that justification and displacement is new. That's what's wrong because we are country founded on gentrification and displacement. Like that's how folks have increased wealth and power by gentrifying and displacing people. The reason I think we have to have a little bit more compassion in the conversation is because one of my first jobs after retiring from being a lawyer because that was a mistake was at this organization. That was Millennial Focus. So we focused on economic justice issues impacting the money. Also, I happen to know a lot of really random stats about Millennials. And one of them is is at the millennial generation is the first generation that is going to be worse off than our parents generation. Right? Like we're not trying to like the dream for Millennials is not to have the house with 2.5 kids and a white picket fence. It's to not have death. That's the dream. We're waiting longer to get married to buy houses if we can even ever have a house and some for me what makes gentrification and displacement so hard is that we're often other ring, frankly white folks and saying that they're gentrifiers and I'm displacers and they're wrong now sure. And again, there's something tied in there but I am a gentrifier as a black person who said I want my black kid to grow up around other black people until I moved to a black neighborhood with my white wife and our jobs that like make our joint household income way too high to say publicly right like so we are gentrifiers and I think that's what stuff but there's not this clear area. I think the way Transit organizations have to start thinking about its first to realize it's gentrification and displacement happened. It is no longer helpful for us to hear from you that this is not your area that this is not your work. Right like if your transportation planner or Transportation engineer says like, you know, I'm not a housing person. I can't talk about Transportation. I can't talk about this. Then you're the wrong planner buy next right? Like you have to just start identifying that this is your issue. The reason it is your issue is because as people get gentrified and pushed out and that's both like And business owners, it becomes your problem because they are going to a place that is going to need to be serviced by the Transit Agency. So this idea to deal with this is just wild to me because at some point you're going to have to create a budget to deal with the people who use help gentrifying displaced. And so I think the real first step is acknowledging that this is a transportation issue and that it's not an easy issue that many of us who are just trying to live especially in these Western cities where it is just not affordable. We're all part of it and to start being part of the solution. We have to start talking about it. We have to start talking about it in a way that exhibit some sort of compassion but also acknowledges that our history and our country is built on gentrifying and displacing certain people and continuing to systematically cut them off from wealth and resources and if we don't talk about transportations rolling that then we're never going to be able to solve the problem. What an answer? Thank you. All right, so we're going to wrap a bicycle get some final comments from Mike. To stay in touch with Tamika. You should email her at T Butler that Stevie B U T L at tool design. Calm and that's 200 l e d e s i g n. Com. Cars after the event to all right. Start by giving a big round of applause to Regina for thank you. We are so lucky to have an organization with transportation choices Coalition in our community doing this work and it was just awesome to hear the questions the comments. I want to thank all the folks in the audience today a full room listening to someone talk for an hour or two tension coming out. It was really cool. You all really care about was being discussed. So thank you all for being there.", "end_time": 3501.8}]}