{"format": "raw", "annotations": [], "confidence": 0.9489904007604045, "data": [{"start_time": 0, "text": "Good morning. This is a special meeting of the select committee on Citywide mandatory housing affordability. Mha the date is May 28th, 2019. And the time is 10:30 a.m. I'm counting on Silas the co-chair of the committee and joining me this morning. Thus far is council member at Juarez and council president Harold. Thank you so much for being here today. We do expect that others will join us. We're going to go ahead and start the meeting is so if there's no objection the agenda will be adopted. Hearing it. No objection. The agenda is adopted. I really quickly on a chairs report today. Wanted to let you all know that today Ali penuche from Council Central staff will brief the committee on Council bill 119500 which is the second agenda item. This piece of legislation is available to the public online and in hard copy following a staff briefing. I will open up a public hearing on Council bill 119500 again is a reminder. That's the second item on the agenda. This will be an opportunity for the public to voice their input ideas and concerns with regard to be technical amendments being made the council Bill 119500 + for any of those folks who are here to testify in that particular bill that public hearing will occur after the ordinary public testimony at the top of today's agenda the following the public hearing I will suspend the council rules to allow this committee to vote on Council bill. 119500 with a final recommendation to the full city council and we are now joined by my culture cancer, which I go and buy council members get a thank you for being here. As soon as I as I mentioned will start the public hearing will start today's meeting with public comment on the items other than Council bill 119500 as a reminder again a public hearing on Council bill 119500, which is the second agenda item will be held following public comment period and following discussion of the first agenda item, so we'll go and look at the sign-in sheets. Okay, so I have six books signed up for public comment. And again if I call your name and you're actually here to provide a testimony on the second agenda item if you could just let me know then I can sort of put your testimony to the side when we open up the public hearing. So just make sure you let me know if you're here for the second agenda item instead of the first. Okay, so I can we have six books at signed up. When I call your name. Please. Come to one of the microphones at the front of the room. You will have up to 2 minutes to address the items that appear on the agenda before beginning your comments. I'd ask that you remind us of your name. I will call each speaker in the order that they signed in and once again, we thank you so much for showing up today and providing us for the comet. Also before we go ahead and start for the comment. Just want to recognize that we have now been joined by don't remember smart and thank you for being here this morning. Okay, so the first Turn on the sign up sheet is Ruby Holland. My name is Ruby Holland today. I'm asking Seattle's lgbtq Community to denounce the racist and bigoted policies of one of your own bear Jenny durkan even as the Trump Administration wants to reverse lgbtq this anti-discrimination protections. Jenny durkan is participating and housing discrimination against people of color in Seattle. We feel that both policies are wrong and that everyone deserves to be treated with dignity and respect and yet it is common knowledge that the Durkin machine intends to force all people of color out of Seattle the signing of the overtly discriminatory. Mha is confirmation in a backpack the redlining map used against people of color in Seattle's pass. Is strikingly similar to the mha up zone map being used today. It is shameful and absolutely appalling that racism in Seattle City government is alive and well but times have changed during red line and you had what we wanted access to housing today. We have what you want housing the best way to mod a great gate gem placement is to keep us in our homes. And so we reject your vision of an all-white Seattle and your Envision to encourage homeownership development on city-owned Surplus property. This is an insult taken away our dignity and our right to live and own property in Seattle. We also call out your community preference policy as a lie that I told you after year to those facing residential displacement inviting them back into the community to accept the crumbs of whatever is left of house. Yeah, executive order has many words, but very little substance. Thank you. Thinking of some of the next person signed up for public comment is David Ward. Wanted to say that I am strongly opposed to up zoning in the University District the additional up zones. It's been the poorest of all the neighborhoods in Seattle for a long time Heartland report in 2012. When he was working for the city looked at developing the University District and in that report developer from the u-district said that it would take an income of 80k a year to live in one of the high rise apartments in the U District that same report also said that 69% of the people living in the u-district make under $50,000 a year. So to live in an apartment there that would require $30,000 More than 70% of the people in the u-district make The and also with what's happened so far with NHA there has been more displacement of affordable housing. Then there has been a housing that's going to be more affordable. So if you take a 220 unit apartment building, that's affordable because it's very old witch. There's a lot of in U District and there is in them Butchart wind-up Zone you get up and take a 20-unit apartment and get rid of it and you build a 40 unit apartment with three or four double units. That's not an increase of 3 units. That's a displacement of 17 units. So, please do not increase displacement in the U District and eliminate affordable housing under the pretense of providing more affordable housing. Thank you. Thank you. The next person who has signed up is Rick McLaughlin, and I'd also like to acknowledge that we've been joined by a council member bagshot and the council member Brian. Thank you for being here this morning. Good morning. Cancel. I've been working with the farthest. Rick's a small Business Association for a long time. Now. I've been the president for four years back in February 2017. I worked with you guys and we did this study and with their was resolution that was approved that you guys said that you would work with us and work with us on that seven different key points in the resolution. They have not been done yet the fact that you're bringing forward another up Zone in the U District before even completing the resolution. It's kind of sad. Please work with us. Don't just try to push up zones and then try to work with us afterwards come to us talk to us and fully support if it's about affordable housing fully support Lisa herbold 141 replacement program go after a historic visit the historic Avenue and go after, you know, every historic building that's there for you know, Affordable units. I don't understand why this keeps coming up gets us a little fired up, but we want to work with you. We want to make this happen. I just don't understand why you would try to pass on the ribs. Only District when we were already going to grow so drastically. I just don't see the need for it. We're going to be paying into affordable housing more than any other neighborhood, and I just don't see how it's Justified. So, please contact us. Please work with us and support Lisa herbold 141 program. Thank you. Okay are on next speaker is Cori Crocker followed by John Fox? Missing here. And if Corey comes back will John Fox Seattle displacement Coalition 17 after an exhaustive 324 your process the city of proving that cover nearly over a thousand low-rise low income and affordable apartments were rezone for 242 324 Towers. No neighborhood was hit with such a significant change in increase density the plan assume the district would add 3902 5000 units by 2035, but that plan zone for a capacity of over 10000 units nearly double what we are expecting in growth and targeted at for Moberly by 2035 and despite what developers were saying that the mha requirement would discourage. There are now 27 new projects moving forward. Mha rules that would add over 2,800 mostly expensive in market rate units in the neighborhood of those projects result in the loss the demolition of 110 units a number greater than the 88. Mha units required of these projects has lights and I know I Echo the sentiments of the community. What in the heck are we doing even considering still more up zones for our neighborhood when our neighborhood already has been and is facing uncontrolled and unmanaged Grove. We have Emily have more than enough capacity to meet through 2235 are growth needs. There are no existing 200 units of low-cost housing along the Ave and another 500 existing low-cost units North a 50-second. These are areas that now our plan for these new episodes. I sat and there are over 200 small businesses along the app that are at risk of being displaced and I want to reiterate that and I'll close by saying the obligations under the resolution committing first to addressing the needs of small businesses preventing displacement and helping us preserve the historic buildings in the character in that regard then we can return thank you. Thank you. Thank you Steve from Stella is our last speaker signed up for today. We don't have a shortage of housing. We have a shortage of affordable housing and mha and all your actions are making it worse. You're talking down right now soon upfront the affordable housing and someday you will have housing for people who make a lot more money than the people who live there. Maybe you should think about the people who currently live in Seattle the madness that Rob Johnson ever got it me is when I pointed out that the Central Area used to be 80% black and now we're looking at possibly 20 25% will see what the next census says and we can see rather easily how you been pushing people out of the city and it's not because of their color. They were pushed out. They were pushed out because of economic reasons, you're doing the same thing to the entire city. It doesn't matter how long you lived here. You're very welcome me to new people, but I can tell you two people. moderate-income whatever their color you are not very Helpful, it's harder for people of moderate and less income to move than it is for rich people and you're doing a very good job of taking people on the upper end of the scale and doing very good. The people who are on the absolute bottom there are programs that have they don't take care of nearly enough and there's wouldn't want to have discrimination at that level for people with live in the city all their lives because you know, they may not be quite as needy as someone who just came here. And so therefore there's a war on the middle class the middle in the cleaners, you know, not the bottom few percent not the top 4% but those in the middle and there's a lot of people especially as we age out if you would put it we're not going to have Rising incomes. Thanks, Steve. All right, that was the last person I have on this end of shape Joe Diaz or anybody else signed up. Okay. Thank you so much will go ahead and close out the. Of public, I'll go ahead and begin with the items of business on our agenda. And I would ask that the clerk read the first item into the record and while she does so I would invite those who are here to present on that item to please make their way up to the table agenda item one update on mha implementation in portions of the University District. Thank you Jodi. All right, so we now have our presenters at the table here. And if you can please Begin by introducing yourself for the record, I would appreciate that. Alex Mucci Council Central staff and office of planning and Community Development. Thank you both for being here this morning. I'm going to hand it over to Ally. I Think You're going to kick us off on this conversation and then we will open it up for questions and a further discussion. Once we make it to the presentation to 5267 that made zoning changes to increase height in floor area and implemented. Mha the mandatory housing affordability program in portions of the University District at that time comes I made a policy decision to delay zoning changes along University Way Northeast also known referred to as the Ave with an expectation that the proposal would be Revisited during discussions of the Citywide. Mha bill that was recently passed by this Council during the discussions of the Citywide belstaff determined that some of the proposed changes in the u-district study area or potentially not adequately covered by the environmental work for that bill. And so that area I need a strict study area was removed from the Citywide proposal and included in a separate bill, which is Council Bill 11948 3 action on that bill is awaiting completion of the additional environmental work that Jeff from the office of planning and Community Development will describe them. Thank you. Okay. Thank you. So. Did the update is that the officer planning and development is taking steps to complete the environmental review for potential? Mha implementation in U District. We looked at past environmental documents. The is for the U District in the E is for mha city wide and had a conference with the law department. And I looked at what the appropriate process was for this this action and determined that at the appropriate process is a supplemental environmental impact statement and that process would supplement the u-district. He is and provides an opportunity for public comment at a couple stages of the SE is process. The steps are very similar to a Foley is so on Thursday of this week opcd will publish the notice and Call for scoping and that will open a scoping. And members of the public are welcome to comment on the scope of the is what should be included. It will be a scoping meeting on June 12th at City Hall in the evening and following scope in the next step in the process is to complete the analysis and issue a draft supplemental environmental impact statement. We would expect that to be completed in late summer August maybe early September timeframe public also has a chance to comment on that draft and the city response to all the comments that are received and follows that with a final environmental impact statement that would occur in the fall sometime around October. And following completion of the the final environmental impact statement Council can take action if it chooses to implement mha in the in the U District at that time. So this will primarily focusing on the lands that were removed from previous mha implementation actions, but it will technically be a study area. That is the same as the original 2015 U District GIS Thank you. Any questions or comments? Colleagues kuzma herbold. Thank you about the process for moving forward in the scoping but more would love to hear from OPC Dee's perspective how the city has fulfilled the commitments in the resolution that accompanied the University District. Mha legislation back in 2017, and whether or not you agree with folks that we heard from in public comment that there's still some work to be done. I think we would agree. There's still work to be done. And we hope that we can do some of that work as a part of this process. We know that the issues of potential commercial displacement of a really important and I think we can study them to a certain extent as part of the the is but we will also study them kind of in parallel because they're not all kind of within impacts to the Bilter or natural environment office of economic development is also done work with community and we hope that that'll continue in parallel with this process. I think it's worth noting that the companion resolution that was adopted with the University District just like the companion resolution that was adopted with the Citywide. Mha represented additional work that the council was asking the executive to do and work with the community that was both part of and in addition to potential land use code changes. So my recollection of that resolution and counsels intent was not that all of that work. Essential that you saw the all of the challenges any neighborhood is facing prior to following through with implementing. Mha in this area. The idea was in delaying that decision at that time was really focused on what are the right development standards to try to include incentives and opportunities to retain small locally-owned businesses in new development retain historic buildings. Both that have already been designated or that are potentially eligible. And so the proposal in the U District that was implemented in some areas and would be apply on the Ave includes opportunities for transfer of development rights for historic buildings. It also looks at adopting requirements that new development include smaller commercial spaces that are likely to be more affordable to smaller smaller businesses. I'm where is right now? I think along the Ave in particular Redevelopment can occur and it can occur up to 65 feet without any of those requirements in place or incentives to Starting to maintain those building. So it is a little bit of a challenge in terms of getting all the pieces to come together at just the right moment. But the land use proposal to the extent that man use code by Galatians going to dress him of those concerns does have some of those pieces built into it. It looks like I just pulled it up. It looks like Section 5 of the resolutions is speaking specifically to the Ave. Perhaps we could get some additional information about what we have done and what we are working continuing to work on as it relates to that section five actions a through G. Thanks. I think that's a great suggestion customer herbold in was going to was going to offer it myself. So I'm glad that you that you did at first I think getting getting up a written response of a better sense of how the executive has complied with ribbon responsive to the sections in the resolution that are applicable to this particular body of work would be extremely helpful. Official Jeff thank you. I had an opportunity to read your mail mou May 24th memo and on page to where you talk about. The SC is content about the three alternatives on one will be to consider zoning changes as proposed a second alternative to consider more intensive height. Then the third is no action no action alternative at all. So let me let me ask you this one of your last sentence is what I was more intrigued by the SE is will also at information from the u-dub campus master plan, which was not completed at the time of the 2015 U District Urban Design alternate alternative. She is so my two questions are when did the plan come out and how do you foresee opcd responding to that are Halo that we helpful in our analysis going forward. Thank you. The way that that information will be used as is the that was an environmental impact statement on on the u-dub campus master plan. And so it has some good estimates for growth in that area and growth in that area would affect what we're studying in the area of this proposal and information wasn't available. When we did the u-district. He is also wasn't available for the mha S. So it's a lot about just updating the background information. Set to have to have good information on your things like traffic trip generation demand for services for the girl if it's anticipated and project it in that you dub study area and incorporating that in this review, so it's sort of update in the background information. Of course you be working with the University of Washington and the the folks that put together their campus master plan. I hope so. Yeah. I'll write any other questions or comments cover by chacko in the U District than we had previously anticipated when the council remove this area. But during this process so the at the time that the council remove the area wasn't clear. We weren't certain which environmental review process would would be required cuz that require a sort of analyzing what was studied previously and identifying the correct procedural path. I think at the time there was an assumption that it was likely to be an addendum which would be issued could be issued and doesn't have all of the all of the steps involved in a supplemental nor is there an opportunity for an administrative appeal so it will delay it will it will delay the time under which Council can take action on the changes in the U District? Mha is not Implement in the U District. That is an excellent question. I don't have that number in my head, but I can follow up after the meeting with the analysis. We did during the mha discussions on what that number is unless you happen to have it in front of you. If not, I'll follow up to the full committee. Okay, no other questions from my colleagues. I don't see anybody else raising their hands are waving at me down. So I'm going to assume that there are no other questions last one. Thank you very much. I apologize if you've already commented on this but as we look at the memo and we see in the second to last paragraph here, it says that the finally I asked could be issued approximately October 2019. What assurances do we have? This date will not slip ideally would love for us to be able to have a concrete plan in Hand by before the end of the year and Lead fall. I would be ideal. So how what assurances do we have that this date will not slip you assurances, but I don't think that it would be possible to give a specific date. There are uncertainties related to the Out of comments on the draft Eis issues that the technical issues that might complicate analysis and also whether or not there's a peel those are things that you know are difficult anticipate probably outside of our control. So it would be hard to give a specific Assurance. There are also other priorities that the office and the city has to fit this work in amongst so it would be difficult for us to give a specific Hard dates. Okay manager on that on the former not knowing what external realities may present themselves. I understand that answer on the ladder. If this is a matter of Staffing or priorities are resources. I would expect this Council to get out of our heads up on what that those restrictions are because as council member Pacheco Pacheco had just mentioned every month that we delay. This process is loss of Housing and I would like for us How to count these months in terms of lost units versus actual days if there is any indication that this somehow is going to be delayed due to lack of resources or staff. Please give us a heads-up and let us know I think if you can do the analysis and let us know far in advance of the the budget that would be ideal because given where we're at the ladder cannot be a factor in the situation for us after budget given that we have budget coming up in the opportunity to enhance resources. They're so please let us know as soon as possible if that's the reality. Okay, I would just conclude by saying that maybe a little bit more forcefully than articulated but it would be my expectation that this issue to be resolved in full by the end of this year and certainly before the end of the year. And before we go on recess for winter break, so we will keep a close eye on the timelines and the things that I like to see is have this text turned into a little clearer of a timeline in terms of what what actions we can expect by when so that this Council in the public has a better sense of when we can expect work product or or when there might be decision points in the in the coming months. And so I I would I would ask that that document B pull together so that we have a clear sense of exactly what those decision points and time and Route in Associated timeline is going to be hit with the assumption that the finally is will be completed. Approximately October of 2019 I would again signal that it's my expectation as one of the cultures of this committee that that actually that date be met and and that there be an opportunity for the city council to consider a legislative process and or final package of legislation before the council at recess is for winter break, which is sometime in December. So that would be my expectation as one of the coaches here and we'll stay close in contact with my colleagues to make sure that we continue to stay on track as it relates to this. I really do feel that we have we have a sense of urgency and a sense of priority on this Council to ensure that bit the full Suite of mha tuna tees are dealt with before the end of the year. neither comments or questions All right, we'll go ahead and close out this agenda item and we will move into the second agenda item. So we'll go ahead and have the clerk read the second a giant it a genda item into the record agenda item to cancel Bill 119500 and ordinance related to land-use and Zoning amending Ordinance 12579 one to correct map errors contained in mapeh 423.58 V point 0 5 0 Section 94 and map a 423.58 c050 section 97 and attachment 12 Ordinance one to 5791. Thank you Jodi. Okay Ali take it away. Thank you 9500 Woodcrest mapping errors that stopped identified after adoption of Ordinance one to 5791 the legislation that implemented the mha program Citywide by amending the land use code and amending the official Indies map to make zoning changes across the city these technical Corrections are necessary to correctly reflect. The policy decisions. The Council made previously and does not reflect any changes in that previous policy directions specifically the bill and immense map a four sections. 2358 b o v o and 2358 c. O v o that those Maps identify the mha payment level of high medium or low that is used to determine fees that a project is required to pay or the number of rent and income restricted. The units for the project is required to include went Ordinance 12579 one was adopted staff inadvertently Incorporated the infected versions of those maps that identify the North Beacon Hill residential. Urban Village is a high area that area has been medium. There were no council amendments are direction to make changes to that map. And so this correct that and in addition to pay for 2358 c o v a was not updated to reflect the amended Urban Village boundaries that were adopted by this Council. So these really are just essentially typographical errors in addition the bill amends Maps 8:30 to 33 and 37 that were included in attachment 12 Ordinance 12579 one again, these are typographical errors on the labels to those maps in some cases the incorrect existing zoning designation was listed or the wrong high medium or low at mha Suffolk. So this is just correcting those errors. This is an opportunity for staff to have their errors discussed publicly. Well, sorry to put you through the paces Ally but thank you so much for being gracious and highlighting those errors and giving us an opportunity to correct them. Are there any questions or concerns about the amendments to council bill 119500 before I open this up for public comment. A hearing on that we will as required by law to open up the. Of of a public hearing on Council Bill 119-5800. We have one person signed up for public comment on Council Bill 119500. Once again, when your name is called, please come to either of the two podiums to one of the microphones and you will have two minutes to address this specific item in as usual before you begin your comments. I'd ask that you state your name. So the one individual who is signed up for public comment is Steve stello. Only in Fantasyland do you talk about how this is improving now the map changes that you have up or up sounds they're about to you their minor things to the people who live in those areas ice method. It's probably not minor what we should be taking a look at is the full impact of what's Happening. We're having a city where if you believe what you're saying is it we should have more and more and more affordable housing. I can tell you about in the city. We're seeing less and less and less affordable housing and these map changes will affect probably a relatively small amount of people, but they will affect What's happening all over the city? You probably keep saying that you're opposed to homelessness in maybe only 10% of the people that were displaced will be homeless and if that's an acceptable number, that's fine for you. But I think we need to take a look at how many Legacy and Heritage trees were losing look at the cost and you never want to talk about how many times the population of the city of Seattle were already zoned for primarily. What I see here is a movement to make construction and development very very profitable for the most. Large the smaller developers don't seem to be on board as much as the larger developers are and we continue not to count the displacement we count as was pointed out earlier. You have 20-unit apartment houses affordable you replace with three subsidized units somewhere at sometime and you call it an improvement. Okay, that was the one and only person sign up for the public hearing. So I will go ahead and close out to the public hearing on Council bill 119500 and we will go ahead and move through the rest of the business on the agenda in order for this committee to vote on a final recommendation to the full at Council. We first need to suspend the council rule relating to voting on legislation on the same day of public hearing is held. So with that if there is no objection the council rule relating to final committee recommendations on legislation on the same day a public hearing is held is suspended. Is suspended and we will now proceed with a vote on the underlined bill. I moved that the committee recommend passage of council bill 119500 bill has been moved and sight and there has been a second. Are there any comments? See no comments all those in favor of the of the recommendation that the committee passed Council Bill 119500 volt. I any opposed Any abstentions the motion carries and Council bill 119500 will be forwarded to the June 3rd city council meeting for full Council action. That is the last item on our agenda and was that we are adjourned.", "end_time": 2228.7}]}