{"format": "raw", "annotations": [], "confidence": 0.9319626956672992, "data": [{"start_time": 0, "text": "Good afternoon, everybody. Thank you for being here in City Hall the May 6th 2019 full city council meeting of the full city council come to order. It's 2 p.m. I'm Bruce harreld present the Council of perk. Please call the roll. Spectre Gonzales herbold or as bruschetta O'Brien Pacheco Salon president today's introduction afro calendar be adopted. Interjection, today's introduction afro calendars adopted and hearing no objection. Today's agenda will be adopted. Turn objects in today's agenda is adopted the minutes of the April 17th, 2019 special city council meeting have been reviewed and if there's no objection the Menace will be signed. Jackson the minister being signed presentations were very delighted to have two presentations this afternoon and we'll start off with cast member council member of mosquito will presenter Proclamation recognizing Beatrice Catherine older. Day or Memorial so council member mosquito you have the floor and it's our honor to hear from you of Beatrice Catherine Alder formerly known as be today. We are honoring and her parents are going to speak to us in just a few minutes. So I'll try to keep my comments during breathe Rachel who was working at Seattle Human Services Department gave birth to be and was delighted to give birth after complicated pregnancy. After giving birth on November 2017 tragically died 36 hours after she was born due to medical issues Aaron and Rachel were devastated. After losing their child that they would continue to fight though to make sure that their situation was a situation that no other parents ever experienced. Again, Rachel learned that due to inadequate Broody for recently policies at the city. She would not get the time she needed to grieve and she couldn't take that time off to physically recover because she no longer qualified for Family Leave given these death Recovering Rachel and Aaron had to deal with procedural gaps that were due to the fact that we we did not have enough leave even though there was sick leave donations that came in from MINI of Rachel's colleagues. I know some of you are here today because you supported her as family and friends and Rachel's family is here and throughout their family's tragedy. And today we're here to celebrate the life of celebrate the future because policy change is coming after a year of advocacy after of year of working with you. We were delighted to hear that the executive is transmitting policy to address the situation that Rachel and Aaron found themselves in and we will have chance to take this up later this month as we look at policy changes to address bereavement leave in the family leave policy. Today, we are honoring Proclamation and you might think that this is a unique Proclamation that we find ourselves in both her parents and it is it's a proclamation because I'm struck by the advocacy the dedication the determination and the vision of these two women. The reason our policy gaps exist is because often those who had the experiences the lived experiences that we are supposed to be centering policy change on our left out of the policy-making tables and Aaron and Rachel have made sure that they were at that policy-making table that they not only lifted the voice of be but they made sure that no other family would ever find himself in this situation today. We are changing policy today. We are advocating for and today we change that Dynamic continue to Advocate to make sure that more people everyone in the city is able to take time that they need to grieve the loss of a child and Air. Turn Rachel without your advocacy your countless hours a partnership with us the city. I don't believe would be in the place to advance policy later this month. So congratulations to you on that incredible incredible. Advocacy when we've heard from you over countless months. I think starting at the beginning of last summer were both patient and Relentless written in over 200 emails at least once a month to talk about the progress of these law and you've been very clear that you wanted this to me. Be more than just changes on a piece of paper. You wanted this to be a positive Legacy for B. And your interest in this policy change was not in fighting or political games or making a stance but addressing the root causes of the Gap in policy coverage that that exists so that other people don't have to go through a similar situation. So thank you. Thank you for your hard work cuz it is paying off today. We recognized Truly recognized her the date after Mother's Day very intentionally to recognize you're at work as well as mothers. We think Sean's a knife with Protech 17 for continuing to raise this who brought it to our attention and help ensure that the conversation never went away. I want to thank the stage up for a week as well as Chief of Staff who was engaged in these conversations with you and your family and the folks that pte. I'm sorry protex 17 how to make sure that we continue to fight for changes and I really appreciate the conversation will have later this month and the work that the executive has put putting down toward for us so that we can actually change policy as well. I also understand that you're expecting later this summer. So I just want to say congratulations in advance. I cannot wait to meet The Advocate the fighter and the passionate human being that you too low raise. Today we will be dedicating next Monday, May 13th honoring Rachel Erin with an impact far beyond her 36 hours of life. Thank you cast member mosquito in before we resent the proclamation of the other council members would like to say a few words to our honored guests. Wait for the moment the spirit. It's anybody. She covered it. I never assume that in fact, I'd like to just say thank you can surmise Kata and your staff is still working on this Proclamation very emotional sort of at a loss of words, but sometimes I never stops a politician from saying something. I hope the healing process continues and thanks for looking at this Gap in our policy such that similar parents benefit from the policy change. So thank you very much. Look. How are you going to percentage will suspend the rules and love to hear from you. Guess we're like to speak on this issue. I'm Aaron Alder and this is my wife Rachel Alder. Thank you all for being here for this very special day. Thank you dear friends and our family and our co-workers some that drove quite a ways to be here. We so appreciate you taking the time out of your day to be here with us. Thanks to Sarah Baartman and Sean Van Dyke for getting this ball rolling for us councilmember Moscato and sajal over there. And mayor Jenny durkan for truly seeing us and hearing our story you shown us that average citizens do have a voice and that we can make a difference. And thank you for the rest of the council for allowing us this time. Today. We're here today to honor the life of our daughter this little cutie Beatrice Catherine Alder and how even though she lived a short little life. She continues to buzz around us and move mountains. 3 days after Beatrice died in our arms Rachel had ended up back in the hospital with pre-eclampsia. I just come back to the hospital that morning after visiting the funeral home to plan services for little bee. Rachel was pumping milk because she had selflessly decided to donate her milk to babysit needed it. I was standing at the sink washing out some of her pumping bottles, and she said I need to tell you something. I got an email from work and I will only get one paid when only get paid time off for the two days that bee was alive and one bereavement day. I'll never forget my disbelief in that moment. My wife. I just had a C-section. Our daughter had just died in her arms. My wife is back in the hospital and I was planning a funeral but no baby. No paid time off. I was at a loss for words and frankly. I didn't have a moment to spare thinking about that Injustice because we had a few other things going on at that moment. Thankfully for us to get an amazing team of friends and family that brought us meals raise money and just kept on the path with us and our co-workers. They donated PTO and they kept in touch as we began to heal. I'm not sure how we could have done that. If not for the support that we received. I couldn't help but think of the families in the same situation that didn't have the support and place that we did. How could anyone get through something like this possibly having to go right back to work after the death of a child in order to pay their bills? What could we do and how could we help? Thanks, Erin her painting the picture of the immediate repercussions of the policy gaps. We experienced and outcome. No one could have imagined when writing the policy. I want to take a couple of minutes to tell you what else happened to bring us here today. Then of course to share a little about our sweet baby girl Beatrice as this is her day after all. Practice this how you kept the crying till the very end stuff. Okay, I return to work after 2 months off thanks to all the people that are in just mentioned each day was an exercise in trying to be strong. I was grateful to have a job. I loved to return to all the while it was still a challenge. So I buckled down and worked with great support for my supervisor in my teeth after work many days. I walk to the bus stop for the ride back to Kent and cried on the ride home trying to process to understand and keep going to be strong for me and her Legacy of strength. Also after this return to work my dear friend and co-worker Sarah bark then came to me about bringing my situation to the union. I checked with Aaron and we said let's do it in March 2018 on my birthday. Actually, we had our first meeting with two people from the union Sean Van Dyke are you didn't wrap was one of them and forward we went first to a meeting with the mayor's office then to a meeting with council member must got us Chief of Staff sejal Parikh. Let me tell you something about the song Hero sejal. She took an hour and a half and listen to our story gave us her personal phone number Andrea reiterated more times than I can count that. I could come and cry councilmember mosquitoes couch any day especially if I couldn't hold out until that afternoon bus ride and she replied to every email we sent quickly. She believed in our story they believe in our story. So regardless of what happened what was going to happen Aaron and I were in good hands yet again as we have been throughout this entire experience there were ups and downs throughout this process. Ultimately Aaron and I were going to be satisfied with any outcome because we were sure we are part of a community of family friends co-workers politicians and doctors that cared about our family these law if passed will help. What I hope is a small fraction of the workforce at the city of Seattle. No parent will want to use these law but it will be there in their darkest moment when the wheels are falling off all that seems to be reasonable and right B will be there to help. Now let's get down to the real business of today Beatrice Catherine Alder. She was born on November 15th 2017. She cried out when first delivered and our doctor said that the world got to hear her voice. Her nose was beyond cute. She had the best toes when I saw those toes and knew she was my child. Those were my toes and her hands. She had my sweet sisters hands and a full head of hair and then our final time with her. She looked me Square in the eye almost saying hey Mom. I love you. It's all good more to come with a story We've Only Just Begun and she was right who knows where bees law has the potential to go from here State national. Maybe hopefully wherever it goes her Legacy is strong in this beautiful city of Seattle City of compassion love and strength. Thank you to all that have said to keep going through. Every step of this process we needed everyone strength together to create a life to lose a life and help many lives to come including her little brother growing strong and my belly too. Happy these day off go be kind. Thank you. Very much, very powerful. Next will have a presentation by councilmember Bagshaw who presented Proclamation proclaiming May 2019 as older Americans month. Actually. We aren't doing that today. It's going to be presented on Friday, but happy older Americans month and thank you very much all of you for signing. It has crossed and councilmember mosquito will present a proclamation recognizing affordable housing week. I hope I'm very excited laughing about the I hope You're lucky I am I do have another proclamation in my hands here. I am excited for this Proclamation honoring affordable housing. We've 2019 as affordable housing in Seattle Consortium of Seattle and King County or HCC to put together. This Proclamation HTC is 165 member organization of affordable housing Advocates who make sure that everyone can live with dignity and safety and healthy and affordable homes within the city that they want to work live retire or play HTC is our reasons leader on policy advocacy and organizing and support of affordable housing. And today we have patients from the HDC along with members of the affordable housing community here to accept the proclamation affordable housing week will be a week full of events and celebrate. Advocacy across a dozen cities in King County to ensure that everyone has a safe affordable and Healthy Home in East Bay where they have been organizing a week of action for over 20 years. Nationally. There's also a day of organizing an action which falls on the week of May 30th through June 5th that focuses on federal affordable housing investments that are much needed and have been depleting over the last few decades affordable housing week here in King County is a testament to the collaboration and collaborative nature and needed to make sure that we meet the scale of our affordable housing needs just earlier today councilmember bags. I was commenting on how many affordable housing units that we need in our city and county and on a conservative estimate. We know that we need 156000 affordable home to meet our current needs in the county throughout the events of next of next week. You will be able to see how the city is striving to meet at school and what we're doing to work together. The city of Evans King County is in his fourth year and the biggest Siri at with over 30 events to Spur large-scale advocacy movement and Amendment these events are solutions based ranging from housing Consortium of vents focus on homelessness services to home ownership. There will be a building buildings in open houses showing affordable housing actually is discussions on the intersections of housing along with issues like mental health immigration and hunger and you can also learn and I would also add that on the Criminal Justice Reform system that we need some more folks can get stabilized. You can learn about these housing and intersections at housing Consortium. Org portal housing week. This week is focused particularly to generate inspiration and motivation to implement the recommendations of the regional affordable housing task force, which council member Johnson brought to this committee before leaving and I had the opportunity to co-sponsor with him to Wrecking. Ryzen, memorialize our commitment as well to the regional affordable housing task force for Seattle. This means implementing leadership to scale up to at least forty four thousand homes in the next five years as the task force recommendations say that we need to do as we know. This is a time of unprecedented and growing needs for affordable housing in Seattle as people continue to get pushed out of the city and pushed into the street from affordable housing is the solution to homelessness and is a strong anti displacement to Laswell permanent affordable housing is so much more than the units that are being built. It promotes social inclusion reduces poverty increased healthier and more resilient communities individuals and families that allows families and individuals disability. They need to get out of generational poverty and build resilience affordable housing provides people with opportunities and high opportunity neighborhoods of access to grocery stores childcare schools and Parks it connects people. How to Transit and it makes sure that everyone has a place to call home in the city that we love this week is an opportunity for us to celebrate energize and to focus and so as we look forward to focusing on the affordable housing week that is coming up from May 13th to May 17th. We recognize our so much more work to do the folks who've been actually working to build and provide affordable housing need individuals to come together to advocate for additional Revenue so that we can meet the needs and that we have the resources needed to make sure that everyone has a place to call home. Thank you so much for being here today for the work that you do and patience Ava it's always wonderful to see you and your incredible team. So thank you all for being here, but to the entire housing homelessness and affordable housing community. We thank you for the work that you do every day because we know it's a long long projector you to go from getting and legislation pass the funding needed to actually seeing people house. So thank you for your that your work and And next week, we recognize you and all that you've done. Thank you customers Katie before we suspend the rules and hear from any of our guests. Would anyone like to make any comments as well? And then we'd like to suspend the rules customers skating percent the proclamation. Thank you so much. For the record, my name is patience a lava. I am the policy manager at HTC and on behalf of our board members our members and stuff. Is this on? Hello, thank you so much for the record and patience. My lava. I am the policy manager at HTC and on behalf of our members are bored and I was stuff. I just want to thank you come to my mascara and all of console for all of the work that you are doing this affordable housing week is about Solutions. I just last week all homes count found that that use a decrease of about 8% in terms of the number of people who are living and house. This is a decrease since 2012 and it's really a testament to the fact that the service provider Community knows what works and when we have the political will to invest in those Solutions. We're actually able to get people house the count also found that we still have 11000 more people across King. Who are not house so they still a lot of work that needs to be done in order for us to meet. This is going to require that we collaborate we engage and really focus specifically on Solutions every neighborhood as you say cancel. My mascara needs more affordable housing and needs more supportive services, and this will take that we are using all of the tools that we have in our solutions to a cheat to meet Disney. Thank you for your leadership, and we look forward to continue working with you in building a city. That is a credible livable and affordable for all. Thank you. Thank you. Okay at this time will take public comment on items that appear on today's agenda or our introduction referral calendar or our 2019 work program and will take approximately 20 minutes or when we run out of speakers at 2 minutes. A lot of free speaker and I'll just call you out in the order with what you sign and we'll start with Susan Lee followed by Stephen PR. A why? I think my name is Miss Lee. I am a servant of the Living God. I am here to let you know that the Lord has redeemed Jacob with the mighty stressed out right hand as you can see all across this city. He made a promise to our forefathers Abraham Isaac and Jacob to give them the land where they are a stranger. Guess what? I am Jacob I am that blessed since I am just here to let you know he will be moving to shake terribly the earth. I am going into God has given me the city. You see availability everywhere because scripture will be fulfilled at the last will be first and the first will be last and those that don't know the Lord I suggest you get to know him because he is going to move. I'm just letting you know that the lie I'll be there and if I don't tell you what he told me to tell you that I will be in trouble. So everybody have a great day. I'm going to go in and help my people everybody do what you doing. Hopefully it'll change everybody to start believing in something outside of an Idol that can't move speak or talk. Have a great day. God bless you Steven. Pray. Steven pray. Good afternoon. Good afternoon. My name is Steven pray and I'm a union representative iprotec 17 represent. Approximately nine hundred members who work for the city of Seattle. I am also a member of the mares IDT. I have not personally met doctor, yet. I am fully supportive of her appointment to the office of employee on bud by support of her is based off of an overwhelming overwhelmingly positive feedback that I've received from my members in her regard many of my members have expressed their excitement in eagerness to bring her on board. I believe it the office of employee on but will soon be one of the most important offices in the city the number of members that I have contacting me with experiences of harassment bullying and discrimination is increasing daily. I look forward to being able to direct them towards someone such as dr. Conrad the confidence of everyone that I have spoken to I would like to recognize and thing with the mayor and city council for dedicating resources to create this office and for listening to the Union's who have been advocating for this office for some time. This is a tremendous win for my membership. I look forward to working with dr. Khan in her Endeavor to make all employees in the city of Seattle feel safe and supported. I know she has a lot of work to do and that she's up to the task and I wish you the best of luck in your new position. Thank you. Stephen. Our next speaker will be the honorable Michael Fuller Suey Juris. Yes, I thank God for being here. But this is August 2019 is 400 years of slavery by the Europeans about how they talk about housing over two decades and at the time of War. I'm just looking at you Democrats illegal immigrants, September 11th. 2996 - 2977 victims 2015. I thought you said something this morning that I'm disturbed my. And also a violation of extraordinary circumstances against Marvel or Richard always said you don't make violet with Justin, but you can't come up in here making all of Johnny forward 2 and 1/2 Decay during the Korean War. Korean War June 6th of 1944. Thank you very much, sir. Our next speaker. I understand. I understand. I understand Sir Charles. Next speaker will be Marguerite Richard. Yes. Um, I know my name is Marjorie Richard and I'm here today because the last time I was here I was talking about logistics, so And the reason why I brought it up is because when I go to other places and address the council, they're not in no battle with me. They give you my two minutes to speak and I speak and I'm gone but here I noticed there's three individuals in particular that always seen the end of a a combatant a spirit or in a disarray when I'm speaking as if there's something some underlying issue and so when the woman came here, I don't know the Lord. I think I mention the Lord to and I said, you know, he said these signs and wonders shall follow them that believe and some when she came up in here and said that that's the confirmation for me because it is not just me in the world. That's a Believer and says the things that I say because I'm feeling like abuse is going on periodically whenever a person comes address somebody so I was Listen to other woman on the news and stuff and they had the formative action bake sale with the cookies in the president of the University of Washington said I don't care how rude and abusive. The languages they have a right to be here to sell their cookies. I said what she said. Oh, yeah. It's covered up under Free Speech the rudeness the vulgarity or whatever that may have transpired over the sale of the cookies. I still will they people they be that folk down here at the city council, but it's not covered up under free speech on So when you say program in the agenda, I asked this Monica Simmons multiple times. That's what I'm saying you explain to me what is supposed to happen in here so that there will be no confusion. Cuz God is not the author of confusion. He's a god of peace in our public comment section and thanks for your comments and we will move to the next agenda item, which is the payment of the bills will please read the title. 19508 removed and second of the bill pass for any further comments Please call the roll on the passage of the Bill O'Brien sawant president hero. Please read the first agenda item the appointment 01306 and believe cancer awareness may have an amendment to that once it is read into the record. Okay. It went public assets and Native communities committee attend item one appointment to 1306 appointment of Jesus s Aguirre as superintendent Department of parks recreation for term to April first 2023 the department be confirmed for us to include a letter to the clerk file before the proceeding as you stated council president. This is a letter of expectations for mr. A guy from city council. My staff shared a physical electronic copy to offices this morning. Therefore. I moved to a man appointment 01306 to add the letter of expectations for mr. Right as superintendent dated today, May 6th 2019. Their second removed and second that you add the letter of expectations to the appointment file any questions or comments on the amendment all those in favor of the amendment, please go die those opposed. No. The legislation is a minute. Councilman Waris. Thank you. I just briefly touch on the expectations. The council expectations are in hand intended to enhance. Mr. Gatti's accountability to the Seattle City council Council expectations are intended to add to the mayor's expectations and responsibilities established in his Seattle Municipal Code, the four areas of city council expectations food communication policy management commitment to race and social justice and Leadership. First of all, I did for mr. I got a following buy a rundown on the process for the filing of the feeling. I'm sorry. This appointment position Jesus Agave is a remarkable and committed public servant. He is a breadth of experience serving the role of director for large agencies prior to moving to Seattle Jesus served as a state superintendent of education for Washington DC / CNA agency of more than 1,800 employees. He then served as the Director of the District of Columbia Parks and Recreation. It over 1,000 employee agency where he established a focus on outcome-based programs staff professional development and an overall emphasis on providing equal access to high-quality Recreation and Leisure program me to all residents and visitors. He also LED this at the agency 3 comprehensive Master planning process over a 10-year. Which received national accreditation for the city of Seattle Jesus served as the superintendent for the Department of Parks and Recreation from 2015 to 2018 during this time at parks. Jesus successfully implemented the Seattle Parks District that was passed by the voters overwhelmingly in 2014. Jesus Took a sabbatical in January 18th to be close to his family and participate in his family business. He missed working in the public sector and especially for Parks. He particularly missed my committee wants the position was open. He applied again, the mayor's office conducted a nationwide search and their call for applicants for the position of superintendent. I'd share this committee. So my office was asked to service a member of the search committee other members included the department of Parks and Recreation the Park District board the parks foundation and the mayor's office there were four levels of institutional review and participation. The cultures are Julie phares & Thatcher Bailey who conducted a series of meetings to set goals standards and evaluate each application through each round of meetings in which there were for the committed narrow that over 100 applicants to a group of about 15 over several weeks then 5 or selected from that group for the interview process. I sat on the interview panel and forwarded the two finalists to the final round of interviews with other director. Heads and park staff the feedback from these rounds were delivered to the mayor's office who had made an executive decision selection for this for this position. Mr. Gatti's appointment was transmitted to cancel on April 2nd 2019. The appointment was referred to my committee Civic development public assets and Native communities to my committee last Wednesday May 1st held this appointment with members had an opportunity to ask questions and learn more. Thank you cancel my room a skater Gonzalez and Bagshaw providing your thoughtful questions in the committee based on these questions and conversations about the appointment process at our mutual goals. I have again provided my colleagues with the letters cancel expectations as well as a copy to mr. Ray. I want express my gratitude towards all the volunteers and members of the search selection and interview committee withdrawal of armed here except for those of us that work for the city, especially to Deputy Mayor mostly for conducting a collaborative in through a process that they may confidently predict that I Did confidently present to this Council and my colleagues I believe in. Mr. Gatti's values lived experience and strong commitment to empowering underrepresented communities. I believe who will serve the city. Well the Civic development public assets and Native communities committee recommends that city council confirm the appointment so much any comments or questions confirm actual I want to say thank you very much for replying again. And it's been my experience a real pleasure working with you and your team and I really want to express my thanks for the work that you've done just stepping forward again, they'll most as if you never left and just without without having any loss of time or effort and I also know how much your staff and team really appreciate you and respect you. So I'm looking very much forward voting. Yes. Any other comments or questions comes from a mosquito live for this comprehensive search process was thanks to council member badge giant Gonzalez last week for asking questions on my behalf related to specific labor and Cory's and a public policies around our public servants in what I really loved and appreciated about the answers to those questions is that you really understood how important it is to make sure that every worker feel safe that they're listen to and that we're responding to issues that workers come forward and bravely raise an occasion and that you're placing a special emphasis on human resources data and making sure that this is informing your response in your process. He's moving for critical as we think about macro changes that are needed. I also want to say thank you for your overall comments supporting unions and labor as a whole especially in this day and age or really excite. About the work that are labor Partners do in parks and we know how important it is for their work to be supported in order for our city to function. Well, thank you so much for identifying future opportunities to leverage this partnership with you and Jensen with labor and to think about how we sent her that work, especially in public private Partnerships as we move forward. So thank you for answering those questions. Thanks to my colleagues for raising those and to the good chair for inviting those to be part of the process and look forward to working with you before we vote. Okay, let's move forward those in French those in favor of confirming the appointment as amended, please what I I was opposed vote. No most carries appointment is confirmed and at this time of love to hear from Mr. Michetti make some remarks to the council. How about 12 pages of written testimony doesn't help thank you, Thank you, Thank you. It really is an honor to be standing standing here before you just being confirmed the service superintendent Seattle Parks and Recreation city of Seattle Seattle and all the residents also like to thank mayor durkan for a commitment to making Seattle a great City for every resident and for giving me the opportunity to serve with her and her present cabinet a bit of housekeeping quite as I eat I want to acknowledge that I did receive that letter of expectations not committed to working closely with all of you to meet those expectations of communication policy management in social justice and Leadership like the break briefly take the time to think Christopher Williams is Acting Superintendent, Seattle Parks and Recreation for longer than many permanent. Forward and I look forward to continue to work alongside him for many years to come. So thank you Christopher for your service has work for a second time. I'm struck by how fortunate we are. I've had generations of seattleites it with me Parks and Recreation such an important part of who we are as a city. In fact, we could we have won the best parks and recreation systems in the country due to the consistent support of generations of presidents elected officials, great Community Partners and volunteers every single day to improve the lives of Seattle residents by providing high-quality programming and impressive facilities in Open Spaces in every Seattle Community. Of course, I'm also struck by our city is changed to change as I push this work a second time. I'm committed to ensuring that we continue to Stuart are impressive Parks and Recreation Department in a way that's truly inclusive to all and respond to the changing needs of the people that we serve. I'm convinced that the work of Seattle Parks and Recreation has never been more important and I'm ready to get to work on behalf of our residents. Thank you for your support. Thank you. And congratulations again. Please read the port of the housing Health Energy and workers rights committee Office of the employee on but the committee recommends that the city council confirm the appointment for an updated resume, which have been distributed to our Council colleagues to supplement the appointment packages. Describe a counselor Mesquite. Are there any questions or comments on the amendment? All those in favor of the minute, please. Go die. I go Zappos vote. No the package is amended cuz wear mascara after the anti harassment and discrimination interdepartmental team, or as late. We come look kindly refer to it as the IDT recommendations came out. We are now moving forward on one of the key recommendations and turning it into a reality. Dr. Khan will be the city's first director of The Office of the employee on bud and I'm not only excited for what this means in terms of a mod chip Monumental set for our city but also because I believe that this could be the blueprint for other cities and other jurisdictions to follow. Dr. Khan is the perfect candidate to stand up this Office Professional and personal background have prepared her to lead with race and social justice through trauma-informed practices Afrikaans priorities for this office will feed to gain the trust of our employees and way to do that is to ensuring employees privacy and Collaborating with other departments to get resolutions to make sure that the office is looking at data driven Solutions and looking at training to prevent behavior in the first place. She's also looking at ways to create space so that this office can be seen as it is from undue political influence. Dr. Khan is a global diversity and inclusion specialist. Most recently. She served as the Director of equity and inclusive practices at the Renton School District prior to that. She was the associate director for Global diversity initiatives at the Oregon State University. And dr. Khan comes with support and recommendations for a yes vote from our friends and labor from the ITT and the silence Baker Breakers and the change to make hers and key stakeholder groups. There were various interviews and conversations with many of our stakeholders. She's had unanimous support. I was going to take a second to think the mayor's office for you're really robust process and pulling in members of the IDT and silence break. Where's to be part of the conversation for creating the 34 recommendations one of which was the office of the employee on but today's a really exciting step forward as we look forward to implementing all of those recommendations. We know we can't be successful without this office fully operating and the process that start process that you led which lettuce is dr. Khan. I really was inclusive and robust and I think you guys have a selected and got feedback on one of the best candidates that we could ever hopeful for this position. So thank you and please pass it on to the mayor for her efforts and a to the ID team members for their incredible efforts quick. Thank you Tiffany de Cuevas from our office as well who sits on the IDT and had the chance to be part of the interview process and meet. Dr. Khan as she came forward from the mayor's office. I hope that they will also here are notes of appreciation for their ongoing work and that the work that they put into creating a multi-page report wasn't just to go on a shelf. It was too truly Creed action today. We see that action so I'm very excited. That dr. Khan is interested qualified and has a full recommendation of our committee to move forward and lead the office of the employee on buds for our city. I'm confident that she will lead with empathy and justice for all our employees and it's with that that we recommend a yes vote on. Dr. Khan to leave the office of the employee on bud. Thank you very much. Are there any other questions or comments on this legislation or appointment? Okay, let's move forward then. So all those in favor of the appointment of Miss Khan as amended, please go die. The legislation did appointment is approved. And confirmed and at this time we love to hear from iskcon to make a few brief comments to the council. Good afternoon cat can I thank you. I had a lot of thoughts about how I would tank and the respected council members, but after what we saw with that little B and her Legacy, I feel like today is a much bigger day. If as if a small child can leave such a large Legacy in kindness us adults can only try and follow and leave an example. I am honored and humbled that this conversation is happening right after an amazing Proclamation honoring a small child who setting the standard very high for us. I'm very grateful. I'm thrilled and humbled by the warm welcome and consideration offered by all of you and Midas Community. My job now is to honor the vision and Mission behind this important position and make sure I contribute towards restoring trash. In our system and in our community, I my three children my oldest six and and this morning he asked me if I'm opening a new shop and I said, yes, and he said what would I sell and I said I'm selling kindness and compassion. So I hope I'm true to my promise to him. Thank you for congratulations. Please read agenda item number three in the record Define be confirmed. Free 415103 tomorrow to record games four and five Apartments 1316 and 1317 appointments of William J pittz and Marilyn P Watkins as member labor standards Advisory board for April 30th, 2021 after advisory and adding Commission because it's the labor standards advisory commission to 1315 by deleting the term bored as described by can't swim ask it any questions on the amendment all those in favor. Say aye opposed. It is a mended and I'll speak to all three of these appointments first we have gay Gilmore who is the co-founder of optimism Brewery on Capitol Hill. I've had the opportunity to work with gay over the last 2 years and really Did her ideas about how to support small businesses will also protecting workers optimism Brewery is it pays its employees a living wage by starting at $20 an hour to 100% paid medical and dental and vision is leadership will be extremely useful as we figure out how to best Implement our labor standards and days constantly on Ben and allies we talk about what we need to make sure that policies for small businesses so that they can be achievable and accessible for the workers that we advocate for. So I appreciate her willingness and her leadership already and excitement to serve on this commission person is William Pitts member of the member of the labor standards advisory commission. He currently works at Teamsters Local 117 and brings a long history of work with unions and nonprofits and Community organizations my staff and I believe in if you had the chance to work with during the fight for 15 to support fast food workers and the strike. Payment on the one-day strikes in 2013. I am also excited that Will's going to be bringing you to this commission his expertise on ride-sharing and tncs as we consider. How do we expand labor protections to these independent contractors and address issues of his classification very excited that will is bringing his decades worth of advocacy to serve the city and lastly the appointment of Marilyn Watkins as member of the labor standards advisory commission appointment. 01317. Marilyn has a long time she has served as a policy director of Economic Opportunity Institute had the chance to work with her on issues like Paid Family and Medical Leave sick and safe leave policy is minimum wage at the state level and equal pay number among a number of other policies. She has let our state and constantly brought up the intersections between hell gender and economic policies and is a graduate of University of Michigan. And Maryland supposed expertise is going to be instrumental to helping us think through intricate policy issues on the horizon. Marilyn is both an incredible Advocate at the macro level and has an eye for the micro details that need to be changed to make sure the policies actually work very excited about these three appointments and would encourage a yes vote on all three Customer Gonzalez. Thank you. I noticed that confirm is goetta made an amendment to the agenda for appointment 1315 to change the listing for labor standards Advisory Board. The commission is are we going to do the same for appointment 1317 North from the clerk to go through an individual. We got the assistance. I noticed that we got any other comments on the appointments. Okay. So we're going to vote on each one individually cuz we have to correct one of the files and so let's take the first one first which is 0 1 3 5 store going to vote on them individually is instructed by the clerk and all those in favor of appointment 0 1 3 815 please say I I suppose. No one cares in appointments confirmed. Number for all those in favor appointment Ciro 1316. It's going to be number five. The the last one has to be amended the fourth one I think is Okay, so all those in favor appointment 01316 please vote. I know when number 5 we have another correction to a counselor was getting you can move to make that same change on that 1317 by deleting board after advisory and adding Commission. All those in favor of amending appointment 01317 by describe a customer mosquito, please what I ate all those in favor of appointment 01317 as amended. Please hold. I opposed the eyes have it. Okay with a good okay, we're going to move to adoption of other resolutions. I don't think we have any resolutions there, but on other business, I believe council member O'Brien would like to discuss in an open Forum in letter that he would like signatures on councilman Rob Ryan. Are you going to the president I'm going to pass this copy of the letter with a slight modification from what you saw over the weekend in this morning the one clarification that I want to just highlight. Sorry. This is a letter to a City attorney Pete Holmes regarding their ongoing work to potentially file a lawsuit against fossil fuel companies the responsibility in the climate climate disaster that's happening. The first copy of letter had asked the City attorney to work with outside counsel this version. Thanks him for working. It outside counsel as it was highlighted that they are already doing that. There's some questions this morning about current status of some other lawsuits the state of Rhode Island the cities of Boulder Boulder County and San Miguel County in Colorado, Baltimore. Dale County Marin County Imperial Beach Santa Cruz Santa Cruz County in Richmond have all filed suits in addition to New York City Los Angeles and King County King County file their suit about a year ago. And that suit is being is paused at the moment. Well folks like the city of Seattle are waiting for a 9th Circuit Court of Appeals decision on the proper jurisdiction for these suits to be pursued. I can do my best to answer questions or folks have any other kind of legal questions, but I'm probably not the best person to answer them in no way to put you on the spot here council member. Do you know what is our state of Washington doing? What is our attorney general doing? Sorry, I don't know I just asked if you have any information about what the state of Washington is doing what our attorney general is doing in this regard. I have not spoken with her busy with lots of suits of town, but that's a fair question. I don't know the answer to what internal forces. Okay. So any other comments custom embroidery my questions for me? Emotion have your circulating it. So the letter will work its way down into action just be a signature in Open session is you want to think that this is a scary thing or step forward. It really wasn't until our state and many others got together around the tobacco cases that it brought to light the fact that tobacco companies had known for years if not decades the danger to People's Health and I really am glad that we're moving forward. I also would like for this not to be a perceived as a blank check with our City attorney and hope he'll come back and report to us what he's doing what the status is, but we know I'm in based upon all of the science that if we can get the fossil fuel companies to align your business models with some of the other requests or at least to align with some of the recommendations in the Paris agreement. I think it's time for us to do the next five year cycle. That we're supposed to be looking at our action steps and since our federal government isn't doing that that it's got to fall on the shoulders of the state and local action show. Thank you for bringing this forward than glad to sign up for the comments on the letter that were shining in Open Session and has it been completed by everybody that wants to sign it? Okay, so we're finish for that matter. I'll phillybuster Luke. We got two letters. Is there any further business to come before the council Council Council? I'm just consult the member. Mascara. Thank you. Mr. President during this morning. So I'd like to take a quick second to talk about letter that I've just circulated for a sign on for consideration for my colleagues. This follows on the heels of a presentation from Seattle City Light regarding the proposed mining in the Skagit headwaters of Canada. We have a letter here that was jointly authored and will be submitted on May 17th that is being circulated to various municipalities for consideration. And this letter outlines concerns regarding the proposed mining project in an unprotected area in the Canadiens schedule Waters. The sign that was circulated was drafted by Washington Wild a conservation non-profit that's working to defend protect and restore what wild lands and Waters in Washington state through advocacy education and Civic engagement as you can see the letter A. Dresses opposition to an exploratory drilling project in the Canadiens schedule Headwaters on the basis that it violates the high Rost treaty between the United States and Canada and then it could have significant impact on salmon habitat and water quality and the Skagit Basin in Washington the 1984 treaty between the US and Canada resolve the dispute over reason Seattle's. Hi. I'm in a voided flooding in parts of the upper Skagit Watershed recognizing the unique ecological and recreational values of the schedule Watershed. One of the purposes of the treaty was to maintain environmental Integrity of the Watershed and the Skagit River supports the largest population of threatened Steelhead and Chinook salmon in Puget Sound in the largest run chum salmon, and the Counter - us approximately 90% of bull trout from Ross Lakes pain in the upper Skagit Downstream of their proposed activities. These fish are Key Food Source for the southern residential killer whales and are Central to the culture and integrity of several tribes in the US and Canada who have a treaty rights in those resources signatories to this letter include the conservation Recreation Wildlife organizations as well as local businesses and elected officials representing Washington State and strong opposition to the proposed mineral exploratory permit proposed by the Imperial Metals for being proposed by Imperial Metals being considered by the ministry of energy mines and petroleum resources several Washington, DC and Canada have already weighed in on the issue. There is an unofficial, too. That I'm sorry. There is an official comment. That ends on May 17th. That's why this letter has been pretty dated May 17th that the British Columbia Ministry of mines. Petroleum resources is putting out there to get feedback and this letter offers a joint a message showing strong opposition to the proposal for the sake of Clean Water salmon populations and other Downstream values in the Skagit patient's obvious. You do have any more questions about this. I have you to engage in that orange house in our office who staffs the deal I can help inform a folks more of the conversation. We had previously thank you customers kid. I believe the letter has been circulated. That's been strictly I believe and is it the cast from her Bowl? Headed to sign this and I'm really pleased that you're doing this. I'm wondering if you might consider reformatting it on city council letterhead. Yes. So this was an impromptu way for us to try to confirm if I wanted to sign on. I think it's an electronic sign on. So with your signature, then I'll be able to tell them that we do have all of the council members who are interested in signing on signing on to that. It was my way of confirming your interest in the letter but I think it will actually not have our signatures. It will just be electronically signed on to be excused on Monday, May 20th. I will be attending a national conference on our public retirement system. And this is an issue as I mentioned this morning as chair of the Seattle retail Seattle cities retirement system. This will work to learn more about potential board liability and reduce our responsibility to To be concerned about fossil fuels is one of these should coming up and so that's May 20th coming up and I'll tell you more about it. When I have more information closure on the discussion of the letter to Herman Henning before we just closed a tissue to make sure there are no pending thought your questions. We're good on that. Okay, so it's been moved and seconded to excuse counselor and badshah on May 20th is their second you can't say I opposed the eyes have it. Is there any other business coming for the council? Okay. If not, we stand adjourned. I would have a great rest of the afternoon.", "end_time": 3851.9}]}